"A demesne ( di-MAYN) or domain was all the land retained and managed by a lord of the manor under the feudal system for his own use, occupation, or support. This distinguished it from land sub-enfeoffed by him to others as sub-tenants.\nIn England, Wales and Northern Ireland, royal demesne is the land held by the Crown, and ancient demesne is the legal term for the land held by the king at the time of the Domesday Book.\n\n\n== Etymology ==\nThe word derives from Old French demeine, ultimately from Latin dominus, \"lord, master of a household\" – demesne is a variant of domaine.The word barton, which is an element found in many place-names, can refer to a demesne farm: it derives from Old English bere (barley) and ton (enclosure).\n\n\n== Development ==\nThe system of manorial land tenure, broadly termed feudalism, was conceived in France, but was exported to areas affected by Norman expansion during the Middle Ages, including the Kingdoms of England, Sicily, Jerusalem, Scotland, and Ireland.\nIn this feudal system, the demesne was all the land retained and managed by a lord of the manor for his own use and support. It was not necessarily all contiguous to the manor house. A portion of the demesne lands, called the lord's waste, served as public roads and common pasture land for the lord and his tenants. Most of the remainder of the land in the manor was sub-enfeoffed by the lord to others as sub-tenants.\nInitially, the demesne lands were worked on the lord's behalf by villeins or by serfs, who had no right of tenure on it, in fulfilment of their feudal obligations, but as a money economy developed in the later Middle Ages, the serfs' corvée came to be commuted to money payments. With the advent of the early modern period, demesne lands came to be cultivated by paid labourers. Eventually, many of the demesne lands were leased out either on a perpetual (i.e., hereditary) or a temporary renewable basis so that many peasants functioned virtually as free proprietors after having paid their fixed rents. In times of inflation or debasement of coinage, the rent might come to represent a pittance, reducing the feudal aristocrat to poverty among a prosperous gentry.Demesne lands that were leased out for a term of years remained demesne lands, though no longer in the occupation of the lord of the manor. See, for example, Musgrave v Inclosure Commissioners (1874) LR 9 QB 162, a case in which the three judges of the Queen's Bench Divisional Court and everyone else concerned assumed without argument that farms which were let by the lord of the manor were part of the lord's demesne land.\nIn Ireland, demesne lands were often demarcated with high stone walls. Today, 24 townlands in Ireland bear the name of \"Demesne\", and many others contain the word.\n\n\n== Royal demesne ==\nImmediately following the Norman Conquest of 1066, all land in England was claimed by King William the Conqueror as his absolute title by allodial right, being the commencement of the royal demesne, also known as Crown land. The king made grants of very large tracts of land under various forms of feudal tenure from his demesne, generally in the form of feudal baronies. The land not so enfeoffed, for example royal manors administered by royal stewards and royal hunting forests, thus remained within the royal demesne. In the Domesday Book of 1086, this land is referred to as terra regis (literally \"the king's land\"), and in English common law the term ancient demesne refers to the land that was held by the Crown at the time of the Domesday Book.The royal demesne was not a static portfolio: it could be increased, for example, as a result of escheat or forfeiture where a feudal tenure would end and revert to its natural state in the royal demesne, or it could be reduced by later grants of land. During the reign of King George III (1760–1820), Parliament appropriated most of the royal demesne, in exchange for a fixed annual sum thenceforth payable to the monarch, called the Civil List. The position of the royal estate of Windsor, still occupied by the monarch and never alienated since 1066, may be a rare remnant of the royal demesne.In the Lordship of Ireland, King Henry II claimed a large area as the royal demesne in 1171: Dublin, its hinterland, the coastline down to Arklow and the towns of Wexford and Waterford. This region around Dublin would evolve into The Pale.\n\n\n== Derivative usage ==\nSince the demesne surrounded the principal seat of the lord, it came to be loosely used of any proprietary territory: \"the works of Shakespeare are this scholar's demesne.\"\n\n\n== See also ==\nTownland\nMains (Scotland)\n\n\n== References ==\n\n\n== Sources ==\nCorèdon, Christopher; Williams, Ann (2004). A Dictionary of Medieval Terms and Phrases. Cambridge: D. S. Brewer. ISBN 1-84384-023-5."