"Christopher Royston George Ellis (born 10 February 1941), known as Royston Ellis, is an English novelist, travel writer and erstwhile beat poet.\n\n\n== Biography ==\nBorn in Pinner, Ellis was educated at the Harrow County School for Boys in Middlesex until he left aged 16, determined to be a writer. Two years later, his first book, Jiving to Gyp, a sequence of poems, was published.  He performed his poetry on stage and TV to backing by Cliff Richard's original group, the Shadows, as well as Jimmy Page,{{cn|date=May 2019}} and featured in a 1960 TV documentary, Living for Kicks, presented by Daniel Farson, which brought him to national attention and controversy through his remarks on teenage lifestyle, and as a spokesman of his generation.He wrote two books in 1959 and 1961 about touring with Cliff Richard and The Shadows, republished in 2014 by Tomahawk Press as a rock and roll memoir.   In June 1960, he travelled to Liverpool, England to perform a poetry reading at Liverpool University. As he usually read his poetry with backing from jazz musicians, Ellis searched among the locals for suitable musicians to accompany him and met the young group comprising John Lennon, Paul McCartney, George Harrison and Stuart Sutcliffe.  Ellis bonded with Lennon in particular, both sharing an enthusiasm for the American Beat poets, and spent the week at 3 Gambier Terrace with Lennon, Sutcliffe, et al. Lennon saw Ellis as \"the converging point of rock 'n' roll and literature\".  Ellis said of the meeting, \"I was quite a star for them at that time because I had come up from London and that was a world they didn't really know about\".  According to Lennon in the International Times: \"The first dope, from a Benzedrine inhaler, was given to the Beatles (John, George, Paul and Stuart) by an English cover version of Allen Ginsberg — one Royston Ellis, known as 'beat poet' ... So, give the saint his due.\"  Ellis also claimed that he suggested the re-spelling of Beetles to Beatles.\nIn 1961 his book survey of pop music at the dawn of the \"Swinging Sixties\", The Big Beat Scene was published.  It was reprinted with additional comments in 2010 by Music Mentor Press.  Ellis's novel, Myself For Fame (1964), about a fictional pop star, has a chapter set in Liverpool that seems to recount his experiences with The \"Beetles\" in 1960.  Ellis is one of the people the song \"Paperback Writer\" was based on, quoting a comment he had made years earlier while in Liverpool, and was also present at a liaison between Lennon and \"Polythene Pam\" in Guernsey in 1963.  In 1980, John Lennon said:That was me, remembering a little event with a woman in Jersey, and a man who was England's answer to Allen Ginsberg .. I met him when we were on tour and he took me back to his apartment and I had a girl and he had one he wanted me to meet. He said she dressed up in polythene, which she did. She didn't wear jack boots and kilts, I just sort of elaborated. Perverted sex in a polythene bag. Just looking for something to write about.\" \nAt 20, Ellis retired from the teenage beatnik and rock and roll scene and left England permanently for a life of travel that took him to East Berlin and Moscow, where he read his poetry on stage with the Russian poet Yevgeni Yevtushenko. Then, via Guernsey where he became a registered ferry boat engineer, he sailed to the Canary Islands, and acted as an Arab with Cliff Richard in the movie Wonderful Life. He stayed in Las Palmas for three years, becoming the editor of the islands' English language newspaper, The Canary Islands Sun, and wrote three novels.He hiked around West Africa, then landed up in the British Virgin Islands before settling, in 1966, in Dominica where he wrote the best-selling Bondmaster series of historical novels as Richard Tresillian; as well as becoming President of the Dominica Cricket Association, a member of the MCC and of the Windward Islands Cricket Board of Control, and a Life Fellow of the Royal Commonwealth Society.In 1979, after his hillside log cabin in Dominica was blown down by Hurricane David, he moved to Sri Lanka where he lives in a colonial cottage overlooking the Indian Ocean.The author of over 60 published books (guides, novels, biographies and volumes of poetry) he also writes travel features for inflight, international and Sri Lankan magazines. A collection of his beat poetry called Gone Man Squared, was published by in the United States by Kicks Books, an associate of Norton Records in 2013.   A selection of his oeuvre was being published by Kicks Book for Kindle as ebooks during 2014.   For his literary achievements Royston Ellis was awarded the title Duke Gypino y Tintinabulation de Redonda by the purported king of Redonda.\n\n\n== Published works ==\n\n\n=== Poetry ===\nJiving To Gyp (Scorpion 1959)\nRave (Scorpion 1960)\nThe Rainbow Walking Stick (Scorpion 1961)\nBurn Up (Arts Council Music Viva script 1962)\nA Seaman's Suitcase (Scorpion 1963)\nThe Cherry Boy (Turret 1966)\nGone Man Squared (Complete & Unabridged) with an introduction by Jimmy Page, Kicks Books, New York City, 2013. (ISBN 9780965977791)\n\n\n=== Fiction ===\n\n\n==== as Royston Ellis ====\nMyself For Fame (Consul 1963)\nThe Flesh Merchants (Tandem 1966)\nThe Rush At The End (Tandem 1967)\nA Hero In Time (Times, Singapore 2000)\nSeason of the Peacock (in What Love Is short story  collection, Arcadia Books, 2010)\n\n\n==== as Richard Tresillian ====\nThe Bondmaster   (Sphere/Warners, 1977)\nBlood of the Bondmaster (Sphere/Warners, 1978)\nThe Bondmaster Breed (Sphere/Warners, 1979)\nFleur (Sphere/Warner, 1979)\nBondmaster Fury (Sphere, 1982)\nBondmaster Revenge (Sphere, 1983)\nBondmaster Buck (Sphere, 1984)\nMaster of Black River (Futura 1984)\nBlack River Affair (Futura, 1985)\nBlack River Breed (Futura, 1985)\nBloodheart (Sphere, 1985)\nBloodheart Royal (Sphere 1986)\nBloodheart Feud (Sphere, 1987)\nGiselle (Sphere 1988)\nBloodheart (Sri Lanka 2009, in Sinhala)\n\n\n=== Biographies ===\nDriftin’ With Cliff Richard (Chas Buchan, 1960)\nRebel, the story of James Dean (Consul 1961)\nThe Big Beat Scene (Four Square 1961)\nThe Big Beat Scene (Music Mentor Books, 2010)\nThe Shadows By Themselves (Consul 1961)\nA Man for All Islands – President Gayoom of Maldives (Times 1998)\nToni, the Maldives Lady (Times, 1999)\nMy Log Book, 1947–2008: Ali Umar Maniku (Singapore   2010)\n\n\n=== Travel ===\nIndia By Rail (Bradt 1989, 1992, 1995)\nIndia By Rail (in German, 1990)\nIndia By Rail (in French, 1993)\nBradt Guide to Mauritius (Bradt, 1988 – 2014)\nBradt Guide to Mauritius (in German, 1990)\nHistory of the Grand Hotel (Sri Lanka, 1991)\nHistory of the Tea Factory Hotel (Sri Lanka 1993)\nSri Lanka By Rail (Bradt 1994)\nSeeing Sri Lanka By Train (Sri Lanka, 1995)\nBradt Guide to Maldives (Bradt 1995, 2000,2005,2008)\nBradt Guide to Maldives (in Italian, 2008)\nBradt Guide to Maldives (in Russian, 2009)\nA Maldives Celebration (Times 1998)\nFestivals of the World: Trinidad (Times 1999)\nFestivals of the World: Madagascar (Times 1999)\nOn The Wings Of Freedom (Sri Lanka, 1998)\nThe Sri Lanka Story (Sri Lanka, 2002)\nBradt Guide to Sri Lanka (Bradt, 2000, 2005, 2008, 2011, 2014)\nStory of Full Moon (Maldives 2003)\nStory of Baros (Maldives, 2004)\nThe Growing Years: History of the Ceylon Planters' Association (Sri Lanka, 2004)\nInsight Pocket Guide to Maldives (Insight, 2006)\nTwenty Years Uncovered: The MAS Story (Sri Lanka   2008)\nIndian Railways Handbook (2008)\nBerlitz Pocket Guide to Maldives (Berlitz 2007)\nGreat Train Journeys of The World (Time Out, 2009,   contributor)\nSri Lanka Step by Step (Insight Guide 2010)\nThe Kurumba Story (Maldives, 2012)\nBaros A Legend (2013)\n\n\n== References ==\n\n\n== External links ==\nRoyston Ellis\nRoyston Ellis on Sri Lanka\nRoyston Ellis Collection at the Harry Ransom Center at the University of Texas at Austin\nTropical Tropics by Royston Ellis\nSri Lanka Holiday Guru editor- Royston Ellis"