"A container format (informally, sometimes called a wrapper) is a file format that allows multiple data streams to be embedded into a single file, usually along with metadata for identifying and further detailing those streams.  Notable examples of container formats include archive files (such as the ZIP format) and formats used for multimedia playback (such as Matroska, MP4, and AVI). Among the earliest cross-platform container formats were Distinguished Encoding Rules and the 1985 Interchange File Format.\n\n\n== Design ==\nAlthough containers may identify how data or metadata is encoded, they do not actually provide instructions about how to decode that data. A program that can open a container must also use an appropriate codec to decode its contents. If the program doesn't have the required algorithm, it can't use the contained data. In these cases, programs usually emit an error message that complains of a missing codec, which users may be able to acquire.\nContainer formats can be made to wrap any kind of data. Though there are some examples of such file formats (e.g. Microsoft Windows's DLL files), most container formats are specialized for specific data requirements. For example, since audio and video streams can be coded and decoded with many different algorithms, a container format may be used to provide the appearance of a single file format to users of multimedia playback software.\n\n\n=== Considerations ===\nThe differences between various container formats arise from five main issues:\n\nPopularity; how widely supported a container is.\nOverhead.  This is the difference in file-size between two files with the same content in a different container.\nSupport for advanced codec functionality.  Older formats such as AVI do not support new codec features like B-frames, VBR audio or VFR video natively. The format may be \"hacked\" to add support, but this creates compatibility problems.\nSupport for advanced content, such as chapters, subtitles, meta-tags, user-data.\nSupport of streaming media.\n\n\n=== Single coding formats ===\nIn addition to pure container formats, which specify only the wrapper but not the coding, a number of file formats specify both a storage layer and the coding, as part of modular design and forward compatibility.\nExamples include JPEG File Interchange Format (JFIF) for containing JPEG data, and Portable Network Graphics (PNG).\nIn principle, coding can be changed while the storage layer is retained; for example, Multiple-image Network Graphics (MNG) uses the PNG container format but provides animation, while JPEG Network Graphics (JNG) puts JPEG encoded data in a PNG container; in both cases however, the different formats have different magic numbers – the format specifies the coding, though a MNG can contain both PNG-encoded images and JPEG-encoded images.\n\n\n== Multimedia container formats ==\n\nThe container file is used to identify and interleave different data types. Simpler container formats can contain different types of audio formats, while more advanced container formats can support multiple audio and video streams, subtitles, chapter-information, and meta-data (tags) — along with the synchronization information needed to play back the various streams together. In most cases, the file header, most of the metadata and the synchro chunks are specified by the container format. For example, container formats exist for optimized, low-quality, internet video streaming which differs from high-quality Blu-ray streaming requirements.\nContainer format parts have various names: \"chunks\" as in RIFF and PNG, \"atoms\" in QuickTime/MP4, \"packets\" in MPEG-TS (from the communications term), and \"segments\" in JPEG. The main content of a chunk is called the \"data\" or \"payload\". Most container formats have chunks in sequence, each with a header, while TIFF instead stores offsets.  Modular chunks make it easy to recover other chunks in case of file corruption or dropped frames or bit slip, while offsets result in framing errors in cases of bit slip.\nSome containers are exclusive to audio:\n\nAIFF (IFF file format, widely used on Mac OS platform)\nWAV  (RIFF file format, widely used on Windows platform)\nXMF (Extensible Music Format)Other containers are exclusive to still images:\n\nFITS (Flexible Image Transport System) still images, raw data, and associated metadata.\nTIFF (Tagged Image File Format) still images and associated metadata.Other flexible containers can hold many types of audio and video, as well as other media. The most popular multi-media containers are:\n\n3GP (used by many mobile phones; based on the ISO base media file format)\nASF (container for Microsoft WMA and WMV, which today usually do not use a container)\nAVI (the standard Microsoft Windows container, also based on RIFF)\nDVR-MS (\"Microsoft Digital Video Recording\", proprietary video container format developed by Microsoft based on ASF)\nFlash Video (FLV, F4V) (container for video and audio from Adobe Systems)\nIFF (first platform-independent container format)\nMatroska (MKV) (not limited to any coding format, as it can hold virtually anything; it is an open standard container format)\nMJ2 - Motion JPEG 2000 file format, based on the ISO base media file format which is defined in MPEG-4 Part 12 and JPEG 2000 Part 12\nQuickTime File Format (standard QuickTime video container from Apple Inc.)\nMPEG program stream (standard container for MPEG-1 and MPEG-2 elementary streams on reasonably reliable media such as disks; used also on DVD-Video discs)\nMPEG-2 transport stream (a.k.a. MPEG-TS) (standard container for digital broadcasting and for transportation over unreliable media; used also on Blu-ray Disc video; typically contains multiple video and audio streams, and an electronic program guide)\nMP4 (standard audio and video container for the MPEG-4 multimedia portfolio, based on the ISO base media file format defined in MPEG-4 Part 12 and JPEG 2000 Part 12) which in turn was based on the QuickTime file format.\nOgg (standard container for Xiph.org audio formats Vorbis and Opus and video format Theora)\nRM (RealMedia; standard container for RealVideo and RealAudio)There are many other container formats, such as NUT, MXF, GXF, ratDVD, SVI, VOB and DivX Media Format\n\n\n== See also ==\nArchive format\nComparison of audio coding formats\nComparison of video codecs\nComparison of video container formats\nList of codecs\nList of open-source codecs\n\n\n== References ==\n\n\n== External links ==\nOnline Video File Format Identification Tool - Designed primarily for CCTV video formats and codecs"