"An organization, or organisation (Commonwealth English; see spelling differences), is an entity – such as a company, an institution, or an association – comprising one or more people and having a particular purpose.\nThe word is derived from the Greek word organon, which means tool or instrument, musical instrument, and organ.\n\n\n== Types ==\nThere are a variety of legal types of organizations, including corporations, governments, non-governmental organizations, political organizations, international organizations, armed forces, charities, not-for-profit corporations, partnerships, cooperatives, and  educational institutions etc.\nA hybrid organization is a body that operates in both the public sector and the private sector simultaneously, fulfilling public duties and developing commercial market activities.\nA voluntary association is an organization consisting of volunteers. Such organizations may be able to operate without legal formalities, depending on jurisdiction, including informal clubs or coordinating bodies with a goal in mind which they may express in the form of an manifesto, mission statement, or in an informal manner reflected in what they do because remember every action done by an organization both legal and illegal reflects a goal in mind.Organizations may also operate secretly or illegally in the case of secret societies, criminal organizations and resistance movements. And in some cases may have obstacles from other organizations (ex: MLK's organization) but what makes an organization an organization is not the paperwork that makes it official but to be an organization there must be four things:\n\nA goal in mind\nA leader or committee making the decision\naction involved\ncommunication and members.But what makes an organization recognized by the government is either filling out Incorporation (business) or recognition in the form of either societal pressure (ex: Advocacy group), causing concerns (ex: Resistance movement) or being considered the spokesperson of a group of people subject to negotiation (ex: the Polisario Front being recognized as the sole representative of the Sahawri people and forming a partially recognized state.)\nCompare the concept of social groups, which may include non-organizations.Organizations and institutions can be synonymous, but Jack Knight writes that organizations are a narrow version of institutions or represent a cluster of institutions; the two are distinct in the sense that organizations contain internal institutions (that govern interactions between the members of the organizations).\n\n\n== Structures ==\n\nThe study of organizations includes a focus on optimising organizational structure. According to management science, most human organizations fall roughly into four types:\nCommittees or juries\nEcologies\nMatrix organizations\nPyramids or hierarchies\n\n\n=== Committees or juries ===\nThese consist of a group of peers who decide as a group, perhaps by voting. The difference between a jury and a committee is that the members of the committee are usually assigned to perform or lead further actions after the group comes to a decision, whereas members of a jury come to a decision. In common law countries, legal juries render decisions of guilt, liability and quantify damages; juries are also used in athletic contests, book awards and similar activities. Sometimes a selection committee functions like a jury. In the Middle Ages, juries in continental Europe were used to determine the law according to consensus among local notables.\nCommittees are often the most reliable way to make decisions. Condorcet's jury theorem proved that if the average member votes better than a roll of dice, then adding more members increases the number of majorities that can come to a correct vote (however correctness is defined). The problem is that if the average member is subsequently worse than a roll of dice, the committee's decisions grow worse, not better; therefore, staffing is crucial.\nParliamentary procedure, such as Robert's Rules of Order, helps prevent committees from engaging in lengthy discussions without reaching decisions.\n\n\n=== Ecologies ===\nThis organizational structure promotes internal competition.  Inefficient components of the organization starve, while effective ones get more work. Everybody is paid for what they actually do, and so runs a tiny business that has to show a profit, or they are fired.\nCompanies who utilize this organization type reflect a rather one-sided view of what goes on in ecology. It is also the case that a natural ecosystem has a natural border - ecoregions do not, in general, compete with one another in any way, but are very autonomous.\nThe pharmaceutical company GlaxoSmithKline talks about functioning as this type of organization in this external article from The Guardian.\nBy:Bastian Batac De Leon.\n\n\n=== Matrix organization ===\n\nThis organizational type assigns each worker two bosses in two different hierarchies. One hierarchy is \"functional\" and assures that each type of expert in the organization is well-trained, and measured by a boss who is super-expert in the same field. The other direction is \"executive\" and tries to get projects completed using the experts. Projects might be organized by products, regions, customer types, or some other schemes.\nAs an example, a company might have an individual with overall responsibility for products X and Y, and another individual with overall responsibility for engineering, quality control, etc. Therefore, subordinates responsible for quality control of project X will have two reporting lines. The United States aerospace industries were first to officially use this organizational structure after it emerged in the early 1960s. \n\n\n=== Pyramids or hierarchical ===\nA hierarchy exemplifies an arrangement with a leader who leads other individual members of the organization. This arrangement is often associated with basis that there are enough imagine a real pyramid, if there are not enough stone blocks to hold up the higher ones, gravity would irrevocably bring down the monumental structure.  So one can imagine that if the leader does not have the support of his subordinates, the entire structure will collapse. Hierarchies were satirized in The Peter Principle (1969), a book that introduced hierarchiology and the saying that \"in a hierarchy every employee tends to rise to his level of incompetence.\"\n\n\n== Theories ==\n\nIn the social sciences, organizations are the object of analysis for a number of disciplines, such as sociology, economics, political science, psychology, management, and organizational communication. The broader analysis of organizations is commonly referred to as organizational structure, organizational studies, organizational behaviour, or organization analysis. A number of different perspectives exist, some of which are compatible:\n\nFrom a functional perspective, the focus is on how entities like businesses or state authorities are used.\nFrom an institutional perspective, an organization is viewed as a purposeful structure within a social context.\nFrom a process-related perspective, an organization is viewed as an entity is being (re-)organized, and the focus is on the organization as a set of tasks or actions.Sociology can be defined as the science of the institutions of modernity; specific institutions serve a function, akin to the individual organs of a coherent body. In the social and political sciences in general, an \"organization\" may be more loosely understood as the planned, coordinated and purposeful action of human beings working through collective action to reach a common goal or construct a tangible product. This action is usually framed by formal membership and form (institutional rules). Sociology distinguishes the term organization into planned formal and unplanned informal (i.e. spontaneously formed) organizations. Sociology analyses organizations in the first line from an institutional perspective. In this sense, organization is an enduring arrangement of elements. These elements and their actions are determined by rules so that a certain task can be fulfilled through a system of coordinated division of labor.\nEconomic approaches to organizations also take the division of labor as a starting point. The division of labor allows for (economies of) specialization. Increasing specialization necessitates coordination. From an economic point of view, markets and organizations are alternative coordination mechanisms for the execution of transactions.An organization is defined by the elements that are part of it (who belongs to the organization and who does not?), its communication (which elements communicate and how do they communicate?), its autonomy (which changes are executed autonomously by the organization or its elements?), and its rules of action compared to outside events (what causes an organization to act as a collective actor?).\nBy coordinated and planned cooperation of the elements, the organization is able to solve tasks that lie beyond the abilities of the single elements. The price paid by the elements is the limitation of the degrees of freedom of the elements. Advantages of organizations are enhancement (more of the same), addition (combination of different features) and extension. Disadvantages can be inertness (through co-ordination) and loss of interaction.\nAmong the theories that are or have been influential are:\n\nActivity theory is the major theoretical influence, acknowledged by de Clodomir Santos de Morais in the development of Organization Workshop method.\nActor–network theory, an approach to social theory and research, originating in the field of science studies, which treats objects as part of social networks.\nComplexity theory and organizations, the use of complexity theory in the field of strategic management and organizational studies.\nContingency theory, a class of behavioural theory that claims that there is no best way to organize a corporation, to lead a company, or to make decisions.\nCritical management studies, a loose but extensive grouping of theoretically informed critiques of management, business, and organization, grounded originally in a critical theory perspective\nEconomic sociology, studies both the social effects and the social causes of various economic phenomena.\nEnterprise architecture, the conceptual model that defines the coalescence of organizational structure and organizational behaviour.\nGarbage Can Model, describes a model which disconnects problems, solutions and decision makers from each other.\nPrincipal–agent problem, concerns the difficulties in motivating one party (the \"agent\"), to act in the best interests of another (the \"principal\") rather than in his or her own interests\nScientific management (mainly following Frederick W. Taylor), a theory of management that analyses and synthesizes workflows.\nSocial entrepreneurship, the process of pursuing innovative solutions to social problems.\nTransaction cost theory, the idea that people begin to organize their production in firms when the transaction cost of coordinating production through the market exchange, given imperfect information, is greater than within the firm.\nWeber's Ideal of Bureaucracy (refer to Max Weber's chapter on \"Bureaucracy\" in his book Economy and Society)\n\n\n== Leadership ==\n\nA leader in a formal, hierarchical organization, is appointed to a managerial position and has the right to command and enforce obedience by virtue of the authority of his position. However, he must possess adequate personal attributes to match his authority, because authority is only potentially available to him. In the absence of sufficient personal competence, a manager may be confronted by an emergent leader who can challenge his role in the organization and reduce it to that of a figurehead. However, only authority of position has the backing of formal sanctions. It follows that whoever wields personal influence and power can legitimize this only by gaining a formal position in the hierarchy, with commensurate authority.\n\n\n=== Formal organizations ===\nAn organization that is established as a means for achieving defined objectives has been referred to as a formal organization. Its design specifies how goals are subdivided and reflected in subdivisions of the organization. Divisions, departments, sections, positions, jobs, and tasks make up this work structure. Thus, the formal organization is expected to behave impersonally in regard to relationships with clients or with its members. According to Weber's definition, entry and subsequent advancement is by merit or seniority. Each employee receives a salary and enjoys a degree of tenure that safeguards him from the arbitrary influence of superiors or of powerful clients. The higher his position in the hierarchy, the greater his presumed expertise in adjudicating problems that may arise in the course of the work carried out at lower levels of the organization. It is this bureaucratic structure that forms the basis for the appointment of heads or chiefs of administrative subdivisions in the organization and endows them with the authority attached to their position.\n\n\n=== Informal organizations ===\nIn contrast to the appointed head or chief of an administrative unit, a leader emerges within the context of the informal organization that underlies the formal structure. The informal organization expresses the personal objectives and goals of the individual membership. Their objectives and goals may or may not coincide with those of the formal organization. The informal organization represents an extension of the social structures that generally characterize human life – the spontaneous emergence of groups and organizations as ends in themselves.In prehistoric times, man was preoccupied with his personal security, maintenance, protection, and survival. Now man spends a major portion of his waking hours working for organizations. His need to identify with a community that provides security, protection, maintenance, and a feeling of belonging continues unchanged from prehistoric times. This need is met by the informal organization and its emergent, or unofficial, leaders.Leaders emerge from within the structure of the informal organization. Their personal qualities, the demands of the situation, or a combination of these and other factors attract followers who accept their leadership within one or several overlay structures. Instead of the authority of position held by an appointed head or chief, the emergent leader wields influence or power. Influence is the ability of a person to gain cooperation from others by means of persuasion or control over rewards. Power is a stronger form of influence because it reflects a person's ability to enforce action through the control of a means of punishment.\n\n\n=== The interplay between formal and informal organizations ===\nAs most organizations operate through a mix of formal and informal mechanisms, organization science scholars have paid attention to the type of interplay between formal and informal organizations. On the one hand, some have argued that formal and informal organizations operate as substitutes as one type of organization would decrease the advantages of using the other one. For instance, if parties trust each other the use of a formal contract is unnecessary or even detrimental to the relationship. On the other hand, other scholars have suggested that formal and informal organizations can complement each other. For instance, formal mechanisms of control can pave the way for the development of relational norms.\n\n\n== See also ==\n\n\n== References ==\n\nGeneralCoase, Ronald (1937). \"The Nature of the Firm\" Economica, 4(16), pp. 386–405.\nHandy, Charles (1990). Inside Organizations: 21 Ideas for Managers. London: BBC Books. ISBN 978-0-563-20830-3.\nHandy, Charles (2005). Understanding Organizations (4th ed.). London: Penguin Books. ISBN 978-0-14-015603-4.\nHewlett, Roderic. (2006). The Cognitive leader. Rowman & Littlefield Pub Inc.\nJohnson, Richard Arvid (1976). Management, systems, and society : an introduction. Pacific Palisades, Calif.: Goodyear Pub. Co. ISBN 0-87620-540-6. OCLC 2299496.\nKatz, Daniel; Kahn, Robert Louis (1966). The social psychology of organizations. New York: Wiley. OCLC 255184.\nMarch, James G.; Simon, Herbert A. (1958). Organizations. New York: Wiley. ISBN 0-471-56793-0. OCLC 1329335.\nMarshak, Thomas (1987). \"organization theory,\" The New Palgrave: A Dictionary of Economics, v. 3, pp. 757–60.\nMintzberg, Henry (1981). \"Organization Design: Fashion or Fit\"  Harvard Business Review (January February)\nMorgenstern, Julie (1998).  Organizing from the Inside Out.  Owl Books ISBN 0-8050-5649-1\nPeter, Laurence J. and Raymond Hull. The Peter Principle  Pan Books 1970 ISBN 0-330-02519-8\nRogers, Carl R.; Roethlisberger, Fritz Jules (1990). Barriers and gateways to communication. Boston, Mass.: Harvard Business Review. OCLC 154085959.\nSamson, D., Daft, R. (2005). Management: second Pacific Rim edition. Melbourne, Victoria: Thomson\nSatir, Virginia (1967). Conjoint family therapy; a guide to theory and technique. Palo Alto, Calif: Science and Behavior Books. OCLC 187068.\nScott, William Richard (2008). Institutions and Organizations (3rd ed.). London: Sage Publications Ltd. ISBN 978-1-4129-5090-9.\n\n\n== External links ==\nResearch on Organizations: Bibliography Database and Maps\nTheTransitioner.org: a site dedicated to collective intelligence and structure of organizations"