"Bunyavirales is an order of segmented negative-strand RNA viruses with mainly tripartite genomes. Member viruses infect arthropods, plants, protozoans, and vertebrates. It is the only order in the class Ellioviricetes. The name Bunyavirales derives from Bunyamwera, where the original type species Bunyamwera orthobunyavirus was first discovered.  Ellioviricetes is named in honor of late virologist Richard M. Elliott for his early work on bunyaviruses.Bunyaviruses belong to the fifth group of the Baltimore classification system, which includes viruses with a negative-sense, single-stranded RNA genome.  They have an enveloped, spherical virion. Though generally found in arthropods or rodents, certain viruses in this order occasionally infect humans. Some of them also infect plants. In addition, there is a group of bunyaviruses whose replication is restricted to arthropods and is known as insect-specific bunyaviruses.A majority of bunyaviruses are vector-borne. With the exception of Hantaviruses and Arenaviruses, all viruses in the Bunyavirales order are transmitted by arthropods (mosquitos, tick, or sandfly). Hantaviruses are transmitted through contact with rodent feces. Incidence of infection is closely linked to vector activity, for example, mosquito-borne viruses are more common in the summer.Human infections with certain members of Bunyavirales, such as Crimean-Congo hemorrhagic fever orthonairovirus, are associated with high levels of morbidity and mortality, consequently handling of these viruses is done in biosafety level 4 laboratories. They are also the cause of severe fever with thrombocytopenia syndrome.Hantaviruses  are another medically important member of the order Bunyvirales. They are found worldwide, and are relatively common in Korea, Scandinavia (including Finland), Russia, western North America and parts of South America. Hantavirus infections are associated with high fever, lung edema, and pulmonary failure. The mortality rate varies significantly depending on the form, being up to 50% in New World hantaviruses (the Americas), up to 15% in Old World hantaviruses (Asia and Europe), and as little as 0.1% in Puumala virus (mostly Scandinavia). The antibody reaction plays an important role in decreasing levels of viremia."