"Penélope Cruz Sánchez (; Spanish: [peˈnelope ˈkɾuθ ˈsantʃeθ]; born 28 April 1974) is a Spanish actress and model. Signed by an agent at the age of 15, she made her acting debut at 16 on television, and her feature film debut the following year in Jamón Jamón (1992). Her subsequent roles in the 1990s and 2000s included Belle Époque (1992), Open Your Eyes (1997), The Hi-Lo Country (1999), The Girl of Your Dreams (2000), and Woman on Top (2000). Cruz is also known for her collaborations with director Pedro Almodóvar acting in Live Flesh (1997), All About My Mother (1999), Volver (2006), Broken Embraces (2009), I'm So Excited! (2013), Julieta (2016), Pain and Glory (2019) and with director Woody Allen starring in Vicky Cristina Barcelona (2008) and To Rome with Love (2012). She has since garnered numerous awards and recognitions, including an Academy Award from three nominations.\nCruz achieved international recognition for her lead roles in the 2000-2001 films Vanilla Sky, All the Pretty Horses, Captain Corelli's Mandolin, and Blow. Cruz has appeared in various films from a wide range of genres, including the comedy Waking Up in Reno (2002), the thriller Gothika (2003), the Christmas film Noel (2004), the action-adventure films Sahara (2005) and Pirates of the Caribbean: On Stranger Tides (2011), the crime drama The Counselor (2013), and the mystery film Murder on the Orient Express (2017). She received critical acclaim for her roles in Volver (2006) and Nine (2009), earning Golden Globe and Academy Award nominations for each. She won the Academy Award for Best Supporting Actress in 2008 for playing volatile painter María Elena in Woody Allen's Vicky Cristina Barcelona. She is the first and only Spanish actress to both win and be nominated for an Academy Award, as well as the first Spanish actress to receive a star on the Hollywood Walk of Fame. In 2018, Cruz made her American television debut as Italian fashion designer Donatella Versace in the FX series The Assassination of Gianni Versace: American Crime Story, for which she was nominated for the Primetime Emmy Award for Outstanding Supporting Actress in a Limited Series or Movie.\nCruz has modelled for Mango, Ralph Lauren, Chanel, and L'Oréal, and along with her younger sister Mónica Cruz, has designed clothing for Mango. Cruz has volunteered in Uganda and India, where she spent one week working with Mother Teresa; she donated her salary from The Hi-Lo Country to help fund the late nun's mission."