"Fortune telling is the practice of predicting information about a person's life. The scope of fortune telling is in principle identical with the practice of divination. The difference is that divination is the term used for predictions considered part of a religious ritual, invoking deities or spirits, while the term fortune telling implies a less serious or formal setting, even one of popular culture, where belief in occult workings behind the prediction is less prominent than the concept of suggestion, spiritual or practical advisory or affirmation.\nHistorically, Pliny the Elder describes use of the crystal ball in the 1st century CE by soothsayers (\"crystallum orbis\", later written in Medieval Latin by scribes as orbuculum).Contemporary Western images of fortune telling grow out of folkloristic reception of Renaissance magic, specifically associated with Romani people. During the 19th and 20th century, methods of divination from non-Western cultures, such as the I Ching, were also adopted as methods of fortune telling in western popular culture.\nAn example of divination or fortune telling as purely an item of pop culture, with little or no vestiges of belief in the occult, would be the Magic 8-Ball sold as a toy by Mattel, or Paul II, an octopus at the Sea Life Aquarium at Oberhausen used to predict the outcome of matches played by the Germany national football team.There is opposition to fortune telling in Christianity, Islam, Baháʼísm and Judaism based on scriptural prohibitions against divination.\nTerms for one who claims to see into the future include fortune teller, crystal-gazer, spaewife, seer, soothsayer, sibyl, clairvoyant, and prophet; related terms which might include this among other abilities are oracle, augur, and visionary.\nFortune telling is dismissed by the scientific community and scientific skeptics as being based on magical thinking and superstition.\n\n\n== Methods ==\n\nCommon methods used for fortune telling in Europe and the Americas include astromancy, horary astrology, pendulum reading, spirit board reading, tasseography (reading tea leaves in a cup), cartomancy (fortune telling with cards), tarot card reading, crystallomancy (reading of a crystal sphere), and chiromancy (palmistry, reading of the palms). The last three have traditional associations in the popular mind with the Roma and Sinti people (often called \"gypsies\").\nAnother form of fortune telling, sometimes called \"reading\" or \"spiritual consultation\", does not rely on specific devices or methods, but rather the practitioner gives the client advice and predictions which are said to have come from spirits or in visions.\n\nAlectromancy: by observation of a rooster pecking at grain\nAstrology: by the movements of celestial bodies.\nAstromancy: by the stars.\nAugury: by the flight of birds.\nBazi or four pillars: by hour, day, month, and year of birth.\nBibliomancy: by books; frequently, but not always, religious texts.\nCartomancy: by playing cards, tarot cards, or oracle cards.\nCeromancy: by patterns in melting or dripping wax.\nChiromancy: by the shape of the hands and lines in the palms.\nChronomancy: by determination of lucky and unlucky days.\nClairvoyance: by spiritual vision or inner sight.\nCleromancy: by casting of lots, or casting bones or stones.\nCold reading: by using visual and aural clues.\nCrystallomancy: by crystal ball also called scrying.\nExtispicy: by the entrails of animals.\nFace reading: by means of variations in face and head shape.\nFeng shui: by earthen harmony.\nGastromancy: by stomach-based ventriloquism (historically).\nGeomancy: by markings in the ground, sand, earth, or soil.\nHaruspicy: by the livers of sacrificed animals.\nHorary astrology: the astrology of the time the question was asked.\nHydromancy: by water.\nI Ching divination: by yarrow stalks or coins and the I Ching.\nKau cim by means of numbered bamboo sticks shaken from a tube.\nLithomancy: by stones or gems.\nMolybdomancy: by molten metal after dumped in cold water\nNaeviology: by moles, scars, or other bodily marks\nNecromancy: by the dead, or by spirits or souls of the dead.\nNephomancy: by shapes of clouds.\nNumerology: by numbers.\nOneiromancy: by dreams.\nOnomancy: by names.\nPalmistry: by lines and mounds on the hand.\nParrot astrology: by parakeets picking up fortune cards\nPaper fortune teller: origami used in fortune-telling games\nPendulum reading: by the movements of a suspended object.\nPyromancy: by gazing into fire.\nRhabdomancy: divination by rods.\nRunecasting or Runic divination: by runes.\nScrying: by looking at or into reflective objects.\nSpirit board: by planchette or talking board.\nTaromancy: by a form of cartomancy using tarot cards.\nTasseography or tasseomancy: by tea leaves or coffee grounds.\n\n\n== Sociology ==\n\nWestern fortune tellers typically attempt predictions on matters such as future romantic, financial, and childbearing prospects. Many fortune tellers will also give \"character readings\". These may use numerology, graphology, palmistry (if the subject is present), and astrology.\nIn contemporary Western culture, it appears that women consult fortune tellers more than men. Some women have maintained long relationships with their personal readers. Telephone consultations with psychics grew in popularity through the 1990s, and by the 2010s additional contact methods such as email and videoconferencing also became available, but none of these have completely replaced traditional in-person methods of consultation.\n\n\n== As a business in North America ==\n\nDiscussing the role of fortune telling in society, Ronald H. Isaacs, an American rabbi and author, opined, \"Since time immemorial humans have longed to learn that which the future holds for them. Thus, in ancient civilization, and even today with fortune telling as a true profession, humankind continues to be curious about its future, both out of sheer curiosity as well as out of desire to better prepare for it.\"\nPopular media outlets like The New York Times have explained to their American readers that although 5000 years ago, soothsayers were prized advisers to the Assyrians, they lost respect and reverence during the rise of Reason in the 17th and 18th centuries.With the rise of commercialism, \"the sale of occult practices [adapted to survive] in the larger society,\" according to sociologists Danny L. and Lin Jorgensen. Ken Feingold, writer of \"Interactive Art as Divination as a Vending Machine,\" stated that with the invention of money, fortune telling became \"a private service, a commodity within the marketplace\".As J. Peder Zane wrote in The New York Times in 1994, referring to the Psychic Friends Network, \"Whether it’s 3 P.M. or 3 A.M., there’s Dionne Warwick and her psychic friends selling advice on love, money and success. In a nation where the power of crystals and the likelihood that angels hover nearby prompt more contemplation than ridicule, it may not be surprising that one million people a year call Ms. Warwick’s friends.\"\n\n\n=== Clientele ===\nIn 1994, the psychic counsellor Rosanna Rogers of Cleveland, Ohio explained to J. Peder Zane  that a wide variety of people consulted her: \"Couch potatoes aren’t the only people seeking the counsel of psychics and astrologers. Clairvoyants have a booming business advising Philadelphia bankers, Hollywood lawyers and CEO’s of Fortune 500 companies... If people knew how many people, especially the very rich and powerful ones, went to psychics, their jaws would drop through the floor.\" Ms. Rogers \"claims to have 4,000 names in her rolodex.\"Janet Lee, also known as the Greenwich psychic, claims that her clientele often included Wall Street brokers who were looking for any advantage they could get. Her usual fee was around $150 for a session but some clients would pay between $2,000 and $9,000 per month to have her available 24 hours a day to consult.\n\n\n=== Typical clients ===\nIn 1982, Danny Jorgensen, a professor of Religious Studies at the University of South Florida offered a spiritual explanation for the popularity of fortune telling. He said that people visit psychics or fortune tellers to gain self-understanding, and knowledge which will lead to personal power or success in some aspect of life.In 1995, Ken Feingold offered a different explanation for why people seek out fortune tellers: \"We desire to know other people’s actions and to resolve our own conflicts regarding decisions to be made and our participation in social groups and economies. […] Divination seems to have emerged from our knowing the inevitability of death.  The idea is clear—we know that our time is limited and that we want things in our lives to happen in accord with our wishes. Realizing that our wishes have little power, we have sought technologies for gaining knowledge of the future… gain power over our own [lives].\"Ultimately, the reasons a person consults a diviner or fortune teller depend on cultural and personal expectations.\n\n\n=== Services ===\nTraditional fortune tellers vary in methodology, generally using techniques long established in their cultures and thus meeting the cultural expectations of their clientele.\nIn the United States and Canada, among clients of European ancestry, palmistry is popular and, as with astrology and tarot card reading, advice is generally given about specific problems besetting the client.\nNon-religious spiritual guidance may also be offered. An American seclairvoyant by the name of Catherine Adams has written, \"My philosophy is to teach and practice spiritual freedom, which means you have your own spiritual guidance, which I can help you get in touch with.\"In the African American community, where many people practice a form of folk magic called hoodoo or rootworking, a fortune-telling session or \"reading\" for a client may be followed by practical guidance in spell-casting and Christian prayer, through a process called \"magical coaching\".In addition to sharing and explaining their visions, fortune tellers can also act like counselors by discussing and offering advice about their clients' problems. They want their clients to exercise their own willpower.\n\n\n=== Full-time careers ===\n\nSome fortune tellers support themselves entirely on their divination business; others hold down one or more jobs, and their second jobs may or may not relate to the occupation of divining. In 1982, Danny L., and Lin Jorgensen found that \"while there is considerable variation among [these secondary] occupations, [part-time fortune tellers] are over-represented in human service fields: counseling, social work, teaching, health care.\" The same authors, making a limited survey of North American diviners, found that the majority of fortune tellers are married with children, and a few claim graduate degrees. \"They attend movies, watch television, work at regular jobs, shop at K-Mart, sometimes eat at McDonald's, and go to the hospital when they are seriously ill.\"\n\n\n=== Legality ===\nIn 1982, the sociologists Danny L., and Lin Jorgensen found that, \"when it is reasonable, [fortune tellers] comply with local laws and purchase a business license.\" However, in the United States, a variety of local and state laws restrict fortune telling, require the licensing or bonding of fortune tellers, or make necessary the use of terminology that avoids the term \"fortune teller\" in favor of terms such as \"spiritual advisor\" or \"psychic consultant.\" There are also laws that outright forbid the practice in certain districts.\nFor instance, fortune telling is a class B misdemeanor in the state of New York. Under New York State law, S 165.35:\n\nA person is guilty of fortune telling when, for a fee or compensation which he directly or indirectly solicits or receives, he claims or pretends to tell fortunes, or holds himself out as being able, by claimed or pretended use of occult powers, to answer questions or give advice on personal matters or to exercise, influence or affect evil spirits or curses; except that this section does not apply to a person who engages in the aforedescribed conduct as part of a show or exhibition solely for the purpose of entertainment or amusement.\nLawmakers who wrote this statute acknowledged that fortune tellers do not restrict themselves to \"a show or exhibition solely for the purpose of entertainment or amusement\" and that people will continue to seek out fortune tellers even though fortune tellers operate in violation of the law.\nSimilarly, in New Zealand, Section 16 of the Summary Offences Act 1981 provides a one thousand dollar penalty for anyone who sets out to \"deceive or pretend\" for financial recompense that they possess telepathy or clairvoyance or acts as a medium for money through use of \"fraudulent devices.\" As with the New York legislation cited above, however, it is not a criminal offence if it is solely intended for purposes of entertainment.\nSaudi Arabia also bans the practice outright, considering fortune telling to be sorcery and thus contrary to Islamic teaching and jurisprudence. It has been punishable by death.\n\n\n== Critical analysis ==\nFortune telling is dismissed by the scientific community and skeptics as being based on magical thinking and superstition.Skeptic Bergen Evans suggested that fortune telling is the result of a \"naïve selection of something that have  happened from a mass of things that haven't, the clever interpretation of ambiguities, or a brazen announcement of the inevitable.\" Other skeptics claim that fortune telling is nothing more than cold reading.A large amount of fraud has occurred in the practice of fortune telling.Fortune telling and how it works raises many critical questions. For example, fortune-telling occurs through various methods such as psychic readings, tarot cards, and more. What is similar about many of these methods is that they are based on random phenomena. For example, astrologers believe that the movement of stars in the sky can have implications on one's life. In the case of tarot cards, people believe that images displayed on the cards have significant meanings on their lives. The problem is that there is a lack of evidence to support why such things, such as the stars, would have any implications on our lives. \nAdditionally, fortune-telling readings and predictions made by horoscopes, for example, are often general enough to apply to anyone. In cold reading, for example, readers often begin by stating general descriptions and continuing to make specifics based on the reactions they receive from the person whose life they are predicting. The tendency for people to deem general descriptions as being representative to themselves has been termed the Barnum effect and has been studied by psychologists for many years.Nonetheless, even with a lack of evidence supporting the various methods of fortune-telling and the many frauds that have occurred by psychic readers, for example, fortune-telling continues to become popular around the world. There are many reasons for the appealing nature of fortune-telling such as that people often experience stress when there is uncertainty and thus seek to gain deeper insight into their lives.\n\n\n== See also ==\n\n\n== Notes ==\n\n\n== References ==\nFeingold, Ken (1995), \"OU: Interactivity as Divination as Vending Machine\", Leonardo, Third Annual New York Digital Salon, 28 (5): 399–402, doi:10.2307/1576224, JSTOR 1576224, S2CID 61727726\nHughes, M., Behanna, R; Signorella, M. (2001). Perceived Accuracy of Fortune Telling and Belief in the Paranormal. Journal of Social Psychology 141: 159-160.\nJorgensen, Danny L.; Jorgensen, Lin (1982), \"Social Meanings of the Occult\", The Sociological Quarterly, 23 (3): 373–389, doi:10.1111/j.1533-8525.1982.tb01019.x.\nZane, J. Peder (11 September 1994), \"Soothsayers as Business Advisers; You Are Going to Go on a Long Trip…\", The New York Times.\n\n\n== External links ==\n Media related to Fortune-telling at Wikimedia Commons"