"Carolinian is an Austronesian language originating in the Caroline Islands, but spoken in the Northern Mariana Islands. It is an official language (as well as English) of the Carolinian people.  Carolinian is a threatened language according to the Catalogue of Endangered Languages (ELCat), but available data is scarce. There are approximately 3,100 native speakers in the world. Carolinian has 95% lexical similarity with Satawalese, 88% with Woleaian and Puluwatese; 81% with Mortlockese; 78% with Chuukese, 74% with Ulithian.\n\n\n== Classification ==\nThe Commonwealth of the Northern Marianas occupies a chain of 14 islands in the Pacific, approximately 1,300 miles southeast of Japan. The total land areas are 183.5 square miles, and some islands are unpopulated. Most Carolinians live on Saipan, the largest island, though a very small island. Agrigan, is reported to be populated solely by Carolinians speaking Carolinian language.Carolinian language is more usually known as Saipan Carolinian, it was born from several languages in the Carolinian language continuum, due to a century of migration from the west Carolinian atolls to the Northern Marianas island of Saipan in 1815. Spoken mostly by the Carolinian people, Carolinian is the most closely related dialect to Satawalese, Woleaian, and Puluwatese languages. Nowadays, Carolinian is changing quickly due to English, which has dominated Micronesia since World War II. There are only a small percentage of Carolinian children left on Saipan who can confidently speak the traditional form of Carolinian.\n\n\n== History ==\n\n\n=== Early history ===\nThe Carolinian language comes from closely related languages and dialects. It is a member of the family of Austronesian languages. The first residents were the Austronesians, who came from Taiwan. In 1652, Europeans started to live on the Caroline Islands and spoke the language. Later, people communicated with Europeans in the main linguistic areas of the Carolinian language at the end of the 1600s. Between 1795 and 1797, a Spanish official on Guam, Don Luis de Torres, began to study the Carolinian language and discovered its dialect continuum. During the 1700s, there were more than two Carolinian drift voyages to the Philippines and more than four drift voyages to Guam. The voyages spread a lot of information on Carolinian culture and language from outside islands during the same period.During the 1800s, there was a range of reasons for the maintenance of inter-island travel, and thus supporting the Carolinian language continuum. Besides the necessity to survive, it also had many benefits to communication, trade, and family relations. The evolution of the Carolinian language would have changed once the Carolinian people moved to Saipan under Chamorros occupation. However, Saipan was abandoned in approximately 1815. Due to the Spanish, Carolinians had a beautiful undisturbed frontier all to themselves. The original Carolinian speaking group to live on Saipan would be the first speaker of Saipan Carolinian. Also, every migration from additional atolls would have added many complex languages through that time. It would be good to tell the stages of speaking evolution on Saipan, based on the continued layers of “blending” from the beginning period until today.For that to happen, it would require detailed information on all migrations from 1815 until modern times. Nonetheless, the historical records of movements to Saipan conflict with each other at certain points along the way, and it is sometimes hard to know which group preceded which one. The form of speaking on Saipan did not have an opportunity to specify during the 19th century. Some speakers coming and going between Saipan and the atolls indicated that the language was in a constant state of changing.\n\n\n=== Late history ===\nWhen immigrations came from atolls east of Satawal, the population of Carolinians in the Northern Marianas began to have a huge change after the 1850s. From 1865 to 1868, an English entrepreneur, H. G. Johnson, moved about 1,500 Carolinians to the Marianas, to help running his plantations on Guam, Rota, and Tinian. This number population included Carolinians from Pollan is uncertain. Following the pathway of those 1,500 Carolinians from their first islands to the island of the first assignment in 1865 to 1869, and then on to their last destination by the end of the 1900s century, had so many challengings. The Spanish stone-walled until the Tinian Carolinian moved to Saipan.When the Americans took over Guam in 1898, the Carolinians of the Maria Cristina village were still there. Also, the Americans tried to require the Carolinians in Guam to give their customary dress up. That was not going too well, and the Carolinians still wore their dress. Almost all of the migrations that led to populating the Carolinian community on Saipan had happened in 1911. Additionally, any voyages had no memory existing after about 1905. Specifically, it was the biggest influx of outer island Carolinians to Saipan during 1905 and 1907. Especially when German ships using moved hundreds of Mortlockese and other atoll dwellers to Saipan because of the typhoon devastation on the outer islands in 1907. There was not any huge impact on the language traits that Carolinian language was utilized. This stems from the fact that the migrations were directed into areas of Saipan away from the established villages. Many islanders returned to their original island homes as soon as the crop on the outer islands could recover from the 1907 typhoon, which was a crucial movement for the Carolinian history to influence the language changes.  Only a few people who shared from these forced migrations remained on Saipan.Today, both northern and southern Saipan Carolinians have spread throughout populated areas of Saipan, include the new Kagman homestead areas, which built by the government on the eastern shore. Two events began the process on Saipan whereby the Saipan Carolinians began to reconnect with their outer-island roots in the 1970s. The first one was that a navigator made a voyage from the outer islands to Saipan in 1969 when after a lapse of 60 or 70 years. Saipan Carolinians were in the overpowering current of U.S., and global influence in a new political reality meant for them. The impact of radio, printed matter, and the addition of TVs, video players, video games to virtually every Carolinian home would ensure that nowadays would never subside. While it is true to say that a certain amount of authentic and entrenched aspects of Carolinian language and culture would persist far in the future, the new arrangement would have an enormous impact on the language. There was still genuine interest in preserving the native languages. However,  the reality is different from what people plan.\n\n\n== Cultures ==\nAccording to the history of the language, it is critical to show respect to the Carolinian culture, in particular for older people. First, Carolinian women must use precise words when they are speaking to their brothers and other male relatives. In addition, another way that a woman should show respect to her brothers or male relatives is when the brothers are sitting, and she needs to get up to do something, she must bend her back while walking past him, and her head should not be higher than the man. This is the norm in the Carolinian culture. Also, it is not good to go to the front of the brothers when the sisters pass; she should go around the back of them.  This shows that the language is inseparable from its culture.\nSecond, in the Carolinian culture, dishes cannot be shared between sister and brother. Dishes used by males must not be used by females except by the mother of the man. This is their custom. Additionally, female's bedrooms are restricted. For example, brothers and male relatives must not enter their sister's or female relative's bedroom. Girls should be careful about their personal things, like underwear, which should not be seen by their brothers, after washing clothes they should hang them to dry in a separate place. Females cannot slap her brother, comb his hair, scratch his back and touch his face.\nThird, there is a certain age when a girl must be doing these things. As soon as she gets her menstrual period, this is the starting age. In the outer island of the Carolines, when a girl reaches her period, she is placed in a particular house, where she is taken care of by the grandmother or old women. Her face is colored with orange coloring, and the whole community knows that she has got out of age. In Saipan, people stopped the practice of a special house and coloring the face during the Second World War. Many of Carolinians still practice all of the ways to show respect even today.\nLast, there is respect shown between older men and younger men. For instance, the younger men must not give their opinion in a meeting unless they are invited to do so by the older men. Younger men should respect the older men and keep quiet before them unless this permission to speak is granted. Usually there is a leader, who must be respected and his decision followed. Also, a husband must respect his wife's brothers and male relatives. When they need something, if the husband should have sex with his wife, he should in return help her brothers. He should make his plans fit into their plans. For instance, if they need to use his car then it is expected that he should let them use it. He should bring local food to the family party.\n\n\n== Grammar ==\n\n\n=== Phonology ===\nConsonant Phonemes TableThe table shows that alveolar ridge receives tongue-blade contact while the tongue tip makes contact at some place on the teeth.\nVowel Phonemes TableAll of the consonants may appear initially, medially, and finally. In the final position, all the obstruents are obligatorily released. All consonants except / Ç / are unaspirated, and all stops and  / x / are lenis. The consonants  / bw / and / mw / have coarticulated labial closure and rounding with a raising of the back of the tongue toward the velum. the / bw / is usually spirantized to / βw/ medially. The / r / is a trill, which is voiceless word-finally. Moreover, all of the following single consonants may also be geminate initially, medially and in their abstract representation, finally: / p, t, bw, f, s, m, mw, ŋ, l /. Geminate / bw / is devoiced. in addition, Carolinian has geminate but not single / kk /. There are the five consonants / ş, x, r, w, y /, which may be geminated medially in productive reduplication. Geminate obstruents are tense and often give the impression of aspiration.\nIn addition to its native vocabulary, Carolinian has borrowed considerable vocabulary from Chamorro, English, and Japanese. This has led to the borrowing of some phonemes from these languages as well. Although these phonemes appear only in borrowed words, many of these words undergo regular Carolinian phonological rules, and the international segments are assigned in the same way as native speakers. For example, the Japanese word / dzori / means slipper is borrowed into Carolinian and may be reduplicated. So / dzodzdzoori / means to be wearing slippers.\n\n\n=== Syllable structure ===\nThe classic form of Carolinian syllables is either CV, CVC, CVVC, or CCVC.\n\n\n=== Morphology ===\n\n\n=== Simple sentence structure ===\nCarolinian simple sentences contain two major constituents, which are the Subject Noun Phrase and the Predicate Phrase. The word order of Carolinian language is Subject-Verb-Object. The following are some example simple sentences.\n\n\n== Vocabulary ==\nSome researchers indicate that Carolinian language with the western half of the continuum. In either case, the next sister of Carolinian is invariably described as Satawalese. Carolinian gets a little more in common with Woleaian- Mortlockese than it does either Polowat-Pulusuk or Satawalese, but with Polowat-Pulusuk showing slightly more influence than Satawalese. The lexical stock is one domain in Chuukic languages that can contribute substantially to the quest to find how Carolinian is put in order to its source languages since there is a significant amount of diversity among the languages’ lexicons. That is quite true even though each Chuukic language has close to a very high 50% lexical similarity with all the other members of the Continuum. Nonetheless, that still leaves the remaining 50% in which to find differences among languages, and this will prove to be enough to refine in on Carolinian lines of lexical inheritance.\n\n\n=== Past orthographies ===\n1. Most Saipan Carolinians are bilingual or trilingual. Their writing has reflected many foreign language orthographic systems. Despite the perfection of Carolinian writing, the following generalizations can be made. First, the vulgarized consonants / bw, mw, pw / were often written as digraphs when the following vowels are unrounded. However, / w / or / u / was virtually never indicated before rounded vowels or word finally. This phenomenon can be traced to Chamorro writing, there is a rounded velar glide that occurs only after consonants and only before unrounded vowels. The Carolinians seem to have interpreted their vulgarized consonants as plain consonants followed by glides, like the Chamorro phones. For instance, libual means hole of for / libwal /, but lib means hole for / liibw / the form imual for / imwal / means his house, but imom / imwɔmw / means your house, puel for / pwpwel / means dirt, but po for / pwo / means pound.\n2. The geminate consonants were not represented as it initially and finally, though some people wrote geminate consonants medially. This is almost surely a result of Chamorro influence. The only geminates in Chamorro are medial and as a consequence only these geminates are reflected in writing. For example, pi / ppii / means sand, lepi, leppi for / leppi /  means beach, sand, mile, mille for / mille / means this one. lol for / llɔl / means in it.\n3. Carolinian are used to the 5 vowel symbols of the Roman alphabet. These were used to identify the 9 distinctive vowels of the Carolinian language.\n4. Long vowels were not represented maybe due to Chamorro impact, as there are no distinctive long vowels in that language. For example, fi / fii / means star, set / sææt / means sea, il for / iil / means mother.\n5. In writing morphophonemic regularities such as the predictable vowel qualities before possessive suffixes, the Carolinian paid no attention to the underlying regulations. On the order hand, they focus totally on the surface phones. This is the same as Chamorro practice as well as to most of other Micronesian orthographies.\n6. Directional suffixes were usually attached to the preceding verbs. For instance, muatiu / mɔɔttiu / means sit down, mela / mæællɔ / means die, touo / towou / means get out.\n7. The subject pronoun was almost invariably attached to whichever part of the verb phrase immediately was following. For example, the negative marker, the aspect marker, an aspectual adverb, or the verb itself. ese / e se / means he not, ebue / e bwe / means he will, eke, eghal / e kke, e ghal / means he progressive, and emuel / e mwmwel / means he can.\n8. When the determines were singular, they were usually connected to the preceding noun. For example, mualue /mwææl-we/ means that man, mualie /mwææl-ie/ means this man. Plural determiners, which were generally written separated. For example, mual kal /mwææl + kkaal/ means these men, mual kelal /mwææl kke + laal/ means those men, mual keue /mwææl kke + we/ means those men in the past.\n9. The longer object pronouns were sometimes separated from the preceding verb stem, while the shorter pronouns are identical attached. For example, e weriei means he sees me, versus e uri ghisch means he sees us.\n10. Sometimes morphemes were not written if they were phonologically assimilated to other morphemes. For example, ito for / i + itto / means I come.\n\n\n=== Saipan Carolinian Orthography Committee ===\nA preliminary meeting was called at the Headquarters Education Department conference room on July 21, 1976. The site was decided on in part since it was about equidistant from both the northern and southern Carolinian communities. The meeting was to review the initial steps for setting up an orthography acceptable to both communities and to select the members of the orthography committee. The official orthography conference was held from July 26 to August 4, 1976. The meeting opened with an address by the Director of Education for the Marianas. Mr. Jesus M. Conception, representatives from the Marianas Education Department and the Chamorro Orthography Committee also attacked the convention on an irregular basis. This is the first decided that no dialect would be chosen as the official dialect for school and government documents, In other words, the committee agreed to pick a standard system of presenting the pronunciations of all three dialects, and Carolinians should use that system to reflect the specific dialect pronunciations. So school teachers would not enforce the unique forms of one dialect but instead, allow students to use the spelling correctly for the dialect they speak.\n\n\n=== Alphabet ===\nThere were 28 letters in 1977 and they were expanded to 33 letters in 2004.\n\n\n== Writing system ==\nThe Carolinians use a wide range of experiences in selecting the alphabetic system they use. For example, many of the older Carolinians are at least familiar with German from the German occupation. Depending on these, people would often use umlaut diacritics for the writing some vowels. A German influence could also be detected in the writing of the coronal spirant /s/ as <sch>. However, other speakers use their knowledge of Chamorro orthography to write Carolinian. As Chamorro has three fewer phonemic vowels than Carolinian and does not include Carolinians distinctive vowel length, initial consonant gemination, or velarized labials, individual systems based on Chamorro contained many double meanings. However, other Carolinians based their spelling in English, no individual writer could make use of the system.\n\n\n== References =="