"Roberto Eduardo Viola (13 October 1924 – 30 September 1994) was an Argentine military officer who briefly served as president of Argentina  from 29 March to 11 December 1981 as a military dictatorship.\n\n\n== Early life ==\nHe was born as Roberto Eduardo Viola Prevedini on 13 October 1924. His parents were Italian immigrants Angelo Viola and Rosa Maria Prevedini, both from Casatisma, a town in the Province of Pavia.\n\n\n== President of Argentina ==\nAfter Videla's departure, Viola formally assumed the post of President of Argentina.\n\n\n=== Economic policy ===\nViola appointed Lorenzo Sigaut as finance minister, and it became clear that Sigaut were looking for ways to reverse some of the economic policies of Videla's minister José Alfredo Martínez de Hoz. Notably, Sigaut abandoned the sliding exchange rate mechanism and devalued the peso, after boasting that \"they who gamble on the dollar, will lose\". Argentines braced for a recession after the excesses of the sweet money years, which destabilized Viola's position.Viola was also the victim of infighting within the armed forces. After being replaced as Navy chief, Eduardo Massera started looking for a political space to call his own, even enlisting the enforced and unpaid services of political prisoners held in concentration camps by the regime. The mainstream of the Junta's support was strongly opposed to Massera's designs and to any attempt to bring about more \"populist\" economic policies.\n\n\n=== Foreign policy ===\n\nU.S Argentina relations improved dramatically with Ronald Reagan, which asserted that the previous Carter Administration had weakened US diplomatic relationships with Cold War allies in Argentina, and reversed the previous administration's official condemnation of the junta's human rights practices.The re-establishment of diplomatic ties allowed for CIA collaboration with the Argentine intelligence service in arming and training the Nicaraguan Contras against the Sandinista government. The 601 Intelligence Battalion, for example, trained Contras at Lepaterique base, in Honduras. Argentina also provided security advisors, intelligence training and some material support to forces in Guatemala, El Salvador and Honduras to suppress local rebel groups as part of a U.S.-sponsored program called Operation Charly.\n\n\n=== Ousted in a coup ===\nViola found his maneuvering space greatly reduced, and was ousted by a military coup in December 1981, led by the Commander-in-Chief of the Army, Lieutenant General Leopoldo Galtieri, who soon became President. The official explanation given for the ousting was Viola's alleged health problems. Galtieri swiftly appointed Roberto Alemann as finance minister and presided over the build-up and pursuit of the Falklands War.\n\n\n== Later years ==\nAfter the collapse of the military regime and the election of Raúl Alfonsín in 1983, Viola was arrested, judged for human rights violations committed by the military junta during the Dirty War, and sentenced to 17 years in prison. His health deteriorated in prison; Viola was pardoned by Carlos Menem in 1990 together with all junta members. He died on 30 September 1994, two weeks before his 70th birthday.\n\n\n== See also ==\nNational Reorganization Process\n\n\n== References =="