"Objective idealism is an idealistic metaphysics that postulates that there is ultimately only one perceiver, and that this perceiver is also that which is perceived. In this school of thought, the many individual beings and their local perceptions are united through a collective unconscious. \nOne important advocate of such a metaphysics, Josiah Royce (the founder of American idealism), wrote that he was indifferent \"whether anybody calls all this Theism or Pantheism\". \nIt is distinct from the subjective idealism of George Berkeley, and it abandons the thing-in-itself of Kant's dualism.\n\n\n== Overview ==\nIdealism, in terms of metaphysics, is the philosophical view that the mind or spirit constitutes the fundamental reality. It has taken several distinct but related forms. Among them are objective and subjective idealism. Objective idealism accepts Naïve realism (the view that empirical objects exist objectively) but rejects naturalism (according to which the mind and spiritual values have emerged due to material causes), whereas subjective idealism denies that material objects exist independently of human perception and thus stands opposed to both realism and naturalism.\nSchelling, Hegel and Schopenhauer had forms of objective idealism. \nThe philosopher Charles Sanders Peirce stated his own version of objective idealism in the following manner:\n\nThe one intelligible theory of the universe is that of objective idealism, that matter is effete mind, inveterate habits becoming physical laws (Peirce, CP 6.25).\n\nA. C. Ewing is an analytic philosopher influenced by the objective idealist tradition. His approach has been termed analytic idealism.\n\n\n== Notable proponents ==\n\n\n== See also ==\n\n\n== Notes ==\n\n\n== References ==\nPaul Guyer, \"Absolute idealism and the rejection of Kantian dualism\", Ch. 2 of The Cambridge Companion to German Idealism, ed. by Karl Ameriks.\nPeirce, C. S. (1891), \"The Architecture of Theories\", The Monist vol. 1, no. 2 (January 1891), pp. 161–176. Internet Archive The Monist vol. 1, page 161. Reprinted in Collected Papers of Charles Sanders Peirce, vol. 6 (1935), paragraphs 7–34, and in The Essential Peirce, vol. 1 (1992), pp. 285–297).\nPeirce, C. S., Collected Papers of Charles Sanders Peirce, vols. 1–6, Charles Hartshorne and Paul Weiss (eds.), vols. 7–8, Arthur W. Burks (ed.), Harvard University Press, Cambridge, MA, 1931–1935, 1958. (Cited as CP vol.para.)"