"A financial endowment is a legal structure for managing, and in many cases indefinitely perpetuating, a pool of financial, real estate, or other investments for a specific purpose according to the will of its founders and donors. Endowments are often structured so that the principal value is kept intact, while the investment income or a small part of the principal is available for use each year.\n\nEndowments are often governed and managed either as a nonprofit corporation, a charitable foundation, or a private foundation that, while serving a good cause, might not qualify as a public charity. In some jurisdictions, it is common for endowed funds to be established as a trust independent of the organizations and the causes the endowment is meant to serve. Institutions that commonly manage endowments include academic institutions (e.g., colleges, universities, and private schools); cultural institutions (e.g., museums, libraries, and theaters); service organizations (e.g., hospitals, retirement homes; the Red Cross); and religious organizations (e.g., churches, synagogues, mosques).\nPrivate endowments are some of the wealthiest entities in the world, notably private higher education endowments. Harvard University's endowment (valued at US$40.9 billion as of 2019) is the largest academic endowment in the world. The Bill and Melinda Gates Foundation is one of the wealthiest private foundations as of 2019 with endowment of $46.8 billion as of December 31, 2018.\n\n\n== Types ==\nMost private endowments in the United States are governed by the Uniform Prudent Management of Institutional Funds Act which is based in part on the concept of donor intent that helps define what restrictions are imposed on the principal and earnings of the fund. Endowments in the United States are commonly categorized in one of four ways:\nUnrestricted endowment can be used in any way the recipient chooses to carry out its mission.\nTerm endowment funds stipulate that all or part of the principal may be expended only after the expiration of a stated period of time or occurrence of a specified event, depending on donor wishes.\nQuasi endowment funds are designated endowments by an organization's governing body rather than by the donor. Therefore both the principal and the income may be accessed at the organization's discretion. Quasi endowment funds are still subject to any other donor restrictions or intent.\nRestricted endowments ensure that the original principal is held in perpetuity and that the earnings from this original principal are allocated according to the donor's requirements.\n\n\n== Restrictions and donor intent ==\nEndowment revenue can be restricted by donors to serve many purposes. Endowed professorships or scholarships restricted to a particular subject are common; in some places a donor could fund a trust exclusively for the support of a pet. Ignoring the restriction is called \"invading\" the endowment. But change of circumstance or financial duress like bankruptcy can preclude carrying out the donor's intent.  A court can alter the use of restricted endowment under a doctrine called cy-près meaning to find an alternative \"as near as possible\" to the donor's intent.\n\n\n== History ==\n\nThe earliest endowed chairs were established by the Roman emperor and Stoic philosopher Marcus Aurelius in Athens in AD 176. Aurelius created one endowed chair for each of the major schools of philosophy: Platonism, Aristotelianism, Stoicism, and Epicureanism. Later, similar endowments were set up in some other major cities of the Empire.The earliest universities were founded in Asia and Africa. Their endowment by a prince or monarch and their role in training government officials made early Mediterranean universities similar to Islamic madrasas, although madrasas were generally smaller, and individual teachers, rather than the madrasa itself, granted the license or degree.Waqf (Arabic: وَقْف‎; [ˈwɑqf]), also known as 'hubous' (حُبوس) or mortmain property, is a similar concept from  Islamic law, which typically involves donating a building, plot of land or other assets for Muslim religious or charitable purposes with no intention of reclaiming the assets. The donated assets may be held by a charitable trust.\n\nIbn Umar reported, Umar Ibn Al-Khattab got land in Khaybar, so he came to the prophet Muhammad and asked him to advise him about it. The Prophet said, 'If you like, make the property inalienable and give the profit from it to charity.'\" It goes on to say that Umar gave it away as alms, that the land itself would not be sold, inherited or donated. He gave it away for the poor, the relatives, the slaves, the jihad, the travelers and the guests. And it will not be held against him who administers it if he consumes some of its yield in an appropriate manner or feeds a friend who does not enrich himself by means of it.\nWhen a man dies, only three deeds will survive him: continuing alms, profitable knowledge and a child praying for him.\nThe two oldest known waqfiya (deed) documents are from the 9th century, while a third one dates from the early 10th century, all three within the Abbasid Period. The oldest dated waqfiya goes back to 876 CE, concerns a multi-volume Qur'an edition and is held by the Turkish and Islamic Arts Museum in Istanbul. A possibly older waqfiya is a papyrus held by the Louvre Museum in Paris, with no written date but considered to be from the mid-9th century.\nThe earliest known waqf in Egypt, founded by financial official Abū Bakr Muḥammad bin Ali al-Madhara'i in 919 (during the Abbasid period), is a pond called Birkat Ḥabash together with its surrounding orchards, whose revenue was to be used to operate a hydraulic complex and feed the poor. In India, wakfs are relatively common among Muslim communities and are regulated by the Central Wakf Council and governed by Wakf Act 1995 (which superseded Wakf Act 1954).\n\n\n== Modern college and university endowments ==\n\nAcademic institutions, such as colleges and universities, will frequently control an endowment fund that finances a portion of the operating or capital requirements of the institution. In addition to a general endowment fund, each university may also control a number of restricted endowments that are intended to fund specific areas within the institution. The most common examples are endowed professorships (also known as named chairs), and endowed scholarships or fellowships.\nThe practice of endowing professorships began in the modern European university system in England in 1502, when Lady Margaret Beaufort, Countess of Richmond and grandmother to the future king Henry VIII, created the first endowed chairs in divinity at the universities of Oxford (Lady Margaret Professor of Divinity) and Cambridge (Lady Margaret's Professor of Divinity). Nearly 50 years later, Henry VIII established the Regius Professorships at both universities, this time in five subjects: divinity, civil law, Hebrew, Greek, and physic—the last of those corresponding to what are now known as medicine and basic sciences. Today, the University of Glasgow has fifteen Regius Professorships.\nPrivate individuals also adopted the practice of endowing professorships. Isaac Newton held the Lucasian Chair of Mathematics at Cambridge beginning in 1669, more recently held by the celebrated physicist Stephen Hawking.In the United States, the endowment is often integral to the financial health of educational institutions. Alumni or friends of institutions sometimes contribute capital to the endowment. The use of endowment funding is strong in the United States and Canada but less commonly found outside of North America, with the exceptions of Cambridge and Oxford universities. Endowment funds have also been created to support secondary and elementary school districts in several states in the United States.\n\n\n=== Endowed professorships ===\nAn endowed professorship (or endowed chair) is a position permanently paid for with the revenue from an endowment fund specifically set up for that purpose. Typically, the position is designated to be in a certain department. The donor might be allowed to name the position. Endowed professorships aid the university by providing a faculty member who does not have to be paid entirely out of the operating budget, allowing the university to either reduce its student-to-faculty ratio, a statistic used for college rankings and other institutional evaluations, or direct money that would otherwise have been spent on salaries toward other university needs. In addition, holding such a professorship is considered to be an honour in the academic world, and the university can use them to reward its best faculty or to recruit top professors from other institutions.\n\n\n=== Endowed scholarships and fellowships ===\nAn endowed scholarship is tuition (and possibly other costs) assistance that is permanently paid for with the revenue of an endowment fund specifically set up for that purpose. It can be either merit-based or need-based (the latter is only awarded to those students for whom the college expense would cause their family financial hardship) depending on university policy or donor preferences. Some universities will facilitate donors' meeting the students they are helping. The amount that must be donated to start an endowed scholarship can vary greatly.\nFellowships are similar, although they are most commonly associated with graduate students. In addition to helping with tuition, they may also include a stipend. Fellowships with a stipend may encourage students to work on a doctorate. Frequently, teaching or working on research is a mandatory part of a fellowship.\n\n\n== Charitable foundations ==\n\nA foundation (also a charitable foundation) is a category of nonprofit organization or charitable trust that will typically provide funding and support for other charitable organizations through grants, but may engage directly in charitable activities. Foundations include public charitable foundations, such as community foundations, and private foundations which are typically endowed by an individual or family. The term foundation though may also be used by organizations not involved in public grant-making.\n\n\n== Fiduciary management ==\n\nA financial endowment is typically overseen by a board of trustees and managed by a trustee or team of professional managers. Typically, the financial operation of the endowment is designed to achieve the stated objectives of the endowment.\nIn the United States, typically 4–6% of the endowment's assets are spent every year to fund operations or capital spending.  Any excess earnings are typically reinvested to augment the endowment and to compensate for inflation and recessions in future years.  This spending figure represents the proportion that historically could be spent without diminishing the principal amount of the endowment fund.\n\n\n== Criticism and reforms ==\n\nAs expressed by Rodney Foxworth in Nonprofit Quarterly, there is an inherent structural tension for many endowments between the stated mission of the fund, the history and sources of the endowed capital, and the governance of the endowment. In Foxworth's words, \"philanthropy is used to address problems created by an economic system that engenders radical wealth inequality, thus making philanthropy necessary in the first place.\" In other words, endowments are using the same economic tools and power structures that cause social problems in an attempt to solve those very problems.\n\n\n=== Ethics and endowment repatriation ===\nCritics like Justice Funders’ Dana Kawaoka-Chen call for \"redistributing all aspects of well-being, democratizing power, and shifting economic control to communities.\". Endowment repatriation refers to campaigns that acknowledge the history of human and natural resource exploitation that is inherent to many large private funds. Repatriation campaigns ask for private endowments to be returned to the control of the people and communities that have been most affected by labor and environmental exploitation and often offer ethical frameworks for discussing endowment governance and repatriation.\nMany might say that, by definition, philanthropy is about redistributing resources. Yet to truly embody this principle, philanthropy must move far beyond the 5% payout requirements for grants and distribute ALL of its power and resources. This includes spending down one’s endowment, investing in local and regional economic initiatives that build community wealth rather than investing in Wall Street, giving up decision-making power for grants, and, ultimately, turning over assets to community control.\nAfter the Heron Foundation's internal audit of its investments in 2011 uncovered an investment in a private prison that was directly contrary to the foundation's mission, they developed and then began to advocate for a four-part ethical framework to endowment investments conceptualized as Human Capital, \nNatural Capital, Civic Capital, and Financial Capital.Another example is the Ford Foundation's co-founding of the independent Native Arts and Culture Foundation in 2007. The Ford Foundation provided a portion of the initial endowment after self-initiated research into the foundation's financial support of Native and Indigenous artists and communities.  This results of this research indicated \"the inadequacy of philanthropic support for Native arts and artists\", related feedback from an unnamed Native leader that \"[o]nce [big foundations] put the stuff in place for an Indian program, then it is not usually funded very well. It lasts as long as the program officer who\nhad an interest and then goes away\" and recommended that an independent endowment be established and that \"[n]ative leadership is crucial\".\n\n\n=== Divestment campaigns and impact investing ===\n\nAnother approach to reforming endowments is the use of divestment campaigns to encourage endowments to not hold unethical investments. One of the earliest modern divestment campaigns was Disinvestment from South Africa which was used to protest apartheid policies. By the end of apartheid, more than 150 universities divested of South African investments, although it is not clear to what extent this campaign was responsible for ending the policy.A proactive version of divestment campaigns is impact investing, or mission investing which refers to investments \"made into companies, organizations, and funds with the intention to generate a measurable, beneficial social or environmental impact alongside a financial return.\" Impact investments provide capital to address social and environmental issues.\n\n\n=== Donor intent ===\n\nThe case of Leona Helmsley is often used to illustrate the downsides of the legal concept of donor intent as applied to endowments. In the 2000s, Helmsley bequested a multi-billion dollar trust to \"the care and welfare of dogs\". This trust was estimated at the time to total 10 times more than the combined 2005 assets of all registered animal-related charities in the United States.\nIn 1914, Frederick Goff sought to eliminate the \"dead hand\" of organized philanthropy and so created the Cleveland Foundation: the first community foundation. He created a corporately structured foundation that could utilize community gifts in a responsive and need-appropriate manner. Scrutiny and control resided in the \"live hand\" of the public as opposed to the \"dead hand\" of the founders of private foundations.\n\n\n=== Higher education ===\nResearch published in the American Economic Review indicates that major academic endowments often act in times of economic downturn in a way opposite of the intention of the endowment. This behavior is referred to as endowment hoarding, reflecting the way that economic downturns often lead to endowments decreasing their payouts rather than increasing them to compensate for the downturn.Large U.S.-based college and university endowments, which had posted large, highly publicized gains in the 1990s and 2000s, faced significant losses of principal in the 2008 economic downturn. The Harvard University endowment, which held $37 billion in June 2008, was reduced to $26 billion by mid-2009.  Yale University, the pioneer of an approach that involved investing heavily in alternative investments such as real estate and private equity, reported an endowment of $16 billion as of September 2009, a 30% annualized loss that was more than predicted in December 2008.  At Stanford University, the endowment was reduced from $17 billion to $12 billion as of September 2009. Brown University's endowment fell 27 percent to $2.04 billion in the fiscal year that ended June 30, 2009.  George Washington University lost 18% in that same fiscal year, down to $1.08 billion.In Canada, after the financial crisis in 2008, University of Toronto reported a loss of 31% ($545 million) of its previous year-end value in 2009. The loss is attributed to over-investment in hedge funds.\n\n\n=== Endowment taxes ===\n\nGenerally, endowment taxes are the taxation of financial endowments that otherwise not taxed due to their charitable, educational, or religious mission. Endowment taxes are typically enacted in response to criticisms that endowments are not operating as nonprofit organizations or that they have served as tax shelters, or that they are depriving local governments of essential property and other taxes.\n\n\n== See also ==\nFoundation (nonprofit)\nLists of institutions of higher education by endowment size\nin Canada\nin South Africa\nin the UK\nin the United States\nList of wealthiest charitable foundations\nEndowment tax\nWaqf\n\n\n== References ==\n\n\n== Further reading ==\nNewfield, Christopher (2008). Unmaking the public university: the forty-year assault on the middle class. Harvard University Press. p. 162. ISBN 978-0-674-02817-3.\n\n\n== External links ==\nFord Foundation: A Primer for Endowment Grantmakers\nDada, Kamil (February 1, 2008). \"Congress investigates endowment\". Stanford Daily. Archived from the original on June 9, 2011.\n12 SMA for Financial Endowments"