"Anamorphic widescreen (also called Full height anamorphic or FHA) is a process by which a comparatively wide widescreen image is horizontally compressed to fit into a storage medium (photographic film or MPEG-2 Standard Definition frame, for example) with a narrower aspect ratio, reducing the horizontal resolution of the image while keeping its full original vertical resolution. Compatible play-back equipment (a projector with modified lens, or a digital video player or set-top box) can then expand the horizontal dimension to show the original widescreen image. This is typically used to allow one to store widescreen images on a medium that was originally intended for a narrower ratio, while using as much of the frame – and therefore recording as much detail – as possible.The technique comes from cinema, when a film would be framed and recorded as widescreen but the picture would be \"squashed together\" using a special concave lens to fit into non-widescreen 1.37:1 aspect ratio film. This film can then be printed and manipulated like any other 1.37:1 film stock, although the images on it will appear to be squashed horizontally (or elongated vertically). An anamorphic lens on the projector in the cinema (a convex lens) corrects the picture by performing the opposite distortion, returning it to its original width and its widescreen aspect ratio.\nThe optical scaling of the lens to a film medium is considered more desirable than the digital counterpart, due to the amount of non-proportional pixel-decimated scaling that is applied to the width of an image to achieve (something of a misnomer) a so-called \"rectangular\" pixel widescreen image. The legacy ITU-R Rec. 601 4:3 image size is used for its compatibility with the original video bandwidth that was available for professional video devices that used fixed clock rates of a SMPTE 259M serial digital interface. One would produce a higher-quality upscaled 16:9 widescreen image by using either a 1:1 SD progressive frame size of 640×360 or for ITU-R Rec. 601 and SMPTE 259M compatibility a letterboxed frame size of 480i or 576i. Similar operations are performed electronically to allow widescreen material to be stored on formats or broadcast on systems that assume a non-widescreen aspect ratio, such as DVD or standard definition digital television broadcasting."