"{| align=\"right\" border=\"0\" cellpadding=\"1\" cellspacing=\"0\"\n|-valign=\"top\"\n|-\n\n|\n|}\n\nDownhill mountain biking (DH) is a genre of mountain biking practiced on steep, rough terrain that often features jumps, drops, rock gardens and other obstacles.\nDownhill bikes are heavier and stronger than other mountain bikes and feature front and rear suspension with over 8 inches (20 cm) of travel, to glide quickly over rocks and tree roots. In competitive races, a continuous course is defined on each side by a strip of tape. Depending on the format, riders have a single or double attempt to reach the finish line as fast as possible, while remaining between the two tapes designating the course. Riders must choose their line by compromising between the shortest possible line and the line that can be traveled at the highest speed.  If a rider leaves the course by crossing or breaking the tape they must return to the course at the point of exit, unless they do not gain a time advantage from crossing the tape, in which case they can continue with their run.Riders start at intervals, often seeded from slowest to fastest, and courses typically take two to five minutes to complete with winning margins being often less than a second.  Riders are timed with equipment similar to that used in downhill skiing.\n\n\n== History of competitive racing ==\nThe 1st downhill time-trial race took place in Fairfax, California on October 21, 1976 on a fireroad now referred to as Repack Road, due to the need to repack the hub brake after each descent. The bikes used were based on cruiser bicycles that had a drum or coaster brake that worked by pedalling backwards. The mechanism operated with a conical brake shoe being wound on a thread in a metal hub. To prevent the brake from seizing it was kept filled with grease. Heavy use during the descent would cause the brake to over heat, softening the grease and causing it to drain from the hub, requiring frequent repacking. Ten riders descended 1,300 feet (400 m) of Repack road in about 5 minutes.The first bikes used for descending were known as \"klunkers\" or \"paperboy bikes\" - sturdy cruisers using balloon tires and coaster brakes, designed by Ignatz Schwinn during the Great Depression. The bikes could endure abuse that would damage other bicycles by changing features from the Henderson and Excelsior motorcycles his company had built during the 1920s, including a heavy \"cantilevered\" frame with two top tubes and 2.125-inch-wide (54.0 mm) \"balloon\" tires from Germany. Innovations like the fat-tire Schwinn with derailleur gears by Russ Mahon of  The Morrow Dirt Club in Cupertino at the 1974 Marin County cyclo-cross and Gary Fisher's 1975 use of a tandem rear hub (from a flea market) with a drum brake threaded for a freewheel cluster developed the sport, and by 1979, two organizers and competitors of the Repack downhill, Charlie Kelly and Gary Fisher founded the company which named the sport, MountainBikes. As mountain biking grew during the 80s, downhill riders continued to use either rigid or limited-travel (under 2 inches (5 cm)) suspension bicycles. Purpose-made downhill bikes started to appear in the 90s, with innovations such as dual crown forks and disc brakes, as well as more elaborate suspension designs.\nLater, riders from other disciplines began focusing on downhill, such as BMX racers Daniel Solano (Team Tomac Bikes), and Brian Lopes. Their influence is seen in the increased difficulty of many courses, with bigger jumps and drops added. The coming of age for downhill biking was its inclusion at the first UCI Mountain Bike Championship, held in 1990 in Durango, Colorado.\n\n\n== Notable downhill racing venues ==\n\nMany ski areas are converted into downhill mountain biking venues in the summer, such as Whistler Mountain Bike Park and Fernie Alpine Resort, alongside the specifically developed all-season downhill trails. At some courses, bikers ride gondolas, trams or chair lifts to the starting point, or \"shuttling\" with motorized vehicles is used to transport riders to the top of the hill. Others are accessible by riding (or pushing) bicycles to the starting point. Urban downhill courses have also appeared in mountain-side cities, with the courses going through city streets and sidewalks, such as the Taxco Downhill event in Mexico.Courses used in competition often feature several \"lines\" through or around difficult obstacles. For example, the \"A line\" might be a direct line over a large jump with a sketchy landing, the \"B line\" a smaller jump with a better landing, and the \"C line\" completely avoids the jumps, but may take longer.\n\n\n=== Australia ===\n\nAustralia has produced a large number of internationally successful downhill racers,  including Sam Hill, Chris Kovarik, Nathan Rennie and Mick Hannah. The large majority of Australian downhill riding and racing is accessed by shuttling in cars, buses or by walking to the top of the track (push runs), however the venues at Mount Buller and Thredbo provide lift accessed tracks during the snow less summer months.\nMount Stromlo, near Canberra, hosted a World Cup Round in August 2008 and the 2009 World Championships. The top can be accessed by either riding up singletrack, or by shuttling via the road. Australia's first UCI Mountain Bike World Cup was held in Cairns in 1994-1995. followed by the World Mountain Bike Championships in 1996 and again in 2017, placing Cairns on the map as the premier Australian mountain bike destination.\n\n\n=== Austria ===\nLocated in the Alps, Austria is very suitable for downhill riding. A large majority of Austria's downhill tracks are accessible via lift shuttles. A World Cup track called the \"Planai\" is located in the city of Schladming. It is about 5 km long with an average descent grade of about 35%.\n\n\n=== Bolivia ===\nMost of Bolivia’s downhill riding is done in the Andes Mountains in and around La Paz. In the city there is the Pura Pura trail, there are also a few trails through the forest. Camiraya at the outskirts of La Paz has more and longer trails. The Loma Loma and Chu Chu trails are a little further out in Sorata. There are also trails in other parts of the country, for example in Cochabamba and Potosí.\n\n\n=== Bosnia and Herzegovina ===\nBosnia and Herzegovina is rich with mountains especially around the capital city of Sarajevo, in which a downtown race is held, although mountain bike and downhill especially are still developing to become known sports. Mountains like Igman, Bjelašnica and others are being increasingly used for downhill racing. Currently there are a few tracks on Trebević, Igman, Bjelašnica,  Cavljak - Barice, all featured tournaments on an international level. Unexploded ordnance is one of the reasons for slow development of this sport in a country with a such great potential for it.\n\n\n=== Canada ===\nCanada is famous for its downhill racing as well as other sorts of mountain biking. The Whistler Mountain Bike Park in Whistler, British Columbia hosts the annual Crankworx and Joyride Huckfest racing events. The province of British Columbia is also home to several other large lift-serviced mountain bike parks, including Sun Peaks in Kamloops, BC, Silver Star Mountain Resort in Vernon, BC, Kicking Horse Mountain Resort in Golden, BC and Fernie Alpine Resort. The North Shore Mountains of North Vancouver, BC, are a famous downhill biking destination in their own right. The popular style of technical downhill freeriding that involves many man-made trail elements originated here. The style is often referred to as \"North Shore Style.\"\nCanada has produced many world-class mountain bike racers, including downhillers Andrew Shandro and Steve Smith. The mount of Bromont, situated in Bromont, Quebec, and Mont-Sainte-Anne near Quebec City are great places for downhill biking.\n\n\n=== Croatia ===\n\nDownhill MTB races have been held in Croatia since 1993, when the first competition was organized outside Zagreb, on the same mountain that today hosts the world cup races in alpine skiing. Until the past 4–5 years, Mountain biking was banished from popular hiking trails and ski slopes around the capital. However, with the rise in popularity of DH and enduro, (gravity) riding, Trail management regulations have been relaxed and along with allowing riders, have begun to allow for development of MTB specific trails, cooperating with the local riding community to communicate which trails are acceptable and which are not. Additionally, the area known as 'Grma' has seen the growth and development of DH specific trails. MTB DH riding has also flourished in other parts of Croatia, especially in the northern Adriatic coastal region and in the northern (continental) part of country. In 2010 the national DH Cup events were held in Buzet (Istria), Samobor (Zagreb area), Pakrac (Slavonia) and Gracisce (Pazin, Istria). Additionally, multiple enduro races around the country are now part of an annual 'Cro-enduro' series and the fall of 2017 saw organization of the first ever Croatian Enduro National Championships. Urban downhill events are also held in the coastal city of Rijeka. 2018 saw the first UCI Mountain Bike World Cup held in Croatia, on the island of Lošinj.\n\n\n=== France ===\n\nThe French Alps are home to many downhill routes and events. The most famous of which is the Mega Avalanche downhill race event in the Alp d'Huez and Bourg d'Oisans region. Another downhill course in the region is Les Deux Alpes which sometimes hosts other downhill events. The downhill courses and events are limited in the area however, because of the alpine winter and snow.\nThe most popular area for downhill in the French alps is the Portes du Soleil including the two more popular resorts of Morzine and Les Gets. Most recently, a world cup was held for the first time in La Bresse. In August 2011, La Bresse hosted the sixth round of the UCI World Cup. Since 2015, Lourdes hosted a World Cup round each year.\n\n\n=== Georgia ===\nThe first downhill trails in Georgia were developed in 2015. Among the first built was in Gudauri, followed by trails in Bakuriani. Both of the places are also ski resorts. Trails are at 2000–2250 meters, with trail lengths of about 5000 meters.\n\n\n=== Germany ===\nIn Germany the landscape is quite diverse, reaching from flatlands in the north to medium-sized mountains in the center to alpine mountains in the south. Downhill tracks in Germany are not as steep as in Switzerland, Austria or Canada and the difference from top to bottom is less, but the main parts of an average track are everywhere in Germany. Racing on these short tracks is highly intense and allows no mistakes. Due to the country's large population the sport has developed quickly in Germany. Number of riders can go up to 600 at races. With 3 cup races, Thuringia, in the middle of Germany, is the center of gravity riding. The most popular race series is the 'iXS German Downhill Cup'. In Germany is the Europe's biggest Mountainbike Freeride Festival hold, called iXS Dirt Masters. It includes one iXS German Downhill Cup Round, a 4X Race and a slopestyle contest. It is visited by around 25000 spectators and 1200 riders. In the small town Willingen is a former World Cup Downhill and Four Cross Race Course. The World Cup has been held there in 2005 and 2006.\nWith Germany being a high level industry country, there are many firms producing downhill bikes, such as Last Bikes, Zonenschein, Fusion Bikes, Cube Bikes, Ghost Bikes, Canyon Bikes, Propain Bikes, Rose Bikes, Solid Bikes as well as boutique bike manufacturers Nicolai and Liteville. There are also a lot of firms producing high-end parts like Rohloff, Magura or Tune.\n\n\n=== India ===\n\nDownhill Mountain Biking in India is fairly new. The main and the most popular downhill mountain bike race in India is called Himalayan Downhill Mountain Bike Trophy which is organized by Himalayan Mountain Bike Network during Himalayan Mountain Bike Festival. This race is conducted at Ski Himalayas Ropeway and Ski Resort located in Solang Valley near Manali which the Mountain Biking Capital of India. The DH race track is 2 km long and the area offers lot of natural mountain biking trails and lends itself to many styles of mountain biking. The trails in this Himalayan region are accessible to riders of all skill levels.\n\n\n=== Ireland ===\nDownhill cycling has increased in Ireland over the past 10 years, for example, the National Points Series rounds regularly attract over 250 riders from all over the country. Irish tracks vary greatly in length and difficulty. Moneyscalp is one of the shorter tracks with times for Elites coming at just over a minute. Other tracks such as Carrick in Co.Wicklow are closer to 5 minutes. There are no official downhill tracks in the Republic of Ireland. Just across the border in Rostrevor, Northern Ireland however, Newry & Mourne District Council has recently built some tracks in Kilbroney Forest which includes a 27 km and 17 km single track and 2 purpose-built downhill trails.\nAccording to the law it is illegal to ride in the forests. All the tracks are built and maintained voluntarily by individuals and mountain biking clubs who take it upon themselves to do so. As downhill mountain biking has become more popular so has the call for more facilities and practitioners of this sport have begun campaigning with the state on this issue.\n\n\n=== Italy ===\nBardonecchia, one of the Torino 2006 winter olympic venues, converts some of its ski courses and lifts for use by mountain bikers in the summer, and a number of downhill courses are present. Other ski resorts turning to mountain bike parks in summer are Canazei, Pila, Sestola and Livigno. The area of Finale Ligure, near Genoa, offers year-round tracks that end on the seaside, served by shuttles. Among the most famous tracks in the country is the Sanremo Downhill, a rocky, technical and dangerous course won in 2007 by Fabien Barel. The 2008 World Championship were held in Val di Sole.\n\n\n=== Kazakhstan ===\nLocated in Tian Shan, city of Almaty, Shymbulak bike park was opened in 2013. There is also the Charyn canyons and mini RedBull Rampage trail. The cheap living costs, warm climate and fresh mountain air make Almaty a \"must visit\" place for riders on a budget.\n\n\n=== Latvia ===\nIn global context there are very little notable downhill venues in Latvia. Most of them are located at local ski resorts in Baldone, Sigulda and Cēsis, also there's trail network in the forests of Tukums near Melnezers. All the tracks are built and maintained voluntarily by individuals who take it upon themselves to do so. Each year Latvian Downhill association regularly schedule National downhill cup and championships. In the next several years it is expected to grow local community around downhill mountain biking by increasing the number of riders and improving local ski resort trail quality.\n\n\n=== Norway ===\nHafjell, a ski resort in the county of Oppland and host of the alpine skiing events (giant slalom and slalom) at the 1994 Winter Olympics, offers a wide variety of courses and tracks for cross country and downhill mountain bikers during summer. Hafjell hosted the 2010 European downhill championships and the 2010 Nordic downhill championships.\n\n\n=== Philippines ===\nPhilippines is known for its mountainous range and rocky hills. In Rizal, there are famous downhill tracks such as the Antenna Downhill Tracks in Binangonan and the Patiis Downhill Tracks in San Mateo. There are also other downhill tracks around the country that holds annual downhill races. Some notable Downhill athletes in Philippines are Parabanne Mendoza, Eleazar Barba Jr.,and Niño Martin Eday. The Downhill Riders Organization of the Philippines (DROP) organizes some of the downhill races around the country.\n\n\n=== Portugal ===\nPortugal is the host country of a unique variety of downhill races, the Urban Downhill, known as Downtown. Lisbon DownTown is a very popular annual event which brings world class Downhill athletes to Portugal, Steve Peat is the King of the race winning 8 of the 11 editions.\nThe Gouveia International Downhill is another important annual race that normally brings some of the WorldCup racers to the country.\nPlaces like Lousã, Tarouca and Sintra offer a big variety of single tracks and Downhill circuits.\n\n\n=== Russia ===\nSome of the notable Russian downhill venues are ski-complex \"Metallurg\" (Bannoe lake, Magnitogorsk), Mashuk and Chaget mountains. And in the city of Novosibirsk has a trail for such races. It is located in the CHP-5.\n\n\n=== Slovenia ===\n\nSlovenia's vast hilly landscape and undamaged nature makes very good conditions for downhill cycling, thus one of the world's top, not only tracks but riders are also in Slovenia. The famous tracks that are included in the world cup are at ski resort Kranjska Gora in north-west tip of Slovenia, while the other track is on ski resort hill Pohorje at Slovenia's second largest city Maribor.\n\n\n=== South Africa ===\nDownhill racing is not currently a very big sport in South Africa, but is rapidly growing. South Africa boasts some great tracks and riders, especially from the Western Cape and the Pietermaritzburg area in Kwa-Zulu Natal, the hometown of Greg Minnaar. In the Western Cape, the best tracks are Edeouth and Jonkershoek in Stellenbosch, Playgrounds in Paarl, Sir Lowry's Pass near Somerset-West (hometown of Andrew and Jonty Neethling), Zevenwacht near Kuilsriver and Witfontein in George. They provide quite technical, but fun courses. Ferncliff and World's View are great in Pietermaritzburg. Helderkruin (West of Johannesburg), Klapperkop in Pretoria and Gillooly's Farm in Johannesburg. South Africa held the first round of the 2009 UCI World Cup, which was in Pietermaritzburg (Greg Minnaar's hometown).\n\n\n=== Sweden ===\nWith the Caledonian mountains forming the borderland with Norway this country has places to downhill race. The majority of Sweden's notable downhill tracks are situated around Åre and Åre Bike, accessible via lift shuttles. In 1999 Åre was the host for the UCI Mountain Bike & Trials World Championships and it hosted the Nordic Championships in 2007. There are numerous graded biking trails down the Åreskutan fell.\nSweden's most southerly DH bike park is called Vallåsen Bike Park and is located on the north side of the Halland ridge between Skåne and Halland. Vallåsen opened in 2008 and attracts riders not only from Sweden but also Denmark due to its relatively close location to Copenhagen. Vallåsen holds an annual DH race at the end of the season called the Vallåsen DH Challenge.\nJarvsö Bike Park is another downhill park, which is located in the locality of Järvsö, in the municipality of Ljusdal approximately 3 hours north of Stockholm by car. The park consists of 17 tracks of varying difficulty, and a pumptrack.\n\n\n=== Switzerland ===\nLocated between the Alps and the Jura and surrounded by the downhill nations of France, Germany, Italy and Austria it is kind of a center for the European downhill scene. There are tracks in or near every city with high quality and a steep descent. It has several World Cup tracks like \"Champéry\" or \"Portes du Soleil\". Switzerland is the home of parts manufacturer DT Swiss,  EDCO Swiss bicycle components since 1902, frame manufacturer BMC and bike manufacturer Redalp.\n\n\n=== Thailand ===\nMountainous regions of Northern Thailand offer great venues for downhill mountain biking. Chiang Mai is the most famous location for downhill mountain biking in Thailand. The Chiang Mai Downhill Challenge, which were held in November 2012 and 2013 had attracted World Cup riders, such as Steve Peat, Josh Bryceland, Sam Dale, Brook Macdonald, Wyn Masters and Edward Masters, as well as a Belgian freerider, Nico Vink. Doi Suthep mountain is where most downhill actions take place in Chiang Mai. Tour operator, such as X-Biking Chiang Mai offers guided tour or shuttle service to the trailheads and pick up the riders once they complete the trails. The Thailand National Championships, which are held in many different venues across Thailand by the Thai Cycling Association also attract many riders across Southeast Asia. The cheap living costs, great foods, warm climate and great ridings make Thailand a \"must visit\" place for riders on a budget.\n\n\n=== United Kingdom ===\n\nWithin the UK most of the main downhill tracks are in the Scottish Uplands, Highlands, Wales and Northern England, as these are more mountainous areas. Fort William in Scotland is Britain's only World Cup standard track and was the venue for the 2007 World Championships. The UK has a strong race scene with a national series and numerous regional series with strong representation of all age groups present. The country has produced many of the world's top downhill mountain bikers including Steve Peat, Gee Atherton, Danny Hart, Josh Bryceland, Brendan Fairclough, Rachel Atherton, Manon Carpenter and Tahnee Seagrave.\n\n\n=== United States ===\nThe Sea Otter Classic, held each April at Laguna Seca near Monterey, California, is a major riding event that opens the racing season. In 2008, experienced racer Mark Reynolds died after a crash at the Sea Otter Classic, highlighting the dangers of the sport. Plattekill Mountain in the Catskills, Mammoth Mountain, the Northstar at Tahoe, Brian Head Resort, Attitash and Deer Valley ski resorts, and Moab (Utah) are also well known to mountain bikers. Snowmass, Colorado is also developing as a location for the sport.\nMountain Creek Bike Park in Vernon, New Jersey is a downhill venue which hosts their own series of competitions called the Gravity Series. In the southeastern United States, Snowshoe Mountain is well known for its extensive mountain bike park, camps, and freeriding areas during the summer. Bryce Resort offers a self-described progression based bike park, built by Gravity Logic. Massanutten Resort also has a bike park with some of the most rocky terrain on the east coast. UCI Pro Downhill riders, Neko Mulally and Dakota Norton have built, train at, and promoted races Windrock Bike Park in Oliver Springs, Tennessee as well.\nVail, Colorado was the site of the 1994 Downhill World Championship.  The trail was renamed \"'94 Downhill\", and is still ridden by downhill bikers today. In 2006, The U.S. National Championships were held at the Infineon Raceway in Sonoma, California. In 2007 and 2008 the U.S. National Championships were held in Mt. Snow, Vermont, and in 2009 and 2010 the U.S. National Championships were held at SolVista Bike Park in Colorado.\n\n\n=== Venezuela ===\nEl Volcan, a small mountain in the southeastern, touristic El Hatillo Municipality of Caracas, has a Downhill course that has about 500 meters of vertical drop, it is used by hundreds of riders a day during dry and wet weather, mostly on weekends. El Volcan is the representative [Downhill] Track of Caracas city. The course is open to the public and riding is neither specifically allowed nor prohibited by law. The trails are also used by hikers all week long. Shuttles are about 10 Venezuelan bolivars per trip, they run from the parking lot of a Farmatodo drug store in La Boyera, up to the summit using public avenues and paved roads, taking from 15 minutes to 30 minutes depending on traffic on the area. The course apart from being used mostly for recreational purpose, also has been used for irregularly scheduled downhill races due to the lack of organization in the riders community.\n\n\n== Governing bodies ==\nThe Union Cycliste Internationale is the governing body for downhill mountain bike racing.  Racers qualify to compete in World Cup races by earning UCI points, which are gained by being a top ten finisher in certain races, usually national.\nIn the U.S., NORBA, as part of USA Cycling, runs the National Mountain Bike Series, and the NCCA is the governing body for collegiate cycling.  In the UK, British Cycling controls mountain biking as well as road and BMX. In Australia, MTBA controls all disciplines of Mountain biking.\n\n\n== Notable riders ==\n\n\n=== Men ===\nGee Atherton\nDan Atherton\nFabien Barel\nWade Bootes\nJoe Breeze\nTroy Brosnan\nLoïc Bruni\nJosh Bryceland\nEric Carter\nCédric Gracia\nAaron Gwin\nMichael Hannah\nDanny Hart\nCorrado Hérin\nSam Hill\nFinn Iles\nMike King\nMatti Lehikoinen\nBrian Lopes\nGreg Minnaar\nSteve Peat\nNathan Rennie\nRoger Rinderknecht\nLuca Shaw\nSteve Smith\nJohn Tomac\nLoris Vergier\nNicolas Vouilloz\nJake Watson\nJoost Wichman\n\n\n=== Women ===\nRachel Atherton\nAnneke Beerten\nManon Carpenter\nAnne-Caroline Chausson\nLeigh Donovan\nMissy Giove\nNiki Gudex\nTracey Hannah\nValentina Höll\nJana Horáková\nTara Llanes\nTracy Moseley\nMyriam Nicole\nTahnée Seagrave\n\n\n== See also ==\nDownhill bike\nMountain bike\nMountain biking\nMountain bike racing\nBicycle suspension\nGlossary of cycling\n\n\n== References ==\n\n\n== External links ==\nKlunkerz: a film about mountain bikes at IMDb"