"A chordioid, also called chord fragment or fragmentary voicing or partial voicing, is a group of musical notes which does not qualify as a chord under a given chord theory, but still useful to name and reify for other reasons.\nThe main use of chordioids is to form \"legitimate\" chords enharmonically in 12TET by adding one or more notes to this base.  It is typical of chordioids that many different resultant chords can be created from the same base depending on the note or combination of notes added.  The resultant chords on a single chordioid are somewhat related, because they can be progressed between using motion of just one voice.  Theorists – or practical music teachers – writing of chordioids usually go so far as to advise that students learn them in the practical manner of chords generally: in all transpositions, ranges, permutations, and voicings, for reading, writing, and playing.\nIt is the case, also, that \"legitimate chords\" can be used as chordioids to create resultant chords by the same process.  Perhaps this is whence the non-chord chordioids come.  The Italian augmented 6th chord (It+6) is one example, from which proceed the French augmented 6th chord (Fr+6) and German augmented 6th chord (Gr+6) by addition of one note.  Rawlins (2005) asserts that the notion derives from practice of such composers as Eric Satie, Claude Debussy, Maurice Ravel, and Gabriel Faure, and was first used in jazz by Bill Evans.Two chordioids may potentially be combined, as well.  Typically, duplication of notes will result in a reduced number of unique notes in the resultant.\nChordioids as a technique is related to polychords insofar as polychords are the result of an additive process, but differs in that the basis of polychords is the addition of two known chords.  Chordioids is related also to upper structures as a technique insofar as upper structures represent groups of notes not commonly taken to be \"legitimate\" chords, but differs in that chordioids as a technique uses a priori structures held in common rather than a free selection of color tones appropriate for a lower integral chord.  Chordioids is related to slash chords as a technique insofar as known chords may be used as chordioids to create resultant scales, but differs in that chordioids used are not exclusively known chords.\n\n\n== Master chord ==\n\nNicolas Slonimsky named \"master chord\" that chordioid described in jazz chord theory as 7no5, e.g.: { C D F♯ }.  The sonority of the chordioid itself is identical to that of the It+6, a subset of the Wholetone scale and so subject to some of the symmetries and homogeneity for which that scale is known, and anhemitonic allowing the possibility that the resultant scale be anhemitonic or at least ancohemitonic itself.\nThe chord buttons of the Accordion usually play master chords, allowing the bass buttons (or a second chord button) to supply the variable note (or notes) to complete the sonority.\nThe new name and concept, \"master chord\", thus does not imply either jazz derivation, completeness of the sonority as an independent chord, nor connection to other use as a chord of dominant function.  It does not speciously denote anything to be \"missing\", or posit that the listener should ever hear a note not actually present.  It rejects the tertian chordal basis as pertaining at all.  These, the practicality of application, and the variety of use, are the logical basis of chordioids.\nThe following table shows the resultant chord for some of the possible added notes:\n\n\n== Non-dominant seventh chordioids ==\nRobert Rawlins based his theory of chordioids off the above as well as permutations of other major and minor 7th chords.  He described his chordiods as the interval of a 2nd below the interval of a 3rd.\n\n\n=== Major ===\nBased upon M7no5, e.g.: { C D♭ F }:\n\n\n=== Major-minor ===\nBased upon mM7no5, e.g.: { C D♭ F♭ }:\n\n\n=== Minor ===\nBased upon m7no5, e.g.: { C D F }\n, the sonority of the chordioid itself is anhemitonic allowing the possibility that the resultant scale be anhemitonic or at least ancohemitonic itself.\n\n\n== Incomplete sevenths and ninths chordioids ==\nJoseph Schillinger based his theory of chordioids off the above as well as those irregular voicings of 7th chords in which the 5th is present but the 3rd absent, and of 9th chords in which the 5th and 3rd are both absent.\n\n\n=== Dominant seventh ===\nBased upon 7no3, e.g.: { C G B♭ }\n, the sonority of the chordioid itself is anhemitonic allowing the possibility that the resultant scale be anhemitonic or at least ancohemitonic itself.\n\n\n=== M7 ===\nBased upon M7no3, e.g.: { C G B }:\n\n\n=== 7♭5 ===\nBased upon 7♭5no3, e.g.: { C G♭ B♭ }\n, the sonority of the chordioid itself is identical to that of the base triad of the Fr+6, a subset of the Wholetone scale and so subject to some of the symmetries and homogeneity for which that scale is known, and anhemitonic allowing the possibility that the resultant scale be anhemitonic or at least ancohemitonic itself.\n\n\n=== M7♭5 ===\nBased upon M7♭5no3, e.g.: { C G♭ B }:\n\n\n=== 7♯5 ===\nBased upon 7♯5no3, e.g.: { C G♯ B♭ }\n, the sonority of the chordioid itself is a subset of the Wholetone scale and so subject to some of the symmetries and homogeneity for which that scale is known, and anhemitonic allowing the possibility that the resultant scale be anhemitonic or at least ancohemitonic itself.\n\n\n=== M7♯5 ===\nBased upon M7♯5no3, e.g.: { C G♯ B }:\n\n\n=== Dominant 9 ===\nBased upon 9no5no3, e.g.: { C D B♭ }\n, the sonority of the chordioid itself is a subset of the Wholetone scale and so subject to some of the symmetries and homogeneity for which that scale is known, and anhemitonic allowing the possibility that the resultant scale be anhemitonic or at least ancohemitonic itself.\n\n\n=== M9 ===\nBased upon M9no5no3, e.g.: { C D B }:\n\n\n=== Dominant ♭9 ===\nBased upon ♭9no5no3, e.g.: { C D♭ B♭ }\n, the sonority of the chordioid itself is anhemitonic allowing the possibility that the resultant scale be anhemitonic or at least ancohemitonic itself.\n\n\n=== M♭9 ===\nBased upon M♭9no5no3, e.g.: { C D♭ B }, the sonority of the chordioid itself is cohemitonic assuring that the resultant scale be cohemitonic itself.\n\n\n=== Dominant ♯9 ===\nBased upon ♯9no5no3, e.g.: { C D♯ B♭ }\n, the sonority of the chordioid itself is anhemitonic allowing the possibility that the resultant scale be anhemitonic or at least ancohemitonic itself.\n\n\n=== M♯9 ===\nBased upon M♯9no5no3, e.g.: { C D♯ B }:\n\n\n== Incomplete 11ths chordioids ==\n\n\n=== Dominant 11 ===\nBased upon 11no5no9 (or 7sus4), e.g.: { C F B♭ }, the sonority of the chordioid itself is anhemitonic allowing the possibility that the resultant scale be anhemitonic or at least ancohemitonic itself.\n\n\n=== Major 11 ===\nBased upon M11no5no9 (or M7sus4), e.g.: { C F B }:\n\n\n== Augmented sixth chords ==\n\nHarmonically, augmented sixth chords (+6ths)  in prime position require three things:\n\nthe interval of a major third up from the bottom note,\nthe interval of an augmented sixth up from the bottom note, and\nstrict anhemitonia: that there be no semitones present.Given these requirements, which are minimally fulfilled by the Italian sixth (It+6), e.g.: { A♭ C F♯ }, it is possible to derive all potential +6 chords from the It+6.  The following table illustrates:\n\n\n== Other known chords as chordioids ==\nJoseph Schillinger also used basic triads and the master chord as chordioids in building bigger structures, textures, and strata.  His 7th chords were based upon single notes added below major, minor, diminished, or augmented triads; some of his hybrid 4-part harmony (including 11th and 13th chords) likewise.\n\n\n== See also ==\nFactor (chord)\n\n\n== References =="