"Gala Dalí, Marchioness of Dalí de Púbol (born Elena Ivanovna Diakonova; 7 September [O.S. 26 August] 1894 – 10 June 1982), usually known simply as Gala, was the Russian wife of poet Paul Éluard and later of artist Salvador Dalí, who were both prominent in surrealism. She also inspired many other writers and artists.\n\n\n== Early years ==\nGala was born as Elena Ivanovna Diakonova (Russian: Елена Ивановна Дьяконова) in Kazan, Kazan Governorate, Russian Empire, to a family of intellectuals. Among her childhood friends was the poet Marina Tsvetaeva. She began working as a schoolteacher in 1915, at which time she was living in Moscow.\n\n\n== Marriage to Éluard ==\nIn 1912, she was sent to a sanatorium at Clavadel, near Davos in Switzerland for the treatment of tuberculosis. She met Paul Éluard while in Switzerland and fell in love with him. They were both seventeen. In 1916, during World War I, she traveled from Russia to Paris to reunite with him; they were married one year later. Their daughter, Cécile, was born in 1918. Gala detested motherhood, mistreating and ignoring her child.With Éluard, Gala became involved in the Surrealist movement. She was an inspiration for many artists including Éluard, Louis Aragon, Max Ernst, and André Breton. Breton later despised her, claiming she was a destructive influence on the artists she befriended. She, Éluard, and Ernst spent three years in a ménage à trois, from 1924 to 1927. In early August 1929, Éluard and Gala visited a young Surrealist painter in Spain, the emerging Salvador Dalí. An affair quickly developed between Gala and Dalí, who was about 10 years younger than she. Nevertheless, even after the breakup of their marriage, Éluard and Gala continued to be close.\n\n\n== Marriage to Dalí ==\n \nAfter living together since 1929, Dalí and Gala married in a civil ceremony in 1934, and remarried in a Catholic ceremony in 1958 in the Pyrenean hamlet of Montrejic. They needed to receive a special dispensation by the Pope because Gala had been previously married and she was a believer (not Catholic, but was an Orthodox Christian). Due to his purported phobia of female genitalia, Dalí was said to have been a virgin when they met on the Costa Brava in 1929. Around that time she was found to have uterine fibroids, for which she underwent a hysterectomy in 1936. She was Dalí's muse, directly inspiring and appearing in many of his works.In the early 1930s, Dalí started to sign his paintings with his and her name as \"(i)t is mostly with your blood, Gala, that I paint my pictures\". He stated that Gala acted as his agent, and aided in redirecting his focus. According to most accounts, Gala had a strong libido and throughout her life had numerous extramarital affairs (among them with her former husband Paul Éluard), which Dalí encouraged, since he was a practitioner of candaulism. She had a fondness for young artists, and in her old age she often gave expensive gifts to those who associated with her.In 1968, Dalí bought Gala the Castle of Púbol, Girona, where she would spend time every summer from 1971 to 1980.  He also agreed not to visit there without getting advance permission from her in writing.\n\n\n== Death ==\nGala died in Port Lligat in Catalonia, Spain, early in the morning of 10 June 1982, at the age of 87. In the months before her death, Gala had battled a severe case of influenza, after which she began to exhibit signs of dementia. She was interred in the Castle of Púbol, which her husband had purchased for her in 1968, in a crypt with a chessboard style pattern.\n\n\n== Gala as model ==\nGala is a frequent model in Dalí's work, often in religious roles such as the Blessed Virgin Mary in the 1949 painting The Madonna of Port Lligat. His paintings of her show his great love for her, and some are perhaps the most affectionate and sensual depictions of a middle-aged woman in Western art. Among the paintings she served as a model for are: Imperial Monument to the Child-Woman, Gala (1929); Memory of the Child-Woman (1932); The Angelus of Gala (1935); Gala and \"The Angelus\" of Millet before the Imminent Arrival of the Conical Anamorphoses (1933); William Tell and Gradiva (1931); The Old Age of William Tell (1931); The Discovery of America by Christopher Columbus (1958–59); The Ecumenical Council (1960); Corpus Hypercubus (1954); Galatea of the Spheres (1952); and others.\nGala served a model for other surrealists, including Max Ernst in his 1924 painting Gala Éluard.\n\n\n=== Portrait of Galarina ===\nIn Portrait of Galarina, (1940–1945) Gala's face is shown severe and confrontational, her bared breast meant to depict bread, and the snake on the arm a gift of Dalí's sponsor Edward James.\n\n\n== References =="