"Lucille Désirée Ball (August 6, 1911 – April 26, 1989) was an American actress, comedian, model, studio executive, and producer. She was the star and producer of sitcoms I Love Lucy, The Lucy Show, and Here's Lucy, as well as comedy television specials aired under the title The Lucy-Desi Comedy Hour. She was also the first female head of a major Hollywood studio, Desilu Productions, which she also owned.\nBall's career began in 1929 when she landed work as a model. Shortly thereafter, she began her performing career on Broadway using the stage name Diane (or Dianne) Belmont. She later appeared in several minor film roles in the 1930s and 1940s as a contract player for RKO Radio Pictures, being cast as a chorus girl or in similar roles. During this time, she met Cuban bandleader Desi Arnaz, and the two eloped in November 1940. In the 1950s, Ball ventured into television. In 1951,  Arnaz and she created the sitcom I Love Lucy. The same year, Ball gave birth to their first child, Lucie Arnaz, followed by Desi Arnaz Jr. in 1953. Ball and Arnaz divorced in May 1960, and she married comedian Gary Morton in 1961.Following the end of I Love Lucy, Ball produced and starred in the Broadway musical Wildcat from 1960 to 1961. The show received lukewarm reviews and had to be closed when Ball became ill for several weeks. After Wildcat, Ball reunited with I Love Lucy co-star Vivian Vance for The Lucy Show, which Vance left in 1965. The show continued, with Ball's longtime friend and series regular Gale Gordon, until 1968. Ball immediately began appearing in a new series, Here's Lucy, with Gordon, frequent show guest Mary Jane Croft, and Lucie and Desi Jr.; this program ran until 1974.\nIn 1962, Ball became the first woman to run a major television studio, Desilu Productions, which produced many popular television series, including Mission: Impossible and Star Trek. Ball did not retire from acting completely, and in 1985, she took on a dramatic role in the television film Stone Pillow. The next year, she starred in Life with Lucy, which was, unlike her other sitcoms, not well-received; the show was cancelled after three months. She appeared in film and television roles for the rest of her career until her death in April 1989 from an abdominal aortic aneurysm at the age of 77.Ball was nominated for 13 Primetime Emmy Awards, winning four times. In 1960, she received two stars for her work in film and television on the Hollywood Walk of Fame. In 1977, Ball was among the first recipients of the Women in Film Crystal Award. She was also the recipient of the Golden Globe Cecil B. DeMille Award in 1979, was inducted into the Television Hall of Fame in 1984,  received the Lifetime Achievement Award from the Kennedy Center Honors in 1986, and the Governors Award from the Academy of Television Arts & Sciences in 1989.\n\n\n== Early life ==\nBorn at 69 Stewart Avenue, Jamestown, New York, Lucille Désirée Ball was the daughter of Henry Durrell Ball (1887–1915), a lineman for Bell Telephone, and Désirée \"DeDe\" Evelyn Ball (née Hunt; 1892–1977). Her family belonged to the Baptist church. Her ancestors were mostly English, but a few were Scottish, French, and Irish. Some were among the earliest settlers in the Thirteen Colonies, including Elder John Crandall of Westerly, Rhode Island, and Edmund Rice, an early emigrant from England to the Massachusetts Bay Colony.As part of her father's work for Bell Telephone, he was frequently transferred and the family moved often during her childhood. The family had moved from Jamestown to Anaconda, Montana, and later to Trenton, New Jersey. In February 1915, while living in Wyandotte, Michigan, her father died from typhoid fever at 27 years old, when Ball was three. At the time of Henry's death, DeDe Ball was pregnant with her second child, Fred Henry Ball (1915–2007). Ball recalled little from the day her father died, except a bird getting trapped in the house, which caused her lifelong ornithophobia.Ball's mother returned to New York, where maternal grandparents helped raise her brother Fred and her in Celoron, a summer resort village on Lake Chautauqua, 2.5 miles (4 km) west of downtown Jamestown. Ball loved Celoron Park, a popular amusement area in the United States at that time. Its boardwalk had a ramp to the lake that served as a children's slide, the Pier Ballroom, a roller-coaster, a bandstand, and a stage where vaudeville concerts and regular theatrical shows were presented.Four years after Henry Ball's death, DeDe Ball married Edward Peterson. While her mother and stepfather looked for work in another city, Peterson's parents cared for her brother and her. Ball's step-grandparents were a puritanical Swedish couple who banished all mirrors from the house except one over the bathroom sink. When the young Ball was caught admiring herself in it, she was severely chastised for being vain. This period of time affected Ball so deeply that, in later life, she said that it lasted seven or eight years.When Ball was 12, her stepfather encouraged her to audition for his Shriner's organization that was in need of entertainers for the chorus line of their next show. While Ball was onstage, she realized performing was a great way to gain praise, and her appetite for recognition was awakened. During this time in 1927, her family was forced to relocate into a small apartment in Jamestown after they suffered a misfortune when their house and furnishings were sold to settle a financial legal judgment. A neighborhood boy was accidentally shot and paralyzed by someone target shooting in their yard under the supervision of Ball's grandfather.\n\n\n== Career ==\n\n\n=== Early career ===\nIn 1925, Ball, then only 14, started dating Johnny DeVita, a 21-year-old local hoodlum. Her mother was unhappy with the relationship, and hoped the romance she was unable to influence would burn out. After about a year, her mother tried to separate them by exploiting Ball's desire to be in show business. Despite the family's meager finances, in 1926, she enrolled Ball in the John Murray Anderson School for the Dramatic Arts, in New York City, where Bette Davis was a fellow student. Ball later said about that time in her life, \"All I learned in drama school was how to be frightened.\" Ball's instructors felt she would not be successful in the entertainment business, and were unafraid to directly state this to her.\nIn the face of this harsh criticism, Ball was determined to prove her teachers wrong and returned to New York City in 1928. That same year, she began working for Hattie Carnegie as an in-house model. Carnegie ordered Ball to dye her brown hair blond, and she complied. Of this time in her life, Ball said, \"Hattie taught me how to slouch properly in a $1,000 hand-sewn sequin dress and how to wear a $40,000 sable coat as casually as rabbit.\"Her acting forays were still at an early stage when she became ill with rheumatic fever and was unable to work for two years.In 1932, she moved back to New York City to resume her pursuit of an acting career, where she supported herself by again working for Carnegie and as the Chesterfield cigarette girl. Using the name Diane (sometimes spelled Dianne) Belmont, she started getting chorus work on Broadway, but it was not lasting. Ball was hired – but then quickly fired – by theatre impresario Earl Carroll from his Vanities, and by Florenz Ziegfeld, from a touring company of Rio Rita.\n\n\n=== Hollywood ===\n\nAfter an uncredited stint as a Goldwyn Girl in Roman Scandals (1933), starring Eddie Cantor and Gloria Stuart, Ball moved permanently to Hollywood to appear in films. She had many small movie roles in the 1930s as a contract player for RKO Radio Pictures, including a two-reel comedy short with the Three Stooges (Three Little Pigskins, 1934) and a movie with the Marx Brothers (Room Service, 1938). Her first credited role came in Chatterbox in 1936. She also appeared in several Fred Astaire and Ginger Rogers RKO musicals - as one of the featured models in Roberta (1935), as the flower girl in Top Hat (1935), and in a brief supporting role at the beginning of Follow the Fleet (1936). Ball and Ginger Rogers, who were distant maternal cousins, played aspiring actresses in the film Stage Door (1937) alongside Katharine Hepburn.In 1936, she landed the role she hoped would lead her to Broadway, in the Bartlett Cormack play Hey Diddle Diddle, a comedy set in a duplex apartment in Hollywood. The play premiered in Princeton, New Jersey, on January 21, 1937, with Ball playing the part of Julie Tucker, \"one of three roommates coping with neurotic directors, confused executives, and grasping stars, who interfere with the girls' ability to get ahead\". The play received good reviews, but problems existed with star Conway Tearle, who was in poor health. Cormack wanted to replace him, but producer Anne Nichols said the fault lay with the character and insisted the part needed to be rewritten. Unable to agree on a solution, the play closed after one week in Washington, DC, when Tearle became gravely ill.Ball later auditioned for the role of Scarlett O'Hara for Gone with the Wind (1939), but Vivien Leigh got the part, winning an Academy Award for Best Actress for her role. In 1940, Lucy appeared as the lead in the musical Too Many Girls when she met and fell in love with Desi Arnaz, who played one of her character's four bodyguards in the movie.\nBall signed with Metro-Goldwyn-Mayer in the 1940s, but never achieved major stardom there. She was known in Hollywood circles as \"Queen of the Bs\" – a title previously held by Fay Wray and later more closely associated with Ida Lupino and Marie Windsor – starring in a number of B-movies like Five Came Back (1939).\nLike many budding actresses, Ball picked up radio work to supplement her income and gain exposure. In 1937, she appeared regularly on The Phil Baker Show. When its run ended in 1938, Ball joined the cast of The Wonder Show starring Jack Haley. There began her 50-year professional relationship with the show's announcer, Gale Gordon. The Wonder Show lasted one season, with the final episode airing on April 7, 1939.MGM producer Arthur Freed purchased the Broadway hit musical play DuBarry Was a Lady (1943) especially for Ann Sothern, but when she turned down the part, that role went to Ball, Sothern's real-life best friend. In 1943, Ball portrayed herself in Best Foot Forward. In 1946, Ball starred in Lover Come Back. In 1947, she appeared in the murder mystery Lured as Sandra Carpenter, a taxi dancer in London.\n\n\n=== I Love Lucy and Desi ===\n\nIn 1948, Ball was cast as Liz Cooper, a wacky wife in My Favorite Husband, a radio comedy for CBS Radio. (At first, the character's name was Liz Cugat; this was changed because of confusion with real-life bandleader Xavier Cugat, who sued.)\nThe show was successful, and CBS asked her to develop it for television. She agreed, but insisted on working with her real-life husband, Cuban bandleader Desi Arnaz. CBS executives were reluctant, thinking the public would not accept an Anglo-American redhead and a Cuban as a couple. CBS was initially unimpressed with the pilot episode, produced by the couple's Desilu Productions company. The pair went on the road with a vaudeville act, in which Lucy played the zany housewife, wanting to get into Arnaz's show. Given the great success of the tour, CBS put I Love Lucy into their lineup.I Love Lucy was not only a star vehicle for Lucille Ball, but also a potential means for her to salvage her marriage to Arnaz. Their relationship had become badly strained, in part because of their hectic performing schedules, which often kept them apart, but mostly due to Desi's attraction to other women.Along the way, Ball created a television dynasty and achieved several firsts. She was the first woman to head a TV production company, Desilu, which she had formed with Arnaz. After their divorce in 1960, she bought out his share and became a very actively engaged studio head. Desilu and I Love Lucy pioneered a number of methods still in use in TV production today, such as filming before a live studio audience with more than one camera, and distinct sets, adjacent to each other. During this time, Ball taught a 32-week comedy workshop at the Brandeis-Bardin Institute. She was quoted as saying, \"You cannot teach someone comedy; either they have it or they don't.\"During the run of I Love Lucy, Ball and Arnaz wanted to remain in their Los Angeles home, but time-zone logistics made that difficult. Since prime time in Los Angeles was too late to air a major network series live on the East Coast, filming in California would have meant giving most of the TV audience an inferior kinescope picture, delayed by at least a day.Sponsor Philip Morris pressured the couple into relocating, not wanting day-old kinescopes airing in major East Coast markets, nor did they want to pay the extra cost that filming, processing, and editing would require. Instead, the couple offered to take a pay cut to finance filming, which Arnaz did on better-quality 35 mm film and on the condition that Desilu would retain the rights of each episode once it aired. CBS agreed to relinquish the post-first-broadcast rights to Desilu, not realizing they were giving up a valuable and enduring asset. In 1957, CBS bought back the rights for $1,000,000 ($9.21 million in today's terms), giving Ball and Arnaz's down payment for the purchase of the former RKO Pictures studios, which they turned into Desilu Studios.I Love Lucy dominated U.S. ratings for most of its run. An attempt was made to adapt the show for radio using the \"Breaking the Lease\" episode (in which the Ricardos and Mertzes argue, and the Ricardos threaten to move, but find themselves stuck in a firm lease) as the pilot. The resulting radio audition disc has survived, but never aired.\nA scene in which Lucy and Ricky practice the tango, in the episode \"Lucy Does The Tango\", evoked the longest recorded studio audience laugh in the history of the show – so long that the sound editor had to cut that section of the soundtrack in half. During the show's production breaks, Lucy and Desi starred together in two feature films: The Long, Long Trailer (1954) and Forever, Darling (1956). After I Love Lucy ended its run in 1957, the main cast continued to appear in occasional hour-long specials under the title The Lucy–Desi Comedy Hour until 1960.Desilu produced several other popular shows, such as The Untouchables, Star Trek, and Mission: Impossible. The studio was eventually sold in 1967 for $17,000,000 ($132 million in today's terms) and merged into Paramount Pictures, which was just next door to the Desilu lot.\n\n\n=== Activities 1960–1979 ===\nThe 1960 Broadway musical Wildcat ended its run early when producer and star Ball could not recover from a virus and continue the show after several weeks of returned ticket sales. The show was the source of the song she made famous, \"Hey, Look Me Over\", which she performed with Paula Stewart on The Ed Sullivan Show. Ball hosted a CBS Radio talk show entitled Let's Talk to Lucy in 1964–65. She also made a few more movies including Yours, Mine, and Ours (1968), and the musical Mame (1974), and two more successful long-running sitcoms for CBS: The Lucy Show (1962–68), which costarred Vivian Vance and Gale Gordon, and Here's Lucy (1968–74), which also featured Gordon, as well as Lucy's real-life children, Lucie Arnaz and Desi Arnaz, Jr. She appeared on the Dick Cavett show in 1974 and spoke of her history and life with Arnaz.Ball's close friends in the business included perennial co-star Vivian Vance and film stars Judy Garland, Ann Sothern, and Ginger Rogers, and comedic television performers Jack Benny, Barbara Pepper, Mary Wickes, and Mary Jane Croft; all except Garland appeared at least once on her various series. Former Broadway co-stars Keith Andes and Paula Stewart also appeared at least once on her later sitcoms, as did Joan Blondell, Rich Little, and Ann-Margret. Ball mentored actress and singer Carole Cook, and befriended Barbara Eden, when Eden appeared on an episode of I Love Lucy.In 1959, Ball became a friend and mentor to Carol Burnett. She guested on Burnett's highly successful CBS-TV special Carol + 2 and the younger performer reciprocated by appearing on The Lucy Show.  Ball was rumored to have offered Burnett a chance to star on her own sitcom, but in truth, Burnett was offered (and declined) Here's Agnes by CBS executives. She instead chose to create her own variety show due to a stipulation that was on an existing contract she had with CBS. The two women remained close friends until Ball's death in 1989. Ball sent flowers every year on Burnett's birthday.Ball was originally considered by Frank Sinatra for the role of Mrs. Iselin in the Cold War thriller The Manchurian Candidate. Director/producer John Frankenheimer, however, had worked with Angela Lansbury in a mother role in All Fall Down, and insisted on having her for the part.Ball was the lead actress in a number of comedy television specials to about 1980, including Lucy Calls the President, which featured Vivian Vance, Gale Gordon, and Mary Jane Croft, and Lucy Moves to NBC, a special depicting a fictionalization of her move to the NBC television network.\nAside from her acting career, she became an assistant professor at California State University, Northridge in 1979.\n\n\n=== 1980s ===\nDuring the 1980s, Ball attempted to resurrect her television career. In 1982, she hosted a two-part Three's Company retrospective, showing clips from the show's first five seasons, summarizing memorable plotlines, and commenting on her love of the show.A 1985 dramatic made-for-TV film about an elderly homeless woman, Stone Pillow, received mixed reviews, but had strong viewership. Her 1986 sitcom comeback Life with Lucy, costarring her longtime foil Gale Gordon and co-produced by Ball, Gary Morton, and prolific producer Aaron Spelling, was cancelled less than two months into its run by ABC. In February 1988, Ball was named the Hasty Pudding Woman of the Year.In May 1988, Ball was hospitalized after suffering a mild heart attack. Her last public appearance, just one month before her death, was at the 1989 Oscars telecast, in which  fellow presenter Bob Hope and she were given a standing ovation.\n\n\n== HUAC Testimony ==\nWhen Ball registered to vote in 1936, she listed her party affiliation as Communist, along with her brother and mother.\nTo sponsor the Communist Party's 1936 candidate for the California State Assembly's 57th District, Ball signed a certificate stating, \"I am registered as affiliated with the Communist Party.\" The same year, the Communist Party of California appointed her to the state's Central Committee, according to records of the California Secretary of State. In 1937, Hollywood writer Rena Vale, a self-identified Communist, attended a  class at an address identified to her as Ball's home according to her testimony given before the US House of Representatives' Special House Un-American Activities Committee (HUAC), on July 22, 1940. Two years later, Vale affirmed this testimony in a sworn deposition:\"[...]within a few days after my third application to join the Communist Party was made, I received a notice to attend a meeting on North Ogden Drive, Hollywood; although it was a typed, unsigned note, merely requesting my presence at the address at 8 o'clock in the evening on a given day, I knew it was the long-awaited notice to attend Communist Party new members' classes ... on arrival at this address I found several others present; an elderly man informed us that we were the guests of the screen actress, Lucille Ball, and showed us various pictures, books, and other objects to establish that fact, and stated she was glad to loan her home for a Communist Party new members' class;\"\nIn a 1944 British Pathé newsreel, titled \"Fund Raising for Roosevelt\", Ball was featured prominently among several stage and film stars at events in support of President Franklin D. Roosevelt's fundraising campaign for the March of Dimes. She stated that in the 1952 US Presidential Election, she voted for Republican Dwight Eisenhower.\n\nOn September 4, 1953, Ball met voluntarily with HUAC investigator William A. Wheeler in Hollywood and gave him sealed testimony. She stated that she had registered to vote as a Communist \"or intended to vote the Communist Party ticket\" in 1936 at her socialist grandfather's insistence. She stated she \"at no time intended to vote as a Communist\". Her testimony was forwarded to J. Edgar Hoover in an FBI memorandum:Ball stated she has never been a member of the Communist Party \"to her knowledge\" ... [She] did not know whether or not any meetings were ever held at her home at 1344 North Ogden Drive; stated... [that if she had been appointed] as a delegate to the State Central Committee of the Communist Party of California in 1936 it was done without her knowledge or consent; [and stated that she] did not recall signing the document sponsoring EMIL FREED for the Communist Party nomination to the office of member of the assembly for the 57th District ... A review of the subject's file reflects no activity that would warrant her inclusion on the Security Index.\nImmediately before the filming of episode 68 (\"The Girls Go Into Business\") of I Love Lucy, Desi Arnaz, instead of his usual audience warm-up, told the audience about Lucy and her grandfather. Reusing the line he had first given to Hedda Hopper in an interview, he quipped:\"The only thing red about Lucy is her hair, and even that is not legitimate.\"\n\n\n== Personal life ==\nIn 1940, Ball met Cuban-born bandleader Desi Arnaz while filming the Rodgers and Hart stage hit Too Many Girls. When they met again on the second day, the two connected immediately and eloped the same year. Although Arnaz was drafted into the Army in 1942, he ended up being classified for limited service due to a knee injury. As a result, Arnaz stayed in Los Angeles, organizing and performing USO shows for wounded GIs being brought back from the Pacific.\nBall filed for divorce in 1944, obtaining an interlocutory decree; however, Arnaz and she reconciled, which precluded the entry of a final decree.\n\nOn July 17, 1951, one month before her 40th birthday, Ball gave birth to daughter Lucie Désirée Arnaz. A year and a half later, Ball gave birth to her second child, Desiderio Alberto Arnaz IV, known as Desi Arnaz, Jr. Before he was born, I Love Lucy was a solid ratings hit, and Ball and Arnaz wrote the pregnancy into the show. (Ball's necessary and planned caesarean section in real life was scheduled for the same date that her television character gave birth.)Several demands were made by CBS, insisting that a pregnant woman could not be shown on television, nor could the word \"pregnant\" be spoken on-air. After approval from several religious figures the network allowed the pregnancy storyline, but insisted that the word \"expecting\" be used instead of \"pregnant\". (Arnaz garnered laughs when he deliberately mispronounced it as \"'spectin'\".) The episode's official title was \"Lucy Is Enceinte\", borrowing the French word for pregnant; however, episode titles never appeared on the show.\nThe episode aired on the evening of January 19, 1953, with 44 million viewers watching Lucy Ricardo welcome little Ricky, while in real life Ball delivered her second child, Desi Jr., that same day in Los Angeles.  The birth made the cover of the first issue of TV Guide for the week of April 3–9, 1953.In October 1956, Ball, Arnaz, Vance, and William Frawley all appeared on a Bob Hope special on NBC, including a spoof of I Love Lucy, the only time all four stars were together on a color telecast. By the end of the 1950s, Desilu had become a large company, causing a good deal of stress for both Ball and Arnaz.On March 3, 1960, a day after Desi's 43rd birthday (and one day after the filming the final episode of The Lucy-Desi Comedy Hour), Ball filed papers in Santa Monica Superior Court, claiming married life with Desi was \"a nightmare\" and nothing at all as it appeared on I Love Lucy. On May 4, 1960, the couple divorced; however, until his death in 1986, Arnaz and Ball remained friends and often spoke very fondly of each other. Her real-life divorce indirectly found its way into her later television series, as she was always cast as an unmarried woman.The following year, Ball starred in the Broadway musical Wildcat, which co-starred Keith Andes and Paula Stewart. It marked the beginning of a 30-year friendship with Stewart, who introduced Ball to second husband Gary Morton, a Borscht Belt comic who was 13 years her junior. According to Ball, Morton claimed he had never seen an episode of I Love Lucy due to his hectic work schedule. She immediately installed Morton in her production company, teaching him the television business and eventually promoting him to producer; he also played occasional bit parts on her various series.Ball was outspokenly against the relationship her son had with actress Patty Duke. Later, commenting on when her son dated Liza Minnelli, she was quoted as saying, \"I miss Liza, but you cannot domesticate Liza.\"\n\n\n== Illness and death ==\nOn April 18, 1989, Ball complained of chest pain at her home in Beverly Hills, and was taken to Cedars-Sinai Medical Center in Los Angeles, where she was diagnosed with a dissecting aortic aneurysm and underwent surgery to repair her aorta and a successful seven-hour aortic valve replacement.Shortly after dawn on April 26, Ball awoke with severe back pain then lost consciousness;\nshe died at 5:47 am PDT at the age of 77. Doctors determined that Ball had succumbed to a ruptured abdominal aortic aneurysm not directly related to her surgery.In accordance with Ball's wishes, her body was cremated and the ashes were initially interred in Forest Lawn – Hollywood Hills Cemetery in Los Angeles. In 2002, her children moved her remains to the Hunt family plot at Lake View Cemetery in Jamestown, New York, where her parents and grandparents are buried. Her brother's remains were also interred there in 2007.\n\n\n== Recognition and legacy ==\n\nBall was the recipient of tributes, honors, and many prestigious awards throughout her career and posthumously. On February 8, 1960, she was given two stars on the Hollywood Walk of Fame: one at 6436 Hollywood Boulevard for contributions to motion pictures, and one at 6100 Hollywood Boulevard for her contribution to the arts and sciences of television.In 1976, CBS paid tribute to Ball with the two-hour special CBS Salutes Lucy: The First 25 Years.On December 7, 1986, Ball received recognition as a Kennedy Center Honors recipient. The portion of the honors event focused on Ball was particularly poignant, as Desi Arnaz, who was scheduled to introduce Lucy at the event, had died from cancer just five days earlier. Friend and former Desilu star Robert Stack delivered the emotional introduction in the place of Arnaz.Posthumously, Ball received the Presidential Medal of Freedom from President George H. W. Bush on July 6, 1989, and The Women's International Center's 'Living Legacy Award'.\n\nThe Lucille Ball Desi Arnaz Museum & Center for Comedy is in Ball's hometown of Jamestown, New York. The Little Theatre was renamed the Lucille Ball Little Theatre in her honor.  The street she was born on was renamed \"Lucy Street.\" Ball was among Time magazine's \"100 Most Important People of the Century\".On June 7, 1990, Universal Studios Florida opened a walk-through attraction dedicated to Ball, Lucy – A Tribute, which featured clips of shows, and various pieces of trivia about her, along with items owned by or associated with Lucille, and an interactive quiz for guests. The attraction was permanently closed on August 17, 2015.On August 6, 2001, the United States Postal Service honored what would have been her 90th birthday with a commemorative postage stamp as part of its Legends of Hollywood series.Ball appeared on 39 covers of TV Guide, more than any other person, including its first cover in 1953 with her baby son, Desi Arnaz Jr. TV Guide voted Lucille Ball as the 'Greatest TV Star of All Time' and it later commemorated the 50th anniversary of I Love Lucy with eight collector covers celebrating memorable scenes from the show. In 2008, it named I Love Lucy the second-best television program in American history, after Seinfeld.For her contributions to the Women's Movement, Ball was inducted into the National Women's Hall of Fame in 2001.The Friars Club named a room in its New York clubhouse for Lucille Ball (the Lucille Ball Room). She was posthumously awarded the 'Legacy of Laughter' award at the fifth Annual TV Land Awards in 2007. In November 2007, Lucille Ball was chosen as number two on a list of the '50 Greatest TV Icons', however, a public poll, chose her as number one.On August 6, 2011, Google's homepage displayed an interactive doodle of six classic moments from I Love Lucy to commemorate what would have been Ball's 100th birthday. On the same day, a total of 915 Ball look-alikes converged on Jamestown to celebrate the birthday and set a new world record for such a gathering.Since 2009, a statue of Ball has been on display in Celoron, New York, that residents deemed \"scary\" and not accurate, earning it the nickname \"Scary Lucy\".  On August 1, 2016, it was announced that a new statue of Ball would replace it on August 6. However, the old statue had become a local tourist attraction after receiving media attention, and it was placed 75 yards (69 m) from its original location so visitors could view both statues.In 2015, it was announced that Ball would be played by Cate Blanchett in an untitled biographical film, to be written and directed by Aaron Sorkin, and in January 2021, Nicole Kidman was in talks to portray Ball instead of Blanchett.A 2017 episode of Will & Grace paid homage to Ball by replicating the 1963 shower scene from the episode “Lucy and Viv Put in a Shower\" from The Lucy Show. Three years later, an entire episode was dedicated to her by recreating four scenes from I Love Lucy.Ball's character Lucy Ricardo was portrayed by Gillian Anderson in the American Gods episode \"The Secret of Spoons\" (2017).Ball was portrayed by Sarah Drew in the play I Love Lucy: A Funny Thing Happened on the Way to the Sitcom, a comedy about how Ball and her husband battled to get their sitcom on the air. It premiered in Los Angeles on July 12, 2018, co-starring Oscar Nuñez as Desi Arnaz, and Seamus Dever as I Love Lucy producer-head writer Jess Oppenheimer. The play was written by Oppenheimer's son, Gregg Oppenheimer.Ball was a well-known gay-rights supporter, stating in a 1980 interview with People: \"It's perfectly all right with me. Some of the most gifted people I've ever met or read about are homosexual. How can you knock it?\"\n\n\n== Filmography and television work ==\n\n\n== Radio appearances ==\n\n\n== Awards and nominations ==\nBall's awards and nominations references:\n\n\n== References ==\n\n\n=== Citations – books ===\n\n\n== Further reading ==\nKarol, Michael (2003). Lucy in Print; ISBN 0-595-29321-2\nKarol, Michael (2005). The Comic DNA of Lucille Ball: Interpreting the Icon; ISBN 0-595-37951-6\nMcClay, Michael (1995). I Love Lucy: The Complete Picture History of the Most Popular TV Show Ever; ISBN 0-446-51750-X (hardcover)\nMeeks, Eric G. (2011). P.S. I Love Lucy: The Story of Lucille Ball in Palm Springs. Horotio Limburger Oglethorpe. p. 45. ISBN 978-1468098549.\nPugh Davis, Madelyn; with Carroll Jr., Bob (2005). Laughing With Lucy: My Life With America's Leading Lady of Comedy; ISBN 978-1-57860-247-6\nSheridan, James & Barry Monush (2011). Lucille Ball FAQ: Everything Left to Know About America's Favorite Redhead; ISBN 978-1-61774-082-4\nYoung, Jordan R. (1999). The Laugh Crafters: Comedy Writing in Radio & TV's Golden Age. Beverly Hills: Past Times Publishing; ISBN 0-940410-37-0\n\n\n== External links ==\nLucille Ball at the Internet Broadway Database \nLucille Ball at IMDb\nLucille Ball at the TCM Movie Database\nLucille Ball at TV Guide\nLucille Ball at the Museum of Broadcast Communications\nLucille Ball and Desi Arnaz Papers, 1915-1990 at the Library of Congress\nLucille Ball at Find a Grave\nFBI Records: The Vault – Lucille Ball at vault.fbi.gov\n\"Celebrating Lucille Ball at 100: Unpublished Photos\". LIFE (Sideshow). Archived from the original on January 15, 2012. Retrieved August 6, 2011.\nNorwood, Arlisha. \"Lucille Ball\", National Women's History Museum. 2017.\n\"Orson Welles Radio Almanac\". Internet Archive. Recordings. 1944. Lucille Ball and several other actors participate\n\"Wanda Clark\". Interview. Oral history project. Voices of Oklahoma. August 5, 2015. About her long-time, 25 years, employer Lucille Ball"