"Lucille Désirée Ball (August 6, 1911 – April 26, 1989) was an American actress, comedian, model, studio executive, and producer. She was the star and producer of sitcoms I Love Lucy, The Lucy Show, and Here's Lucy, as well as comedy television specials aired under the title The Lucy-Desi Comedy Hour. She was also the first female head of a major Hollywood studio, Desilu Productions, which she also owned.\nBall's career began in 1929 when she landed work as a model. Shortly thereafter, she began her performing career on Broadway using the stage name Diane (or Dianne) Belmont. She later appeared in several minor film roles in the 1930s and 1940s as a contract player for RKO Radio Pictures, being cast as a chorus girl or in similar roles. During this time, she met Cuban bandleader Desi Arnaz, and the two eloped in November 1940. In the 1950s, Ball ventured into television. In 1951,  Arnaz and she created the sitcom I Love Lucy. The same year, Ball gave birth to their first child, Lucie Arnaz, followed by Desi Arnaz Jr. in 1953. Ball and Arnaz divorced in May 1960, and she married comedian Gary Morton in 1961.Following the end of I Love Lucy, Ball produced and starred in the Broadway musical Wildcat from 1960 to 1961. The show received lukewarm reviews and had to be closed when Ball became ill for several weeks. After Wildcat, Ball reunited with I Love Lucy co-star Vivian Vance for The Lucy Show, which Vance left in 1965. The show continued, with Ball's longtime friend and series regular Gale Gordon, until 1968. Ball immediately began appearing in a new series, Here's Lucy, with Gordon, frequent show guest Mary Jane Croft, and Lucie and Desi Jr.; this program ran until 1974.\nIn 1962, Ball became the first woman to run a major television studio, Desilu Productions, which produced many popular television series, including Mission: Impossible and Star Trek. Ball did not retire from acting completely, and in 1985, she took on a dramatic role in the television film Stone Pillow. The next year, she starred in Life with Lucy, which was, unlike her other sitcoms, not well-received; the show was cancelled after three months. She appeared in film and television roles for the rest of her career until her death in April 1989 from an abdominal aortic aneurysm at the age of 77.Ball was nominated for 13 Primetime Emmy Awards, winning four times. In 1960, she received two stars for her work in film and television on the Hollywood Walk of Fame. In 1977, Ball was among the first recipients of the Women in Film Crystal Award. She was also the recipient of the Golden Globe Cecil B. DeMille Award in 1979, was inducted into the Television Hall of Fame in 1984,  received the Lifetime Achievement Award from the Kennedy Center Honors in 1986, and the Governors Award from the Academy of Television Arts & Sciences in 1989."