"Beowulf (; Old English: Bēowulf [ˈbeːowuɫf]) is an Old English epic poem in the tradition of Germanic heroic legend consisting of 3,182 alliterative lines. It is one of the most important and most often translated works of Old English literature. The date of composition is a matter of contention among scholars; the only certain dating is for the manuscript, which was produced between 975 and 1025. Scholars call the anonymous author the \"Beowulf poet\". \nThe story is set in pagan Scandinavia in the 6th century. Beowulf, a hero of the Geats, comes to the aid of Hrothgar, the king of the Danes, whose mead hall in Heorot has been under attack by the monster Grendel. After Beowulf slays him, Grendel's mother attacks the hall and is then defeated. Victorious, Beowulf goes home to Geatland (Götaland in modern Sweden) and becomes king of the Geats. Fifty years later, Beowulf defeats a dragon, but is mortally wounded in the battle. After his death, his attendants cremate his body and erect a tower on a headland in his memory.\nScholars have debated whether Beowulf was transmitted orally, affecting its interpretation: if it was composed early, in pagan times, then the paganism is central and the Christian elements were added later, whereas if it was composed later, in writing, by a Christian, then the pagan elements could be decorative archaising; some scholars hold an intermediate position. \nBeowulf is written mostly in the West Saxon dialect of Old English, but many other dialectal forms are present, suggesting that the poem may have had a long and complex transmission throughout the dialect areas of England.\nAnglo-Saxon poetry is constructed very differently from a modern poem. There is little use of rhyme, and no fixed number of beats or syllables; the verse is alliterative, meaning that each line is in two halves, separated by a caesura, and linked by the presence of stressed syllables with similar sounds. The poet often used formulaic phrases for half-lines, including kennings, evocative poetic descriptions compressed into a single compound word.\nNo definite sources or analogues of the poem can be proven, but many suggestions have been made, including the Icelandic Grettis saga, the Norse story of Hrolf Kraki and his bear-shapeshifting servant Bodvar Bjarki, the international folktale the Bear's Son Tale, and the Irish folktale of the Hand and the Child. Persistent attempts have been made to link Beowulf to tales from Homer's Odyssey or Virgil's Aeneid. More definite are Biblical parallels, with clear allusions to the books of Genesis, Exodus, and Daniel.\nThe poem survives in a single copy in the manuscript known as the Nowell Codex. It has no title in the original manuscript, but has become known by the name of the story's protagonist. In 1731, the manuscript was damaged by a fire that swept through Ashburnham House in London, which was housing  Sir Robert Cotton's collection of medieval manuscripts. It survived, but the margins were charred, and some readings were lost. The Nowell Codex is housed in the British Library. \nThe poem was first transcribed in 1786; some verses were first translated into modern English in 1805, and nine complete translations were made in the 19th century, including those by John Mitchell Kemble and William Morris.\nFrom 1900, hundreds of translations, whether into prose, rhyming verse, or alliterative verse were made, some relatively faithful, some archaising, some attempting to domesticate the work. Among the best-known modern translations are those of Edwin Morgan, Burton Raffel, Michael J. Alexander, Roy Liuzza, and Seamus Heaney. The difficulty of translating Beowulf has been explored by scholars including J. R. R. Tolkien (in his essay \"On Translating Beowulf\"), who worked on a verse and a prose translation of his own."