"A kitchen scraper is a kitchen implement made of metal, plastics (such as polyethylene, nylon, or polypropylene), wood, rubber or silicone rubber. In practice, one type of scraper is often interchanged with another or with a spatula (thus scrapers are often called spatulas) for some of the various uses.\n\n\n== Bowl scraper ==\n\nBowl scrapers (also known as rubber feet) are, as the name suggests, used to remove material from mixing bowls. Often, a plate scraper is used for this purpose, particularly since the long handle allows it to be used to remove contents of bowls as well as jars, such as mayonnaise jars; however, for bowls, dedicated scrapers are available, lacking the handle, and consisting of a flat, flexible piece of plastic or silicone rubber sized for convenient holding with the palm and fingers, with a curved edge to match the curvature of the average bowl. The degree of curvature can vary from a slight curvature along one edge of a rectangle, to a complex shape composed of changing radii to adapt better to bowls of different sizes. Sometimes a hole is provided in one corner, to allow for hanging the utensil, as well as for placement of the thumb to allow for more secure grip. Prices vary from below one American dollar, to as much as $20 American.The technique for use of either form of bowl scraper is essentially intuitive.\n\n\n== Dough scraper ==\n\nDough scrapers, or pastry scrapers, are more rigid implements, often made of a metal rectangle with a wooden, plastic, or metal handle running along one long edge not only for more comfortable grip, but also to add rigidity; some bowl scrapers, however, are designed to be stiff enough to serve a dual purpose and are sold as such. Occasionally, an implement resembling a putty knife is sold for this purpose.This implement is used to manipulate raw dough, by scraping it from a surface on which it has been rolled, as well as to slice it. It can also be called a spatula.A dough scraper is a tool used by bakers to manipulate dough and to clean surfaces on which dough has been worked. It is generally a small sheet of stainless steel (approximately 8 centimetres (3.1 in) by 13 centimetres (5.1 in)) with a handle of wood, plastic, or simply a roll in the steel blade along one of the long sides.Bakers and pastry chefs use this tool to help pick up, turn, and portion dough. When finished, the dough scraper can be used to scrape up the little bits of dough that have dried onto the kneading surface during the forming process. It can also be used in a more generic kitchen role to transfer sliced or diced foods from cutting board to pan. Additionally, the scraper is also used by pastry chefs to give sharp and smooth edges to the cakes while decorating them.This tool is known by a variety of names, including dough scraper, dough cutter, dough knife, pastry cutter, bench scraper, board scraper, and bench knife.Some modern varieties of this tool have handles of nylon or silicone and even feature both straight and curved edges. These are intended primarily for the use of scraping cutting boards and bowls rather than working dough. These uses have introduced further variants of the name, including terms such as bowl scraper or chopper, scooper, scraper.\n\n\n== Grill scraper ==\nA grill scraper is a device used to clean cooking grills by scraping stuck particles of food from their surface. For flat surfaced grills, their design can vary from similar to a putty knife, to a more complex device with provision to protect the hands from the hot grill surface, targeted to professional cooks and chefs, to even more complex models costing $100 American. Varieties sold for cleaning wire grills are also available, with notches in the edge of the blade to match the wires of the grill.\n\n\n== Plate scraper ==\nA plate scraper consists of a plastic, wooden, or metal handle attached to a flexible rubber head. Although the original use of the implement was to remove food from plates before washing, its use has evolved to more of a utilitarian implement, the bowl scraper.\n\n\n== Pan scraper ==\n\nThe pan scraper is, as the name suggests, an implement designed for the forcible removal of tightly stuck or burned food from the bottom of pots and pans before washing. They usually resemble a putty knife with a metal blade and a metal, wood, or plastic handle, sometimes with the handle mounted at an angle to the blade to allow for more vigorous scraping parallel to the surface; others, however, are a wedge shaped piece of hard plastic molded to fit the hand and with a slightly rounded sharp edge.\n\n\n== Shellfish scraper ==\nA shellfish scraper is a specialized utensil used for removing meat from cooked shellfish at the dining table. It consists of a stainless steel rod about ten inches in length, with a flattened tip at one end and a forked tip at the other.\n\n\n== Crumb scraper ==\n\nAlthough not a cooking utensil, a crumb scraper is used during a meal to remove crumbs and other unwanted small debris from the surface of table, for cleanliness. Although historically, when crumb scrapers were mostly used in homes, ornate designs were used, the variety most often seen currently is sized and shaped for a waiter to carry in a breast pocket, and consists of a piece of sheet metal bent into a semi-cylindrical shape closely resembling a laboratory scoopula, which is dragged across the table so that the debris is dragged towards the edge, where it can be disposed of.\n\n\n== Plastic scraper ==\nAlso known as Rubber Spatula. Because it’s flexible, you can scrape dough from the sides of the bowl without scratching it.\n\n\n== See also ==\nBottle scraper\nDough blender\nPastry blender\nSpatula\n\n\n== References ==\n\n\n== External links =="