"America Must Be Destroyed is Gwar’s third album, released in 1992 as their second album on Metal Blade Records. The album’s lyrical content was inspired by controversy over obscenity charges against the band and an incident in Charlotte, North Carolina in which frontman Dave Brockie’s prosthetic penile attachment, \"The Cuttlefish of Cthulhu\", was confiscated by police officers.\n\n\n== Overview ==\nThe lyrical content in America Must Be Destroyed was greatly inspired by Dave Brockie’s fight with police officers while touring in Charlotte, North Carolina in 1990. The controversy revolved around Brockie’s rubbery penis adornment and ended with him being arrested on charges of disseminating obscenity. Brockie was revolted by this attack on his rights and so he created a concept album revolving around an elite \"Morality Squad\" that attacked the members of Gwar and stole Oderus’s penile attachment (a.k.a. Cuttlefish of Cthulu, a phallic hell beast that normally dangles from his crotch). The opening song, \"Ham on the Bone\" (which has a nod to grindcore) explains this robbery. The story then shifts to Gwar headquarters in Antarctica, where Oderus’s slaves are ordered to shoot up a dinosaur egg with crack. The result is the mighty Gor Gor, a Tyrannosaurus Rex that wreaks havoc on America. Meanwhile, the Morality Squad has enlisted the help of Father Bohab (a Catholic priest) to crucify Gwar in the media. Other songs of interest include \"Have You Seen Me?\", \"Poor Ole Tom\", and \"The Road Behind\", the latter of which is a parody of power ballads. A video, Phallus in Wonderland, was released as a supplement to the album’s storyline. This album was followed by The Road Behind, an EP that contained that single as well as a live version of \"Have You Seen Me?\". The single \"S.F.W.\" (a staple of their live shows) was supposedly released on this album as a bonus track, but this has been discounted by the band.\nIn November of 2009, a special edition of the album was released through Metal Blade, containing the CD and a bonus DVD containing Phallus in Wonderland and Tour De Scum.\nGwar fans are referred to as \"bohabs\", named for Father Bohab (\"bohab\" literally means \"habitually boring\", which is the opposite of what Gwar and their fans are—it fits Father Bohab perfectly; Gwar speaks ill of their fans—to their delight—and they have since taken the term as a point of pride).\nFather Bohab was never actually on the album—he originally appeared in 1989, along with an early Cardinal Syn. On the Tour de Scum (the corresponding tour to Scumdogs of the Universe, the Morality Squad story is introduced. He (Bohab) is played by one of the slaves (according to Chuck Varga’s Bohab Central forum posts, it was Bob Gorman; he also went on to say that the voice was his) on tour, but is portrayed by Brad Roberts (Jizmak Da Gusha) in Phallus in Wonderland and It's Sleazy.\n\"Pussy Planet\", the album’s closer, was co-written by Slymenstra Hymen, and was slated to be a duet with Beefcake the Mighty. Though not quite a duet, Slymenstra’s voice can still be heard in the song. The song's opening bass riff is similar to the guitar riff to the Nirvana song \"Rape Me\" from the 1993 album In Utero (\"Rape Me\" was originally written in early 1991 pre-dating \"Pussy Planet\" with the demo version being released many years on Nirvana's With the Lights Out box set) but uses different chords. The song ends with the band arguing.\nThe Canadian release of this album does not feature \"Crack in the Egg\", \"Have You Seen Me?\" and \"Rock N’ Roll Never Felt So Good\", and instead has earlier versions of \"Krak Down\" and \"Bad Bad Men\" (both from This Toilet Earth) and a version of \"O Canada\" performed with synthesized infant cries (according to Gwar, this was included as a way to ridicule Canada for not having the \"guts\" to include the omitted songs).\nFlattus Maximus does not perform on this album. Dewey Rowell left the band before recording began, and all of the lead guitars (save for two songs — \"Crack in the Egg\" and the title track) were recorded by Balsac the Jaws of Death. To this day, Balsac will usually play lead when performing songs from this album live. Tim Harriss (of Kepone, the band Michael Bishop left Gwar for) played lead on the album’s title track; Lee Harris (from Jizmak Da Gusha’s old band Rosebud) played lead on \"Crack in the Egg\". Because of the absence of Flattus, the tour cycle surrounding this album was quite short.\n\n\n== Track listing ==\n\n\n== Personnel ==\nDave Brockie (Oderus Urungus) – Lead vocals\nMike Derks (Balsac the Jaws of Death) – Lead guitar, Rhythm guitar, backing vocals\nMichael Bishop (Beefcake the Mighty) – Bass, backing vocals; lead vocals on \"Pussy Planet\"\nBrad Roberts (Jizmak Da Gusha) – Drums\nDanielle Stampe (Slymenstra Hymen) – Backing vocals\nChuck Varga (Sexecutioner) – Spoken words at the end of \"Pussy Planet\"\nHunter Jackson (Edna P. Granbo) – Vocals on \"The Morality Squad\"\nDave Musel (Müsel) – Samples on \"America Must Be Destroyed\"\n\n\n== See also ==\nPhallus in Wonderland\nThe Road Behind\n\n\n== References =="