"Josiah Warren (; 26 June 1798 – April 14, 1874) was an American utopian socialist, individualist philosopher, polymath, social reformer, inventor, musician, printer and author. He is regarded by some as the first American anarchist (although Warren never used the term anarchism himself) and the four-page weekly paper he edited during 1833, The Peaceful Revolutionist, the first anarchist periodical published, was an enterprise for which he built his own printing press, cast his own type, and made his own printing plates.\n\n\n== Life ==\n\n\n=== Early life ===\nWarren was born in Boston, Massachusetts, in 1798, a descendant of John Warren (1555–1613), the brother of Mayflower passenger Richard Warren. He showed an early talent for music and was a member of the \"Old Boston Brigade Band\" at an early age. In 1819 he married Caroline Cowing (1795–1872) and then moved to Cincinnati, Ohio, where he worked as a music teacher and orchestra leader. They had two children, Caroline (1820–1850) and George (1826–1902), and George wrote a remembrance of his father that can be found in the Labadie Library at the University of Michigan. He invented a tallow-burning lamp in 1821 and manufactured his invention for a number of years in Cincinnati.\n\n\n=== Owenism and New Harmony ===\nIn 1825, Warren became aware of the \"social system\" of Robert Owen and began to talk with others in Cincinnati about founding a communist colony. When this group failed to come to agreement about the form and goals of their proposed community, Warren \"sold his factory after only two years of operation, packed up his young family, and took his place as one of 900 or so Owenites who had decided to become part of the founding population of New Harmony, Indiana.\" The Cincinnati colony was attempted without Warren's involvement, but failed. Warren traveled by flat-boat from Cincinnati, arriving in New Harmony in early May, 1825. By 1827, he had returned to Cincinnati, convinced that the complete individualization of interests was necessary to cooperation. He considered Owen's experiment \"communism,\" which he rejected in no uncertain terms, but he developed a warm and lasting respect for Robert Owen and his sons. One of his earliest writings, published in The March of Mind in 1827, attests to this, as do later writings.\n\n\n=== Cincinnati and Utopia ===\n\nHe put his theories to the test by establishing an experimental \"labor for labor store\" called the Cincinnati Time Store in downtown Cincinnati, which facilitated trade by notes backed by a promise to perform labor. This was the first store to use a labor-for-labor note. \"All the goods offered for sale in Warren's store were offered at the same price the merchant himself had paid for them, plus a small surcharge, in the neighborhood of 4 to 7 percent, to cover store overhead.\" Between 1827 and 1830, the store proved successful. Warren closed the store to pursue establishing colonies based on economic mutualism, including \"Utopia\" and \"Modern Times.\"\n\n\n=== Modern Times ===\n\nModern Times, which was located in what is now Brentwood, New York, lasted from approximately 1851 to 1864. It was Josiah Warren's last attempt to put his ideas of Equitable Commerce and sovereignty of the individual, which he had developed over a lifetime of study and experimentation, into action. In 1850, Warren came back to Boston from the Midwest and began searching for an area near a major city, with low land prices, to establish a utopian community.  The inexpensive land enabled Warren to be able to implement his plan to provide homes for families that had never owned one before. The Pine Barrens of long Island where Modern Times was located had an undeserved reputation as having poor soil so he was able to purchase 400 acres at $2.75 an acre with a very small down payment.  Modern Times was a town with neither government nor money nor laws and can accurately be described as anarchistic, yet there was no crime and very little commotion.  The citizens of Modern Times although eschewing the profit motive, were not socialistic in their attitude toward ownership of property or the means of production.  According to author Roger Wunderlich, \"On 7 September 1864 the name of the village was changed to Brentwood.\"\n\n\n=== Later life and death ===\nWarren later returned to the Boston area. From 1864 to 1869, he resided in Cliftondale, Massachusetts, where he twice attempted to establish a mutual town. He then moved back to Boston, where he remained until his death.Warren died on April 14, 1874, in Charlestown at the home of a friend after developing edema.\n\n\n== Philosophy ==\nLike Pierre-Joseph Proudhon, Warren chose the libertarian socialist path of anarchism and individualism; though he refused to refer to himself as a socialist thinker.Warren's individualistic philosophy arose out of his rejection of Robert Owen's cooperative movement, of which he was an early participant, witnessing in person the failure of Owen's New Harmony commune. Of it, he wrote: \"It seemed that the difference of opinion, tastes, and purposes increased just in proportion to the demand for conformity ... It appeared that it was nature's own inherent law of diversity that had conquered us ... our 'united interests' were directly at war with the individualities of persons and circumstances and the instinct of self-preservation\". According to Warren, there should be absolutely no community of property; all property should be individualized, and \"those who advocated any type of communism with connected property, interests, and responsibilities were doomed to failure because of the individuality of the persons involved in such an experiment.\" Warren is notable for expounding the idea of \"sovereignty of the individual\".\nIn his Manifesto, Warren writes:\n\n[T]he forming of societies or any other artificial combinations IS the first, greatest, and most fatal mistake ever committed by legislators and by reformers. That all these combinations require the surrender of the natural sovereignty of the INDIVIDUAL over her or his person, time, property and responsibilities, to the government of the combination. That this tends to prostrate the individual—To reduce him to a mere piece of a machine; involving others in responsibility for his acts, and being involved in responsibilities for the acts and sentiments of his associates; he lives & acts, without proper control over his own affairs, without certainty as to the results of his actions, and almost without brains that he dares to use on his own account; and consequently never realizes the great objects for which society is professedly formed.Warren said that Stephen Pearl Andrews' The Science of Society, published in 1852, was the most lucid and complete exposition of Warren's own theories  including Warren's belief that employers should pay their employees the full value of their labor according to the cost principle. Warren's theory of value places him within the tradition of free-market socialism. William Bailie states:\nThe outcome of Warren's theory of value, of Cost the Limit of Price, was to place him squarely in line with the cardinal doctrine of all other schools of modern socialism. He believed that labor was robbed through rent, interest, and profit and his aim, like that of the Socialists, was to prevent these modes of exploitation.\n\n\n== Ethics of pricing ==\nWarren termed the phrase \"cost the limit of price,\" with \"cost\" here referring not to monetary price paid but the labor one exerted to produce an item. He believed that goods and services should trade according to how much labor was exerted to produce them and bring them to market, instead of according to how individuals believed them to be subjectively worth.\n\nTherefore, he \"proposed a system to pay people with certificates indicating how many hours of work they did. They could exchange the notes at local time stores for goods that took the same amount of time to produce.\" To charge more labor for something that entailed less labor was \"cannibalism,\" according to him. Moreover, he believed that trading according to \"cost the limit of price\" would promote increasing efficiency in an economy, as he explains in Equitable Commerce:\nIf cost is made the limit of price, every one becomes interested in reducing COST, by bringing in all the economies, all the facilities to their aid. But, on the contrary, if cost does not govern the price, but every thing is priced at what it will bring, there are no such co-operating interests.\nIf I am to have my supply of flour at cost, then, any facility I can afford to the wheat grower, reduces the cost to me, and it does the same for all who have any portion of the wheat, I am promoting all their interests while pursuing my own ... Now if the wheat were NOT TO BE SOLD TO us AT COST, but at \"whatever it would bring\" according to our necessities, then none of us would have any interest in affording facilities, repairing breaches, nor in any other way co-operating with the producer of it. The same motive would act in the production, preservation, and use of every thing.\n\n\n== Inventions ==\nJosiah Warren is the inventor of the first rotary press. Warren began working on the idea in 1830, but he did not patent the invention, it was \"simply given to the public.\". A few years after exhibiting the invention in New York, Hoe and Company was reaping large sums of money marketing an identical press, one that would revolutionize printing toward the end of the 19th century.\n\n\n== Influence ==\nCatalan historian Xavier Diez reports that the intentional communal experiments pioneered by Warren were influential in European individualist anarchists of the late nineteenth and early twentieth centuries such as Émile Armand and the intentional communities started by them. In the United States Benjamin Tucker dedicated his collection of essays, Instead of a Book, to the memory of Warren, \"my friend and master ... whose teachings were my first source of light\". Tucker credits Warren with being \"the first man to expound and formulate the doctrine now known as Anarchism.\"\nJohn Stuart Mill, author of On Liberty, said Warren's philosophy, \"though being a superficial resemblance to some of the project of the Socialists, is diametrically opposed to them in principle, since it recognizes no authority whatever in Society, over the individual, except to enforce equal freedom of development for all individuals.\" Warren's principle of the \"sovereignty of the individual\" was later taken up by Mill and Herbert Spencer.\n\n\n== See also ==\n\nAnarchist economics\nIndividualist anarchism in the United States\nUtopian socialism\nTime-based currency\nLibertarian socialism\nMutualism (economic theory)\n\n\n== Notes ==\n\n\n== References ==\nMartin, James J. Men Against the State: The Expositors of Individualist Anarchism in America, 1827–1908. Colorado Springs, CO: Ralph Myles Publishers, 1970.\nMiskelly, Matthew; and Jaime Noce. (eds) Political Theories For Students. Farmington Hills, MI: The Gale Group Inc., 2002. ISBN 0787656453\nWunderlich, Roger. Low Living and High Thinking at Modern Times, New York. Syracuse, NY: Syracuse University Press, 1992. ISBN 0815625545\n\n\n== External links ==\n\nA biography of Warren by his son George W. Warren\nJosiah Warren's Manifesto\nEquitable Commerce by Josiah Warren\nPlan of the Cincinnati Labor for Labor Store by Josiah Warren\nTrue Civilization by Josiah Warren, hosted by the Anarchy Archives\nThe Science of Society, by Stephan Pearl Andrews\nJosiah Warren: The First American Anarchist, by William Bailie\nUtopia The Successful Libertarian Market Socialist Economy by Nicholas Evans, hosted by BAD Press\nUtopia Drive: A Road Trip Through America's Most Radical Idea by Erik Reece\nDyson, Verne. A History of Modern Times. Brentwood Public Library, 2015.\nJosiah Warren by his son George\nThe Josiah Warren Project\nJosiah Warren – The First American Anarchist: “A Remarkable American”, by Magdalena Modrzejewska"