"Mega Man, known as Rockman (ロックマン, Rokkuman) in Japan, is a Japanese science fiction video game franchise created by Capcom, starring a series of robot characters each known by the moniker \"Mega Man\". Mega Man, released for the Nintendo Entertainment System in 1987, was the first in a series that expanded to over 50 games on multiple systems.  As of March 31, 2021, the game series has sold 36 million units worldwide.The original Mega Man series consists of eleven main games, a side game titled Mega Man & Bass, as well as all Game Boy, Sega Genesis, Sega Game Gear and other console games featuring the original design of Mega Man.\nAlthough the classic series has yet to reach an ending, the storyline shifts to the Mega Man X series, followed by the Mega Man Zero series, two Mega Man ZX games and three games for Mega Man Legends. All Mega Man series follow one continuous timeline except for Mega Man Battle Network and Mega Man Star Force, which takes place on a separate alternate timeline.\n\n\n== Games ==\n\n\n=== Original series ===\n\nIn the story behind the original series, Mega Man is a robot originally named Rock, created as a lab assistant by the scientist Dr. Light with Dr. Wily as his partner. Following treachery by Dr. Wily in which he reprogrammed most of Dr. Light's robots, Rock volunteered to be converted into a fighting robot to defend the world from Wily's violent robotic threats, thus becoming Mega Man.\nThough all incarnations of Mega Man feature unique stories, settings, and characters, they share several common features. All main Mega Man games released prior to 1997 are side-scrolling action platformers. The player character must fight through the levels using Mega Man's \"Mega Buster\"—a cannon attached to his arm—to shoot the robotic enemies inhabiting his environment. When Mega Man was released in 1987, the characteristic that made it revolutionary was the choice given to the player of which robot master to attempt first. After defeating a Robot Master—the boss of a level—Mega Man gains the ability to use that Robot Master's special weapon. Each Robot Master is representative of a specific element or object, with such bosses as Fire Man, Ice Man, Guts Man, Cut Man, Elec Man, and Bomb Man. The weapons Mega Man gains share the theme of the defeated boss. After defeating all of the Robot Masters, Mega Man travels to a multi-stage fortress to confront Dr. Wily, the person responsible for the robotic enemies' destructive acts. In the fortress, Mega Man fights past new bosses, clones of the game's Robot Masters, and Wily himself, who is usually in a large multi-phase war machine.\nEnemies are weak to at least one weapon; for instance, Fire Man will take more damage from Ice Man's weapon than from other weapons. This concept draws inspiration from rock-paper-scissors. Robot Master levels can generally be completed in any order, resulting in a strategic hallmark of the series: determining the best order to defeat bosses and earn weapons. Sequels of Mega Man games contain new enemies alongside familiar ones, new bosses and weapons, and perhaps new gadgets. Later installments of the game give the player the option of commanding other player characters with different abilities, such as Proto Man, Duo, and Bass.\nThe Classic series has not reached a definite conclusion. Originally developed for the NES, the original Mega Man series experienced graphical improvements in fourth and fifth generation installments. The series had no games developed for sixth generation consoles but returned in the seventh generation purposely sporting graphics, sound and gameplay similar to the original NES games to inspire a nostalgic look and feel, distributed as downloadable content instead of retail games like the previous installments.\nOn December 4, 2017, Capcom announced that a new game in the classic series, Mega Man 11, would release in late 2018.  Unlike Mega Man 9 and 10, this game features modern, HD, cel-shaded graphics and is presented in a widescreen aspect ratio. When using a special weapon, in addition to changing colors, Mega Man's armor changes appearance as well.\n\n\n=== Mega Man X ===\n\nCapcom wanted a redesign in graphics and control as the Rock Man series moved from the NES to the SNES, prompting the creation of the Mega Man X series in 1993. Set in the future, this series follows the story of Mega Man's successor, Mega Man X, a new, advanced robot that has complete free will over his actions, thoughts and feelings. This character, often referred to as \"X\", is also a creation of Dr. Light, put into suspended animation and uncovered 100 years in the future by a researcher named Dr. Cain. The Mega Man X series features more detailed 16-bit graphics and greater freedom of movement. In the Mega Man X series, the characters grow in abilities and power as the game progresses.\nAs the series progressed, various other player characters have appeared, such as fellow Maverick Hunter Zero who was created by Dr. Wily of the Classic series, OVER-1, created jointly by Dr. Light and Dr. Cossack, and Axl, a Reploid with an adolescent personality who has the ability to shape-shift into other Reploids. Zero would later star in his own spin-off series, Mega Man Zero.\nThe Mega Man X series has not reached a conclusion, having been left unresolved since the eighth game in the spin-off franchise ended with a cliffhanger.\nA mobile game, Rockman X DiVE, was released on March 24, 2020 in Taiwan.\n\n\n=== Mega Man Zero ===\n\nIn 2002, a follow-up series to the Mega Man X franchise was developed for the Game Boy Advance which starred Zero, a character created for the Mega Man X series as a sidekick/ally of X. The series revolved around Zero battling a powerful human-supremacy force as he protects the oppressed remaining reploids. In the Mega Man Zero series, the gameplay is largely similar to Zero's play style in the later Mega Man X games and features an in-depth ranking system that rewards the player with new abilities and enhancements (such as copied abilities from boss characters) in exchange for better play performance. In the fourth game, Zero can also physically steal weapons from enemies (such as axes and guns).\nMega Man Zero was, with its fourth game, the first series in the franchise to reach a definitive conclusion, although its storyline continues in the distant future with Mega Man ZX.\nThe series has also been referenced in other media; in Ultimate Marvel vs. Capcom 3, Zero's 4th skin was based on his appearance from Mega Man Zero. On July 5, 2020, Capcom Taiwan announced Zero from the Mega Man Zero series would be playable in Rockman X DiVE.\n\n\n=== Mega Man ZX ===\nThe first game in the Mega Man ZX series was released in 2006. It takes place about 200 years after the Zero series in which progression has led to the mixing of physical attributes between humans and robots; humans are given the physical advantages of robots, and robots are given lifespans. Therefore, this is the first game in the main storyline in which the player can control a human character. Players collect Biometals containing data on the legendary heroes of the past (including X, Zero, and the Four Guardians of the Mega Man Zero series). Using these Biometals, they are able to \"Mega-Merge\" with them to don the powers of the fallen heroes.\nGameplay remains largely similar to the Mega Man Zero series, although the ranking system is mostly removed. In the second game, the player character is able to physically transform into fallen boss characters upon defeating them.\nThe player is given the choice of choosing a male or female human protagonist in each installment, and the games imply that both characters do not exist in the same continuity. For example, Vent and Aile both have identical back-stories of being orphaned, have very similar appearances, and both work for Giro Express, but they are never seen together or mentioned to one another, therefore implying that they do not co-exist. The same occurs in the series's only sequel, Mega Man ZX Advent between protagonists Grey and Ashe, both of which meet either Aile or Vent respectively (depending on which player character is chosen), but not both.\nThis makes ZX unique in that it creates two parallel timelines depending on which character is chosen: a timeline in which Aile and Grey exist and are the heroes donning the Biometals, or a timeline in which Vent and Ashe assume their roles instead.\n\n\n=== Mega Man Legends ===\n\nBeginning on the PlayStation in 1997, a 3D action game series called Mega Man Legends was created to take advantage of the console's advanced graphics hardware. The Legends series is set in the same world as the other Mega Man games, although thousands of years in the future. The world is covered by immense bodies of water and features the return of several major characters from the original series in different situations. The hero, Mega Man (Rock) Volnutt, is a relic hunter called a \"Digger\" who scavenges various ruins throughout the world in search of refractor shards that can be mined and traded as currency. Mega Man Legends brings the gameplay into 3D and is an action adventure with role-playing game elements.\nThe Legends series concluded with only two main games and a spin-off starring mainstay antagonist Tron Bonne before being discontinued. Unlike Battle Network and Zero, the final game in the series does not resolve the storyline. A continuation to the Legends series has become an oft-requested game among many Capcom and Mega Man fans. A third game was once under development for the Nintendo 3DS, but on July 17, 2011, Capcom cancelled the project saying it did not meet certain requirements. This decision was met with criticism from fans and gaming news outlets.Despite the many years since the last new release in the series, various characters from the Legends series consistently appear in Capcom cross-over games such as Marvel vs. Capcom, and the Servbot characters have become iconic within the Capcom community, making many cameo appearances in non-Mega Man games, including Dead Rising and as part of the outfit obtained via achievements in Lost Planet 2.\n\n\n=== Mega Man Battle Network ===\n\nMega Man Battle Network, a series primarily on the Game Boy Advance, began in 2001 as a way for the Mega Man games to branch out into the role-playing video game market and to celebrate Mega Man's 15th anniversary. This series features a Net Navi called MegaMan.EXE. NetNavis act as virtual assistants to Operators, such as the protagonist Lan, an elementary school student and future hero who uses his Net Navi to help battle computer viruses and other Internet-based threats. The game combines elements from collectible card games to create a unique fast-paced battle system. An anime series, MegaMan NT Warrior, was also produced, ending with 209 episodes and a 50-minute film adaptation. Mega Man Network Transmission, the only entry in the series released on a home console rather than a handheld, takes place chronologically between the first two Battle Network games, although it was released between the third and fourth. It is also different from other games in the Battle Network universe in that its game play reminds strongly of the Classic series.\nAlong with the anime and games, Mega Man Battle Network had toys mainly based on the Advanced PET from the series. the user would buy a starter pack which included 3 battle chips, and an Advanced PET, the toy came in two colors, Red (based on ProtoMan.EXE), Black (based on Bass.EXE), and Blue (based on MegaMan.EXE). several battle chip expansion packs were also released, when the toy was discontinued, a total of 333 Battle Chips were released. the toy could be linked together via a link cable with another Advanced PET to battle each other.\nMega Man Battle Network was, with its sixth game, the second series in the franchise to reach a definitive conclusion, although the story continues in the distant future with Mega Man Star Force.\n\n\n=== Mega Man Star Force ===\nA follow-up to the Mega Man Battle Network series and released on the Nintendo DS, Star Force's launch commemorated the 20th anniversary of the Mega Man franchise. The Star Force games are very similar to the Battle Network games, and also takes place roughly 200 years later in the timeline. Network technology has progressed with electromagnetic wave technology to connect the world via radio waves. The series stars a timid boy named Geo Stelar and an extraterrestrial EM-wave being named Omega-Xis who can merge into an EM-Human known as \"Mega Man,\" allowing the player to explore both the real world and the EM-world. Although each game has a different set of antagonists, they are usually EM-beings that are able to merge with humans to create new threats. The gameplay is very similar to the Battle Network series with an over-the-shoulder battle system and more simplified collectible card game elements, as well as faster-paced battle mechanics. An anime based on this series began airing on TV Tokyo in October 2006 for 76 episodes.\n\n\n=== Rockman Xover ===\nRockman Xover (ロックマン Xover Rokkuman Kurosuōbā, pronounced Rockman Crossover) is a game for Apple's iOS platform marking the 25th anniversary of the Mega Man franchise, and was released on November 29, 2012 on the Hong Kong iTunes Store. The game features a new protagonist, OVER-1 (オーバー ワン Ōbā Wan), a Reploid created by Dr. Light and Dr. Cossack, confronting villains from the entire Mega Man franchise, who have crossed between dimensions to join forces. Capcom stated a North American release was cancelled due to largely negative feedback from Japanese fans. The game ceased operations on March 31, 2015.\n\n\n== In other media ==\n\n\n=== In other video games ===\nVarious incarnations of Mega Man appear as playable fighters in the Marvel vs. Capcom series. The original was a playable fighter in Marvel vs. Capcom: Clash of Super Heroes and Marvel vs. Capcom 2: New Age of Heroes. He is assisted by his companion robots, Rush, Beat and Eddie. His sister robot, Roll, is also playable in both games, but is a secret character in the first game. Although he did not make a playable appearance in Marvel vs. Capcom 3: Fate of Two Worlds, and its successor, Ultimate Marvel vs. Capcom 3, Zero from Mega Man X and Tron Bonne from Mega Man Legends appear as representatives for the series. Mega Man X appears as an alternate costume for Zero and Frank West and as a card in Heroes and Heralds mode. The original Mega Man appears in the arcade endings of Thor and Nova, and also appears on a poster in the Days of Future Past stage, and finally, as another card in Heroes and Heralds Mode. Mega Man X and Zero appear as playable characters in Marvel vs Capcom: Infinite, with Sigma appearing as both a DLC fighter and a major antagonist in the Story Mode, where he merges with the supervillain Ultron to become Ultron Sigma.MegaMan.EXE and Zero both appear as bonus playable characters in the fighting game Onimusha Blade Warriors, while a different version of Mega Man, based on his appearance on the American box art of the first game, appears as a playable fighter in the PlayStation 3 and PlayStation Vita versions of Street Fighter X Tekken. Mega Man Volnutt and Roll also make an appearance in Tatsunoko vs. Capcom: Ultimate All-Stars, with Zero added to the U.S. version. In 2013, Mega Man appeared as a playable character in Super Smash Bros. for Nintendo 3DS and Wii U and its sequel, Super Smash Bros. Ultimate. An amiibo based on his appearance was confirmed on November 11, and can be utilized in Super Smash Bros. as well as Mario Kart 8 where it can be scanned to unlock a costume for the player's Mii based on Mega Man's. In Super Mario Maker, the player can unlock a Mega Man costume by scanning the character's amiibo.In Monster Hunter: World, Mega Man is a playable character through downloadable content.\n\n\n=== Television appearances ===\nMega Man's first television appearances were produced for the American market and were based on the classic series. First was Captain N: The Game Master (1989–91), a show that took place in a universe that was made up of many different Nintendo games. It featured Mega Man as a main character and also featured Dr. Wily as one of the antagonists. This was followed by Mega Man (1994–95), the first series to be based in the Mega Man universe.Mega Man next appeared in anime produced in Japan and based on spin-off series. First was MegaMan NT Warrior (2002–06), based on the Mega Man Battle Network video game series (both the anime and the video game series were known as Rockman.EXE in Japan). This was followed by Mega Man Star Force (2006–08), based on the video game series of the same name (both were known as Shooting Star Rockman in Japan).A series titled Mega Man: Fully Charged began airing in 2018. Unlike the previous anime, it is again an American-produced animated series loosely based on the classic series.\n\n\n=== OVA ===\nMega Man starred in Mega Man: Upon a Star, a three-part OVA that was developed in Japan. Production on this series started in 1994, before the American TV series, but was not officially released in the United States until 2005.\n\n\n=== Film adaptation ===\nOn September 2, 2015, 20th Century Fox, Chernin Entertainment and Capcom began developing a Mega Man movie with Peter Chernin producing along with Mike Ireland and Ryan Harrigan and David Ready and Michael Finfer overseeing the film. On July 19, 2017, Henry Joost and Ariel Schulman were hired to write and direct the film with Masi Oka producing. On August 8, 2019, it was reported that, following The Walt Disney Company's acquisition of 20th Century Fox's parent company, 21st Century Fox, the film along with numerous video game based movies in development at Fox were cancelled. However, on October 29, Capcom indicated to investors in a semi-annual report that the film is still in development at Disney. The Hollywood Reporter revealed that Mattson Tomlin will rewrite the script for Capcom and Chernin Entertainment. On April 7, 2020, Peter Chernin signed his Chernin Entertainment to a non-exclusive first-look feature film producing deal with Netflix. After Disney put the project into turnaround, Netflix acquired the film rights.\n\n\n=== Artbooks ===\nVarious artbooks and source books have been released for many years in Japan, often including conceptual artwork, interviews with production staff, and background information on the storyline and concepts that are not present within the games themselves. One of the most well-known is the Rockman Perfect Memories sourcebook released in 2002 which first confirmed the presence of an alternate timeline (for Battle Network), as well as exactly where the Legends series fit into the fictional Mega Man universe.\nRecently a series of artbooks called the Official Complete Works has been published for individual Mega Man series, showcasing a large collection of artwork and background information. To date, books for the Zero, Classic and X (released together as R20), Star Force, and Battle Network series have been produced. Although these books have for many years been exclusive to Japan, UDON Entertainment Corporation has finished translating the Official Complete Works series for the North American market, called \"R25\". Mega Man: Official Complete Works was re-released as a hardcover on October 16, 2018, Mega Man X: Official Complete Works was followed by a hardcover re-release on November 27, 2018. A hardcover re-release of Mega Man Zero: Official Complete Works was released on June 11, 2019. On April 2, 2019, it was announced that Mega Man Battle Network Official Complete Works would be getting a hardcover re-release on August 20, 2019. On October 31, 2019, it was announced that Mega Man Star Force Official Complete Works would be getting a hardcover re-release on May 5, 2020.\n\n\n=== Comics ===\nMega Man has also been featured in many comics and manga in Japan, although few have been localized in North America.The most well-known series is produced by Hitoshi Ariga (who went on to provide character designs and artwork for future official Capcom releases, including the Super Famicom game Mega Man and Bass). The series began with Rockman Remix, followed with Rockman Megamix, and is currently being serialized as Rockman Gigamix. The Megamix portion of the series would eventually be brought to North American shores thanks to UDON Entertainment Corporation, also responsible for the localization of the short Mega Man ZX manga by Shin Ogino. In the original Mega Man series, Dr. Light was known as Dr. Right, so many of his robots featured in Ariga's comic have \"R\"s in their designs. UDON did not alter this detail in the English version of Mega Man Megamix.In addition, Viz Media localized the 13-volume Rockman EXE manga by Ryo Takamisaki under the name MegaMan NT Warrior. Takamisaki would later serialize a short adaptation of Mega Man Star Force 3 that was never published outside Japan.\nSome other manga series that have not been localized outside Japan include a 12-volume Rockman X adaptation by Yoshihiro Iwamoto, over 15 Classic and X adaptations by Shigeto Ikehara, a light-hearted adaptation of Rockman Zero by Hideto Kajima, a slapstick adaptation of Shooting Star Rockman by Masaya Itagaki, another Battle Network adaptation by Jun Keijima and Miho Asada  called Rockman EXE Battle Story, and a short series of slapstick Battle Network and Star Force-themed adaptations by Takumi Kawano.\nDreamwave Productions and Brazilian publisher Magnum Press made its own comic books based on the classic game series. The Brazilian series, Novas Aventuras de Megaman (\"New Adventures of Megaman\"), were originally published and sold in Brazil between 1996 and 1997 and drew certain criticism for featuring bizarrely altered storylines (with characters from several installments appearing at random, as well as erotic and sexual innuendo in Mega Man and X's relationship with Roll) as well for frequent nudity involving Roll and an original character named Princesa, which attempted to take over the status as the main character of the comics; its sudden end on a cliffhanger. The series was illustrated by Erica Awano, Eduardo Francisco, Daniel HDR and others.The Dreamwave series lasted only four issues and also ended abruptly, with plot-threads from the first three issues being dropped completely in the final issue and the inclusion of a short story promising a Mega Man X follow-up that never materialized. This was one of several Dreamwave Capcom comics that were cut short or simply never made it to issue #1, including Maximo, Darkstalkers and Rival Schools.\nOn July 20, 2017 it was announced that Mega Man Megamix would be getting remastered on January 24, 2018, titled “Mega Man: Mastermix” These releases will contain remastered versions of the original stories and in full color provided by Josh Perez. And on September 29, 2018, It was announced that Mega Man Mastermix would be getting released in trade paperback form on April 2, 2019.\n\n\n==== Archie Comics ====\nIn April 2011, Archie Comics released their first issue in an ongoing series of licensed comics based on the Mega Man franchise which features the titular character going against his nemesis Dr. Wily in various, original story arcs. The overall concept was created and almost exclusively written by Ian Flynn, who was also the head writer for Archie Comics' other video game licensed comic series Sonic the Hedgehog. Consequently, as of May 2013, both series have been crossed-over in a major story arc called \"Worlds Collide\", which spans twelve issues between the Mega Man comics, the main Sonic the Hedgehog comics, and the latter's side-series Sonic Universe. The popularity of this crossover is such that another meeting of the two series, \"Worlds Unite\", was announced for spring of 2015. The series was put on “indefinite hiatus” after Issue 55.\n\n\n=== Junior novel ===\n\nIn 1990, a junior novel version of Mega Man 2 was released as part of the Worlds of Power novel series. Mega Man is turned human by Dr. Light during an accident in a machine designed to clone Mega Man. Instead of a Mega Buster, human Mega Man uses a hand gun, and instead of being able to copy the robot master's weapons, he instead takes them off of their arms. For some reason, being human does not affect him much and he is still able to consume E-drinks (Energy Tanks) and gain a power boost. The book follows the general plot of Mega Man 2 and even provides game hints at the end of some chapters.\n\n\n=== Music ===\nAscertaining the identity of video game composers, especially prior to the fifth generation of consoles, can be difficult, as the composers were often uncredited or credited under a pseudonym. Recent soundtrack releases and interviews have discovered the true names of the composers; and in some cases, specific track credits.The indie rock music group The Protomen  dedicated their first two albums to a rock opera based on Mega Man, called The Protomen (2005) and Act II: The Father of Death (2009).\nIndependent rap artist Mega Ran remixed several Mega Man tracks for an album called Mega Ran (2007) and several follow-up albums, which were officially licensed by Capcom. He now holds a Guinness World Record for the most songs recorded referencing Megaman with 130.Indie video game cover band The Megas (band) is a band that covers the music of the original NES Mega Man games, known for adding their own twist on the original story in their lyrics such as giving Robot Masters distinct personalities unseen in the games. Get Equipped (2008), their debut album covering the events of Mega Man 2; while their most recent albums, History Repeating: Blue (2012) and History Repeating: Red (2014) cover the events of Mega Man 3.\n\n\n=== Miscellaneous ===\nIn 1999, the Brazilian role-playing game magazine Dragão Brasil #14 published an adaptation for 3D&T by Marcelo Cassaro and João Paulo Nogueira.\n\n\n== Reception and legacy ==\nAccording to GamesRadar, the Mega Man games were the first to feature a non-linear \"level select\" option. This was a stark contrast to both linear games (like Super Mario Bros.) and open world games (like The Legend of Zelda and Metroid). GamesRadar credits the \"level select\" feature of Mega Man as the basis for the non-linear mission structure found in most open-world, multi-mission, sidequest-heavy games, including modern games like Grand Theft Auto, Red Dead Redemption and Spider-Man: Shattered Dimensions. In Street Fighter: Assassin's Fist tenth episode \"Raging Demon\", Ryu and Ken were seen playing Mega Man 2 from a gift from Ken's father.\nThe original Mega Man series was well received, with IGN ranking all six original titles in the top 100 best NES games.  Mega Man 2 in particular is regarded as the best of the entire series and one of the finest and most influential platformers of all-time.  IGN ranked it as the 4th best NES game, behind only Super Mario and Legend of Zelda titles, calling it \"virtually flawless\" and its gameplay \"oft-replicated and never exceeded\".The Mega Man X series has been positively received. The first Mega Man X game was widely acclaimed by critics since its release. Gaming magazines in the United States and Europe including Electronic Gaming Monthly (EGM), GamePro, Game Players, Nintendo Power, Super Play, and the German version of Total! consistently lauded the game's visuals, audio, control, and overall gameplay. Game Players summarized Mega Man X as \"a near-perfect cart with classic gameplay, excellent graphics and sound and tons of hidden items and power-ups\". Nintendo Power stated that the game had \"great control and fun\" along with \"challenging play\".Websites such as IGN, GameSpot, GamesRadar, and 1UP.com retrospectively held Mega Man X as a successful milestone in converting the Mega Man series from its increasingly stale existence on the NES to the SNES. Brett Elston of GamesRadar stated, \"X was a total reinvention of the series, a perfectly executed update that had fans anticipating its release with a fervor the franchise hadn't seen since the Mega Man 2 and 3 days.\"Mega Man X received criticism from some publications as well. Ed Semrad, Danyon Carpenter, and Al Manuel of the EGM review panel all noted that the game may have too low a difficulty level; Semrad disliked the introductory stage and felt that the game was too short as well. Super Play editor Zy Nicholson lowered his review score of the game because he found the levels were neither large nor challenging. \"A few elementary tricks like repeating easy sections to recoup energy and weapon power will see you through the harder bits,\" Nicholson explained. \"Within the level you'll also find restart points, extra lives, and no harsh time limit to put pressure on your performance. Couple this with a password system that records your level completion, status and weapon accumulation and you'll see we're not looking at a lasting challenge for the experienced player.\" Nintendo Power criticized how little the game had changed stating that \"the theme remains the same as the Game Boy and NES Mega Man titles.\" The game's title initially proved a source of some confusion; the gaming media reported that many gamers mistook the \"X\" for the roman numeral 10.Mega Man X was ranked number 58 in Nintendo Power's \"100 Best Nintendo Games of All Time\" in its 100th issue in September 1997, number 103 in the publication's \"Top 200 Games\" list for its 200th issue in February 2006, and the 11th best SNES game of all time in its August 2008 issue. Both GamesRadar and ScrewAttack listed Mega Man X as the eighth best game in the SNES library. GamePro similarly listed it as the eighth greatest 16-bit video game. Game Informer considered it the 120th best game of all time in its own 200th issue in December 2009. IGN named it the twelfth-best on its own top 100 SNES games list in 2011.Mega Man X was a commercial success. The SNES version has sold 1.16 million copies worldwide as of March 31, 2021, making it the 89th best-selling Capcom game of all time. IGN's Jeremy Dunham speculated that the game's more mature storyline and its inclusion of numerous gameplay extensions over the original Mega Man series helped create a \"unique cadre of fans\". A spin-off series, Mega Man Zero, began in 2002 on the Game Boy Advance handheld as a result of the immense popularity of the character Zero.The Mega Man Zero games have earned generally positive reviews. Review sources both criticized and praised the high difficulty level of the game and remarked that they were similar in nature to earlier installments in the Mega Man series. Positive reviews noted the variety of abilities and customization along with an engaging story than compared to its prequel series, while negative reviews focused on the series repetitiveness and lack of originality. Review scores were lower for the last two games in the series, with critics pointing out that the games were just using the same gameplay without introducing anything new. When the first game in the series came out, reviewers were quick to hail a return to what they considered \"the Mega Man roots\", however some fans criticized that the lack of knowing which boss the player will face next was a change for the worse and that it \"takes away what made the series unique in the past\".Overall, the character of Mega Man has been well received by critics. IGN called him an icon of Capcom. Nintendo Power listed Mega Man as their fourth favourite hero, citing his ability to steal weapons from downed Robot Masters. Mega Man was also listed as the best robot in video games by many sources such Joystick Division, UGO Networks, and Complex. GameDaily ranked him as the best Capcom character of all time. UGO Networks listed Mega Man as one of their best heroes of all time, and called him \"one of the most iconic video game heroes of all time\". He was included in GameSpot's \"All Time Greatest Video Game Hero\" contest and reached the \"Elite Eight\" round before losing to Mario. In a Famitsu poll done in February 2010, Mega Man was voted by readers as the twenty-second most popular video game character. The 2011 Guinness World Records Gamer's Edition lists Mega Man as the 23rd most popular video game character. In 2012, GamesRadar ranked him as the 12th \"most memorable, influential, and badass\" protagonist in games.Complex ranked him as having the tenth best fighting game cameos for his guest appearances in Street Fighter X Tekken in 2012. Joystick Division cited his rivalry with Dr. Wily as seventh of the ten greatest in video games, adding giving \"great credit to this rivalry for its open-endedness\" and GamesRadar listed him and Proto Man as having one of the best brotherly rivalries in gaming. UGO Networks have placed Mega Man as the eighth character who most deserves his own movie.1UP.com described Mega Man as \"Capcom's ill-treated mascot\", and \"one of the most incongruous characters of all time\", saying \"it wouldn't be completely incorrect to assume that the popularity of the series has almost nothing to do with Mega Man himself\", but with \"his rivals, his enemies, and their abilities.\" IGN agreed with his dependency on support characters, saying Zero is \"cooler than Mega Man\". Den of Geek listed Mega Man's incarnation from Street Fighter X Tekken as the 15th best cameo in fighting game history due to how it represented Capcom's lack of interest in featuring other games as of 2012, as well as the apparent self-mockery of it due to Mega Man's poor characterization. Destructoid described this Mega Man as \"legit\" stating it was \"an unexpected and interesting creative decision by [Capcom] using this version of Mega Man to represent them in what may be one of their biggest games of 2012\".Mega Man series director Keiji Inafune announced the similarly themed Mighty No. 9 in September 2013, but after much controversy surrounding delays and mishandling, the game was released in June 2016 to a mixed-to-negative reception. Batterystaple Games released the Mega Man X-inspired 20XX in 2014.\n\n\n== Related ==\n20XX\nMighty Gunvolt\nMighty No. 9\nAzure Striker Gunvolt\n\n\n== References ==\n\n\n== External links ==\nOfficial website\nOfficial Japanese website"