"An endorheic basin (; also spelled endoreic basin or endorreic basin) is a drainage basin that normally retains water and allows no outflow to other external bodies of water, such as rivers or oceans, but drainage converges instead into lakes or swamps, permanent or seasonal, that equilibrate through evaporation. They are also called closed or terminal basins or internal drainage systems or basins. Endorheic regions contrast with exorheic regions. Endorheic water bodies include some of the largest lakes in the world, such as the Caspian Sea, the world's largest inland body of water.Basins with subsurface outflows which eventually lead to the ocean are generally not considered endorheic; they are cryptorheic.Endorheic basins constitute local base levels, defining a limit of erosion and deposition processes of nearby areas.\n\n\n== Etymology ==\nThe term was borrowed from French endor(rh)éisme, coined from the combining form endo- (from Ancient Greek: ἔνδον éndon 'within') and ῥεῖν rheîn 'to flow'.\n\n\n== Endorheic lakes ==\n\nEndorheic lakes (also called terminal lakes) are bodies of water that do not flow into the sea. Most of the water falling on Earth finds its way to the oceans through a network of rivers, lakes and wetlands. However, there is a class of water bodies that are located in closed or endorheic watersheds where the topography prevents their drainage to the oceans. These endorheic watersheds (containing water in rivers or lakes that form a balance of surface inflows, evaporation and seepage) are often called sinks.Endorheic lakes are usually in the interior of a landmass, far from an ocean in areas of relatively low rainfall. Their watersheds are often confined by natural geologic land formations such as a mountain range, cutting off water egress to the ocean. The inland water flows into dry watersheds where the water evaporates, leaving a high concentration of minerals and other inflow erosion products. Over time this input of erosion products can cause the endorheic lake to become relatively saline (a \"salt lake\"). Since the main outflow pathways of these lakes are chiefly through evaporation and seepage, endorheic lakes are usually more sensitive to environmental pollutant inputs than water bodies that have access to oceans, as pollution can be trapped in them and accumulate over time.\n\n\n== Occurrence ==\n\nEndorheic regions can occur in any climate but are most commonly found in desert locations. This reflects the balance between tectonic subsidence and rates of evaporation and sedimentation. Where the basin floor is dropping more rapidly than water and sediments can accumulate, any lake in the basin will remain below the sill level (the level at which water can find a path out of the basin). Low rainfall or rapid evaporation in the watershed favor this case. In areas where rainfall is higher, riparian erosion will generally carve drainage channels (particularly in times of flood), or cause the water level in the terminal lake to rise until it finds an outlet, breaking the enclosed endorheic hydrological system's geographical barrier and opening it to the surrounding terrain. The Black Sea was likely such a lake, having once been an independent hydrological system before the Mediterranean Sea broke through the terrain separating the two. Lake Bonneville was another such lake, overflowing its basin in the Bonneville flood. The Malheur/Harney lake system in Oregon is normally cut off from drainage to the ocean, but has an outflow channel to the Malheur River. This is presently dry, but may have flowed as recently as 1000 years ago.Examples of relatively humid regions in endorheic basins often exist at high elevation. These regions tend to be marshy and are subject to substantial flooding in wet years. The area containing Mexico City is one such case, with annual precipitation of 850 mm (33 in) and characterized by waterlogged soils that require draining.Endorheic regions tend to be far inland with their boundaries defined by mountains or other geological features that block their access to oceans. Since the inflowing water can evacuate only through seepage or evaporation, dried minerals or other products collect in the basin, eventually making the water saline and also making the basin vulnerable to pollution. Continents vary in their concentration of endorheic regions due to conditions of geography and climate. Australia has the highest percentage of endorheic regions at 21 percent while North America has the least at five percent. Approximately 18 percent of the earth's land drains to endorheic lakes or seas, the largest of these land areas being the interior of Asia.\nIn deserts, water inflow is low and loss to solar evaporation high, drastically reducing the formation of complete drainage systems. In the extreme case, where there is no discernible drainage system, the basin is described as arheic. Closed water flow areas often lead to the concentration of salts and other minerals in the basin. Minerals leached from the surrounding rocks are deposited in the basin, and left behind when the water evaporates. Thus endorheic basins often contain extensive salt pans (also called salt flats, salt lakes, alkali flats, dry lake beds or playas). These areas tend to be large, flat hardened surfaces and are sometimes used for aviation runways or land speed record attempts, because of their extensive areas of perfectly level terrain.\nBoth permanent and seasonal endorheic lakes can form in endorheic basins. Some endorheic basins are essentially stable, climate change having reduced precipitation to the degree that a lake no longer forms. Even most permanent endorheic lakes change size and shape dramatically over time, often becoming much smaller or breaking into several smaller parts during the dry season. As humans have expanded into previously uninhabitable desert areas, the river systems that feed many endorheic lakes have been altered by the construction of dams and aqueducts. As a result, many endorheic lakes in developed or developing countries have contracted dramatically, resulting in increased salinity, higher concentrations of pollutants, and the disruption of ecosystems.\nEven within exorheic basins, there can be \"non-contributing\", low-lying areas that trap runoff and prevent it from contributing to flows downstream during years of average or below-average runoff. In flat river basins, non-contributing areas can be a large fraction of the river basin, e.g. Lake Winnipeg's basin. A lake may be endorheic during dry years and can overflow its basin during wet years, e.g., the former Tulare Lake.\nBecause the Earth's climate has recently been through a warming and drying phase with the end of the Ice Ages, many endorheic areas such as Death Valley that are now dry deserts were large lakes relatively recently. During the last ice age, the Sahara may have contained lakes larger than any now existing.\n\n\n== Notable endorheic basins and lakes ==\n\n\n=== Africa ===\nLarge endorheic regions in Africa are located in the Sahara Desert, the Kalahari Desert, and the East African Rift:\n\nChad Basin, in the northern center of Africa. It covers an area of approximately 2.434 million km2.\nQattara Depression, in Egypt.\nChott Melrhir, in Algeria.\nChott el Djerid, in Tunisia.\nThe Okavango River, in the Kalahari Desert, is part of an endorheic basin region, the Okavango Basin, that also includes the Okavango Delta, Lake Ngami, the Nata River, and a number of salt pans such as Makgadikgadi Pan.\nEtosha pan in Namibia's Etosha National Park.\nTurkana Basin, in Kenya, whose basin includes the Omo River of Ethiopia.\nLake Chilwa, in Malawi.\nAfar Depression, in Eritrea, Ethiopia, and Djibouti, which contains the Awash River\nSome Rift Valley lakes, such as Lake Abijatta, Lake Chew Bahir, Lake Shala, Lake Chamo, and Lake Awasa.\nLake Mweru Wantipa, in Zambia.\nLake Magadi, in Kenya.\nLake Rukwa, in Tanzania.\n\n\n=== Antarctica ===\nThere are endorheic lakes in Antarctica in the McMurdo Dry Valleys, Victoria Land, the largest ice-free area in Antarctica.\n\nDon Juan Pond in Wright Valley is fed by groundwater from a rock glacier and remains unfrozen throughout the year.\nLake Vanda in Wright Valley has a perennial ice cover, the edges of which melt in the summer allowing flow from the longest river in Antarctica, the Onyx River. The lake is over 70 m deep and is hypersaline.\nLake Bonney is in Taylor Valley and has a perennial ice cover and two lobes separated by the Bonney Riegel. The lake is fed by glacial melt and discharge from Blood Falls. Its unique glacial history has resulted in a hypersaline brine in the bottom waters and fresh water at the surface.\nLake Hoare, in Taylor Valley, is the freshest of the Dry Valley lakes receiving its melt almost exclusively from the Canada Glacier. The lake has an ice cover and forms a moat during the Austral summer.\nLake Fryxell is adjacent to the Ross Sea in Taylor Valley. The lake has an ice cover and receives its water from numerous glacial meltwater streams for approximately 6 weeks out of the year. Its salinity increases with depth.\n\n\n=== Asia ===\n\nMuch of western and Central Asia is a giant endorheic region made up of a number of contiguous closed basins. The region contains several basins and terminal lakes, including:\n\nThe Caspian Sea, the largest lake on Earth. A large part of Eastern Europe, drained by the Volga River, is part of the Caspian's basin.\nLake Urmia in Western Azerbaijan Province of Iran.\nThe Aral Sea, whose tributary rivers have been diverted, leading to a dramatic shrinkage of the lake. The resulting ecological disaster has brought the plight faced by internal drainage basins to public attention.\nLake Balkhash, in Kazakhstan.\nIssyk-Kul Lake and Chatyr-Kul Lake in Kyrgyzstan.\nLop Lake, in the Tarim Basin of China's Xinjiang Uygur Autonomous Region.\nThe Dzungarian Basin in Xinjiang, separated from the Tarim Basin by the Tian Shan. The most notable terminal lake in the basin is the Manas Lake.\nThe Central Asian Internal Drainage Basin, in southern and western Mongolia, contains a series of closed drainage basins, such as the Khyargas Nuur basin, the Uvs Nuur basin, which includes Üüreg Lake, and the Pu-Lun-To River Basin.\nQaidam Basin, in Qinghai Province, China, as well as nearby Qinghai Lake.\nSistan Basin covering areas of Iran and Afghanistan\nPangong Tso and Aksai Chin Lake on the China-India border\nMany small lakes and rivers of the Iranian Plateau, including Gavkhouni marshes and Namak Lake.Other endorheic lakes and basins in Asia include:\n\nThe Dead Sea, the lowest surface point on Earth and one of its saltiest bodies of water, lies between Israel and Jordan.\nSambhar Lake, in Rajasthan, north-western India\nLake Van in eastern Turkey\nSabkhat al-Jabbul, extensive salt flats and a 100 square kilometres (39 sq mi) lake in Syria.\nSolar Lake, Sinai, near the Israeli-Egypt border.\nLake Tuz, in Turkey, in south part of Central Anatolia Region.\nSawa lake in Iraq, in Muthanna Governorate.\n\n\n=== Australia ===\n\nAustralia, being very dry and having exceedingly low runoff ratios due to its ancient soils, has many endorheic drainages. The most important are:\n\nLake Eyre basin, which drains into the highly variable Lake Eyre and includes Lake Frome.\nLake Torrens, usually endorheic lake to the west of the Flinders Ranges in South Australia, that flows to the sea after extreme rainfall events.\nLake Corangamite, a highly saline crater lake in western Victoria.\nLake George, formerly connected to the Murray-Darling Basin\n\n\n=== Europe ===\n\nThough a large portion of Europe drains to the endorheic Caspian Sea, Europe's wet climate means it contains relatively few terminal lakes itself: any such basin is likely to continue to fill until it reaches an overflow level connecting it with an outlet or erodes the barrier blocking its exit.\nThere are some seemingly endorheic lakes, but in fact they are cryptorheic, being drained either through manmade canals, via karstic phenomena, or other subsurface seepage.\n\nLake Neusiedl, in Austria and Hungary.\nLake Trasimeno, in Italy.\nFucine Lake, in Italy. Now drained.\nLake Velence, in Hungary.\nLake Prespa, between Albania, Greece and North Macedonia.\nRahasane turlough, the largest turlough in the Republic of Ireland.\nLaacher See, in Germany.\nThe Lasithi Plateau in Crete, Greece, is a high endorheic plateau.A few minor true endorheic lakes exist in Spain (e.g. Laguna de Gallocanta, Estany de Banyoles), Italy, Cyprus (Larnaca and Akrotiri salt lakes) and Greece.\n\n\n=== North America ===\n\nThe Great Basin is North America's largest and the world's ninth largest endorheic basin, covering nearly all of Nevada, much of Oregon and Utah, and portions of California, Idaho, and Wyoming. Notable enclosed basins include Death Valley, the hottest location on Earth; the Black Rock Desert and Bonneville Salt Flats, location of many of the new vehicle land speed records set since the 1930s; the Great Salt Lake, remnant of Lake Bonneville; and the Salton Sea.\nThe Valley of Mexico. In Pre-Columbian times, the Valley was substantially covered with five lakes, including Lake Texcoco, Lake Xochimilco, and Lake Chalco.\nGuzmán Basin, in northern Mexico and the southwestern United States.  The Mimbres River of New Mexico drains into this basin.\nLago de Atitlán, in the highlands of Guatemala.\nLago de Coatepeque, El Salvador.\nBolsón de Mapimí, in northern Mexico.\nWillcox Playa of southern Arizona.\nTulare Lake in the southern end of the San Joaquin Valley fed by the Kaweah and Tule Rivers plus southern distributaries of the Kings. Historically, in very wet years it would drain into the San Joaquin River. Agricultural development and irrigation diversions have left the lake dry.\nBuena Vista Lake at the southmost end of the San Joaquin Valley fed by the Kern River. Historically, in exceptionally wet years it would drain into Tulare Lake and then into the San Joaquin River. Agricultural development and irrigation diversions have left the lake dry.\nCrater Lake, in Oregon, a cryptorheic lake with subsurface drainage to the Wood River. It is filled directly by rain and snow, and has very little mineral or salt buildup.\nThe Great Divide Basin in Wyoming, a small endorheic basin that straddles the Continental Divide of the Americas.\nDevils Lake, in North Dakota.\nDevil's Lake, in Wisconsin, cryptorheic.\nTule Lake and the Lost River basin in California and Oregon.\nLittle Manitou Lake in Saskatchewan.\nOld Wives Lake, on the Laurentian Divide in Saskatchewan.\nQuill Lakes, in Saskatchewan.\nPakowki Lake, on the Laurentian Divide in Alberta.\nPaynes Prairie, in Florida. Since 1927, it has been drained by canal to the Atlantic Ocean via the River Styx.\nSpotted Lake, Osoyoos, British Columbia, Canada.\nFrame Lake in Yellowknife, capital of Canada's Northwest Territories.\nNew Mexico has a number of desert endorheic basins including:\nThe Tularosa Basin, a rift valley.\nZuni Salt Lake, a maar.\nThe Mimbres River Basin, in Grant County.\nLago Enriquillo on the island of Hispaniola in the Caribbean Sea.Many small lakes and ponds in North Dakota and the Northern Great Plains are endorheic; some of them have salt encrustations along their shores.\n\n\n=== South America ===\nLaguna del Carbón, in Gran Bajo de San Julián, Argentina – the lowest point in the Western and Southern hemispheres\nLake Mar Chiquita in Argentina.\nThe Altiplano includes a number of closed basins such as the Salar de Coipasa, and Titicaca–Poopó system.\nLake Valencia, in Venezuela.\nSalar de Atacama, in the Atacama Desert, Chile.\n\n\n== Ancient ==\nSome of Earth's ancient endorheic systems and lakes include:\n\nThe Black Sea, until its merger with the Mediterranean.\nThe Mediterranean Sea itself and all its tributary basins, during its Messinian desiccation (approximately five million years ago) as it became disconnected from the Atlantic Ocean.\nThe Orcadian Basin in Scotland during the Devonian period. Now identifiable as lacustrine sediments buried around and off the coast.\nLake Tanganyika in Africa. Currently high enough to connect to rivers entering the sea.\nLake Lahontan in North America.\nLake Bonneville in North America. Basin was not always endorheic; at times it overflowed through Red Rock Pass to the Snake River and the sea.\nLake Chewaucan in North America.\nTularosa Basin and Lake Cabeza de Vaca in North America. The basin was formerly much larger than at present, including the ancestral Rio Grande north of Texas, feeding a large lake area.\nEbro and Duero basins, draining most of northern Spain during the Neogene and perhaps Pliocene. Climate change and erosion of the Catalan coastal mountains, as well as deposition of alluvium in the terminal lake, allowed the Ebro basin to overflow into the sea during the middle-to-late Miocene.\n\n\n== See also ==\n\nBolson\nList of endorheic basins – Wikipedia list article\n\n\n== References ==\n\n\n== External links ==\nPrimer on endorheic lakes\nThe Silk Roads and Eurasian Geography\nGarciacastellanos, D. (2007). \"The role of climate during high plateau formation. Insights from numerical experiments\". Earth and Planetary Science Letters. 257 (3–4): 372–390. Bibcode:2007E&PSL.257..372G. doi:10.1016/j.epsl.2007.02.039. hdl:10261/67302."