"Steven William Moffat  (; born 18 November 1961) is a Scottish television writer and producer. He is best known for his work as showrunner, writer, and executive producer of two BBC One series: the science fiction television series Doctor Who and the contemporary crime drama television series Sherlock, based on Sir Arthur Conan Doyle's Sherlock Holmes stories. In 2015, Moffat was appointed Officer of the Order of the British Empire for his services to drama.\nBorn in Paisley, Scotland, Moffat, the son of a teacher, was formerly a teacher himself. His first television work was the teen drama series Press Gang. His first sitcom, Joking Apart, was inspired by the breakdown of his first marriage. Later in the 1990s, he wrote Chalk, inspired by his own experience as an English teacher. Moffat, a lifelong fan of Doctor Who, wrote the comedic sketch episode The Curse of Fatal Death for the Comic Relief charity telethon, which aired in early 1999. His early-2000s sitcom Coupling was based upon the development of his relationship with television producer Sue Vertue. \nIn March 2004, Moffat was announced as one of the writers for the revived Doctor Who TV series. He wrote six episodes under executive producer Russell T Davies, which aired from 2005 to 2008. Moffat's scripts during this era won him three Hugo Awards, a BAFTA Craft Award, and a BAFTA Cymru Award. Between episodes, he wrote and produced the modern-day drama series Jekyll, based on the novella Strange Case of Dr Jekyll and Mr Hyde. In May 2008, it was announced that Moffat would succeed Davies as showrunner, lead writer and executive producer of Doctor Who. Around the same time, he dropped his contract with film director Steven Spielberg for a film trilogy based on artist Hergé's character Tintin. Part of the lone script he wrote was used in Spielberg's film The Adventures of Tintin, eventually released in 2011.\nProduction on Sherlock's unaired pilot episode began in January 2009, while series 5 of Doctor Who—Moffat's first series as executive producer—began production the following July. Moffat won another Hugo for his writing as a Doctor Who showrunner, while his work as a Sherlock showrunner won him a BAFTA Craft Award and two Primetime Emmy Awards. In January 2016, Moffat announced he would be stepping down from running Doctor Who after six series. Sherlock's fourth and most recent series aired in January 2017. Moffat's last Doctor Who episode, \"Twice Upon a Time\", aired at Christmas in 2017. In March 2019, Moffat began production on Dracula, based on Bram Stoker's novel, which was commissioned by BBC One and Netflix and was first broadcast on BBC One in January 2020.\n\n\n== Early life ==\nMoffat was born in Paisley, Scotland, where he attended Camphill High School. He studied at the University of Glasgow, where he was involved with the student television station Glasgow University Student Television. After gaining a Master of Arts degree in English from Glasgow, he worked as a teacher for three and a half years at Cowdenknowes High School, Greenock. In the 1980s he wrote a play entitled War Zones (performed at the 1985 Glasgow Mayfest and the Edinburgh Festival Fringe) and a musical called Knifer. He is an atheist.\n\n\n== Career ==\n\n\n=== Press Gang ===\nMoffat's father Bill was a head teacher at Thorn Primary School in Johnstone, Renfrewshire; when the school was used for Harry Secombe's Highway in the late 1980s, Bill mentioned to the producers that he had an idea for a television series about a school newspaper. The producers asked for a sample script, to which Bill agreed on the condition his son Steven write it. Producer Sandra Hastie said that it was \"the best ever first script\" that she had read. The resulting series was titled Press Gang, starring Julia Sawalha and Dexter Fletcher, and it ran for five series on ITV between 1989 and 1993, with Moffat writing all forty-three episodes. The programme won a BAFTA award in its second series.During production of the second series of Press Gang, Moffat was experiencing an unhappy personal life as a result of the break-up of his first marriage. The producer was secretly phoning his friends at home to check on his state. His wife's new lover was represented in the episode \"The Big Finish?\" by the character Brian Magboy (Simon Schatzberger), a name inspired by Brian: Maggie's boy. Moffat brought in the character so that all sorts of unfortunate things would happen to him, such as having a typewriter dropped on his foot.\n\n\n=== Joking Apart ===\n\nBy 1990, Moffat had written two series of Press Gang, but the programme's high cost along with organisational changes at backers Central Independent Television cast its future in doubt. As Moffat wondered what to do next and worried about his future employment, Bob Spiers, Press Gang's primary director, suggested that he meet with producer Andre Ptaszynski to discuss writing a sitcom. Inspired by his experience working in education, Moffat's initial proposal was a programme similar to what became Chalk, a sitcom set in a school that eventually aired in 1997. During the pitch meeting at the Groucho Club, Ptaszynski realised that Moffat was talking passionately about his impending divorce and suggested that he write about that instead of a school sitcom. Taking Ptaszynski's advice, Moffat's new idea was about \"a sitcom writer whose wife leaves him\". Moffat wrote two series of Joking Apart, which was directed by Spiers and starred Robert Bathurst and Fiona Gillies. The show won the Bronze Rose of Montreux and was entered for the Emmys.He wrote three episodes of Murder Most Horrid, an anthology series of comedic tales starring Dawn French. The first (\"Overkill\", directed by Spiers) was identified by the BBC as a \"highlight\" of the series. His other two episodes were \"Dying Live\" (dir. Dewi Humphreys) and \"Elvis, Jesus and Zack\" (dir. Tony Dow).\n\n\n=== Doctor Who short fiction ===\nMoffat has been a fan of Doctor Who since childhood. In 1995, he contributed a segment to Paul Cornell's Virgin New Adventures novel Human Nature. His first solo Doctor Who work was a short story, \"Continuity Errors\", published in the 1996 Virgin Books anthology Decalog 3: Consequences.\n\n\n=== Chalk ===\nBetween marriages, Moffat claims that he \"shagged [his] way round television studios like a mechanical digger.\" According to an interview with The New York Times, Moffat met television producer Sue Vertue at the Edinburgh Television Festival in 1996. Vertue had been working for Tiger Aspect, a production company run by Peter Bennett-Jones. Bennett-Jones and his friend and former colleague Andre Ptaszynski, who had worked with Moffat on Joking Apart, told Moffat and Vertue that each fancied the other. A relationship blossomed and they left their respective production companies to join Hartswood Films, run by Beryl Vertue, Sue's mother. The couple have two children together: Joshua and Louis Oliver.Before Moffat left Pola Jones for Hartswood, Ptaszynski produced Chalk, the series that the writer had pitched to him at the beginning of the decade. Set in a comprehensive school and starring David Bamber as manic deputy head Eric Slatt and Nicola Walker as Suzy Travis, the show was based on Moffat's three years as an English teacher. The studio audience responded so positively to the first series when it was taped that the BBC commissioned a second series before the first had aired. However, it was met less enthusiastically by critics upon transmission in February 1997, who had taken exception to the BBC's publicity department comparing the show to the highly respected Fawlty Towers. In an interview in the early 2000s, Moffat refuses to even name the series, joking that he might get attacked in the street.After production wrapped on Chalk in 1997, Moffat announced to the cast that he was marrying Vertue.\n\n\n=== The Curse of Fatal Death ===\nIn late 1998, Moffat was approached by Vertue, a producer of Comic Relief, to write a comedic sketch based on the Doctor Who TV series to be aired across Comic Relief's 1999 telethon in several parts on BBC One. The sketch, The Curse of Fatal Death, was written from December 1998 to February 1999, recorded in February, and broadcast in March.\n\n\n=== Coupling ===\nWhen Vertue asked Moffat for a sitcom, he decided to base it around the evolution of their own relationship. Coupling, produced by Vertue, was first broadcast on BBC Two in 2000. Moffat's first son Joshua was born around 2000, and his second son Louis was born around 2002. Though he had no ambition to be a father, he instantly loved his sons when they were delivered. Coupling ran for four series totalling 28 episodes until 2004, all written by Moffat. He also wrote the original, unbroadcast pilot episode for the U.S. version, also titled Coupling, although this was less successful and was cancelled after four episodes on the NBC network. Moffat blamed its failure on an unprecedented level of network interference.\n\n\n=== Doctor Who in the Russell T Davies era and Jekyll ===\nIn December 2003, Moffat received an email offering him to write for Doctor Who, following the announcement of the revival of the series in September. His involvement with the series was announced in March 2004. He wrote six episodes under executive producer Russell T Davies for the 2005 through 2008 series, which were produced from December 2004 to March 2008. Moffat won the Hugo Award for Best Dramatic Presentation, Short Form for the two-part story \"The Empty Child\" and \"The Doctor Dances\" (both 2005), as well as the episodes \"The Girl in the Fireplace\" (2006) and \"Blink\" (2007). \"Blink\" also gained him the BAFTA Craft Award for Best Writer, and a BAFTA Cymru Award for Best Screenwriter.Between Doctor Who episodes, Moffat wrote and produced Jekyll, a modern-day drama series based on the Robert Louis Stevenson novella Strange Case of Dr Jekyll and Mr Hyde, meaning he nearly missed out on writing for the 2007 series of Doctor Who. Written late in the series' run, he quickly based \"Blink\" on his previously-written Doctor Who short story from 2005, \"What I Did on My Christmas Holidays by Sally Sparrow\", as a \"a desperate way to keep a toehold\" in the 2007 series. Jekyll aired on BBC One from June 2007.In March 2008, Davies said that he often rewrote scripts from other writers, but did not \"touch a word\" of Moffat's episodes.\n\n\n=== Doctor Who and Sherlock ===\nIn October 2007, Reuters reported that Moffat would be scripting a trilogy of films based on Belgian artist Hergé's character Tintin for directors Steven Spielberg and Peter Jackson.In May 2008, the BBC announced that Moffat would be succeeding Davies as lead writer and executive producer of Doctor Who for the show's fifth series, to be broadcast in 2010, although Davies had initiated discussions with Moffat regarding this as far back as July 2007. He had intended to complete work on the Tintin trilogy before resuming work on Doctor Who, but delays caused by the intervening 2007–2008 Writers Guild of America strike meant he could only submit part of a script for the first film. Moffat told The Guardian in 2012 that Spielberg was \"lovely\" about his decision to walk away from his three-film Tintin contract to return to Doctor Who. The script for the first film in the trilogy, The Adventures of Tintin (released in 2011), was completed by Edgar Wright and Joe Cornish, with a part of Moffat's script used in the film.During their journeys from London to Cardiff for Doctor Who, Moffat and writer Mark Gatiss conceived a contemporary update of author Sir Arthur Conan Doyle's Sherlock Holmes stories called Sherlock. Vertue advised them to work on the project rather than spend years discussing it. A 60-minute pilot, written by Moffat, was filmed in January 2009. The pilot was not aired but a three-episode series of 90-minute television films produced by Hartswood was commissioned.Production on Moffat's time in charge of Doctor Who began in July 2009. As executive producer and lead writer, he was significantly involved in casting both Matt Smith as the Eleventh Doctor and Peter Capaldi as the Twelfth Doctor. As Doctor Who showrunner, Moffat won another Hugo Award for Best Dramatic Presentation, Short Form for writing the two-part story \"The Pandorica Opens\" and \"The Big Bang\" (both 2010). As showrunner for Sherlock , he won a BAFTA Craft Award for Best Writer for \"A Scandal in Belgravia\" (2012), a Primetime Emmy Award for Outstanding Writing for a Miniseries, Movie or a Dramatic Special for \"His Last Vow\" (2014), and a Primetime Emmy Award for Outstanding Television Movie for executive producing \"The Abominable Bride\" (2016).In June 2015, Moffat was appointed an Officer of the Order of the British Empire for his services to drama. In January 2016, Moffat announced he was stepping down as Doctor Who lead writer and executive producer after the 2017 series, his sixth series as showrunner, with Chris Chibnall succeeding him at the start of the eleventh series for broadcast in 2018. The fourth and most recent series of Sherlock finished production around August 2016, and aired in January 2017. \"Twice Upon a Time\"—the 2017 Doctor Who Christmas special, and Moffat's last episode as lead writer and showrunner—finished production in July 2017 and broadcast on Christmas that year.\n\n\n=== Dracula ===\nIn October 2018, BBC One and Netflix officially commissioned Dracula, a TV series written and created by Moffat and Gatiss based on Bram Stoker's 1897 novel Dracula. In March 2019, Moffat revealed that the first night of production was about to start. The series began airing New Year's Day 2020, and was broadcast over three consecutive days. The three episodes were released on Netflix on 4 January 2020.\n\n\n=== The Unfriend ===\nOn 13 February 2020, Chichester Festival Theatre announced that the play The Unfriend, written by Moffat, will have its world premiere as part of the 2020 Festival Theatre season, running from 17 July to 22 August. It will be directed by Mark Gatiss and feature Amanda Abbington, Frances Barber and Reece Shearsmith.\n\n\n== Writing credits ==\n\n\n=== Television ===\n\n\n=== Film ===\n\n\n=== Stage ===\n\n\n== Awards and nominations ==\n\n\n== Novels ==\nMoffat, Steven (2018). Doctor Who: The Day of the Doctor. ISBN 978-1-78594-329-4.\n\n\n== See also ==\nFilms with screenplays by Steven Moffat\n\n\n== References ==\n\n\n== External links ==\nSteven Moffat at IMDb\nSteven Moffat biography at the Hartswood Films website.\nAudio interview with Steven Moffat at the Doctor Who series two press launch (BBC Wiltshire)"