"American Pastoral is a Philip Roth novel published in 1997 concerning Seymour \"Swede\" Levov, a successful Jewish American businessman and former high school star athlete from Newark, New Jersey. Levov's happy and conventional upper middle class life is ruined by the domestic social and political turmoil of the 1960s during the presidency of Lyndon B. Johnson, which in the novel is described as a manifestation of the \"indigenous American berserk\".\nThe framing device in American Pastoral is a 45th high school reunion attended by frequent Roth alter ego Nathan Zuckerman, who is the narrator. At the reunion, in 1995, Zuckerman meets former classmate Jerry Levov who describes to him the tragic derailment of the life of his recently deceased older brother, Seymour \"Swede\" Levov. After Seymour's teenage daughter Merry, in 1968, set off a bomb in protest against American involvement in the Vietnam War, killing a bystander, and subsequently went into hiding, Seymour remained traumatized for the rest of his life. The rest of the novel consists of Zuckerman's posthumous recreation of Seymour's life, based on Jerry's revelation, a few newspaper clippings, and Zuckerman's own impressions after two brief run-ins with \"the Swede,\" in 1985 and shortly before Seymour's death from prostate cancer, at age 68, in 1995. In these encounters, which take place early in the novel, Zuckerman learns that Seymour has remarried and has three young sons, but Seymour's daughter Merry is never mentioned. In Zuckerman's reimagining of Seymour's life, this second marriage has no part; it ends in 1973 with Watergate unraveling on TV while the previous lives of the protagonists completely disintegrate.\nAmerican Pastoral won the Pulitzer Prize in 1998 and was included in TIME's List of the 100 Best Novels. The film rights to it were later optioned, though a film version was not made until 2016. In 2006, it was one of the runners-up to Toni Morrison's Beloved, in the \"What is the Best Work of American Fiction of the Last 25 Years?\" contest held by the New York Times Book Review.\n\n\n== Plot ==\nSeymour Irving Levov is born and raised in the Weequahic section of Newark, New Jersey, in 1927 as the elder son of a successful Jewish American glove manufacturer, Lou Levov, and his wife Sylvia. Called \"the Swede\" because of his anomalous blond hair, blue eyes and Nordic good looks, Seymour is a star athlete in high school, a two-year veteran of the Marine Corps, and the narrator Nathan Zuckerman's idol and hero. Zuckerman and Seymour's younger brother, Jerry—who grows into a curmudgeonly, irascible heart surgeon with little empathy for the Swede—are schoolmates and close friends. The Swede eventually takes over his father's glove factory and marries Dawn Dwyer, a former beauty queen from nearby Elizabeth, whom he met in college.\nSeymour establishes what he believes to be a perfect American life with a beloved wife and daughter, a satisfying business career, and a magnificent house in the idyllic hamlet of Old Rimrock. Yet, as the Vietnam War and racial unrest wrack the country and destroy inner-city Newark, his precocious teenage daughter Meredith (\"Merry\"), beset by an emotionally debilitating stutter and outraged by the war, becomes increasingly radical in her beliefs. In February 1968, Merry plants a bomb in the Old Rimrock post office, which kills a bystander; she goes into permanent hiding. Seymour finds Merry five years later, living in deplorable conditions in inner-city Newark. During this reunion, Merry reveals that she was responsible for several more bombings, killing three more people. Although Merry informs him that her actions were deliberate, Seymour decides to keep their meeting a secret, believing Merry has been manipulated by an unknown political group and a mysterious woman named Rita Cohen.\nAt a dinner party, Seymour discovers that his wife Dawn has been having an affair with Princeton-educated architect William Orcutt III, for whom she undergoes a facelift. Seymour then realizes that his wife is planning to leave him for Orcutt. It is revealed that Seymour himself previously had a short-term affair with Merry's speech therapist, Sheila Salzman, and that she and her husband Shelly hid Merry in their home after the post office bombing. Seymour sadly concludes that everyone he knows may have a veneer of respectability, but each engages in subversive behavior and that he cannot understand the truth about anyone based upon the conduct they outwardly display. He is forced to see the truth about the chaos and discord rumbling beneath the \"American pastoral\", which has brought about profound personal and societal changes he no longer can ignore. Simultaneously, the dinner party underscores the fact that no one ever truly understands the hearts of other people.\n\n\n== Historical setting ==\nThe novel alludes extensively to the social upheavals of the late 1960s and early 1970s. It refers to the 1967 Newark riots, the Watergate scandal, the sexual revolution and Deep Throat, the code name of the secret source in the Watergate scandal and the title of a 1972 pornographic film. In the novel's final scene, both the Watergate scandal and the pornographic film are discussed at a dinner party during which the first marriage of \"the Swede\" begins to unravel when he discovers that his wife is having an affair. The novel also alludes to the rhetoric of revolutionary violence of the radical fringe of the New Left and the Black Panthers, the trial of the leftist African-American activist Angela Davis, and the bombings carried out between 1969 and 1973 by the Weathermen and other radicals opposing the US military intervention in Vietnam. The novel quotes from Frantz Fanon's A Dying Colonialism, which Zuckerman imagines as one of the texts that inspires Merry to carry out her bombing of a local post office.\nIn the novel, Merry's bombing takes place in February 1968, during the presidency of Lyndon B. Johnson, after which she flees her parental home. By that time she has had a \"Weathermen motto\" tacked up in her room for many months. In reality this would have been impossible. The Weathermen group was, in fact, formed in the summer of 1969. The lines of the \"motto\" which appear in the novel (\"We are against everything that is good and decent in honky America. We will loot and burn and destroy. We are the incubation of your mothers' nightmares.\") allude to a speech by John Jacobs at a Weathermen \"war council\" in December 1969.\nThe inspiration for the Levov character was a real person: Seymour \"Swede\" Masin, a legendary all-around Jewish athlete who, like the Levov character, attended Newark's Weequahic High School. Like the book's protagonist, Swede Masin was revered and idolized by many local middle-class Jews. Both \"Swedes\" were tall and had distinctively blond hair and blue eyes, which stood out among the typically dark-haired, dark-complexioned local residents. Both attended a teachers' college in nearby East Orange; both married out of their faith; both served in the military and, upon their return, both moved to the suburbs of Newark.\nAmerican Pastoral was a scrupulously-researched book; Roth traveled to Gloversville, New York to learn about the glove-making industry and interviewed Yolande Fox, the winner of the 1951 Miss America pageant, while developing the character of Dawn Dwyer. Roth later said, of his conversations with Fox, \"She was very smart, very funny....She just opened up whole ideas for me that I couldn't have had on my own.\"\n\n\n== Film adaptation ==\n\nEwan McGregor directed and starred in the film along with Jennifer Connelly and Dakota Fanning. Filming began in Pittsburgh, Pennsylvania in September 2015, and the film premiered at the Toronto International Film Festival in September 2016.\n\n\n== See also ==\nPastoral\nThe American Dream\nCounterculture of the 1960s\n\n\n== References ==\n\n\n== External links ==\nPhotos of the first edition of American Pastoral\nAmerican Pastoral, reviewed by Ted Gioia (The New Canon)"