"American Pastoral is a Philip Roth novel published in 1997 concerning Seymour \"Swede\" Levov, a successful Jewish American businessman and former high school star athlete from Newark, New Jersey. Levov's happy and conventional upper middle class life is ruined by the domestic social and political turmoil of the 1960s during the presidency of Lyndon B. Johnson, which in the novel is described as a manifestation of the \"indigenous American berserk\".\nThe framing device in American Pastoral is a 45th high school reunion attended by frequent Roth alter ego Nathan Zuckerman, who is the narrator. At the reunion, in 1995, Zuckerman meets former classmate Jerry Levov who describes to him the tragic derailment of the life of his recently deceased older brother, Seymour \"Swede\" Levov. After Seymour's teenage daughter Merry, in 1968, set off a bomb in protest against American involvement in the Vietnam War, killing a bystander, and subsequently went into hiding, Seymour remained traumatized for the rest of his life. The rest of the novel consists of Zuckerman's posthumous recreation of Seymour's life, based on Jerry's revelation, a few newspaper clippings, and Zuckerman's own impressions after two brief run-ins with \"the Swede,\" in 1985 and shortly before Seymour's death from prostate cancer, at age 68, in 1995. In these encounters, which take place early in the novel, Zuckerman learns that Seymour has remarried and has three young sons, but Seymour's daughter Merry is never mentioned. In Zuckerman's reimagining of Seymour's life, this second marriage has no part; it ends in 1973 with Watergate unraveling on TV while the previous lives of the protagonists completely disintegrate.\nAmerican Pastoral won the Pulitzer Prize in 1998 and was included in TIME's List of the 100 Best Novels. The film rights to it were later optioned, though a film version was not made until 2016. In 2006, it was one of the runners-up to Toni Morrison's Beloved, in the \"What is the Best Work of American Fiction of the Last 25 Years?\" contest held by the New York Times Book Review.\n\n"