"Demosthenes (; Greek: Δημοσθένης, romanized: Dēmosthénēs; Attic Greek: [dɛːmosˈtʰenɛːs]; 384 – 12 October 322 BC) was a Greek statesman and orator of ancient Athens. His orations constitute a significant expression of contemporary Athenian intellectual prowess and provide an insight into the politics and culture of ancient Greece during the 4th century BC. Demosthenes learned rhetoric by studying the speeches of previous great orators. He delivered his first judicial speeches at the age of 20, in which he argued effectively to gain from his guardians what was left of his inheritance. For a time, Demosthenes made his living as a professional speech-writer (logographer) and a lawyer, writing speeches for use in private legal suits.\nDemosthenes grew interested in politics during his time as a logographer, and in 354 BC he gave his first public political speeches. He went on to devote his most productive years to opposing Macedon's expansion. He idealized his city and strove throughout his life to restore Athens' supremacy and motivate his compatriots against Philip II of Macedon. He sought to preserve his city's freedom and to establish an alliance against Macedon, in an unsuccessful attempt to impede Philip's plans to expand his influence southward by conquering all the other Greek states.\nAfter Philip's death, Demosthenes played a leading part in his city's uprising against the new king of Macedonia, Alexander the Great. However, his efforts failed and the revolt was met with a harsh Macedonian reaction. To prevent a similar revolt against his own rule, Alexander's successor in this region, Antipater, sent his men to track Demosthenes down. Demosthenes took his own life, to avoid being arrested by Archias of Thurii, Antipater's confidant.\nThe Alexandrian Canon compiled by Aristophanes of Byzantium and Aristarchus of Samothrace recognised Demosthenes as one of the ten greatest Attic orators and logographers. Longinus likened Demosthenes to a blazing thunderbolt and argued that he \"perfected to the utmost the tone of lofty speech, living passions, copiousness, readiness, speed.\" Quintilian extolled him as lex orandi (\"the standard of oratory\"). Cicero said of him that inter omnis unus excellat (\"he stands alone among all the orators\"), and also acclaimed him as \"the perfect orator\" who lacked nothing.\n\n\n== Early years and personal life ==\n\n\n=== Family and personal life ===\n\nDemosthenes was born in 384 BC, during the last year of the 98th Olympiad or the first year of the 99th Olympiad. His father—also named Demosthenes—who belonged to the local tribe, Pandionis, and lived in the deme of Paeania in the Athenian countryside, was a wealthy sword-maker. Aeschines, Demosthenes' greatest political rival, maintained that his mother Kleoboule was a Scythian by blood—an allegation disputed by some modern scholars. Demosthenes was orphaned at the age of seven. Although his father provided for him well, his legal guardians, Aphobus, Demophon and Therippides, mishandled his inheritance.Demosthenes started to learn rhetoric because he wished to take his guardians to court and because he was of \"delicate physique\" and could not receive gymnastic education, which was customary. In Parallel Lives, Plutarch states that Demosthenes built an underground study where he practised speaking and shaving one half of his head so that he could not go out in public. Plutarch also states that he had \"an inarticulate and stammering pronunciation\" that he overcame by speaking with pebbles in his mouth and by repeating verses when running or out of breath. He also practised speaking in front of a large mirror.As soon as Demosthenes came of age in 366 BC, he demanded his guardians render an account of their management. According to Demosthenes, the account revealed the misappropriation of his property. Although his father left an estate of nearly fourteen talents (equivalent to about 220 years of a labourer's income at standard wages, or 11 million dollars in terms of median U.S. annual incomes). Demosthenes asserted his guardians had left nothing \"except the house, and fourteen slaves and thirty silver minae\" (30 minae = ½ talent). At the age of 20 Demosthenes sued his trustees to recover his patrimony and delivered five orations: three Against Aphobus during 363 and 362 BC and two Against Onetor during 362 and 361 BC. The courts fixed Demosthenes' damages at ten talents. When all the trials came to an end, he only succeeded in retrieving a portion of his inheritance.According to Pseudo-Plutarch, Demosthenes was married once. The only information about his wife, whose name is unknown, is that she was the daughter of Heliodorus, a prominent citizen. Demosthenes also had a daughter, \"the only one who ever called him father\", according to Aeschines in a trenchant remark. His daughter died young and unmarried a few days before Philip II's death.In his speeches, Aeschines uses pederastic relations of Demosthenes as a means to attack him. In the case of Aristion, a youth from Plataea who lived for a long time in Demosthenes' house, Aeschines mocks the \"scandalous\" and \"improper\" relation. In another speech, Aeschines brings up the pederastic relation of his opponent with a boy called Cnosion. The slander that Demosthenes' wife also slept with the boy suggests that the relationship was contemporary with his marriage. Aeschines claims that Demosthenes made money out of young rich men, such as Aristarchus, the son of Moschus, whom he allegedly deceived with the pretence that he could make him a great orator. Apparently, while still under Demosthenes' tutelage, Aristarchus killed and mutilated a certain Nicodemus of Aphidna. Aeschines accused Demosthenes of complicity in the murder, pointing out that Nicodemus had once pressed a lawsuit accusing Demosthenes of desertion. He also accused Demosthenes of having been such a bad erastes to Aristarchus so as not even to deserve the name. His crime, according to Aeschines, was to have betrayed his eromenos by pillaging his estate, allegedly pretending to be in love with the youth so as to get his hands on the boy's inheritance. Nevertheless, the story of Demosthenes' relations with Aristarchus is still regarded as more than doubtful, and no other pupil of Demosthenes is known by name.\n\n\n=== Education ===\n\nBetween his coming of age in 366 BC and the trials that took place in 364 BC, Demosthenes and his guardians negotiated acrimoniously but were unable to reach an agreement, for neither side was willing to make concessions. At the same time, Demosthenes prepared himself for the trials and improved his oratory skill. According to a story repeated by Plutarch, when Demosthenes was an adolescent, his curiosity was noticed by the orator Callistratus, who was then at the height of his reputation, having just won a case of considerable importance. According to Friedrich Nietzsche, a German philologist and philosopher, and Constantine Paparrigopoulos, a major modern Greek historian, Demosthenes was a student of Isocrates; according to Cicero, Quintillian and the Roman biographer Hermippus, he was a student of Plato. Lucian, a Roman-Syrian rhetorician and satirist, lists the philosophers Aristotle, Theophrastus and Xenocrates among his teachers. These claims are nowadays disputed. According to Plutarch, Demosthenes employed Isaeus as his master in rhetoric, even though Isocrates was then teaching this subject, either because he could not pay Isocrates the prescribed fee or because Demosthenes believed Isaeus' style better suited a vigorous and astute orator such as himself. Curtius, a German archaeologist and historian, likened the relation between Isaeus and Demosthenes to \"an intellectual armed alliance\".It has also been said that Demosthenes paid Isaeus 10,000 drachmae (somewhat over 1½ talents) on the condition that Isaeus withdraw from a school of rhetoric he had opened and instead devote himself wholly to Demosthenes, his new pupil. Another version credits Isaeus with having taught Demosthenes without charge. According to Sir Richard C. Jebb, a British classical scholar, \"the intercourse between Isaeus and Demosthenes as teacher and learner can scarcely have been either very intimate or of very long duration\". Konstantinos Tsatsos, a Greek professor and academician, believes that Isaeus helped Demosthenes edit his initial judicial orations against his guardians. Demosthenes is also said to have admired the historian Thucydides. In the Illiterate Book-Fancier, Lucian mentions eight beautiful copies of Thucydides made by Demosthenes, all in Demosthenes' own handwriting. These references hint at his respect for a historian he must have assiduously studied.\n\n\n=== Speech training ===\nAccording to Plutarch, when Demosthenes first addressed himself to the people, he was derided for his strange and uncouth style, \"which was cumbered with long sentences and tortured with formal arguments to a most harsh and disagreeable excess\". Some citizens, however, discerned his talent. When he first left the ekklesia (the Athenian Assembly) disheartened, an old man named Eunomus encouraged him, saying his diction was very much like that of Pericles. Another time, after the ekklesia had refused to hear him and he was going home dejected, an actor named Satyrus followed him and entered into a friendly conversation with him.As a boy Demosthenes had a speech impairment: Plutarch refers to a weakness in his voice of \"a perplexed and indistinct utterance and a shortness of breath, which, by breaking and disjointing his sentences much obscured the sense and meaning of what he spoke.\" There are problems in Plutarch's account, however, and it is probable that Demosthenes actually suffered from rhotacism, mispronouncing ρ (r) as λ (l). Aeschines taunted him and referred to him in his speeches by the nickname \"Batalus\", apparently invented by Demosthenes' pedagogues or by the little boys with whom he was playing—which corresponded to how someone with that variety of rhotacism would pronounce \"Battaros,\" the name of a legendary Libyan king who spoke quickly and in a disordered fashion. Demosthenes undertook a disciplined programme to overcome his weaknesses and improve his delivery, including diction, voice and gestures. According to one story, when he was asked to name the three most important elements in oratory, he replied \"Delivery, delivery and delivery!\" It is unknown whether such vignettes are factual accounts of events in Demosthenes' life or merely anecdotes used to illustrate his perseverance and determination.\n\n\n== Career ==\n\n\n=== Legal career ===\nTo make his living, Demosthenes became a professional litigant, both as a \"logographer\" (λογογράφος, logographos), writing speeches for use in private legal suits, and as an advocate (συνήγορος, sunégoros) speaking on another's behalf. He seems to have been able to manage any kind of case, adapting his skills to almost any client, including wealthy and powerful men. It is not unlikely that he became a teacher of rhetoric and that he brought pupils into court with him. However, though he probably continued writing speeches throughout his career, he stopped working as an advocate once he entered the political arena.\nJudicial oratory had become a significant literary genre by the second half of the fifth century, as represented in the speeches of Demosthenes' predecessors, Antiphon and Andocides. Logographers were a unique aspect of the Athenian justice system: evidence for a case was compiled by a magistrate in a preliminary hearing and litigants could present it as they pleased within set speeches; however, witnesses and documents were popularly mistrusted (since they could be secured by force or bribery), there was little cross-examination during the trial, there were no instructions to the jury from a judge, no conferencing between jurists before voting, the juries were huge (typically between 201 and 501 members), cases depended largely on questions of probable motive, and notions of natural justice were felt to take precedence over written law—conditions that favoured artfully constructed speeches.Since Athenian politicians were often indicted by their opponents, there was not always a clear distinction between \"private\" and \"public\" cases, and thus a career as a logographer opened the way for Demosthenes to embark on his political career. An Athenian logographer could remain anonymous, which enabled him to serve personal interests, even if it prejudiced the client. It also left him open to allegations of malpractice. Thus for example Aeschines accused Demosthenes of unethically disclosing his clients' arguments to their opponents; in particular, that he wrote a speech for Phormion (350 BC), a wealthy banker, and then communicated it to Apollodorus, who was bringing a capital charge against Phormion. Plutarch much later supported this accusation, stating that Demosthenes \"was thought to have acted dishonourably\" and he also accused Demosthenes of writing speeches for both sides. It has often been argued that the deception, if there was one, involved a political quid pro quo, whereby Apollodorus secretly pledged support for unpopular reforms that Demosthenes was pursuing in the greater, public interest (i.e. the diversion of Theoric Funds to military purposes).\n\n\n=== Early political activity ===\n\nDemosthenes was admitted to his δῆμος (dêmos) as a citizen with full rights probably in 366 BC, and he soon demonstrated an interest in politics. In 363 and 359 BC, he assumed the office of the trierarch, being responsible for the outfitting and maintenance of a trireme. He was among the first ever volunteer trierarchs in 357 BC, sharing the expenses of a ship called Dawn, for which the public inscription still survives. In 348 BC, he became a choregos, paying the expenses of a theatrical production.\nBetween 355 and 351 BC, Demosthenes continued practising law privately while he was becoming increasingly interested in public affairs. During this period, he wrote Against Androtion and Against Leptines, two fierce attacks on individuals who attempted to repeal certain tax exemptions. In Against Timocrates and Against Aristocrates, he advocated eliminating corruption. All these speeches, which offer early glimpses of his general principles on foreign policy, such as the importance of the navy, of alliances and of national honour, are prosecutions (γραφὴ παρανόμων, graphē paranómōn) against individuals accused of illegally proposing legislative texts.In Demosthenes' time, different political goals developed around personalities. Instead of electioneering, Athenian politicians used litigation and defamation to remove rivals from government processes. Often they indicted each other for breaches of the statute laws (graphē paranómōn), but accusations of bribery and corruption were ubiquitous in all cases, being part of the political dialogue. The orators often resorted to \"character assassination\" tactics (δῐᾰβολή, diabolḗ; λοιδορία, loidoría), both in the courts and in the Assembly. The rancorous and often hilariously exaggerated accusations, satirised by Old Comedy, were sustained by innuendo, inferences about motives, and a complete absence of proof; as J. H. Vince states \"there was no room for chivalry in Athenian political life\". Such rivalry enabled the demos (\"citizen-body\") to reign supreme as judge, jury and executioner. Demosthenes was to become fully engaged in this kind of litigation and he was also to be instrumental in developing the power of the Areopagus to indict individuals for treason, invoked in the ekklesia by a process called ἀπόφασις (apóphasis).In 354 BC, Demosthenes delivered his first political oration, On the Navy, in which he espoused moderation and proposed the reform of the symmoriai (boards) as a source of funding for the Athenian fleet. In 352 BC, he delivered For the Megalopolitans and, in 351 BC, On the Liberty of the Rhodians. In both speeches he opposed Eubulus, the most powerful Athenian statesman of the period 355 to 342 BC. The latter was no pacifist but came to eschew a policy of aggressive interventionism in the internal affairs of the other Greek cities. Contrary to Eubulus' policy, Demosthenes called for an alliance with Megalopolis against Sparta or Thebes, and for supporting the democratic faction of the Rhodians in their internal strife. His arguments revealed his desire to articulate Athens' needs and interests through a more activist foreign policy, wherever opportunity might provide.Although his early orations were unsuccessful and reveal a lack of real conviction and of coherent strategic and political prioritisation, Demosthenes established himself as an important political personality and broke with Eubulus' faction, of which a prominent member was Aeschines. He thus laid the foundations for his future political successes and for becoming the leader of his own \"party\" (the issue of whether the modern concept of political parties can be applied in the Athenian democracy is hotly disputed among modern scholars).\n\n\n=== Confrontation with Philip II ===\n\n\n==== First Philippic and the Olynthiacs (351–349 BC) ====\n\nMost of Demosthenes' major orations were directed against the growing power of King Philip II of Macedon. Since 357 BC, when Philip seized Amphipolis and Pydna, Athens had been formally at war with the Macedonians. In 352 BC, Demosthenes characterised Philip as the very worst enemy of his city; his speech presaged the fierce attacks that Demosthenes would launch against the Macedonian king over the ensuing years. A year later he criticised those dismissing Philip as a person of no account and warned that he was as dangerous as the king of Persia.In 352 BC, Athenian troops successfully opposed Philip at Thermopylae, but the Macedonian victory over the Phocians at the Battle of Crocus Field shook Demosthenes. In 351 BC, Demosthenes felt strong enough to express his view concerning the most important foreign policy issue facing Athens at that time: the stance his city should take towards Philip. According to Jacqueline de Romilly, a French philologist and member of the Académie française, the threat of Philip would give Demosthenes' stances a focus and a raison d'être. Demosthenes saw the King of Macedon as a menace to the autonomy of all Greek cities and yet he presented him as a monster of Athens's own creation; in the First Philippic he reprimanded his fellow citizens as follows: \"Even if something happens to him, you will soon raise up a second Philip [...]\".The theme of the First Philippic (351–350 BC) was preparedness and the reform of the Theoric fund, a mainstay of Eubulus' policy. In his rousing call for resistance, Demosthenes asked his countrymen to take the necessary action and asserted that \"for a free people there can be no greater compulsion than shame for their position\". He thus provided for the first time a plan and specific recommendations for the strategy to be adopted against Philip in the north. Among other things, the plan called for the creation of a rapid-response force, to be created cheaply with each ὁπλῑ́της (hoplī́tēs) to be paid only ten drachmas per month (two obols per day), which was less than the average pay for unskilled labourers in Athens—implying that the hoplite was expected to make up the deficiency in pay by looting.\nFrom this moment until 341 BC, all of Demosthenes' speeches referred to the same issue, the struggle against Philip. In 349 BC, Philip attacked Olynthus, an ally of Athens. In the three Olynthiacs, Demosthenes criticised his compatriots for being idle and urged Athens to help Olynthus. He also insulted Philip by calling him a \"barbarian\". Despite Demosthenes' strong advocacy, the Athenians would not manage to prevent the falling of the city to the Macedonians. Almost simultaneously, probably on Eubulus' recommendation, they engaged in a war in Euboea against Philip, which ended in a stalemate.\n\n\n==== Case of Meidias (348 BC) ====\n\nIn 348 BC a peculiar event occurred: Meidias, a wealthy Athenian, publicly slapped Demosthenes, who was at the time a choregos at the Greater Dionysia, a large religious festival in honour of the god Dionysus. Meidias was a friend of Eubulus and supporter of the unsuccessful excursion in Euboea. He also was an old enemy of Demosthenes; in 361 BC he had broken violently into his house, with his brother Thrasylochus, to take possession of it.\nDemosthenes decided to prosecute his wealthy opponent and wrote the judicial oration Against Meidias. This speech gives valuable information about Athenian law at the time and especially about the Greek concept of hybris (aggravated assault), which was regarded as a crime not only against the city but against society as a whole. He stated that a democratic state perishes if the rule of law is undermined by wealthy and unscrupulous men, and that the citizens acquire power and authority in all state affairs due \"to the strength of the laws\". There is no consensus among scholars either on whether Demosthenes finally delivered Against Meidias or on the veracity of Aeschines' accusation that Demosthenes was bribed to drop the charges.\n\n\n==== Peace of Philocrates (347–345 BC) ====\n\nIn 348 BC, Philip conquered Olynthus and razed it to the ground; then conquered the entire Chalcidice and all the states of the Chalcidic federation that Olynthus had once led. After these Macedonian victories, Athens sued for peace with Macedon. Demosthenes was among those who favoured compromise. In 347 BC, an Athenian delegation, comprising Demosthenes, Aeschines and Philocrates, was officially sent to Pella to negotiate a peace treaty. In his first encounter with Philip, Demosthenes is said to have collapsed from fright.The ekklesia officially accepted Philip's harsh terms, including the renouncement of their claim to Amphipolis. However, when an Athenian delegation arrived at Pella to put Philip under oath, which was required to conclude the treaty, he was campaigning abroad. He expected that he would hold safely any Athenian possessions that he might seize before the ratification. Being very anxious about the delay, Demosthenes insisted that the embassy should travel to the place where they would find Philip and swear him in without delay. Despite his suggestions, the Athenian envoys, including himself and Aeschines, remained in Pella, until Philip successfully concluded his campaign in Thrace.Philip swore to the treaty, but he delayed the departure of the Athenian envoys, who had yet to receive the oaths from Macedon's allies in Thessaly and elsewhere. Finally, peace was sworn at Pherae, where Philip accompanied the Athenian delegation, after he had completed his military preparations to move south. Demosthenes accused the other envoys of venality and of facilitating Philip's plans with their stance. Just after the conclusion of the Peace of Philocrates, Philip passed Thermopylae, and subdued Phocis; Athens made no move to support the Phocians. Supported by Thebes and Thessaly, Macedon took control of Phocis' votes in the Amphictyonic League, a Greek religious organisation formed to support the greater temples of Apollo and Demeter. Despite some reluctance on the part of the Athenian leaders, Athens finally accepted Philip's entry into the Council of the League. Demosthenes was among those who adopted a pragmatic approach, and recommended this stance in his oration On the Peace. For Edmund M. Burke, this speech heralds a maturation in Demosthenes' career: after Philip's successful campaign in 346 BC, the Athenian statesman realised that, if he was to lead his city against the Macedonians, he had \"to adjust his voice, to become less partisan in tone\".\n\n\n==== Second and Third Philippics (344–341 BC) ====\n\nIn 344 BC Demosthenes travelled to the Peloponnese, to detach as many cities as possible from Macedon's influence, but his efforts were generally unsuccessful. Most of the Peloponnesians saw Philip as the guarantor of their freedom and sent a joint embassy to Athens to express their grievances against Demosthenes' activities. In response, Demosthenes delivered the Second Philippic, a vehement attack against Philip. In 343 BC Demosthenes delivered On the False Embassy against Aeschines, who was facing a charge of high treason. Nonetheless, Aeschines was acquitted by the narrow margin of thirty votes by a jury which may have numbered as many as 1,501.In 343 BC, Macedonian forces were conducting campaigns in Epirus and, in 342 BC, Philip campaigned in Thrace. He also negotiated with the Athenians an amendment to the Peace of Philocrates. When the Macedonian army approached Chersonese (now known as the Gallipoli Peninsula), an Athenian general named Diopeithes ravaged the maritime district of Thrace, thereby inciting Philip's rage. Because of this turbulence, the Athenian Assembly convened. Demosthenes delivered On the Chersonese and convinced the Athenians not to recall Diopeithes. Also in 342 BC, he delivered the Third Philippic, which is considered to be the best of his political orations. Using all the power of his eloquence, he demanded resolute action against Philip and called for a burst of energy from the Athenian people. He told them that it would be \"better to die a thousand times than pay court to Philip\". Demosthenes now dominated Athenian politics and was able to considerably weaken the pro-Macedonian faction of Aeschines.\n\n\n==== Battle of Chaeronea (338 BC) ====\n\nIn 341 BC Demosthenes was sent to Byzantium, where he sought to renew its alliance with Athens. Thanks to Demosthenes' diplomatic manoeuvres, Abydos also entered into an alliance with Athens. These developments worried Philip and increased his anger at Demosthenes. The Assembly, however, laid aside Philip's grievances against Demosthenes' conduct and denounced the peace treaty; so doing, in effect, amounted to an official declaration of war. In 339 BC Philip made his last and most effective bid to conquer southern Greece, assisted by Aeschines' stance in the Amphictyonic Council. During a meeting of the Council, Philip accused the Amfissian Locrians of intruding on consecrated ground. The presiding officer of the Council, a Thessalian named Cottyphus, proposed the convocation of an Amphictyonic Congress to inflict a harsh punishment upon the Locrians. Aeschines agreed with this proposition and maintained that the Athenians should participate in the Congress. Demosthenes however reversed Aeschines' initiatives and Athens finally abstained. After the failure of a first military excursion against the Locrians, the summer session of the Amphictyonic Council gave command of the league's forces to Philip and asked him to lead a second excursion. Philip decided to act at once; in the winter of 339–338 BC, he passed through Thermopylae, entered Amfissa and defeated the Locrians. After this significant victory, Philip swiftly entered Phocis in 338 BC. He then turned south-east down the Cephissus valley, seized Elateia, and restored the fortifications of the city.At the same time, Athens orchestrated the creation of an alliance with Euboea, Megara, Achaea, Corinth, Acarnania and other states in the Peloponnese. However the most desirable ally for Athens was Thebes. To secure their allegiance, Demosthenes was sent by Athens, to the Boeotian city; Philip also sent a deputation, but Demosthenes succeeded in securing Thebes' allegiance. Demosthenes' oration before the Theban people is not extant and, therefore, the arguments he used to convince the Thebans remain unknown. In any case, the alliance came at a price: Thebes' control of Boeotia was recognised, Thebes was to command solely on land and jointly at sea, and Athens was to pay two thirds of the campaign's cost.While the Athenians and the Thebans were preparing themselves for war, Philip made a final attempt to appease his enemies, proposing in vain a new peace treaty. After a few trivial encounters between the two sides, which resulted in minor Athenian victories, Philip drew the phalanx of the Athenian and Theban confederates into a plain near Chaeronea, where he defeated them. Demosthenes fought as a mere hoplite. Such was Philip's hatred for Demosthenes that, according to Diodorus Siculus, the King after his victory sneered at the misfortunes of the Athenian statesman. However, the Athenian orator and statesman Demades is said to have remarked: \"O King, when Fortune has cast you in the role of Agamemnon, are you not ashamed to act the part of Thersites [an obscene soldier of the Greek army during the Trojan War]?\" Stung by these words, Philip immediately altered his demeanour.\n\n\n=== Last political initiatives and death ===\n\n\n==== Confrontation with Alexander ====\n\nAfter Chaeronea, Philip inflicted a harsh punishment upon Thebes, but made peace with Athens on very lenient terms. Demosthenes encouraged the fortification of Athens and was chosen by the ekklesia to deliver the Funeral Oration. In 337 BC, Philip created the League of Corinth, a confederation of Greek states under his leadership, and returned to Pella. In 336 BC, Philip was assassinated at the wedding of his daughter, Cleopatra of Macedon, to King Alexander of Epirus. The Macedonian army swiftly proclaimed Alexander III of Macedon, then twenty years old, as the new King of Macedon. Greek cities like Athens and Thebes saw in this change of leadership an opportunity to regain their full independence. Demosthenes celebrated Philip's assassination and played a leading part in his city's uprising. According to Aeschines, \"it was but the seventh day after the death of his daughter, and though the ceremonies of mourning were not yet completed, he put a garland on his head and white raiment on his body, and there he stood making thank-offerings, violating all decency.\" Demosthenes also sent envoys to Attalus, whom he considered to be an internal opponent of Alexander. Nonetheless, Alexander moved swiftly to Thebes, which submitted shortly after his appearance at its gates. When the Athenians learned that Alexander had moved quickly to Boeotia, they panicked and begged the new King of Macedon for mercy. Alexander admonished them but imposed no punishment.\nIn 335 BC Alexander felt free to engage the Thracians and the Illyrians, but, while he was campaigning in the north, Demosthenes spread a rumour—even producing a bloodstained messenger—that Alexander and all of his expeditionary force had been slaughtered by the Triballians. The Thebans and the Athenians rebelled once again, financed by Darius III of Persia, and Demosthenes is said to have received about 300 talents on behalf of Athens and to have faced accusations of embezzlement. Alexander reacted immediately and razed Thebes to the ground. He did not attack Athens, but demanded the exile of all anti-Macedonian politicians, Demosthenes first of all. According to Plutarch, a special Athenian embassy led by Phocion, an opponent of the anti-Macedonian faction, was able to persuade Alexander to relent.According to ancient writers, Demosthenes called Alexander \"Margites\" (Greek: Μαργίτης) and a boy. Greeks used the word Margites to describe foolish and useless people, on account of the Margites.\n\n\n==== Delivery of On the Crown ====\n\nDespite the unsuccessful ventures against Philip and Alexander, most Athenians still respected Demosthenes, because they shared his sentiments and wished to restore their independence. In 336 BC, the orator Ctesiphon proposed that Athens honour Demosthenes for his services to the city by presenting him, according to custom, with a golden crown. This proposal became a political issue and, in 330 BC, Aeschines prosecuted Ctesiphon on charges of legal irregularities. In his most brilliant speech, On the Crown, Demosthenes effectively defended Ctesiphon and vehemently attacked those who would have preferred peace with Macedon. He was unrepentant about his past actions and policies and insisted that, when in power, the constant aim of his policies was the honour and the ascendancy of his country; and on every occasion and in all business he preserved his loyalty to Athens. He finally defeated Aeschines, although his enemy's objections, though politically-motivated, to the crowning were arguably valid from a legal point of view.\n\n\n==== Case of Harpalus and death ====\n\nIn 324 BC Harpalus, to whom Alexander had entrusted huge treasures, absconded and sought refuge in Athens. The Assembly had initially refused to accept him, following Demosthenes' and Phocion's advice, but finally Harpalus entered Athens. He was imprisoned after a proposal of Demosthenes and Phocion, despite the dissent of Hypereides, an anti-Macedonian statesman and former ally of Demosthenes. Additionally, the ekklesia decided to take control of Harpalus' money, which was entrusted to a committee presided over by Demosthenes. When the committee counted the treasure, they found they only had half the money Harpalus had declared he possessed. When Harpalus escaped, the Areopagus conducted an inquiry and charged Demosthenes and others with mishandling twenty talents.Among the accused, Demosthenes was the first to be brought to trial before an unusually numerous jury of 1,500. He was found guilty and fined 50 talents. Unable to pay this huge amount, Demosthenes escaped and only returned to Athens nine months later, after the death of Alexander. Upon his return, he \"received from his countrymen an enthusiastic welcome, such as had never been accorded to any returning exile since the days of Alkibiades.\" Such a reception, the circumstances of the case, Athenian need to placate Alexander, the urgency to account for the missing funds, Demosthenes' patriotism and wish to set Greece free from Macedonian rule, all lend support to George Grote's view that Demosthenes was innocent, that the charges against him were politically-motivated, and that he \"was neither paid nor bought by Harpalus.\"Mogens Hansen, however, notes that many Athenian leaders, Demosthenes included, made fortunes out of their political activism, especially by taking bribes from fellow citizens and such foreign states as Macedonia and Persia. Demosthenes received vast sums for the many decrees and laws he proposed. Given this pattern of corruption in Greek politics, it appears likely, writes Hansen, that Demosthenes accepted a huge bribe from Harpalus, and that he was justly found guilty in an Athenian People's Court. \nAfter Alexander's death in 323 BC, Demosthenes again urged the Athenians to seek independence from Macedon in what became known as the Lamian War. However, Antipater, Alexander's successor, quelled all opposition and demanded that the Athenians turn over Demosthenes and Hypereides, among others. Following his order, the ekklesia had no choice but to reluctantly adopt a decree condemning the most prominent anti-Macedonian agitators to death. Demosthenes escaped to a sanctuary on the island of Kalaureia (modern-day Poros), where he was later discovered by Archias, a confidant of Antipater. He committed suicide before his capture by taking poison out of a reed, pretending he wanted to write a letter to his family. When Demosthenes felt that the poison was working on his body, he said to Archias: \"Now, as soon as you please you may commence the part of Creon in the tragedy, and cast out this body of mine unhurried. But, O gracious Neptune, I, for my part, while I am yet alive, arise up and depart out of this sacred place; though Antipater and the Macedonians have not left so much as the temple unpolluted.\" After saying these words, he passed by the altar, fell down and died. Years after Demosthenes' suicide, the Athenians erected a statue to honour him and decreed that the state should provide meals to his descendants in the Prytaneum.\n\n\n== Assessments ==\n\n\n=== Political career ===\nPlutarch lauds Demosthenes for not being of a fickle disposition. Rebutting historian Theopompus, the biographer insists that for \"the same party and post in politics which he held from the beginning, to these he kept constant to the end; and was so far from leaving them while he lived, that he chose rather to forsake his life than his purpose\". On the other hand, Polybius, a Greek historian of the Mediterranean world, was highly critical of Demosthenes' policies. Polybius accused him of having launched unjustified verbal attacks on great men of other cities, branding them unjustly as traitors to the Greeks. The historian maintains that Demosthenes measured everything by the interests of his own city, imagining that all the Greeks ought to have their eyes fixed upon Athens. According to Polybius, the only thing the Athenians eventually got by their opposition to Philip was the defeat at Chaeronea. \"And had it not been for the King's magnanimity and regard for his own reputation, their misfortunes would have gone even further, thanks to the policy of Demosthenes\".\nPaparrigopoulos extols Demosthenes' patriotism, but criticises him as being short-sighted. According to this critique, Demosthenes should have understood that the ancient Greek states could only survive unified under the leadership of Macedon. Therefore, Demosthenes is accused of misjudging events, opponents and opportunities and of being unable to foresee Philip's inevitable triumph. He is criticised for having overrated Athens's capacity to revive and challenge Macedon. His city had lost most of its Aegean allies, whereas Philip had consolidated his hold over Macedonia and was master of enormous mineral wealth. Chris Carey, a professor of Greek in UCL, concludes that Demosthenes was a better orator and political operator than strategist. Nevertheless, the same scholar underscores that \"pragmatists\" like Aeschines or Phocion had no inspiring vision to rival that of Demosthenes. The orator asked the Athenians to choose that which is just and honourable, before their own safety and preservation. The people preferred Demosthenes' activism and even the bitter defeat at Chaeronea was regarded as a price worth paying in the attempt to retain freedom and influence. According to Professor of Greek Arthur Wallace Pickarde, success may be a poor criterion for judging the actions of people like Demosthenes, who were motivated by the ideals of democracy political liberty. Athens was asked by Philip to sacrifice its freedom and its democracy, while Demosthenes longed for the city's brilliance. He endeavoured to revive its imperilled values and, thus, he became an \"educator of the people\" (in the words of Werner Jaeger).\nThe fact that Demosthenes fought at the battle of Chaeronea as a hoplite indicates that he lacked any military skills. According to historian Thomas Babington Macaulay, in his time the division between political and military offices was beginning to be strongly marked. Almost no politician, with the exception of Phocion, was at the same time an apt orator and a competent general. Demosthenes dealt in policies and ideas, and war was not his business. This contrast between Demosthenes' intellectual prowess and his deficiencies in terms of vigour, stamina, military skill and strategic vision is illustrated by the inscription his countrymen engraved on the base of his statue:Had you for Greece been strong, as wise you were, the Macedonian would not have conquered her.George Grote notes that already thirty years before his death, Demosthenes \"took a sagacious and provident measure of the danger which threatened Grecian liberty from the energy and encroachments of Philip.\" Throughout his career \"we trace the same combination of earnest patriotism with wise and long-sighted policy.\" Had his advice to the Athenians and other fellow Greeks been followed, the power of Macedonia could have been successfully checked. Moreover, says Grote, \"it was not Athens only that he sought to defend against Philip, but the whole Hellenic world. In this he towers above the greatest of his predecessors.\"  The sentiments to which Demosthenes appeals throughout his numerous orations, are those of the noblest and largest patriotism; trying to inflame the ancient Grecian sentiment of an autonomous Hellenic world, as the indispensable condition of a dignified and desirable existence.\n\n\n=== Oratorical skill ===\n\nIn Demosthenes' initial judicial orations, the influence of both Lysias and Isaeus is obvious, but his marked, original style is already revealed. Most of his extant speeches for private cases—written early in his career—show glimpses of talent: a powerful intellectual drive, masterly selection (and omission) of facts, and a confident assertion of the justice of his case, all ensuring the dominance of his viewpoint over his rival. However, at this early stage of his career, his writing was not yet remarkable for its subtlety, verbal precision and variety of effects.According to Dionysius of Halicarnassus, a Greek historian and teacher of rhetoric, Demosthenes represented the final stage in the development of Attic prose. Both Dionysius and Cicero assert that Demosthenes brought together the best features of the basic types of style; he used the middle or normal type style ordinarily and applied the archaic type and the type of plain elegance where they were fitting. In each one of the three types he was better than its special masters. He is, therefore, regarded as a consummate orator, adept in the techniques of oratory, which are brought together in his work.According to the classical scholar Harry Thurston Peck, Demosthenes \"affects no learning; he aims at no elegance; he seeks no glaring ornaments; he rarely touches the heart with a soft or melting appeal, and when he does, it is only with an effect in which a third-rate speaker would have surpassed him. He had no wit, no humour, no vivacity, in our acceptance of these terms. The secret of his power is simple, for it lies essentially in the fact that his political principles were interwoven with his very spirit.\" In this judgement, Peck agrees with Jaeger, who said that the imminent political decision imbued Demosthenes' speech with a fascinating artistic power. From his part, George A. Kennedy believes that his political speeches in the ekklesia were to become \"the artistic exposition of reasoned views\".Demosthenes was apt at combining abruptness with the extended period, brevity with breadth. Hence, his style harmonises with his fervent commitment. His language is simple and natural, never far-fetched or artificial. According to Jebb, Demosthenes was a true artist who could make his art obey him. For his part, Aeschines stigmatised his intensity, attributing to his rival strings of absurd and incoherent images. Dionysius stated that Demosthenes' only shortcoming is the lack of humour, although Quintilian regards this deficiency as a virtue. In a now lost letter, Cicero, though an admirer of the Athenian orator, claimed that occasionally Demosthenes \"nods\", and elsewhere Cicero also argued that, although he is pre-eminent, Demosthenes sometimes fails to satisfy his ears. The main criticism of Demosthenes' art, however, seems to have rested chiefly on his known reluctance to speak ex tempore; he often declined to comment on subjects he had not studied beforehand. However, he gave the most elaborate preparation to all his speeches and, therefore, his arguments were the products of careful study. He was also famous for his caustic wit.Besides his style, Cicero also admired other aspects of Demosthenes' works, such as the good prose rhythm, and the way he structured and arranged the material in his orations. According to the Roman statesman, Demosthenes regarded \"delivery\" (gestures, voice, etc.) as more important than style. Although he lacked Aeschines' charming voice and Demades' skill at improvisation, he made efficient use of his body to accentuate his words. Thus he managed to project his ideas and arguments much more forcefully. However, the use of physical gestures wasn't an integral or developed part of rhetorical training in his day. Moreover, his delivery was not accepted by everybody in antiquity: Demetrius Phalereus and the comedians ridiculed Demosthenes' \"theatricality\", whilst Aeschines regarded Leodamas of Acharnae as superior to him.Demosthenes relied heavily on the different aspects of ethos, especially phronesis. When presenting himself to the Assembly, he had to depict himself as a credible and wise statesman and adviser to be persuasive. One tactic that Demosthenes used during his philippics was foresight. He pleaded with his audience to predict the potential of being defeated, and to prepare. He appealed to pathos through patriotism and introducing the atrocities that would befall Athens if it was taken over by Philip. He was a master at \"self-fashioning\" by referring to his previous accomplishments, and renewing his credibility. He would also slyly undermine his audience by claiming that they had been wrong not to listen before, but they could redeem themselves if they listened and acted with him presently.Demosthenes tailored his style to be very audience-specific. He took pride in not relying on attractive words but rather simple, effective prose. He was mindful of his arrangement, he used clauses to create patterns that would make seemingly complex sentences easy for the hearer to follow. His tendency to focus on delivery promoted him to use repetition, this would ingrain the importance into the audience's minds; he also relied on speed and delay to create suspense and interest among the audience when presenting to most important aspects of his speech. One of his most effective skills was his ability to strike a balance: his works were complex so that the audience would not be offended by any elementary language, but the most important parts were clear and easily understood.\n\n\n== Rhetorical legacy ==\n\nDemosthenes is widely considered one of the greatest orators of all time, and his fame has continued down the ages. Authors and scholars who flourished at Rome, such as Longinus and Caecilius, regarded his oratory as sublime. Juvenal acclaimed him as \"largus et exundans ingenii fons\" (a large and overflowing fountain of genius), and he inspired Cicero's speeches against Mark Antony, also called the Philippics. According to Professor of Classics Cecil Wooten, Cicero ended his career by trying to imitate Demosthenes' political role. Plutarch drew attention in his Life of Demosthenes to the strong similarities between the personalities and careers of Demosthenes and Marcus Tullius Cicero:\nThe divine power seems originally to have designed Demosthenes and Cicero upon the same plan, giving them many similarities in their natural characters, as their passion for distinction and their love of liberty in civil life, and their want of courage in dangers and war, and at the same time also to have added many accidental resemblances. I think there can hardly be found two other orators, who, from small and obscure beginnings, became so great and mighty; who both contested with kings and tyrants; both lost their daughters, were driven out of their country, and returned with honour; who, flying from thence again, were both seized upon by their enemies, and at last ended their lives with the liberty of their countrymen.\nDuring the Middle Ages and Renaissance, Demosthenes had a reputation for eloquence. He was read more than any other ancient orator; only Cicero offered any real competition. French author and lawyer Guillaume du Vair praised his speeches for their artful arrangement and elegant style; John Jewel, Bishop of Salisbury, and Jacques Amyot, a French Renaissance writer and translator, regarded Demosthenes as a great or even the \"supreme\" orator. For Thomas Wilson, who first published translation of his speeches into English, Demosthenes was not only an eloquent orator, but, mainly, an authoritative statesman, \"a source of wisdom\".In modern history, orators such as Henry Clay would mimic Demosthenes' technique. His ideas and principles survived, influencing prominent politicians and movements of our times. Hence, he constituted a source of inspiration for the authors of The Federalist Papers (a series of 85 essays arguing for the ratification of the United States Constitution) and for the major orators of the French Revolution. French Prime Minister Georges Clemenceau was among those who idealised Demosthenes and wrote a book about him. For his part, Friedrich Nietzsche often composed his sentences according to the paradigms of Demosthenes, whose style he admired.\n\n\n== Works and transmission ==\n\nThe \"publication\" and distribution of prose texts was common practice in Athens by the latter half of the fourth century BC and Demosthenes was among the Athenian politicians who set the trend, publishing many or even all of his orations. After his death, texts of his speeches survived in Athens (possibly forming part of the library of Cicero's friend, Atticus, though their fate is otherwise unknown), and in the Library of Alexandria.The Alexandrian texts were incorporated into the body of classical Greek literature that was preserved, catalogued and studied by the scholars of the Hellenistic period. From then until the fourth centuryAD, copies of Demosthenes' orations multiplied and they were in a relatively good position to survive the tense period from the sixth until the ninth century AD. In the end, sixty-one orations attributed to Demosthenes survived till the present day (some however are pseudonymous). Friedrich Blass, a German classical scholar, believes that nine more speeches were recorded by the orator, but they are not extant. Modern editions of these speeches are based on four manuscripts of the tenth and eleventh centuries AD.Some of the speeches that comprise the \"Demosthenic corpus\" are known to have been written by other authors, though scholars differ over which speeches these are. Irrespective of their status, the speeches attributed to Demosthenes are often grouped in three genres first defined by Aristotle:\nSymbouleutic or political, considering the expediency of future actions—sixteen such speeches are included in the Demosthenic corpus;\nDicanic or judicial, assessing the justice of past actions—only about ten of these are cases in which Demosthenes was personally involved, the rest were written for other speakers;\nEpideictic or sophistic display, attributing praise or blame, often delivered at public ceremonies—only two speeches have been included in the Demosthenic corpus, one a funeral speech that has been dismissed as a \"rather poor\" example of his work, and the other probably spurious.In addition to the speeches, there are fifty-six prologues (openings of speeches). They were collected for the Library of Alexandria by Callimachus, who believed them genuine. Modern scholars are divided: some reject them, while others, such as Blass, believe they are authentic. Finally, six letters also survive under Demosthenes' name and their authorship too is hotly debated.\n\n\n== Later honours ==\nIn 1936, an American botanist Albert Charles Smith named a genus of shrubs in the family Ericaceae, which were native to south America, as Demosthenesia in honour of Demosthenes.\n\n\n== See also ==\nPseudo-Demosthenes\n\n\n== Notes ==\n\n\n== References ==\n\n\n== Sources ==\n\n\n=== Primary sources (Greeks and Romans) ===\n\n\n=== Secondary sources ===\n\n\n== Further reading ==\n\n\n== External links =="