"Affluenza is a psychological malaise supposedly affecting wealthy people. It is a portmanteau of affluence and influenza, and is used most commonly by critics of consumerism. It is not a medically recognized disease. It is thought to have been first used in 1954, but was popularised in 1997 with a PBS documentary of the same name and the subsequent book Affluenza: The All-Consuming Epidemic (2001, revised in 2005, 2014). These works define affluenza as \"a painful, contagious, socially transmitted condition of overload, debt, anxiety, and waste resulting from the dogged pursuit of more\". A more informal definition of the term would describe it as \"a quasi-illness caused by guilt for one's own socio-economic superiority\". The term \"affluenza\" has also been used to refer to an inability to understand the consequences of one's actions because of financial privilege.\nThe term \"affluenza\" was re-popularized in 2013 with the arrest of Ethan Couch, a Texas teen, for driving while intoxicated and killing four pedestrians and injuring several others. Testimony from a psychologist in court referred to Couch as having a case of affluenza as his defense, sparking a media frenzy and victim family outrage.\n\n\n== Theory ==\nIn 2007, British psychologist Oliver James asserted that there was a correlation between the increasing occurrence of affluenza and the resulting increase in material inequality: the more unequal a society, the greater the unhappiness of its citizens. Referring to Vance Packard's thesis The Hidden Persuaders on the manipulative methods used by the advertising industry, James related the stimulation of artificial needs to the rise in affluenza. To highlight the spread of affluenza in societies with varied levels of inequality, James interviewed people in several cities including Sydney, Singapore, Auckland, Moscow, Shanghai, Copenhagen and New York.\nIn 2008 James wrote that higher rates of mental disorders were the consequence of excessive wealth-seeking in consumerist nations. In a graph created from multiple data sources, James plotted \"Prevalence of any emotional distress\" and \"Income inequality\", attempting to show that English-speaking nations have nearly twice as much emotional distress as mainland Europe and Japan: 21.6 percent vs 11.5 percent. James defined affluenza as \"placing a high value on money, possessions, appearances (physical and social) and fame\", which was the rationale behind the increasing mental illness in English-speaking societies. He explained the greater incidence of affluenza as the result of 'selfish capitalism', the market liberal political governance found in English-speaking nations as compared to the less selfish capitalism pursued in mainland Europe. James asserted that societies can remove the negative consumerist effects by pursuing real needs over perceived wants, and by defining themselves as having value independent of their material possessions.\nClive Hamilton and Richard Denniss's book, Affluenza: When Too Much is Never Enough, poses the question: \"If the economy has been doing so well, why are we not becoming happier?\":vii They argue that affluenza causes overconsumption, \"luxury fever\", consumer debt, overwork, waste, and harm to the environment. These pressures lead to \"psychological disorders, alienation and distress\",:179 causing people to \"self-medicate with mood-altering drugs and excessive alcohol consumption\".They note that a number of Australians have reacted by \"downshifting\"—they decided to \"reduce their incomes and place family, friends and contentment above money in determining their life goals\". Their critique leads them to identify the need for an \"alternative political philosophy\", and the book concludes with a \"political manifesto for wellbeing\".\n\n\n== See also ==\n\n\n== References ==\n\n\n== Further reading ==\nThe Circle of Simplicity, Cecile Andrews, ISBN 0-06-092872-7\nThe Golden Ghetto: The Psychology of Affluence, Jessie H. O'Neill, ISBN 978-0-9678554-0-0\nVoluntary Simplicity, Duane Elgin, ISBN 0-688-12119-5\nVoluntary Simplicity, Daniel Doherty & Amitai Etzioni, ISBN 0-7425-2066-8\nHow Much Is Too Much? Raising Likeable, Responsible, Respectful Children-From Toddler to Teens-In an Age of Overindulgence, Clarke, Jean Illsley, Bredehoft, David & Dawson, Connie, ISBN 978-0-7382-1681-2\n\n\n== External links ==\n\"Affluenza\". pbs.org.\nMacquarie Dictionary Word of the Year Winners: Affluenza\nThe Affluenza Project\nAffluenza issues in the USA\nAffluenza video\nA film clip \"The Open Mind - Affluenza (1984)\" is available at the Internet Archive"