"A meromictic lake is a lake which has layers of water that do not intermix. In ordinary, holomictic lakes, at least once each year, there is a physical mixing of the surface and the deep waters.The term meromictic was coined by the Austrian Ingo Findenegg in 1935, apparently based on the older word holomictic. The concepts and terminology used in describing meromictic lakes were essentially complete following some additions by G. Evelyn Hutchinson in 1937.\n\n\n== Characteristics ==\n\nMost lakes are holomictic; that is, at least once per year, physical mixing occurs between the surface and the deep waters. In so-called monomictic lakes, the mixing occurs once per year; in dimictic lakes, the mixing occurs twice a year (typically spring and autumn), and in polymictic lakes, the mixing occurs several times a year. In meromictic lakes, however, the layers of the lake water can remain unmixed for years, decades, or centuries.\nMeromictic lakes can usually be divided into three sections or layers. The bottom layer is known as the monimolimnion; the waters in this portion of the lake circulate little, and are generally hypoxic and saltier than the rest of the lake. The top layer is called the mixolimnion, and essentially behaves like a holomictic lake. The area in between is referred to as the chemocline, also called the chemolimnion.The lack of mixing between layers creates radically different environments for organisms to live in: among the consequences of this stratification, or stable layering, of lake waters is that the bottom layer receives little oxygen from the atmosphere, hence becomes depleted of oxygen. While the surface layer may have 10 mg/L or more dissolved oxygen in summer, the depths of a meromictic lake can have less than 1 mg/L. Very few organisms can live in such an oxygen-poor environment. One exception is  purple sulfur bacteria. These bacteria, commonly found at the top of the monimolimnion in such lakes, use sulfur compounds such as sulfides in photosynthesis. These compounds are produced by decomposition of organic sediments in oxygen-poor environments.  The monimolimnion is often rich in phosphorus and nitrogen. These factors combine to create an ideal environment for bacterial growth. The mixolimnion can have similar qualities. However, the types of bacteria that can grow at the surface are determined by the amount of light received at the surface.A meromictic lake may form because the basin is unusually deep and steep-sided compared to the lake's surface area, or because the lower layer of the lake is highly saline and denser than the upper layers of water.\nStratification in meromictic lakes can be either endogenic or ectogenic. Endogenic means the patterns seen in the lake are caused by internal events, such as organic matter accumulating in the sediments and decaying, whereas ectogenic means the patterns seen are caused by external causes, like an intrusion of saltwater settling in the hypolimnion, preventing it from mixing.The layers of sediment at the bottom of a meromictic lake remain relatively undisturbed because there is little physical mixing and few living organisms to agitate them.  There is also little chemical decomposition. For this reason, cores of the sediment at the bottom of meromictic lakes are important in tracing past changes in climate at the lake, by examining trapped pollen grains and the types of sediments [see Proxy (climate)].\nWhen the layers do mix for whatever reason, the consequences can be devastating for organisms that normally live in the mixolimnion. This layer is usually much smaller in volume than the monimolimnion. When the layers mix, the oxygen concentration at the surface will decrease dramatically. This can result in the death of many organisms, such as fish, that require oxygen.\nOccasionally, carbon dioxide (CO2) or other dissolved gases can build up relatively undisturbed in the lower layers of a meromictic lake. When the stratification is disturbed, as could happen from an earthquake, a limnic eruption may result. In 1986, a notable event of this type took place at Lake Nyos in Cameroon, causing nearly 1,800 deaths.While it is mainly lakes that are meromictic, the world's largest meromictic basin is the Black Sea. The deep waters below 50 metres (150 feet) do not mix with the upper layers that receive oxygen from the atmosphere. As a result, over 90% of the deeper Black Sea volume is anoxic water. The Caspian Sea is anoxic below 100 metres (300 feet). The Baltic Sea is persistently stratified, with dense, highly saline water comprising the bottom layer, and large areas of hypoxic sediments (see Baltic Sea hypoxia).\n\n\n== List of meromictic lakes ==\nThere are meromictic lakes all over the world. The distribution appears to be clustered, but this may be due to incomplete investigations. Depending on the exact definition of \"meromictic\", the ratio between meromictic and holomictic lakes worldwide is around 1:1000.\n\n\n=== Africa ===\nLake Nyos and Lake Monoun in Cameroon\nLake Kivu in Rwanda, The DRC\nLake Tanganyika in Burundi, The DRC, Tanzania and Zambia\nLake Malawi, located between Malawi, Mozambique and Tanzania.\n\n\n=== Antarctica ===\nLake Vanda in Ross Dependency\n21 lakes including Organic Lake in Vestfold Hills\n\n\n=== Asia ===\nPantai Keracut (Keracut Beach) Lake, Penang National Park, northwest Penang island, Malaysia\nJellyfish Lake (Ongeim'l Tketau), on Eil Malk in Palau\nZigetangcuo Lake, a crenogenic lake in Nagqu Prefecture, Tibet, the PRC. It is the meromictic lake located at the highest altitude.\nKaptai Lake, in Rangamati District, at the south eastern part of Bangladesh. Created by constructing a dam at Kaptai to set up a hydroelectric power plant.\nBababu Lake, Basilisa, Dinagat Islands, Philippines\n\n\n=== Australia ===\nLake Fidler, in Tasmania's Wilderness World Heritage Area, Australia.\n\n\n=== Europe ===\nKärntner Seen (Alpine lakes in the Austrian province of Carinthia;  studied by Ingo Findenegg in the 1930s).\nAlatsee (small alpine lake in Germany's State of Bavaria, near the City of Füssen and Neuschwanstein Palace)\nLake Vähä-Pitkusta in Finland.\nLake Pakasaivo in Finland.\nLough Furnace in Ireland.\nSalvatnet, Kilevann, Tronstadvatn, Birkelandsvatn, Rørholtfjorden, Botnvatn, Rørhopvatn and Strandvatn lakes in Norway.\nCzarne Lake in Drawa National Park, Poland\nLake Mogilnoye in Murmansk Oblast of Russia.\nLakes El Tobar and La Cruz in Spain.\nLake Cadagno is a \"crenogenic\" meromictic lake in Switzerland, and the location of the Alpine Biology Center\nLac Pavin and Lac du Bourget in France\nThe Black Sea is also considered to be meromictic.\n\n\n=== North America ===\nCanada\nLakes A and C1 on Ellesmere Island, Nunavut\nBlackcat Lake near Dorset, Ontario, in Frost Centre\nCrawford Lake near Milton, Ontario\nPicard Lake near Lakehurst, Ontario\nMahoney Lake in the Okanagan Valley, British Columbia\nMcGinnis Lake in Petroglyphs Provincial Park, Ontario\nPink Lake in Gatineau Park, Quebec\nPowell Lake in the town of Powell River, British Columbia\nSunfish Lake near Waterloo, Ontario\nLittle Round Lake (Ontario) in Central Frontenac, Ontario\nTeapot Lake, Heart Lake Conservation Area, Brampton, Ontario. See also Heart Lake (Ontario)\nCentral America\nLake Atitlán 50 square mile, 1,000 ft deep Caldera, endorheic lake in the Department of Sololá, Guatemala.\nUnited States\nBallston Lake, 30 km NNW of Albany, New York\nBig Soda Lake, Nevada\nBrownie Lake near Minneapolis, MN\nCanyon Lake near Big Bay, MI \nChapel Lake, in Pictured Rocks National Lakeshore, near Munising, Michigan\nDevil's Bathtub near Rochester, New York, in Mendon Ponds Park\nGlacier Lake in Clark Reservation State Park near Syracuse, New York\nGreat Salt Lake near Salt Lake City, Utah\nGreen Lake and Round Lake in Green Lakes State Park near Syracuse, New York\nHot Lake in Okanogan County, Washington\nIrondequoit Bay near Rochester, New York, is also considered meromictic; use of road salt has been cited as the main reason for its change\nKnaack Lake, Wisconsin\nLake Mary, in the northwest corner of Vilas County, Wisconsin\nLower Mystic Lake in Arlington and Medford, Massachusetts\nRedoubt Lake near Sitka, Alaska; one of North America's largest meromictic lakes\nSoap Lake in Washington\n\n\n== References ==\n\n\n== External links ==\n\"Density Stratification\", part of an educational website Water on the Web operated by the University of Minnesota, Duluth. Retrieved 11-March-2007.\nLake Fidler revived\nphoto-outing.com review over Pantai Kerachut with Memomictic lake"