"Eidgenossenschaft (German pronunciation: [ˈaɪdɡəˌnɔsənʃaft]) is a German word specific to the political history of Switzerland. \nIt means \"oath commonwealth\" or \"oath alliance\" in reference to the \"eternal pacts\" formed between the Eight Cantons of the Old Swiss Confederacy of the late medieval period, most notably in Swiss historiography being the Rütlischwur between the three founding cantons Uri, Schwyz and Unterwalden, traditionally dated to 1307. \nIn modern usage, it is the German term used as equivalent with \"Confederation\" in the official name of  Switzerland, Schweizerische Eidgenossenschaft, rendered Confédération and Confederazione in French and Italian, respectively. The related adjective, eidgenössisch, officially translated as Swiss federal, is used in the name of organisations, for example the Eidgenössische Technische Hochschule, Swiss Federal Institute of Technology.\nThe term Eidgenosse (literally: comrade by oath) refers to the individual members of the Eidgenossenschaft. It is attested as early as 1315, in the Pact of Brunnen (as Eitgenoze), referring to the\ncantons of Uri, Schwyz and Unterwalden. The abstract noun Eidgenossenschaft (mostly contracted to eidgnoszschaft  or eidgnoschaft) is attested in the 15th century.\nIn modern usage, Eidgenosse is sometimes used (in archaic or ironic usage) for   \"Swiss citizen\", especially for those citizens of purely Swiss origin, not immigrated.In a historical context, Eidgenossenschaft  refers to the medieval Swiss Confederacy, which grew from the 13th to the 16th century in central Europe, persisted until 1798 and then evolved into a federal state in the 19th century. When used in this sense, the eternal nature of the pact is necessary—the members of the Dreizehn Orte (Thirteen Cantons), frequently made time-limited alliances sworn by oath with other partners, but such pacts were not considered an Eidgenossenschaft.\nThe members of an Eidgenossenschaft are called Eidgenossen (singular Eidgenosse). This term is documented in an alliance from 1351 between the communal, countrified lieus of Uri, Schwyz and Unterwalden and the civic city lieus of Lucerne and Zürich, which referred to themselves as such. In the evolution of the Swiss Confederacy, the members initially were not united by one single pact, but rather by a whole set of overlapping pacts and separate bilateral treaties between various members. The abstraction to the singular use of Eidgenossenschaft, which implies a stronger sense of community and the perception of a strong common cause, did not occur until some forty years later, after the Battle of Sempach, although it began already in the Pfaffenbrief of 1370, a treaty among some of the then eight members of the Swiss Confederacy.\nThe communal movement in medieval Europe often led to similar alliances or leagues, called conjurationes in the Latin of the official documents of the time. The city alliances (German: Städtebünde) in the medieval Holy Roman Empire, in which the member cities also were equal, can be regarded as Eidgenossenschaften, too, although they generally proved less stable, partly due to their fragmented territories. The best known of these city alliances was the Hanseatic League, but many others existed in the 13th and 14th century. An early example is the Lombard League at the time of Frederick I \"Barbarossa\"; an example from Switzerland would be the \"Burgundian Confederacy\" of Bern.\nIn the Holy Roman Empire, emperor Charles IV outlawed any such conjurationes, confederationes, and conspirationes in his Golden Bull of 1356. Most Städtebünde were subsequently dissolved, sometimes forcibly, and where refounded, their political influence was much reduced. On the Swiss Eidgenossenschaft, however, the edict had no such effect as Charles IV, who was of the House of Luxembourg, regarded the Swiss as potential useful allies against his rivals, the Habsburgs.\n\n"