"An ascot tie, or ascot or hanker-tie, is a neckband with wide pointed wings, traditionally made of pale grey patterned silk. This wide tie is usually patterned, folded over, and fastened with a tie pin or tie clip. It is usually reserved for formal wear with morning dress for daytime weddings and worn with a cutaway morning coat and striped grey formal trousers. This type of dress cravat is made of a thicker, woven type of silk similar to a modern tie and is traditionally either grey or black.The ascot is descended from the earlier type of cravat widespread in the early 19th century, most notably during the age of Beau Brummell, made of heavily starched linen and elaborately tied around the neck. Later in the 1880s, amongst the upper-middle-class in Europe men began to wear a more loosely tied version for formal daytime events with daytime full dress in frock coats or with morning coats. It remains a feature of morning dress for weddings today. The Royal Ascot race meeting at the Ascot Racecourse gave the ascot its name, although such dress cravats were no longer worn with morning dress at the Royal Ascot races by the Edwardian era. The ascot was still commonly worn for business with morning dress in the late 19th and very early 20th centuries.\nIn British English, the casual form is called a cravat, or sometimes as a day cravat to distinguish it from the highly formal dress cravat. It is made from a thinner woven silk that is more comfortable when worn against the skin, often with ornate and colourful printed patterns.\n\n\n== Military use ==\nStudents at the United States Army Officer Candidate School wear ascots as part of their uniform, black for basic officer candidates, blue for intermediate candidates, and white for senior officer candidates. Pararescue trainees (upon completion of extended training day) are given a blue ascot. In the United States Navy the ascot is now worn for ceremonial purposes with Enlisted Full Dress Whites and Enlisted Full Dress Blue in the Ceremonial Guard. \nIn the Dutch Army, it is a part of the uniform, for barrack use, the ascot is often in the weapon colors, and with a logo, and when in combat uniform, a DPM or desert version is used. Likewise the Royal Danish Army employs an ascot for the ceremonial version of the barrack dress, its colors vary between each company.\n\n\n== See also ==\nCravat\n\n\n== References ==\n\n\n== Further reading ==\nVillarosa, Riccardo: The Elegant Man - How to Construct the Ideal Wardrobe. Random House, 1992. ISBN 0-679-42101-7\n\n\n== External links ==\nHow to tie the Ruche knot\nHow to tie an Ascot Tie"