"Venus in Furs (German: Venus im Pelz) is a novella by the Austrian author Leopold von Sacher-Masoch, and the best known of his works. The novel was to be part of an epic series that Sacher-Masoch envisioned called Legacy of Cain (Das Vermächtniß Kains). Venus in Furs was part of Love (Die Liebe), the first volume of the series. It was published in 1870.\n\n\n== Novel ==\nThe novel draws themes, like female dominance and sadomasochism, and character inspiration heavily from Sacher-Masoch's own life. Wanda von Dunajew, the novel's central female character, was modelled after Fanny Pistor, who was an emerging literary writer. The two met when Pistor contacted Sacher-Masoch, under the assumed name and fictitious title of Baroness Bogdanoff, for suggestions on improving her writing to make it suitable for publication.\n\n\n== Plot summary ==\nThe framing story concerns a man who dreams of speaking to Venus about love while she wears furs. The unnamed narrator tells his dreams to a friend, Severin, who tells him how to break himself of his fascination with cruel women by reading a manuscript, Memoirs of a Suprasensual Man.\nThis manuscript tells of a man, Severin von Kusiemski, who is so infatuated with a woman, Wanda von Dunajew, that he asks to be her slave, and encourages her to treat him in progressively more degrading ways. At first Wanda does not understand or accede to the request, but after humouring Severin a bit she finds the advantages of the method to be interesting and enthusiastically embraces the idea, although at the same time she disdains Severin for allowing her to do so.\nSeverin describes his feelings during these experiences as suprasensuality. Severin and Wanda travel to Florence. Along the way, Severin takes the generic Russian servant's name of \"Gregor\" and the role of Wanda's servant. In Florence, Wanda treats him brutally as a servant, and recruits a trio of African women to dominate him.\nThe relationship arrives at a crisis when Wanda meets a man to whom she would like to submit, a Byronic hero known as Alexis Papadopolis. At the end of the book, Severin, humiliated by Wanda's new lover, loses the desire to submit. He says of Wanda:\n\nThat woman, as nature has created her, and man at present is educating her, is man's enemy. She can only be his slave or his despot, but never his companion. This she can become only when she has the same rights as he and is his equal in education and work.\n\n\n== In popular culture ==\n\nThe Velvet Underground's 1967 debut album The Velvet Underground & Nico included the song \"Venus in Furs\".\nThe novel has been adapted for film several times: in 1967; in 1969 by Massimo Dallamano; in 1969 by Jesus Franco; in 1985 as Seduction: The Cruel Woman (Verführung: Die Grausame Frau), a lesbian-feminist interpretation directed by Monika Treut; and in 1995.\nVenus in Furs was a fictitious band who performed in the 1998 British-American drama film Velvet Goldmine.\nSteve Tanner adapted the novel to stage. In May 2004, it premiered in Los Angeles at the Sacred Fools Theater Company as part of its \"Get Lit!\" series.\nThe book inspired Venus in Fur, a 2010 play set in the modern day by David Ives, which had its Off-Broadway premiere at the Classic Stage Company in New York City starring Nina Arianda and Wes Bentley.\nIn 2013, Roman Polanski directed the film Venus in Fur (original French title La Vénus à la fourrure), which is based on the David Ives play. The film premiered in competition for the Palme d'Or at the 2013 Cannes Film Festival and in January 2014 it won the Best Director award at the 39th César Awards.\nSteven Severin, co-founder of the band Siouxsie and the Banshees, took the name \"Severin\" from the character in Sacher-Masoch's novel who is mentioned in the Velvet Underground song \"Venus in Furs\".\n\n\n== Editions ==\nLeopold von Sacher-Masoch, Venus im Pelz. In: Das Vermächtniß Kains – Erster Theil: Die Liebe. Stuttgart: Cotta, 1870, pp. 121–368.\n\n\n== References ==\n\n\n== External links ==\nLeopold von Sacher-Masoch. Venus in Furs at Project Gutenberg\nLeopold von Sacher-Masoch. Venus im Pelz (in German)\n Venus in Furs public domain audiobook at LibriVox"