"Max Stirner's idea of the \"Union of egoists\" (German: Verein von Egoisten) was first expounded in The Ego and Its Own. A union of egoists is understood as a voluntary and non-systematic association which Stirner proposed in contradistinction to the state. Each union is understood as a relation between egoists which is continually renewed by all parties' support through an act of will. The Union requires that all parties participate out of a conscious egoism. If one party silently finds themselves to be suffering, but puts up and keeps the appearance, the union has degenerated into something else. This union is not seen as an authority above a person's own will, but a voluntary relation subordinate to the wills of its members. This idea has received interpretations for politics, economics, romance and sexual relations.\n\n\n== Stirner on the Union of egoists ==\n\n\n=== On The Ego and Its Own ===\n\n\n==== Society vs. Unions of egoists ====\n\nIn his main work, The Ego and Its Own, Stirner makes a difference between society and the Union of egoists. As such, \"[m]orality is incompatible with egoism, because the former does not allow validity to me, but only to the Man in me. But, if the State is a society of men, not a union of egos each of whom has only himself before his eyes, then it cannot last without morality, and must insist on morality. Therefore we two, the State and I, are enemies. I, the egoist, have not at heart the welfare of this \"human society,\" I sacrifice nothing to it, I only utilize it; but to be able to utilize it completely I transform it rather into my property and my creature; i. e., I annihilate it, and form in its place the Union of Egoists\".Stirner establishes other oppositions along the same lines: \"The Christian people has produced two societies whose duration will keep equal measure with the permanence of that people: these are the societies State and Church. Can they be called a union of egoists? Do we in them pursue an egoistic, personal, own interest, or do we pursue a popular (i.e. an interest of the Christian people), to wit, a State, and Church interest? Can I and may I be myself in them? May I think and act as I will, may I reveal myself, live myself out, busy myself? Must I not leave untouched the majesty of the State, the sanctity of the Church? Well, I may not do so as I will. But shall I find in any society such an unmeasured freedom of maying? Certainly no! Accordingly we might be content? Not a bit! It is a different thing whether I rebound from an ego or from a people, a generalization. [...] For the State is likewise a society, not a union; it is the broadened family (\"Father of the Country — Mother of the Country — children of the country\")\".On economics, Stirner sees the idea of Union of egoists apply as follows: \"If men reach the point of losing respect for property, every one will have property, as all slaves become free men as soon as they no longer respect the master as master. Unions will then, in this matter too, multiply the individual's means and secure his assailed property\".\n\n\n==== Elements of a Union of egoists ====\nStirner establishes that reciprocity and what he calls \"intercourse\" are important elements of the Union of egoists: \"Like the hall, the prison does form a society, a companionship, a communion (e.g. communion of labor), but no intercourse, no reciprocity, no union. On the contrary, every union in the prison bears within it the dangerous seed of a \"plot,\" which under favorable circumstances might spring up and bear fruit\".Unions of egoists are also associations with a participant's active will: \"But war might rather be declared against establishment itself, the State, not a particular State, not any such thing as the mere condition of the State at the time; it is not another State (e.g. a \"people's State\") that men aim at, but their union, uniting, this ever-fluid uniting of everything standing. — A State exists even without my co-operation: I am born in it, brought up in it, under obligations to it, and must \"do it homage.\" [huldigen] It takes me up into its \"favor,\" [Huld] and I live by its \"grace.\" [...] Now the Nationals are exerting themselves to set up the abstract, lifeless unity of beehood; but the self-owned are going to fight for the unity willed by their own will, for union. [...] In this combination I see nothing whatever but a multiplication of my force, and I retain it only so long as it is my multiplied force. But thus it is a — union. Neither a natural ligature nor a spiritual one holds the union together, and it is not a natural, not a spiritual league\".\n\n\n==== What is and what is not a Union of egoists ====\nEgoistical relationships have to be flexible enough so that it can be ended up at the will of the participant. The Union of egoists ceases to be one under specific conditions, i.e. \"the party ceases to be a union at the same moment at which it makes certain principles binding and wants to have them assured against attacks; but this moment is the very birth-act of the party. As party it is already a born society, a dead union, an idea that has become fixed. As party of absolutism it cannot will that its members should doubt the irrefragable truth of this principle; they could cherish this doubt only if they were egoistic enough to want still to be something outside their party, i.e. non-partisans. Non-partisans they cannot be as party-men, but only as egoists. [...] [T]he dissolution of society is intercourse or union. A society does assuredly arise by union too, but only as a fixed idea arises by a thought — to wit, by the vanishing of the energy of the thought (the thinking itself, this restless taking back all thoughts that make themselves fast) from the thought. If a union [Verein] has crystallized into a society, it has ceased to be a coalition [Vereinigung]; for coalition is an incessant self-uniting; it has become a unitedness, come to a standstill, degenerated into a fixity; it is — dead as a union, it is the corpse of the union or the coalition, i.e. it is —society, community. [...] You bring into a union your whole power, your competence, and make yourself count; in a society you are employed, with your working power; in the former you live egoistically, in the latter humanly, i.e. religiously, as a \"member in the body of this Lord”; to a society you owe what you have, and are in duty bound to it, are — possessed by \"social duties\"; a union you utilize, and give it up undutifully and unfaithfully when you see no way to use it further\".Stirner admits that \"complete freedom\" is not possible, but he sees that the Union of egoists are the most free form of association that can be had: \"Limitation of liberty is inevitable everywhere, for one cannot get rid of everything; one cannot fly like a bird merely because one would like to fly so, for one does not get free from his own weight...The union will assuredly offer a greater measure of liberty, as well as (and especially because by it one escapes all the coercion peculiar to State and society life) admit of being considered as \"a new liberty\"; but nevertheless it will still contain enough of unfreedom and involuntariness. For its object is not this — liberty (which on the contrary it sacrifices to ownness), but only ownness\".\n\n\n=== Stirner's Critics ===\nIn Stirner's Critics, Stirner intended to respond to criticisms made to important arguments put forward in The Ego and Its Own. In it, Stirner tends to refer to himself in the third person. He defines the Union of egoists as follows: \"Egoism, as Stirner uses it, is not opposed to love nor to thought; it is no enemy of the sweet life of love, nor of devotion and sacrifice; it is no enemy of intimate warmth, but it is also no enemy of critique, nor of socialism, nor, in short, of any actual interest. It doesn't exclude any interest. It is directed against only disinterestedness and the uninteresting; not against love, but against sacred love, not against thought, but against sacred thought, not against socialists, but against sacred socialists, etc. The \"exclusiveness\" of the egoist, which some want to pass off as isolation, separation, loneliness, is on the contrary full participation in the interesting by — exclusion of the uninteresting\".\n\n\n==== Unions of egoists vs. class hierarchy ====\nIn this work, Stirner corrects what he sees as a misinterpretation of his idea of Union of egoists by the German socialist writer Moses Hess. He charges Hess of wanting to characterize Unions of egoists as \"the utterly common opposition of the liberal bourgeoisies who put the blame on the state when people fall into poverty and starve\". Instead, he corrects him by saying that it \"is a union in which most of those involved are hoodwinked about their most natural and obvious interests, a union of egoists? Have \"egoists\" come together where one is the slave or serf of the other? There are, it's true, egoists in such a society, and in this sense, it might in some aspects be called an \"egoistic union\"; but the slaves have not really sought this society from egoism, and are instead, in their egoistic hearts, against these lovely \"unions,\" as Hess calls them\".\n\n\n==== Stirner's examples of Unions of egoists in practice ====\nStirner also proceeds to give specific examples of what he would consider Unions of egoists: \"It would be another thing indeed, if Hess wanted to see egoistic unions not on paper, but in life. Faust finds himself in the midst of such a union when he cries: \"Here I am human, here I can be human\" — Goethe says it in black and white. If Hess attentively observed real life, to which he holds so much, he will see hundreds of such egoistic unions, some passing quickly, others lasting. Perhaps at this very moment, some children have come together just outside his window in a friendly game. If he looks at them, he will see a playful egoistic union. Perhaps Hess has a friend or a beloved; then he knows how one heart finds another, as their two hearts unite egoistically to delight (enjoy) each other, and how no one \"comes up short\" in this. Perhaps he meets a few good friends on the street and they ask him to accompany them to a tavern for wine; does he go along as a favor to them, or does he \"unite\" with them because it promises pleasure? Should they thank him heartily for the \"sacrifice,\" or do they know that all together they form an \"egoistic union\" for a little while?\".\n\n\n== Interpretations and influence ==\nScholar Andrew Carlson argues that people would be held together by mutual advantage through common \"use\" of one another in this Union of egoists. In joining the Union, an individual increases his own individual power—each person would through his own might control what they could. It does not imply though that there would be a region of universal rapacity and perpetual slaughter, nor does it mean the wielding of power over others as each person would defend his own uniqueness. Carlson holds that once a person has attained self-realization of true egoism, they would not want to rule over others or hold more possessions than they need because this would destroy their independence. Carlson views the Union of egoists as essentially a non-formal group that participants voluntarily engage in for personal gain. Since no one person is obligated to the group, they may leave if it ceases to serve their interests, making the benefit mutual to all members. Whereas individuals in communism are obligated to one another in society, in egoism they are obligated only to themselves. Stirner saw this as the opposite of a state, government or society, which could use the individual for its own gain without benefiting the individual or truly being in his interest.There would be neither masters nor servants, only egoists. Everyone would withdraw into his own uniqueness which would prevent conflict because no one will be trying to prove themselves \"in the right\" before a third party as each individual would be \"above\" the Union. It is claimed by egoist anarchists that egoism will foster genuine and spontaneous union between individuals. Stirner held that only this form of organisation would not intrude on the individual's power, exerting neither moral influence nor legal constraint.Stirner does not develop in any detail the form of social organisation that the Union of egoists might take, with some, such as Carlson, arguing that organization itself is anathema to Stirner's Union. Within the Union, the individual will be able to develop himself and the Union exists for the individual. The Union of egoists is not to be confused with society which Stirner opposes because society lays claim to a person which is considered to be sacred, but which consumes an individual. The Union is made up of individuals who consume the Union for their own good.In his introduction to Benjamin Tucker's 1907 edition of The Ego and His Own, James L. Walker said: \"In Stirner we have the philosophical foundation for political liberty. His interest in the practical development of egoism to the dissolution of the State and the union of free men is clear and pronounced, and harmonizes perfectly with the economic philosophy of Josiah Warren. Allowing for difference of temperament and language, there is a substantial agreement between Stirner and Proudhon. Each would be free, and sees in every increase of the number of free people and their intelligence an auxiliary force against the oppressor\".The writers of An Anarchist FAQ report that \"many in the anarchist movement in Glasgow, Scotland, took Stirner's \"Union of egoists\" literally as the basis for their anarcho-syndicalist organising in the 1940s and beyond. Similarly, we discover the noted anarchist historian Max Nettlau stating that \"[o]n reading Stirner, I maintain that he cannot be interpreted except in a socialist sense\". They also say \"Stirner believed that as more and more people become egoists, conflict in society will decrease as each individual recognises the uniqueness of others, thus ensuring a suitable environment within which they can co-operate (or find \"truces\" in the \"war of all against all\"). These \"truces\" Stirner termed \"Unions of egoists.\" [...] The unions Stirner desires would be based on free agreement, being spontaneous and voluntary associations drawn together out of the mutual interests of those involved, who would \"care best for their welfare if they unite with others\" [p. 309]. Unlike the state, the unions exist to ensure what Stirner calls \"intercourse\", or \"union\" between individuals. To better understand the nature of these associations, which will replace the state, Stirner lists the relationships between friends, lovers and children at play as examples [No Gods, No Masters, vol. 1, p. 25]. These illustrate the kinds of relationships that maximise an individual's self-enjoyment, pleasure, freedom and individuality as well as ensuring that those involved sacrifice nothing while belonging to them. Such associations are based on mutuality and a free and spontaneous co-operation between equals. As Stirner puts it, \"intercourse is mutuality, it is the action, the commercium, of individuals\" [p. 218]. Its aim is \"pleasure\" and \"self-enjoyment\".The idea of Union of egoists was interpreted in a sexual sense by French and Spanish individualist anarchists of the early 20th century. Catalan historian Xavier Diez reports: \"In this sense, the theoretical positions and the vital experiences of french [sic] individualism are deeply iconoclastic and scandalous, even within libertarian circles. The call of nudist naturism, the strong defence of birth control methods, the idea of \"unions of egoists\" with the sole justification of sexual practices, that will try to put in practice, not without difficulties, will establish a way of thought and action, and will result in sympathy within some, and a strong rejection within others\". The main theorist of this was the French individualist anarchist Émile Armand in what he called \"amorous camaraderie\".\nWhile explaining his concept of immediatism, post-left thinker Hakim Bey compares the idea of Union of egoists to those of other thinkers: The penetration of everyday life by the marvelous—the creation of \"situations\"—belongs to the \"material bodily principle\", and to the imagination, and to the living fabric of the present... The individual who realizes this immediacy can widen the circle of pleasure to some extent simply by waking from the hypnosis of the \"Spooks\" (as Stirner called all abstractions); and yet more can be accomplished by \"crime\"; and still more by the doubling of the Self in sexuality. From Stirner's \"Union of Self-Owning Ones\" we proceed to Nietzsche's circle of \"Free Spirits\" and thence to Charles Fourier's \"Passional Series\", doubling and redoubling ourselves even as the Other multiplies itself in the eros of the group.\nWhen speaking about his concept of permanent autonomous zone in his book Temporary Autonomous Zone, Hakim Bey compares it to Peter Kropotkin's concept of mutual aid. He says that \"face-to-face, a group of humans synergize their efforts to realize mutual desires, whether for good food and cheer, dance, conversation, the arts of life; perhaps even for erotic pleasure, or to create a communal artwork, or to attain the very transport of bliss—in short, a \"union of egoists\" (as Stirner put it) in its simplest form—or else, in Kropotkin's terms, a basic biological drive to \"mutual aid\".\n\n\n== See also ==\nAffinity group\nEgoist anarchism\n\n\n== References =="