"The Old Swiss Confederacy or Swiss Confederacy (Modern German: Alte Eidgenossenschaft; historically Eidgenossenschaft, after the Reformation also Corps des Suisses, Confoederatio helvetica \"Confederation of the Swiss\") was a loose confederation of independent small states (cantons, German Orte or Stände) initially within the Holy Roman Empire. It is the precursor of the modern state of Switzerland.\nIt formed during the 14th century, from a nucleus in what is now Central Switzerland,  expanding to include the cities of Zürich and Berne by the middle of the century. This formed a rare union of rural and urban communes, all of which enjoyed imperial immediacy in the Holy Roman Empire.\nThis confederation of eight cantons (Acht Orte) was politically and militarily successful for more than a century, culminating in the Burgundy Wars of the 1470s which established it as a power in the complicated political landscape dominated by France and the Habsburgs. Its success resulted in the addition of more confederates, increasing the number of cantons to thirteen (Dreizehn Orte) by 1513. The confederacy pledged neutrality in 1647 (under the threat of the Thirty Years' War), although many Swiss served privately as mercenaries in the Italian Wars and during the Early Modern period.\nAfter the Swabian War of 1499 the confederacy was a de facto independent state throughout the early modern period, although still nominally part of the Holy Roman Empire until 1648 when the Treaty of Westphalia ended the Thirty Years' War. The Swiss Reformation divided the confederates into Reformed and Catholic parties, resulting in internal conflict from the 16th to the 18th centuries; as a result, the federal diet (Tagsatzung) was often paralysed by hostility between the factions. The Swiss Confederacy fell to invasion by the French Revolutionary Army in 1798, after which it became the short-lived Helvetic Republic.\n\n\n== Name ==\n\nThe adjective \"old\" was introduced after the Napoleonic era with Ancien Régime, retronyms distinguishing the pre-Napoleonic from the restored confederation. During its existence the confederacy was known as Eidgenossenschaft or Eydtgnoschafft (\"oath fellowship\"), in reference to treaties among cantons; this term was first used in the 1370 Pfaffenbrief. Territories of the confederacy came to be known collectively as Schweiz or Schweizerland (Schwytzerland in contemporary spelling), with the English Switzerland beginning during the mid-16th century. From that time the Confederacy was seen as a single state, also known as the Swiss Republic (Republic der Schweitzer, République des Suisses and Republica Helvetiorum by Josias Simmler in 1576) after the fashion of calling individual urban cantons republics (such as the Republics of Zürich, Berne and Basel).\n\n\n== History ==\n\n\n=== Foundation ===\n\nThe nucleus of the Old Swiss Confederacy was an alliance among the valley communities of the central Alps to facilitate management of common interests (such as trade) and ensure peace along trade routes through the mountains. The foundation of the Confederacy is marked by the Rütlischwur (dated to 1307 by Aegidius Tschudi) or the 1315 Pact of Brunnen.\nSince 1889, the Federal Charter of 1291 among the rural communes of Uri, Schwyz, and Unterwalden has been considered the founding document of the confederacy.\n\n\n=== Expansion ===\n\nThe initial pact was augmented by pacts with the cities of Lucerne, Zürich, and Berne. This union of rural and urban communes, which enjoyed the status of imperial immediacy within the Holy Roman Empire, was engendered by pressure from Habsburg dukes and kings who had ruled much of the land. In several battles with Habsburg armies, the Swiss were victorious; they conquered the rural areas of Glarus and Zug, which became members of the confederacy.From 1353 to 1481, the federation of eight cantons—known in German as the Acht Orte (Eight Cantons)—consolidated its position. The members (especially the cities) enlarged their territory at the expense of local counts—primarily by buying judicial rights, but sometimes by force. The Eidgenossenschaft, as a whole, expanded through military conquest: the Aargau was conquered in 1415 and the Thurgau in 1460. In both cases, the Swiss profited from weakness in the Habsburg dukes. In the south, Uri led a military territorial expansion that (after many setbacks) would by 1515 lead to the conquest of the Ticino.\nNone of these territories became members of the confederacy; they had the status of condominiums (regions administered by several cantons).\nAt this time, the eight cantons gradually increased their influence on neighbouring cities and regions through additional alliances. Individual cantons concluded pacts with Fribourg, Appenzell, Schaffhausen, the abbot and the city of St. Gallen, Biel, Rottweil, Mulhouse and others. These allies (known as the Zugewandte Orte) became closely associated with the confederacy, but were not accepted as full members.\nThe Burgundy Wars prompted a further enlargement of the confederacy; Fribourg and Solothurn were accepted in 1481. In the Swabian War against Holy Roman Emperor Maximilian I, the Swiss were victorious and exempted from imperial legislation. The associated cities of Basel and Schaffhausen joined the confederacy as a result of that conflict, and Appenzell followed suit in 1513 as the thirteenth member. The federation of thirteen cantons (Dreizehn Orte) constituted the Old Swiss Confederacy until its demise in 1798.\nThe expansion of the confederacy was stopped by the Swiss defeat in the 1515 Battle of Marignano. Only Berne and Fribourg were still able to conquer the Vaud in 1536; the latter primarily became part of the canton of Berne, with a small portion under the jurisdiction of Fribourg.\n\n\n=== Reformation ===\n\nThe Reformation in Switzerland led to doctrinal division amongst the cantons. Zürich, Berne, Basel, Schaffhausen and associates Biel, Mulhouse, Neuchâtel, Geneva and the city of St. Gallen became Protestant; other members of the confederation and the Valais remained Catholic. In Glarus, Appenzell, in the Grisons and in most condominiums both religions coexisted; Appenzell split in 1597 into a Catholic Appenzell Inner Rhodes and a Protestant Appenzell Outer Rhodes.\nThe division led to civil war (the Wars of Kappel) and separate alliances with foreign powers by the Catholic and Protestant factions, but the confederacy as a whole continued to exist. A common foreign policy was blocked, however, by the impasse. During the Thirty Years' War, religious disagreements among the cantons kept the confederacy neutral and spared it from belligerents. At the Peace of Westphalia, the Swiss delegation was granted formal recognition of the confederacy as a state independent of the Holy Roman Empire.\n\n\n=== Early modern period ===\n\nGrowing social differences and an increasing absolutism in the city cantons during the Ancien Régime led to local popular revolts. An uprising during the post-war depression after the Thirty Years' War escalated to the Swiss peasant war of 1653 in Lucerne, Berne, Basel, Solothurn and the Aargau. The revolt was put down swiftly by force and with the help of many cantons.\nReligious differences were accentuated by a growing economic discrepancy. The Catholic, predominantly rural central-Swiss cantons were surrounded by Protestant cantons with increasingly commercial economies. The politically dominant cantons were Zürich and Berne (both Protestant), but the Catholic cantons were influential since the Second War of Kappel in 1531. A 1655 attempt (led by Zürich) to restructure the federation was blocked by Catholic opposition, which led to the first battle of Villmergen in 1656; the Catholic party won, cementing the status quo. The problems remained unsolved, erupting again in 1712 with the second battle of Villmergen. This time the Protestant cantons won, dominating the confederation. True reform, however, was impossible; the individual interests of the thirteen members were too diverse, and the absolutist cantonal governments resisted all attempts at confederation-wide administration. Foreign policy remained fragmented.\n\n\n=== Collapse ===\n\nAttempting to gain control of key Alpine passes and establish a buffer against hostile monarchies, France first invaded associates of the Swiss Confederation; part of the bishopric of Basel was absorbed by France in 1793. In 1797, Napoleon annexed the Valtellina (on the border with Graubünden) into the new Cisalpine Republic in northern Italy and invaded the southern remainder of the bishopric of Basel.In 1798 the confederacy was invaded by the French Revolutionary Army at the invitation of the Republican faction in Vaud, led by Frédéric-César de La Harpe. Vaud was under Bernese control, but chafed under a government with a different language and culture. The ideals of the French Revolution found a receptive audience in Vaud, and when Vaud declared itself a republic the French had a pretext to invade the confederation.\nThe invasion was largely peaceful (since the Swiss people failed to respond to political calls to take up arms), and the collapse of the confederacy was due more to internal strife than external pressure. Only Bern put up an effective resistance, but after its defeat in the March Battle of Grauholz it capitulated. The canton of Bern was divided into the canton of Oberland (with Thun as its capital) and the canton of Léman (with Lausanne as its capital).\nThe Helvetic Republic was proclaimed on 12 April 1798 as \"one and indivisible\", abolishing cantonal sovereignty and feudal rights and reducing the cantons to administrative districts. This system was unstable due to widespread opposition, and the Helvetic Republic collapsed as a result of the Stecklikrieg. A federalist compromise solution was attempted, but conflict between the federalist elite and republican subjects persisted until the formation of the federal state in 1848.\n\n\n== Structure ==\n\nThe (Alte) Eidgenossenschaft was initially united not by a single pact, but by overlapping pacts and bilateral treaties between members. The parties generally agreed to preserve the peace, aid in military endeavours and arbitrate disputes. Slowly, the members began to see the confederation as a unifying entity. In the Pfaffenbrief, a treaty of 1370 among six of the eight members (Glarus and Berne did not participate) forbidding feuds and denying clerical courts jurisdiction over the confederacy, the cantons for the first time used the term Eidgenossenschaft. The first treaty uniting the eight members of the confederacy was the Sempacherbrief of 1393, concluded after victories over the Habsburgs at Sempach in 1386 and Näfels in 1388, which forbade a member from unilaterally beginning a war without the consent of the other cantons. A federal diet, the Tagsatzung, developed during the 15th century.\nPacts and renewals (or modernizations) of earlier alliances reinforced the confederacy. The individual interests of the cantons clashed in the Old Zürich War (1436–1450), caused by territorial conflict among Zürich and the central Swiss cantons over the succession of the Count of Toggenburg. Although Zürich entered an alliance with the Habsburg dukes, it then rejoined the confederacy. The confederation had become so close a political alliance that it no longer tolerated separatist tendencies in its members.\n\nThe Tagsatzung was the confederation council, typically meeting several times a year. Each canton delegated two representatives (including the associate states, which had no vote). The canton where the delegates met initially chaired the gathering, but during the 16th century Zürich permanently assumed the chair (Vorort) and Baden became the seat. The Tagsatzung dealt with inter-cantonal affairs and was the court of last resort in disputes between member states, imposing sanctions on dissenting members. It also administered the condominiums; the reeves were delegated for two years, each time by a different canton.A unifying treaty of the Old Swiss Confederacy was the Stanser Verkommnis of 1481. Conflicts between rural and urban cantons and disagreements over the bounty of the Burgundian Wars had led to skirmishes. The city-states of Fribourg and Solothurn wanted to join the confederacy, but were distrusted by the central Swiss rural cantons. The compromise by the Tagsatzung in the Stanser Verkommnis restored order and assuaged the rural cantons' complaints, with Fribourg and Solothurn accepted into the confederation. While the treaty restricted freedom of assembly (many skirmishes arose from unauthorised expeditions by soldiers from the Burgundian Wars), it reinforced agreements amongst the cantons in the earlier Sempacherbrief and Pfaffenbrief.\nThe civil war during the Reformation ended in a stalemate. The Catholic cantons could block council decisions but, due to geographic and economic factors, could not prevail over the Protestant cantons. Both factions began to hold separate councils, still meeting at a common Tagsatzung (although the common council was deadlocked by disagreements between both factions until 1712, when the Protestant cantons gained power after their victory in the second war of Villmergen). The Catholic cantons were excluded from administering the condominiums in the Aargau, the Thurgau and the Rhine valley; in their place, Berne became co-sovereign of these regions.\n\n\n== List of territories ==\n\n\n=== Cantons ===\n\nThe confederation expanded in several stages: first to the Eight Cantons (Acht Orte), then in 1481 to ten, in 1501 to twelve, and finally to thirteen cantons (Dreizehn Orte).\nFounding cantons (Urkantone):\n Uri, founding canton named in the Federal Charter of 1291\n Schwyz, founding canton named in the Federal Charter of 1291\n Unterwalden, founding canton  named in the Federal Charter of 1291\n14th century: expansion to the Achtörtige Eidgenossenschaft following the battles of Morgarten and Laupen:\n Lucerne, city canton, since 1332\n Zürich, city canton, since 1351\n Glarus, rural canton, since 1352\n Zug, city canton, since 1352\n Berne, city canton, since 1353; associate since 1323\n15th century: expansion to the Zehnörtige Eidgenossenschaft following the Burgundian Wars:\n Fribourg, city canton, since 1481; associate since 1454\n Solothurn, city canton, since 1481; associate since 1353\n16th century: expansion to the Dreizehnörtige Eidgenossenschaft  following the Swabian War:\n Basel, city canton, since 1501\n Schaffhausen, city canton, since 1501; associate since 1454\n Appenzell, rural canton, since 1513; associate since 1411\n\n\n=== Associates ===\n\nAssociates (Zugewandte Orte) were close allies of the Old Swiss Confederacy, connected to the union by alliance treaties with all or some of the individual members of the confederacy.\n\n\n==== Closest associates ====\nThree of the associates were known as Engere Zugewandte:\n\n Biel – 1344–82 treaties with Fribourg, Berne and Solothurn. Nominally, Biel was subject to the Bishopric of Basel.\n Imperial Abbey of St. Gallen – 1451 treaty with Schwyz, Lucerne, Zürich and Glarus, renewed in 1479 and 1490. The abbey was simultaneously a protectorate.\n Imperial City of St. Gallen – 1454 treaty with Schwyz, Lucerne, Zürich, Glarus, Zug and Berne.\n\n\n==== Eternal associates ====\nTwo federations were known as Ewige Mitverbündete:\n\n Sieben Zenden, an independent federation in the Valais – Became a Zugewandter Ort in 1416 through an alliance with Uri, Unterwalden and Lucerne, followed by a treaty with Berne in 1446.\nThree Leagues were independent federations on the territory of the Grisons and became an associates of the Old Swiss Confederacy in 1497/98 through the events of the Swabian War. The Three Leagues together concluded an alliance pact with Berne in 1602.\n Grey League, who had been allied with Glarus, Uri and Obwalden through pacts from 1400, 1407 and 1419, entered an alliance with seven of the old eight cantons (the Acht Orte without Berne) in 1497\n League of God's House (Gotteshausbund) followed suit a year later.\n League of the Ten Jurisdictions, the third of the leagues, entered an alliance with Zürich and Glarus in 1590.\n\n\n==== Protestant associates ====\nThere were two Evangelische Zugewandte:\n\n Imperial City of Mulhouse – Concluded a first treaty with some cantons in 1466 and became an associate in 1515 through a treaty with all 13 members of the Confederacy, remaining so until events of the French Revolutionary Wars in 1797.\n Imperial City of Geneva – 1536 treaty with Berne and a 1584 treaty with Zürich and Berne.\n\n\n==== Other ====\n County of Neuchâtel – 1406 and 1526 treaties with Berne and Solothurn, 1495 treaty with Fribourg and 1501 treaty with Lucerne.\n Imperial Valley of Urseren – 1317 treaty with Uri; annexed by Uri in 1410.\n Weggis – 1332–1380 by treaties with Uri, Schwyz, Unterwalden and Lucerne; annexed by Lucerne in 1480.\n Murten – from 1353 by treaty with Berne; became a confederal condominium in 1475.\n Payerne – from 1353 by treaty with Berne; annexed by Berne in 1536.\n Vogtei of Bellinzona – from 1407 by treaty with Uri and Obwalden; became a confederal condominium from 1419–22.\n County of Sargans – from 1437 by treaty with Glarus and Schwyz; became a confederal condominium in 1483.\n Barony of Sax-Forstegg – from 1458 by treaty with Zürich; annexed by Zürich in 1615\n Stein am Rhein – from 1459 by treaty with Zürich and Schaffhausen; annexed by Zürich in 1484.\n County of Gruyère – had been allied with Fribourg and Berne since the early 14th century, becoming a full associate of the Confederation in 1548. When the counts fell bankrupt in 1555, the country was partitioned in twain:Lower Gruyère – from 1475 by treaty with Fribourg\nUpper Gruyère – from 1403 by treaty with Berne; annexed by Berne in 1555:\n Imperial Valley of Saanen\n Imperial Valley of Château-d'Œx\n County of Werdenberg – from 1493 by treaty with Lucerne; annexed by Glarus in 1517.\n Imperial City of Rottweil – from 1519–1632 through a treaty with all 13 members; a first treaty on military cooperation had already been concluded in 1463. In 1632, the treaty was renewed with Lucerne, Uri, Schwyz, Unterwalden, Zug, Solothurn and Fribourg.\n Bishopric of Basel – 1579–1735 by treaty with Lucerne, Uri, Schwyz, Unterwalden, Zug, Solothurn and Fribourg.\n\n\n=== Condominiums ===\nCondominiums (German: Gemeine Herrschaften) were common subject territories under the administration of several cantons. They were governed by reeves (Vögte) delegated for two years, each time from another of the responsible cantons. Berne initially did not participate in the administration of some of the eastern condominiums, as it had no part in their conquest and its interests were focused more on the western border. In 1712, Berne replaced the Catholic cantons in the administration of the Freie Ämter (\"Free Districts\"), the Thurgau, the Rhine valley, and Sargans, and furthermore the Catholic cantons were excluded from the administration of the County of Baden.\n\n\n==== German bailiwicks ====\nThe \"German bailiwicks\" (German: Deutsche Gemeine Vogteien, Gemeine Herrschaften) were generally governed by the Acht Orte apart from Berne until 1712, when Bern joined the sovereign powers:\n\n Freie Ämter – conquered 1415 and partitioned in 1712:\nUpper Freiamt was governed by the Acht Orte;\nLower Freiamt was governed by Zürich, Bern and Glarus alone.\n County of Baden – conquered 1415; from 1712 governed by Zürich, Bern and Glarus.\n County of Sargans – from 1460/83\n Landgraviate of Thurgau – from 1460\n Vogtei of Rheintal – from 1490, Acht Orte minus Bern, plus the Imperial Abbey of St Gall. Appenzell added in 1500; Berne added in 1712.\n\n\n==== Italian bailiwicks ====\n\nSeveral bailiwicks (Vogteien) were generally referred to as \"transmontane bailiwicks\" (German: Ennetbergische Vogteien, Italian: Baliaggi Ultramontani).\nIn 1440, Uri conquered the Leventina Valley from the Visconti, dukes of Milan. Some of this territory had previously been annexed between 1403 and 1422. Further territories were acquired in 1500; see History of Ticino for further details.\nThree bailiwicks, all now in the Ticino, were condominiums of the Forest cantons of Uri, Schwyz and Nidwalden:\n\nVogtei of Blenio – 1477–80 and from 1495\nVogtei of Rivera – 1403–22 and from 1495\nVogtei of Bellinzona – from 1500Four other Ticinese bailiwicks were condominiums of the Zwölf Orte (the original 13 cantons, minus Appenzell) from 1512:\n\nLandvogtei of Valmaggia\nLandvogtei of Lugano\nLandvogtei of Locarno\nLandvogtei of MendrisioAnother three bailiwicks were condominiums of the Zwölf Orte from 1512, but were lost from the Confederacy three years later and are all now comuni of Lombardy:\n\nTravaglia\nCuvio\nEschental (now Ossola)\n\n\n==== Two-party condominiums ====\n\n\n===== Bern and Fribourg =====\n County of Grasburg / Schwarzenburg – from 1423\n Murten – from 1475\n Grandson – from 1475\n Orbe and Echallens – from 1475\n\n\n===== Glarus and Schwyz =====\n Uznach – from 1437\n, Windegg / Gaster – from 1438\n  Hohensax / Gams – from 1497\n\n\n===== Condominiums with third-parties =====\nLordship of Tessenberg – from 1388, condominium between Berne and Bishopric of Basel\n\n\n=== Protectorates ===\n Bellelay Abbey – protectorate of Bern, Biel and Solothurn from 1414; nominally under the jurisdiction of the Bishopric of Basel\n Einsiedeln Abbey – protectorate of Schwyz from 1357\n Engelberg Abbey – protectorate of Lucerne, Uri, Schwyz and Unterwalden from 1425\n Erguel – protectorate of Biel/Bienne under military jurisdiction from 1335; also subject to the Bishopric of Basel\n Imperial Abbey of St. Gallen – protectorate of Schwyz, Lucerne, Zürich and Glarus from 1451; the abbey was simultaneously a Zugewandter Ort.\n Republic of Gersau, an independent village – allied with Schwyz since 1332; Lucerne, Uri and Unterwalden were also protecting powers.\n Moutier-Grandval Abbey – protectorate of Berne from 1486; the abbey was also subject to the Bishopric of Basel and, until 1797, the Holy Roman Empire\n La Neuveville – protectorate of Berne from 1388; also subject to the Bishopric of Basel.\n Pfäfers Abbey – protectorate of the Acht Orte minus Berne from 1460; annexed to the County of Sargans in 1483\n Rapperswil – protectorate of Uri, Schwyz, Unterwalden and Glarus from 1464; of Zürich, Berne and Glarus from 1712\n County of Toggenburg – protectorate of Schwyz and Glarus from 1436; of Zürich and Berne from 1718. The county was simultaneously subject to St Gallen Abbey.\n\n\n=== Separate subjects ===\nSome territories were separate subjects of cantons or associates, Einzelörtische Untertanen von Länderorten und Zugewandten:\n\n\n==== Uri ====\n Valley of Leventina (1403, 1439)\n Valley of Urseren (1440)\n\n\n==== Schwyz ====\n Küssnacht (1402)\n Einsiedeln Abbey (1397 / 1424)\n March (1405 / 36)\n Höfe (1440)\n\n\n==== Glarus ====\n County of Werdenberg (1485 / 1517); annexed to Lucerne in 1485; to Glarus in 1517\n\n\n==== Valais ====\n St-Maurice (1475 / 77)\n  Monthey (1536)\n  Nendaz-Hérémence (1475 / 77)\n  Port Valais/Vionnaz\nLötschental (15th century); the five upper Zenden\n\n\n==== Three Leagues ====\n Bormio (1512)\nChiavenna (1512)\nValtellina (1512)\nDrei Pleven (1512–26)\n Maienfeld (Bündner Herrschaft) (1509–1790); simultaneously a member of the League of the Ten Jurisdictions.\n\n\n== Notes and references ==\n\n\n== Further reading ==\nAubert, J.-F.: Petite histoire constitutionnelle de la Suisse, 2nd ed.; Francke Editions, Bern, 1974. (in French)\nPeyer, H. C.: Verfassungsgeschichte der alten Schweiz, Schulthess Polygraphischer Verlag, Zürich, 1978. ISBN 3-7255-1880-7. (in German)\n\n\n== External links ==\n Media related to Alte Eidgenossenschaft (Old Swiss Confederacy) at Wikimedia Commons"