"Phabullo Rodrigues da Silva (born November 1, 1993), known professionally as Pabllo Vittar (Portuguese pronunciation: [ˈpablu viˈtaɾ]) is a Brazilian drag queen, singer and songwriter. Vittar appeared on TV for the first time in 2014, on a Brazilian talent singing show, performing \"I Have Nothing\" by Whitney Houston. He became famous in the media in 2015 with the success of his music video \"Open Bar\", a Portuguese-language version of Major Lazer's song \"Lean On\" with original lyrics, produced by Bonde do Rolê and Omulu. In less than four months, the video reached one million views on YouTube. \nHe also released an extended play with the same name, using pop hits' instrumentals with new arrangements and lyrics.\nOn January 12, 2017, his debut studio album Vai Passar Mal was released – including the singles \"Nêga\", \"Todo Dia\", \"K.O.\", \"Corpo Sensual\", \"Então Vai\" (with Diplo) and \"Indestrutível\". In the same month he released \"Todo Dia\" as the second single of the album, which became notorious in Brazilian Carnival due to its lyrics. The third single \"K.O.\" became an even bigger hit and brought Vittar to nationwide fame and success; as of 2019, the song has over 350 million views on YouTube. The fourth single, \"Corpo Sensual\", was released on September 6, 2017, to similar success, resulting in over 290 million views on YouTube.\nVittar has been featured in songs by international artists such as Major Lazer's \"Sua Cara\" (with fellow Brazilian singer Anitta). The music video was released on July 30, 2017, and reached 10th place on the list of most viewed online videos in the first 24 hours, with 25 million views. The singer also appears on \"I Got It\", from Charli XCX's fourth mixtape Pop 2. Vittar collaborated again with XCX on \"Flash Pose\", released on July 25, 2019; the single was later included on Vittar's 111 1 EP. He also got to perform \"Flash Pose\" at the 2019 MTV Europe Music Awards.\nOn August 15, 2018, Pabllo Vittar released his second studio album Não Para Não – including the singles \"Problema Seu\", \"Disk Me\", \"Seu Crime\", \"Buzina\" and \"Não Vou Deitar\". Vittar toured in support of the album, in Brazil and internationally. An extended tour called \"NPN Pride\" saw Vittar performing in various pride parades throughout USA and Canada. The first two singles were released to great success, with \"Disk Me\" reaching over 71 million views and \"Problema Seu\" reaching over 97 million views on Youtube. The singles \"Seu Crime\" and \"Buzina\" also were successful, albeit with smaller numbers, with both reaching over 20 million views on Youtube. This album also featured Brazilian singers Dilsinho and Ludmilla in \"Trago seu Amor de Volta\" and \"Vai Embora\", respectively.\nOn October 31, 2019, Pabllo Vittar released the 111 1 EP – including the singles \"Parabéns\" (with Brazilian rapper Psirico), \"Amor de Que\" and \"Flash Pose\" (with Charli XCX). Following the success of the 111 1 EP, \"Amor de Que\" rose to success thanks to the 2020 Brazilian Carnival, with the song reaching over 50 million views in just a month; as of 2020, the song has over 97 million views. \"Parabéns\" was released as the second single and also enjoyed similar success, with over 94 million views on Youtube as of 2020. \"Flash Pose\" had modest success, reaching over 23 million views on Youtube.\nOn March 24, 2020, Vittar's third studio album 111 was released – including the singles \"Clima Quente\" (with Brazilian Jerry Smith), \"Tímida\" (with Thalía) and \"Rajadão\"; the songs from the EP were also included in the album. Vittar collaborated with various artists on the album, and included songs in Portuguese, English and Spanish.\nWith the nomination of \"Sua Cara\" at the 19th Annual Latin Grammy Awards, Vittar became the first Grammy-nominated drag queen. He also became the first drag queen to win an EMA award in its 25-year run for Best Brazilian Act.\n\n"