"The epilimnion or surface layer is the top-most layer in a thermally stratified lake. It sits above the deeper metalimnion and hypolimnion. It is typically warmer and has a higher pH and higher dissolved oxygen concentration than the hypolimnion.\n\n\n== Physical Structure ==\n\n\n=== Properties ===\nIn the water column, the epilimnion sits above all other layers. The epilimnion is only present in stratified lakes. On the topside of the epilimnion it is in contact with air, which leaves it open to wind action, which allows the water to experience turbulence. Turbulence and convection work together to make waves which increases aeration. On the bottom side of the epilimnion is the metalimnion, which contains the thermocline. The thermocline is created because of the difference in temperature between the epilimnion and the metalimnion. This is due to the fact that since the epilimnion is in contact with air and is above everything, it interacts with the sun and heat more, making it warmer than the layers below. In certain areas during the winter, the epilimnion will freeze over, cutting off the lake from being aerated directly.\n\n\n=== Lake Turnover and Mixing ===\nIn most stratified lakes, seasonal changes in the spring and fall air temperature cause the epilimnion to warm up or cool down. During these seasonal changes stratified lakes may experience a lake turnover. During this, the epilimnion and hypolimnion mix together and the lake generally becomes un-stratified, meaning it has a constant temperature throughout, and the nutrients are even throughout the lake. There are different names for these turnovers based on how many times the lake does it in a year. Monomictic lakes flip only once, dimictic flip twice, and polymictic lakes flip more than twice. These turnovers can be based on seasonal differences, or can even happen daily. In some cases this causes the lake to have inverse stratification, where the epilimnion has cooler water than the hypolimnion.\n\n\n== Chemistry ==\nWith the layer being open to air, the epilimnion usually has high amounts of dissolved O2 and CO2. This means the epilimnion is in a constant state of exchange of dissolved gases with the atmosphere. The epilimnion is also an area of concern for algal blooms due to phosphorus and nitrogen runoff from terrestrial sources. Wind erosion carrying soil particles can also introduce many different nutrients into the water as well, and those particles will enter the lake system through the epilimnion.\n\n\n== Biology ==\nBecause of its closeness to the surface, and being the area that receives the most sunlight, the epilimnion is a great home for phytoplankton, and other primary producers. Algal blooms are common in this layer as a result of large accumulations of nutrients. In response to large amounts of algae and phytoplankton being present, many fish species are common in this layer as they look for their source of food. Birds will often use the epilimnion as an area for rest and/or fishing. Many insects also make various uses of the epilimnion when it comes to nest making and habitat. Human interactions are also an important part of the biological part of the epilimnion. Some direct human interactions are recreational uses such as swimming, boating, or other activities. Other indirect interactions may come from sewage, runoff of agricultural fields, or land development. These are all able to affect properties of the epilimnion.\n\n\n== References ==\n\n\n== External links ==\nhttp://wow.nrri.umn.edu/wow/teacher/thermal/teaching.html"