"Sansevieria is a historically recognized genus of flowering plants, native to Africa, notably Madagascar, and southern Asia, now included in the genus Dracaena on the basis of molecular phylogenetic studies. Common names for the 70 or so species formerly placed in the genus include mother-in-law's tongue, devil's tongue, jinn's tongue, bow string hemp, snake plant and snake tongue. In the APG III classification system, Dracaena is placed in the family Asparagaceae, subfamily Nolinoideae (formerly the family Ruscaceae). It has also been placed in the former family Dracaenaceae.\n\n\n== Description ==\nThere is great variation within the species formerly placed in the genus; they range from succulent desert plants such as Dracaena pinguicula to thinner leafed tropical plants such as Dracaena trifasciata. Plants often form dense clumps from a spreading rhizome or stolons.\n\n\n=== Foliage ===\nThe leaves of former Sansevieria species are typically arranged in a rosette around the growing point, although some species are distichous. There is a great variation in foliage form. All former species can be divided into one of two basic categories based on their leaves: hard leaved and soft-leaved species. Typically, hard-leaved species originate from arid climates, while soft-leaved species originate from tropical and subtropical regions. Hard leaved species have a number of adaptations for surviving dry regions. These include thick, succulent leaves for storing water and thick leaf cuticles for reducing moisture loss. These leaves may be cylindrical to reduce surface area and are generally shorter than those of their soft leafed tropical counterparts, which are wide and strap-like.\n\n\n=== Flowers ===\nThe flowers of former Sansevieria species are usually greenish-white, also rose, lilac-red, brownish, produced on a simple or branched raceme. The fruit is a red or orange berry. In nature, they are pollinated by moths, but both flowering and fruiting are erratic and few seeds are produced. The raceme is derived from the apical meristem, and a flowered shoot will no longer produce new leaves. Unlike plants such as agave which die after flowering, a bloomed shoot will simply cease to produce new leaves. The flowered shoot continues to grow by producing plantlets via its rhizomes or stolons.\n\n\n== Taxonomy ==\nThe genus name Sansevieria honors Italian scientist and inventor Raimondo di Sangro [1710–71], Prince of San Severo. The genus was originally named Sanseverinia by Vincenzo Petagna in 1787, to honor his patron Pietro Antonio Sanseverino, Count of Chiaromonte (1724–1771), in whose garden Petagna had seen the plant. In 1794, Carl Peter Thunberg used the name Sansevieria. It is not clear whether Thunberg's name was intended to be new, or was a typographical error for Petagna's name. \"Sansevieria Thunb.\" is a conserved name in the International Code of Nomenclature for algae, fungi, and plants, notwithstanding arguments that the author should be given as Petagna. The spellings \"Sanseveria\" and \"Sanseviera\" are commonly seen as well, the confusion deriving from alternate spellings of the Italian place name.Molecular phylogenetic studies showed that Sansevieria was nested within Dracaena, rendering the latter paraphyletic unless Dracaena was expanded to include the species formerly placed in Sansevieria.\n\n\n=== Sections ===\nAs of 2015, the genus was subdivided into three sections, one of which was further subdivided into three subsections:\nsect. Sansevieria\nsubsect. Sansevieria\nsubsect. Hastifolia\nsubsect. Solonifera\nsect. Dracomima\nsect. Cephalantha\n\n\n=== Selected former species ===\nSansevieria arborescens Cornu ex Gérôme & Labroy = Dracaena arborescens (Cornu ex Gérôme & Labroy) Byng & Christenh.\nSansevieria bagamoyensis Carrière = Dracaena bagamoyensis (N.E.Br.) Byng & Christenh.\nSansevieria ballyi = Dracaena ballyi\nSansevieria carnea Andrews = Reineckea carnea (Andrews) Kunth\nSansevieria cylindrica Bojer ex Hook. = Dracaena angolensis (Welw. ex Carrière) Byng & Christenh.\nSansevieria ehrenbergii  Schweinf. ex Baker = Dracaena hanningtonii Baker\nSansevieria eilensis Chahin. = Dracaena eilensis (Chahin.) Byng & Christenh.\nSansevieria fischeri Baker = Dracaena fischeri\nSansevieria kirkii Baker = Dracaena pethera Byng & Christenh.\nSansevieria masoniana Chahin = Dracaena masoniana (Chahin.) Byng & Christenh.\nSansevieria pinguicula P.R.O.Bally = Dracaena pinguicula (P.R.O.Bally) Byng & Christenh.\nSansevieria stuckyi God.-Leb. ex Gérôme & Labroy = Dracaena stuckyi (God.-Leb.) Byng & Christenh.\nSansevieria suffruticosa N.E.Br. = Dracaena suffruticosa (N.E.Br.) Byng & Christenh.\nSansevieria trifasciata Prain = Dracaena trifasciata (Prain) Mabb.\n\n\n== Uses ==\n\n\n=== Rope and traditional uses ===\nIn Africa, the leaves of former Sansevieria species are used for fiber production; in some species, e.g. Dracaena hanningtonii, the plant's sap has antiseptic qualities, and the leaves are used for bandages in traditional first aid.\n\n\n=== Ornamental purposes ===\n\nSeveral former Sansevieria species are popular houseplants in temperate regions, with Dracaena trifasciata the most widely sold; numerous cultivars are available. In China, the plant is usually kept potted in a pot often ornamented with dragons and phoenixes. Growth is comparatively slow and the plant will last for many years. There are two main varieties: wild type sansevierias have stiff, erect, scattered, lance-shaped leaves while the bird's nest sansevierias grow in rosettes. As houseplants, sansevierias thrive on warmth and bright light, but will also tolerate shade. They can rot from over-watering, so it is important that they are potted in well-drained soil, and not over-watered.  They need to be re-potted or split at the root from time to time because they will sometimes grow so large that they break the pot they are growing in.\nIn Korea, potted sansevierias are commonly presented as a gift during opening ceremonies of businesses or other auspicious events.\nIn Barbados, sansevieria is also popularly referred to as the \"money plant\", with the belief that the person having it will always have money.  The belief seems to be based on an association of the color (green) with the US bills.Other former Sansevieria species are less common in cultivation. Another species is Sansevieria cylindrica, which has leaves which look quite different from D. trifasciata, but is equally tough.Plants can be propagated by seed, leaf-cutting, and division. Seeds are rarely used, as plants can normally be grown much faster from cuttings or divisions. As many cultivars are periclinal chimeras, they do not come true to type from leaf cuttings, and therefore must be propagated by rhizome division to retain the variegation.\n\n\n=== Scenery in film and television ===\nSansevierias have frequently been used as a set decoration in many films and TV shows, both in Hollywood and internationally, since at least the 1930s, including A Serbian Film, Being John Malkovich, Blue Velvet, Duck Soup, Groundhog Day, Homegrown, The Paper, and These Final Hours.\n\n\n=== Air purification ===\nAccording to a NASA Clean Air Study, along with other plants such as golden pothos (Epipremnum aureum) and corn plant (Dracaena fragrans), Dracaena trifasciata is capable of purifying air by removing some pollutants such as formaldehyde, xylene, and toluene. Sansevierias use the crassulacean acid metabolism process, which absorbs carbon dioxide at night, although oxygen is released during daylight. Nighttime absorption of CO2 purportedly makes them especially suitable bedroom plants. However, since the leaves are potentially poisonous if ingested, they are not  usually recommended for children's bedrooms.\n\n\n=== Feng shui ===\nAccording to feng shui, because the leaves of sansevierias grow upwards, the plants can be used for feng shui purposes. Some believe that having sansevierias near children helps reduce coarseness, although care must be taken to ensure the child cannot reach the plant's poisonous leaves. Others recommend placing pots near the toilet tank to counter the drain-down vibrations.\n\n\n== References ==\n\n\n== External links ==\n\"Hemp, Bowstring\" . New International Encyclopedia. 1905."