"Colocasia esculenta is a tropical plant grown primarily for its edible corms, a root vegetable most commonly known as taro (),  kalo, dasheen or godere (see §Names and etymology for an extensive list). It is the most widely cultivated species of several plants in the family Araceae that are used as vegetables for their corms, leaves, and petioles. Taro corms are a food staple in African, Oceanic, and South Asian cultures (similar to yams), and taro is believed to have been one of the earliest cultivated plants.\n\n\n== Names and etymology ==\nThe English term taro was borrowed from the Māori language of New Zealand when Captain Cook first observed plantations of Colocasia tubers there in 1769. The form taro or talo is widespread among Polynesian languages:  taro in Tahitian;  talo in Samoan; kalo in Hawaiian; taʻo in Marquesan. All these forms originate from Proto-Polynesian *talo, which itself descended from Proto-Oceanic *talos (cf. dalo in Fijian) and Proto-Austronesian *tales (cf. tales in Javanese). However, irregularity in sound correspondences among the cognate forms in Austronesian suggests that the term may have been borrowed from an Austroasiatic language perhaps somewhere in Borneo and spread from there (cf. proto-Mon-Khmer *t2rawʔ, Khasi shriew, Khmu sroʔ).Colocasia esculenta has other names in different languages.\nIn the Philippines, the plant is known as gabi in Tagalog, aba in the Ilocos Region, and natong and apay in the Bicol Region. In India, it is called arvī (अरबी) in Hindi, kesave (ಕೇಸವೆ) in Kannada, alu (आळू) in Marathi, chempu (சேம்பு) in Tamil, chama (చామ) in Telugu, yendem (ꯌꯦꯟꯗꯦꯝ) in Meitei,  venti (वेंटी) in Konkani, chēmbŭ (ചേമ്പ്) in Malayalam, and kochu (কচু) in Bengali. It is 芋 (yu) or 芋頭 (yu tou) in Chinese; 芋 (POJ: ō͘) or 芋頭 (ō͘-á) in Taiwanese Hokkien; and vasa in Paiwan, and tali in Amis.Names in African languages include jimbi in Swahili, amadumbe or madumbi in some languages of South Africa, kontomire in Ghana, kókó and lámbó in Yoruba,, “boina” in Wolaita language of Ethiopia, amateke in Kinyarwanda. In Madagascar, it is known as saonjo. It is dasheen in Trinidad and Tobago, Saint Lucia and Jamaica.In Portuguese, it is known as taro, inhame-coco, inhame, taioba, taiova, taioba-de-são-tomé, matabala or inhame and in Spanish it is called malanga.\nIn the Sinhala language of Sri Lanka it is called \"Kiri Ala\" (කිරිඅල), but malanga is a different species.The Ancient Greek word κολοκάσιον (kolokasion, lit. 'lotus root') is the origin of the Modern Greek word kolokasi (κολοκάσι), the word kolokas in both Greek  and Turkish, and kolkas (قلقاس) in Arabic. It was borrowed in Latin as colocasia, hence the genus name Colocasia.Taro is among the most widely grown species in the group of tropical perennial plants that are referred to as \"elephant ears\" when grown as ornamental plants.\n\n\n== Taxonomy and ecology ==\n\n\n=== Nomenclature and related plants ===\nLinnaeus originally described two species, Colocasia esculenta and Colocasia antiquorum, but many later botanists consider them both to be members of a single, very variable species, the correct name for which is Colocasia esculenta. The specific epithet, esculenta, means \"edible\" in Latin.\nTaro is related to Xanthosoma and Caladium, plants commonly grown ornamentally, and like them, it is sometimes loosely called elephant ear. Similar taro varieties include giant taro (Alocasia macrorrhizos), swamp taro (Cyrtosperma merkusii), and arrowleaf elephant's ear (Xanthosoma sagittifolium).\n\n\n=== Description ===\nColocasia esculenta is a perennial, tropical plant primarily grown as a root vegetable for its edible, starchy corm. The plant has rhizomes of different shapes and sizes. Leaves are up to 40 cm × 24.8 cm (15+3⁄4 in × 9+3⁄4 in) and sprout from the rhizome. They are dark green above and light green beneath. They are triangular-ovate, sub-rounded and mucronate at the apex, with the tip of the basal lobes rounded or sub-rounded. The petiole is 0.8–1.2 m (2 ft 7 in–3 ft 11 in) high. The path can be up to 25 cm (10 in) long. The spadix is about three fifths as long as the spathe, with flowering parts up to 8 mm (5⁄16 in) in diameter. The female portion is at the fertile ovaries intermixed with sterile white ones. Neuters grow above the females, and are rhomboid or irregular orium lobed, with six or eight cells. The appendage is shorter than the male portion.\n\t\t\n\t\t\n\t\t\n\n\n=== Distribution and habitat ===\nColocasia esculenta is thought to be native to Southern India and Southeast Asia, but is widely naturalised. Colocasia is thought to have originated in the Indomalayan realm, perhaps in East India, Nepal, and Bangladesh. It spread by cultivation eastward into Southeast Asia, East Asia and the Pacific Islands; westward to Egypt and the eastern Mediterranean Basin; and then southward and westward from there into East Africa and West Africa, where it spread to the Caribbean and Americas.\nTaro was probably first native to the lowland wetlands of Malaysia, where it is called taloes.\nIn Australia, Colocasia esculenta var. aquatilis is native to the Kimberley region of Western Australia; variety esculenta is naturalised in Western Australia, the Northern Territory, Queensland and New South Wales.\nIn Turkey, Colocasia esculenta is locally known as gölevez and mainly grown on the Mediterranean coast, such as the Alanya district of Antalya Province and the Anamur district of Mersin Province.\nIn Macaronesia this plant has become naturalized, probably as a result of the Portuguese discoveries and is frequently used in the macaronesian diet as an important carb source.\nIn the southeastern United States, this plant is recognized as an invasive species. Many populations can be commonly found growing near drain ditches and bayous in Houston, Texas.\n\n\n== History ==\nTaro is one of the most ancient cultivated crops.  Taro is found widely in tropical and subtropical regions of South Asia, East Asia, Southeast Asia, Papua New Guinea, and northern Australia and is highly polymorphic, making taxonomy and distinction between wild and cultivated types difficult. It is believed that they were domesticated independently multiple times, with authors giving possible locations as New Guinea, Mainland Southeast Asia, and northeastern India, based largely on the assumed native range of the wild plants. However, more recent studies have pointed out that wild taro may have a much larger native distribution than previously believed, and wild breeding types may also likely be indigenous to other parts of Island Southeast Asia.Archaeological traces of taro exploitation have been recovered from numerous sites, though whether these were cultivated or wild types can not be ascertained. They include the Niah Caves of Borneo around 10,000 years ago, Ille Cave of Palawan, dated to at least 11,000 year ago; Kuk Swamp of New Guinea, dated to between 8250 BC and 7960 BC; and Kilu Cave in the Solomon Islands dated to around 28,000 to 20,000 years ago. In the case of Kuk Swamp, there is evidence of formalized agriculture emerging by about 10,000 years ago, with evidence of cultivated plots, though which plant was cultivated remains unknown.Taro were carried into the Pacific Islands by Austronesian peoples from around 1300 BC, where they became a staple crop of Polynesians, along with other types of \"taros\", like  Alocasia macrorrhizos, Amorphophallus paeoniifolius, and Cyrtosperma merkusii. They are the most important and the most preferred among the four, because they were less likely to contain the irritating raphides present in the other plants.  Taro is also identified as one of the staples of Micronesia, from archaeological evidence dating back to the pre-colonial Latte Period (c. 900 - 1521 AD), indicating that it was also carried by Micronesians when they colonized the islands. Taro pollen and starch residue have also been identified in Lapita sites, dated to between 1100 BC and 550 BC. Taro was later spread to Madagascar as early as the 1st century AD.\n\n\n== Cultivation ==\n\nAt around 3.3 million metric tons per year, Nigeria is the largest producer of taro in the world. Taro can be grown in paddy fields where water is abundant or in upland situations where water is supplied by rainfall or supplemental irrigation. Taro is one of the few crops (along with rice and lotus) that can be grown under flooded conditions. This is due to air spaces in the petiole, which permit underwater gaseous exchange with the atmosphere. For a maximum dissolved oxygen supply, the water should be cool and flowing. Warm, stagnant water causes basal rotting. For maximum yields, the water level should be controlled so that the base of the plant is always under water.\nFlooded cultivation has some advantages over dry-land cultivation: higher yields (about double), out-of-season production (which may result in higher prices), and weed control (which flooding facilitates). On the other hand, in flooded production systems taro requires a longer maturation period, investment in infrastructure, and higher operational costs, and monoculture is likely.\nLike most root crops, taro and eddoes do well in deep, moist or even swampy soils where the annual rainfall exceeds 2,500 mm (100 in). Eddoes are more resistant to drought and cold. The crop attains maturity within six to twelve months after planting in dry-land cultivation and after twelve to fifteen months in wetland cultivation. The crop is harvested when the plant height decreases and the leaves turn yellow. These signals are usually less distinct in flooded taro cultivation.\nHarvesting is usually done by hand tools, even in mechanized production systems. First, the soil around the corm is loosened, and then, the corm is pulled up by grabbing the base of the petioles. The global average yield is 6.2 tonnes per hectare (2.8 short tons per acre) but varies according to the region. In Asia, average yields reach 12.6 t/ha (5.6 short ton/acre).\n\n\n== Uses ==\n\n\n=== Culinary ===\n\nIt is a food staple in African, Oceanic and South Asian cultures.People usually consume its edible corm and leaves. The corms, which have a light purple color due to phenolic pigments, are roasted, baked or boiled. The natural sugars give a sweet, nutty flavor. The starch is easily digestible, and since the grains are fine and small it is often used for baby food. Young taro leaves and stems can be eaten after boiling twice to remove the acrid flavor. The leaves are a good source of vitamins A and C and contain more protein than the corms.\nIn its raw form, the plant is toxic due to the presence of calcium oxalate, and the presence of needle-shaped raphides in the plant cells. However, the toxin can be minimized and the tuber rendered palatable by cooking, or by steeping in cold water overnight.\nCorms of the small, round variety are peeled and boiled, then sold either frozen, bagged in their own liquids, or canned.\n\n\n==== Oceania ====\n\n\n===== Cook Islands =====\nTaro is the pre-eminent crop of the Cook Islands and surpasses all other crops in terms of land area devoted to production. The prominence of the crop there has led it to be a staple of the population's diet. Taro is grown across the country, but the method of cultivation depends on the nature of the island it is grown on. Taro also plays an important role in the country's export trade. The root is eaten boiled, as is standard across Polynesia. Taro leaves are also eaten, cooked with coconut milk, onion, and meat or fish.\n\n\n===== Fiji =====\n\nTaro (dalo in Fijian) has been a staple of the Fijian diet for centuries, and its cultural importance is celebrated on Taro Day. Its growth as an export crop began in 1993 when taro leaf blight decimated the taro industry in neighboring Samoa. Fiji filled the void and was soon supplying taro internationally. Almost 80% of Fiji's exported taro comes from the island of Taveuni where the taro beetle species Papuana uninodis is absent. The Fijian taro industry on the main islands of Viti Levu and Vanua Levu faces constant damage from the beetles. The Fiji Ministry of Agriculture and the Land Resources Division of the Secretariat of the Pacific Community (SPC) are researching pest control and instigating quarantine restrictions to prevent the spread of the pest. Taveuni now exports pest-damage-free crops.\n\n\n===== Hawaii =====\nKalo is the Hawaiian name for the taro plant. The local crop plays an important role in Hawaiian culture, mythology, and cuisine. Taro is a traditional staple of the native cuisine of Hawaii. Some of the uses for taro include poi, table taro (steamed and served like a potato), taro chips, and luau leaf (to make laulau). In Hawaii, kalo is farmed under either dryland or wetland conditions. Taro farming in the Hawaiian Islands is challenging because of the difficulties of accessing fresh water. Kalo is usually grown in \"pond fields\" known as loʻi. Typical dryland or \"upland\" varieties (varieties grown in watered but not flooded fields) in Hawaii are lehua maoli and bun long, the latter widely known as \"Chinese taro\". Bun long is used for making taro chips. Dasheen (also called \"eddo\") is another dryland variety of C. esculenta grown for its edible corms or as an ornamental plant. A contemporary Hawaiian diet consists of many tuberous plants, particularly sweet potato and kalo.\nThe Hawaii Agricultural Statistics Service determined the 10-year median production of kalo in Hawaii to be about 6.1 million pounds (2,800 t). However, 2003 taro production in Hawaii was only 5 million pounds (2,300 t), an all-time low since record-keeping began in 1946. The previous low of 1997 was 5.5 million pounds (2,500 t). Despite generally growing demand, production was even lower in 2005—only 4 million pounds, with kalo for processing into poi accounting for 97.5%. Urbanization is one cause driving down harvests from the high of 14.1 million pounds (6,400 t) in 1948, but more recently, the decline has resulted from pests and diseases. A non-native apple snail (Pomacea canaliculata) is a major culprit along with a plant rot disease traced to a newly identified species of fungus in the genus Phytophthora that now affects kalo crops throughout Hawaii. Although pesticides could control both problems to some extent, pesticide use in the loʻi is banned because of the opportunity for chemicals to migrate quickly into streams, and then eventually the sea.\nSocial roles\nImportant aspects of Hawaiian culture revolve around kalo cultivation and consumption. For example, the newer name for a traditional Hawaiian feast (luau) comes from the kalo. Young kalo tops baked with coconut milk and chicken meat or octopus arms are frequently served at luaus.By ancient Hawaiian custom, fighting is not allowed when a bowl of poi is \"open\". Similarly, it is also considered disrespectful to fight in front of an elder and one should not raise their voice, speak angrily, or make rude comments or gestures.\n\nLoʻi\nA loʻi is a patch of wetland dedicated to growing kalo (taro).  Hawaiians have traditionally used water irrigation systems to produce kalo. Wetland fields produce ten to fifteen times more kalo per acre than dry fields.  Wetland-grown kalo need a constant flow of water, and to get this water, fields are usually positioned between the mauka (mountains) and makai (sea). A lo'i specifically denotes wetland kalo growing, not dry land.\nThe loʻi is part of an ahupuaʻa, a division of land from the mountain to the sea. Ahupuaʻa means \"pig altar\", and was named for stone altars with pig head carvings that marked the boundaries of each Hawaiian land division. Ideally, an ahupuaʻa has all the necessities within its borders. From the mountains, materials such as wood are provided for thatching roofs and twining rope. The uplands produce crops like sugar cane and sweet potatoes, while the lowlands provide taro and fish. This system typically satisfies the large populations in each ahupuaʻa.When kalo was brought to Hawaiʻi, there were about 300 varieties (about 100 remain). The kalo plant takes seven months to grow until harvest, so lo`i fields are used in rotation and the soil can be replenished while the loʻi in use has sufficient water. The stems are typically replanted in the lo`i for future kalo harvests. Once harvested, kalo is incorporated into many foods. The leaves are used to make laulau, from the corm poi or paʻiʻai.\n\nHistoryOne mythological version of Hawaiian ancestry cites the taro plant as an ancestor to Hawaiians. Legend joins the two siblings of high and divine rank: Papahānaumoku (\"Papa from whom lands are born\", or Earth mother) and Wākea (Sky father). Together they create the islands of Hawaii and a beautiful woman, Hoʻohokukalani (The Heavenly one who made the stars).The story of kalo begins when Wakea and Papa conceived their daughter, Hoʻohokukalani. Daughter and father then conceived a child together named Hāloanakalaukapalili (Long stalk trembling), but it was stillborn. After the father and daughter buried the child near their house, a kalo plant grew over the grave:\nThe stems were slender and when the wind blew they swayed and bent as though paying homage, their heart-shaped leaves shivering gracefully as in hula.  And in the center of each leaf water gathered, like a mother’s teardrop.\nThe second child born of Wakea and Hoʻohokukalani was named Hāloa after his older brother. The kalo of the earth was the sustenance for the young brother and became the principal food for successive generations.  Now, as man continues to work the wetlands for this sacred crop, he remembers Haloanaka, the ancestor that nourishes him. The Hawaiian word for family, ʻohana, is derived from ʻohā, the shoot which grows from the kalo corm. The reason being: as young shoots grow from the corm of the kalo plant, so people, too, grow from their family.\n\n\n===== Papua New Guinea =====\nThe taro corm is a traditional staple crop for large parts of Papua New Guinea, with a domestic trade extending its consumption to areas where it is not traditionally grown. Taro from some regions has developed particularly good reputations with (for instance) Lae taro being highly prized.\nAmong the Urapmin people of Papua New Guinea, taro (known in Urap as ima) is the main source of sustenance along with the sweet potato (Urap: wan). In fact, the word for \"food\" in Urap is a compound of these two words.\n\n\n===== Polynesia =====\nConsidered the staple starch of traditional Polynesian cuisine, taro is both a common and prestigious food item that was first introduced to the Polynesian islands by prehistoric seafarers of Southeast Asian derivation. The tuber itself is prepared in various ways, including baking, steaming in earth ovens (umu or imu), boiling, and frying. The famous Hawaiian staple poi is made by mashing steamed taro roots with water. Taro also features in traditional desserts such as Samoan fa'ausi, which consists of grated, cooked taro mixed with coconut milk and brown sugar. The leaves of the taro plant also feature prominently in Polynesian cooking, especially as edible wrappings for dishes such as Hawaiian laulau, Fijian and Samoan palusami (wrapped around onions and coconut milk), and Tongan lupulu (wrapped corned beef). Ceremonial presentations on occasion of chiefly rites or communal events (weddings, funerals, etc.) traditionally included the ritual presentation of raw and cooked taro roots/plants.\nThe Hawaiian laulau traditionally contains pork, fish, and lu'au (cooked taro leaf). The wrapping is inedible ti leaves (Hawaiian: lau ki).  Cooked taro leaf has the consistency of cooked spinach and is therefore unsuitable for use as a wrapping.\n\n\n===== Samoa =====\n\nIn Samoa, the baby talo leaves and coconut milk are wrapped into parcels and cooked, along with other food, in an earth oven . The parcels are called palusami or lu'au. The resulting taste is smoky, sweet, savory and has a unique creamy texture. The root is also baked (Talo tao) in the umu or boiled with coconut cream (Faálifu Talo). It has a slightly bland and starchy flavor. It is sometimes called the Polynesian potato.\n\n\n===== Tonga =====\nLū is the Tongan word for the edible leaves of the taro plant (called talo in Tonga), as well as the traditional dish made using them. This meal is still prepared for special occasions and especially on Sunday. The dish consists of chopped meat, onions, and coconut milk wrapped in a number of taro leaves (lū talo). This is then wrapped traditionally in a banana leaf (nowadays, aluminum foil is often used) and put in the ʻumu to cook. It has a number of named varieties, dependent on the filling:\n\nLū pulu – lū with beef, commonly using imported corned beef (kapapulu)\nLū sipi –  lū with lamb\nLū moa – lū with chicken\nLū hoosi – lū with horse meatOceanian Atolls\nThe islands situated along the border of the three main parts of Oceania (Polynesia, Micronesia and Melanesia) are more prone to being atolls rather than volcanic islands (most prominently Tuvalu, Tokelau, and Kiribati). As a result of this, Taro was not a part of the traditional diet due to the infertile soil and have only become a staple today through importation from other islands (Taro and Cassava cultivars are usually imported from Fiji or Samoa). The traditional staple however is the Swamp Taro known as Pulaka or Babai, a distant relative of the Taro but with a very long growing phase (3–5 years), larger and denser corms and coarser leaves. It is grown in a patch of land dug out to give rise to the freshwater lense beneath the soil. The lengthy growing time of this crop usually confines it  as a food during festivities much like Pork although it can be preserved by drying out in the sun and storing it somewhere cool and dry to be enjoyed out of harvesting season.\n\n\n==== East Asia ====\n\n\n===== P.R.China =====\nTaro (simplified Chinese: 芋头; traditional Chinese: 芋頭; pinyin: yùtou; Cantonese Yale: wuhtáu) is commonly used as a main course as steamed taro with or without sugar, as a substitute for other cereals, in Chinese cuisine in a variety of styles and provinces steamed, boiled or stir-fried as a main dish and as a flavor-enhancing ingredient. In Northern China, it is often boiled or steamed then peeled and eaten with or without sugar much like a potato. It is commonly braised with pork or beef. It is used in the Cantonese dim sum to make a small plated dish called taro dumpling as well as a pan-fried dish called taro cake. It can also be shredded into long strips which are woven together to form a seafood birdsnest. In Fujian cuisine, it is steamed or boiled and mixed with starch to form a dough for dumpling.\nTaro cake is a delicacy traditionally eaten during Chinese New Year celebrations. As a dessert, it can be mashed into a purée or used as a flavoring in tong sui, ice cream, and other desserts such as Sweet Taro Pie. McDonald's sells taro-flavored pies in China.\nTaro is mashed in the dessert known as taro purée.\n\n\n====== Chaoshan, P.R.China ======\n\nTaro paste, a traditional Cantonese cuisine, which originated from the Chaoshan region in the eastern part of China's Guangdong Province is a dessert made primarily from taro. The taro is steamed and then mashed into a thick paste, which forms the base of the dessert. Lard or fried onion oil is then added for fragrance. The dessert is traditionally sweetened with water chestnut syrup, and served with ginkgo nuts. Modern versions of the dessert include the addition of coconut cream and sweet corn. The dessert is commonly served at traditional Teochew wedding banquet dinners as the last course, marking the end of the banquet.\n\n\n===== Japan =====\n\nA similar plant in Japan is called satoimo (里芋、サトイモ, literally \"village potato\"). The \"child\" and \"grandchild\" corms (cormels, cormlets) which bud from the parent satoimo, are called koimo (子芋) and magoimo (孫芋), respectively, or more generally imonoko (芋の子). Satoimo has been propagated in Southeast Asia since the late Jōmon period.  It was a regional staple before rice became predominant. The tuber, satoimo, is often prepared through simmering in fish stock (dashi) and soy sauce.  The stalk, zuiki, can also be prepared a number of ways, depending on the variety.\n\n\n===== Korea =====\n\nIn Korea, taro is called toran (Korean: 토란: \"earth egg\"), and the corm is stewed and the leaf stem is stir-fried. Taro roots can be used for medicinal purposes, particularly for treating insect bites. It is made into the Korean traditional soup toranguk (토란국). Taro stems are often used as an ingredient in yukgaejang (육개장).\n\n\n===== Taiwan, China =====\n\nIn Taiwan, taro— yùtóu (芋頭) in Mandarin, and ō͘-á (芋仔) in Taiwanese—is well-adapted to Taiwanese climate and can grow almost anywhere in the country with minimal maintenance. Before the Taiwan Miracle made rice affordable to everyone, taro was one of the main staples in Taiwan. Nowadays taro is used more often in desserts. Supermarket varieties range from about the size and shape of a brussels sprout to longer, larger varieties the size of a football. Taro chips are often used as a potato-chip-like snack. Compared to potato chips, taro chips are harder and have a nuttier flavor. Another popular traditional Taiwanese snack is taro ball, served on ice or deep-fried. It is common to see taro as a flavor in desserts and drinks, such as bubble tea.\n\n\n==== Southeast Asia ====\n\n\n===== Indonesia =====\nin Indonesia taro widely use for snacks, cakes, cracker even macaroon; can be easily find everywhere; some variety are special cultivated according to social geographical purposes. Taro usually known as \"Keladi Pontianak\" although other variety of Taro also known as \"Talas Bogor\", etc.\nfor Chinese descendant in Indonesia, Taro is best known as perfect pair with Stewed Rice ornate with dried shrimp. in cooking process taro is diced and cook along with rice and dried shrimp and sesame oil. the result is a perfect sticky rice with excellent taste.\n\n\n===== Philippines =====\n\nIn the Philippines taro is usually called gabi, abi, or avi and is widely available throughout the archipelago. Its adaptability to marshland and swamps make it one of the most common vegetables in the Philippines. The leaves, stems, and corms are all consumed and form part of the local cuisine. A popular recipe for taro is laing from the Bicol Region; the dish's main ingredients are taro leaves (at times including stems) cooked in coconut milk, and salted with fermented shrimp or fish bagoong. It is sometimes heavily spiced with red hot chilies called siling labuyo. Another dish in which taro is commonly used is the Philippine national stew, sinigang, although radish can be used if taro is not available. This stew is made with pork and beef, shrimp, or fish, a souring agent (tamarind fruit, kamias, etc.) with the addition of peeled and diced corms as thickener. The corm is also prepared as a basic ingredient for ginataan, a coconut milk and taro dessert.\n\n\n===== Thailand =====\nIn Thai cuisine, taro Thai: เผือก (pheuak) is used in a variety of ways depending on the region. Boiled taro is readily available in the market packaged in small cellophane bags, already peeled and diced, and eaten as a snack. Pieces of boiled taro with coconut milk are a traditional Thai dessert. Raw taro is also often sliced and deep fried and sold in bags as chips (เผือกทอด). As in other Asian countries, taro is a popular flavor for ice cream in Thailand.\n\n\n===== Vietnam =====\n\nIn Vietnam, there is a large variety of taro plants. One is called khoai môn, which is used as a filling in spring rolls, cakes, puddings and sweet soup desserts, smoothies and other desserts. Taro is used in the Tết dessert chè khoai môn, which is sticky rice pudding with taro roots. The stems are also used in soups such as canh chua. One is called khoai sọ, which is smaller in size and more delicious than Khoai môn, and of course, more expensive than khoai môn. Another common taro plant grows roots in shallow waters and grows stems and leaves above the surface of the water. This taro plant has saponin-like substances that cause a hot, itchy feeling in the mouth and throat. Northern farmers used to plant them to cook the stems and leaves to feed their hogs. They re-grew quickly from their roots. After cooking, the saponin in the soup of taro stems and leaves is reduced to a level the hogs can eat. Today this practice is no longer popular in Vietnam agriculture. These taro plants are commonly called khoai ngứa, which literally means \"itchy potato\".\n\n\n==== South Asia ====\n\n\n===== Bangladesh =====\n\nIn Bangladesh taro is a very popular vegetable known as kochu (কচু) or mukhi (মুখি). Within the Sylheti dialect of the Bangla language, it is called mukhi. It is usually cooked with small prawns or the ilish fish into a curry, but some dishes are cooked with dried fish. Its green leaves, kochu pata (কচু পাতা), and stem, kochu (কচু), are also eaten as a favorite dish and usually ground to a paste or finely chopped to make shak — but it must be boiled well beforehand. Taro stolons or stems, kochur loti (কচুর লতি), are also favored by Bangladeshis and cooked with shrimp, dried fish or the head of the ilish fish. Taro is available, either fresh or frozen, in the UK and US in most Asian stores and supermarkets specialising in Bangladeshi or South Asian food. Also, another variety called maan kochu is consumed and is a rich source of vitamins and nutrients. Maan Kochu is made into a paste and fried to prepare a delicious food known as Kochu Bata.\n\n\n===== India =====\n\nIn India, taro or eddoe is a common dish served in many ways. It is called arvi in Urdu and Hindi in north India, which is often pronounced as arbi. It is called kəchu (कचु) in Sanskrit.In Gujarat, it is called Patar Vel or Saryia Na Paan green leaves are used by making a roll, with besan(gram flour), Salt, turmeric, red chili powder all put into paste form inside leaves.  Then steamed and in small portions, as well as fried in the deep fryer.\nIn Mizoram, in north-eastern India, it is called bäl; the leaves, stalks and corms are eaten as dawl bai. The leaves and stalks are often traditionally preserved to be eaten in dry season as dawl rëp bai.In Assam, a north-eastern state, taro is known as kosu (কচু). Various parts of the plant are eaten by making different dishes. The leaf buds called kosu loti (কচু লতি) are cooked with sour dried fruits and called thekera (থেকেৰা) or sometimes eaten alongside tamarind, elephant apple, a small amount of pulses, or fish. Similar dishes are prepared from the long root-like structures called kosu thuri. A sour fried dish is made from its flower (kosu kala). Porridges are made from the corms themselves, which may also be boiled, seasoned with salt and eaten as snacks.\nIn Manipur, another north-eastern state, taro is known as pan. The Kukis calls it bal. Boiled bal is a snack at lunch along with chutney or hot chili-flakes besides being cooked as a main dish along with smoked or dried meat, beans, and mustard leaves. Sun-dried taro leaves are later used in broth and stews. It is widely available and is eaten in many forms, either baked, boiled, or cooked into a curry with hilsa or with fermented soybeans called hawai-zaar. The leaves are also used in a special traditional dish called utti, cooked with peas.\nIn Himachal Pradesh, in northern India, taro corms are known as ghandyali, and the plant is known as kachalu in the Kangra and Mandi districts. The dish called patrodu is made using taro leaves rolled with corn or gram flour and boiled in water. Another dish, pujji is made with mashed leaves and the trunk of the plant and ghandyali or taro corms are prepared as a separate dish. In Shimla, a pancake-style dish, called patra or patid, is made using gram flour.\nIn Uttarakhand and neighboring Nepal, taro is considered a healthy food and is cooked in a variety of ways. The delicate gaderi (taro variety) of Kumaon, especially from Lobanj, Bageshwar district, is much sought after. Most commonly it is boiled in tamarind water until tender, then diced into cubes which are stir-fried in mustard oil with fenugreek leaves. Another technique for preparation is boiling it in salt water till it is reduced to a porridge. The young leaves called gaaba, are steamed, sun-dried, and stored for later use. Taro leaves and stems are pickled. Crushed leaves and stems are mixed with de-husked urad daal (black lentils) and then dried as small balls called badi. These stems may also be sun-dried and stored for later use. On auspicious days, women worship saptarshi (\"seven sages\") and only eat rice with taro leaves.\nIn Maharashtra, in western India, the leaves, called alu che paana, are de-veined and rolled with a paste of gram flour. Then seasoned with tamarind paste, red chili powder, turmeric, coriander, asafoetida and salt, and finally steamed. These can be eaten whole, cut into pieces, or shallow fried and eaten as a snack known as alu chi wadi. Alu chya panan chi patal bhaji a lentil and colocasia leaves curry, is also popular. In Goan as well as Konkani cuisine taro leaves are very popular. A tall-growing variety of taro is extensively used on the western coast of India to make patrode, patrade, or patrada (lit. \"leaf-pancake\") a dish with gram flour, tamarind and other spices.\nIn Gujarat, it is called patar vel or saryia na paan. Gram flour, salt, turmeric, red chili powder made into paste and stuffed inside a roll of green leaves. Then steamed and in small portions and then fried.Sindhis call it kachaloo; they fry it, compress it, and re-fry it to make a dish called tuk which complements Sindhi curry.\nIn Kerala, a state in southern India, taro corms are known as chembu kizhangu (ചേമ്പ് കിഴങ്ങ്) and are a staple food, a side dish, and an ingredient in various side dishes like sambar. As a staple food, it is steamed and eaten with a spicy chutney of green chilies, tamarind, and shallots. The leaves and stems of certain varieties of taro are also used as a vegetable in Kerala. In Dakshin Kannada in Karnataka, it is used as a breakfast dish, either made like fritters or steamed.\nIn Tamil Nadu and Andhra Pradesh, taro corms are known as sivapan-kizhangu (seppankilangu or cheppankilangu), chamagadda, or in coastal Andhra districts as chaama dumpa. They can be prepared in a variety of ways, such as by deep-frying in oil to be eaten on the side with rice, or cooking in a tangy tamarind sauce with spices, onion, and tomato.\nIn the east Indian state of West Bengal, taro corms are thinly sliced and fried to make chips called kochu bhaja(কচু ভাজা). The stem is used to cook kochur saag (কচুর শাগ) with fried hilsha (ilish) head or boiled chhola (chickpea), often eaten as a starter with hot rice. The corms are also made into a paste with spices and eaten with rice. The most popular dish is a spicy curry made with prawn and taro corms. Gathi kochu (গাঠি কচু) (taro variety) are very popular and used to make a thick curry called gathi kochur dal (গাঠি কচুর ডাল). Here kochur loti (কচুর লতি) (taro stolon) dry curry is a popular dish which is usually prepared with poppy seeds and mustard paste. Leaves and corms of shola kochu (শলা কচু) and maan kochu (মান কচু) are also used to make some popular traditional dishes.\nIn Mithila, Bihar, taro corms are known as ədua (अडुआ) and its leaves are called ədikunch ke paat (अड़िकंच के पात). A curry of taro leaves is made with mustard paste and sour sun-dried mango pulp (आमिल; aamil).\nIn Odisha, taro corms are known as saru. Dishes made of taro include saru besara (taro in mustard and garlic paste). It is also an indispensable ingredient in preparing dalma, an Odia cuisine staple (vegetables cooked with dal). Sliced taro corms, deep fried in oil and mixed with red chili powder and salt, are known as 'saru chips'.\n\n\n===== Maldives =====\nAla was widely grown in the southern atolls of Addu Atoll, Fuvahmulah, Huvadhu Atoll, and Laamu Atoll and is considered a staple even after rice was introduced. Ala and olhu ala are still widely eaten all over the Maldives, cooked or steamed with salt to taste, and eaten with grated coconut along with chili paste and fish soup. It is also prepared as a curry. The corms are sliced and fried to make chips and are also used to prepare varieties of sweets.\n\n\n===== Nepal =====\n\nTaro is grown in the Terai and the hilly regions of Nepal. The root (corm) of taro is known as pindalu (पिँडालु) and petioles with leaves are known as karkalo (कर्कलो) and also as Gava (गाभा). Almost all parts are eaten in different dishes.  Boiled corm of Taro is commonly served with salt, spices, and chilies. Taro is a popular dish in the hilly region. Chopped leaves and petioles are mixed with Urad bean flour to make dried balls called maseura (मस्यौरा). Large taro leaves are used as an alternative to an umbrella when unexpected rain occurs. Popular attachment to taro since ancient times is reflected in popular culture, such as in songs and textbooks. Jivan hamro karkala ko pani jastai ho (जीवन हाम्रो कर्कलाको पानी जस्तै हो) means, \"Our life is as vulnerable as water stuck in the leaf of taro\".\nTaro is cultivated and eaten by the Tharu people in the Inner Terai as well.  Roots are mixed with dried fish and turmeric, then dried in cakes called sidhara which are curried with radish, chili, garlic and other spices to accompany rice.  The Tharu prepare the leaves in a fried vegetable side-dish that also shows up in Maithili cuisine.\n\n\n===== Pakistan =====\n\nIn Pakistan, taro or eddoe or arvi is a very common dish served with or without gravy; a popular dish is arvi gosht, which includes beef, lamb or mutton. The leaves are rolled along with gram flour batter and then fried or steamed to make a dish called Pakora, which is finished by tempering with red chilies and carrom (ajwain) seeds. Taro or arvi is also cooked with chopped spinach. The dish called Arvi Palak is the second most renowned dish made of Taro.\n\n\n===== Sri Lanka =====\nMany varieties are recorded in Sri Lanka, several being edible, others being toxic to humans and therefore not cultivated. Edible varieties (kiri ala, kolakana ala, gahala, and sevel ala) are cultivated for their corms and leaves. Sri Lankans eat corms after boiling them or making them into a curry with coconut milk. The leaves of only two variety, kolakana ala and  kalu alakola are eaten.\n\n\n==== Middle East and Europe ====\nTaro was consumed by the early Romans in much the same way the potato is today. They called this root vegetable colocasia. The Roman cookbook Apicius mentions several methods for preparing taro, including boiling, preparing with sauces, and cooking with meat or fowl. After the fall of the Roman Empire, the use of taro dwindled in Europe. This was largely due to the decline of trade and commerce with Egypt, previously controlled by Rome. When the Spanish and Portuguese sailed to the new world, they brought taro along with them. Recently there has been renewed interest in exotic foods and consumption is increasing.\n\n\n===== Cyprus =====\nIn Cyprus, taro has been in use since the time of the Roman Empire. Today it is known as kolokas in Turkish or kolokasi (κολοκάσι) in Greek, which comes from the Ancient Greek name κολοκάσιον (kolokasion) for lotus root. It is usually sauteed with celery and onion with pork, chicken or lamb, in a tomato sauce – a vegetarian version is also available. The cormlets are called poulles (sing. poulla), and they are prepared by first being sauteed, followed by decaramelising the vessel with dry red wine and coriander seeds, and finally served with freshly squeezed lemon.\n\n\n===== Egypt =====\nIn Egypt, taro is known as qolqas (Egyptian Arabic: قلقاس‎, IPA: [ʔolˈʔæːs]). The corms are larger than what would be found in North American supermarkets. After being peeled completely, it is cooked in one of two ways: cut into small cubes and cooked in broth with fresh coriander and chard and served as an accompaniment to meat stew, or sliced and cooked with minced meat and tomato sauce.\n\n\n===== Greece =====\nIn Greece, taro grows on Icaria. Icarians credit taro for saving them from famine during World War II. They boil it until tender and serve it as a salad.\n\n\n===== Lebanon =====\nIn Lebanon, taro is known as kilkass and is grown mainly along the Mediterranean coast. The leaves and stems are not consumed in Lebanon and the variety grown produces round to slightly oblong tubers that vary in size from a tennis ball to a small cantaloupe. Kilkass is a very popular winter dish in Lebanon and is prepared in two ways: kilkass with lentils is a stew flavored with crushed garlic and lemon juice and ’il’as (Lebanese pronunciation of قلقاس) bi-tahini. Another common method of preparing taro is to boil, peel then slice it into 1 cm (1⁄2 in) thick slices, before frying and marinating in edible \"red\" sumac.\nIn northern Lebanon, it is known as a potato with the name borshoushi (el-orse borshushi). It is also prepared as part of a lentil soup with crushed garlic and lemon juice. Also in the north, it is known by the name bouzmet, mainly around Menieh, where it is first peeled, and left to dry in the sun for a couple of days. After that, it is stir-fried in lots of vegetable oil in a casserole until golden brown, then a large amount of wedged, melted onions are added, in addition to water, chickpeas and some seasoning. These are all left to simmer for a few hours, and the result is a stew-like dish. It is considered a hard-to-make delicacy, not only because of the tedious preparation but the consistency and flavour that the taro must reach. The smaller variety of taro is more popular in the north due to its tenderness.\n\n\n===== Portugal =====\nIn the Azores taro is known as inhame or inhame-coco and is commonly steamed with potatoes, vegetables and meats or fish. The leaves are sometimes cooked into soups and stews. It is also consumed as a dessert after first being steamed and peeled, then fried in vegetable oil or lard, and finally sprinkled with sugar, cinnamon and nutmeg. Taro grows abundantly in the fertile land of the Azores, as well as in creeks that are fed by mineral springs. Through migration to other countries, the inhame is found in the Azorean diaspora.\n\n\n===== Spain =====\nTaro root is consumed in the south of Spain. Taro has remained popular in the Canary Islands. In the Canary Islands it is known as ñame and is often used in thick vegetable stews, like potaje de berros (cress potage).  Taro is called ñame (which normally designates yams) in Canarian Spanish and is a common crop in the Autonomous Community of the Canary Islands (Canary Islands, Spain).\n\n\n===== Turkey =====\nTaro (Turkish: gölevez) is grown in the south coast of Turkey, especially in Mersin, Bozyazı, Anamur and Antalya. It is boiled in a tomato sauce or cooked with meat, beans and chickpeas. It is often used as a substitute for potato.\n\n\n==== Africa ====\n\n\n===== East Africa =====\n\nIn Kenya, Uganda and Tanzania, taro is commonly known as arrow root, ggobe, or nduma and madhumbe in some local Bantu languages. It is usually boiled and eaten with tea or other beverages, or as the main starch of a meal. It is also cultivated in Madagascar, Malawi, Mozambique, and Zimbabwe.\n\n\n===== South Africa =====\nIt is known as amadumbe (plural) or idumbe (singular) in the Zulu language of Southern Africa.\n\n\n===== West Africa =====\n\nTaro is consumed as a staple crop in West Africa, particularly in Ghana, Nigeria and Cameroon.  It is called cocoyam in Nigeria, Ghana and Anglophone Cameroon, macabo in Francophone Cameroon, mankani in Hausa language, koko and lambo in Yoruba, and ede in Igbo language. Cocoyam is often boiled, fried, or roasted and eaten with a sauce. In Ghana, it substitutes for plantain in making fufu when plantains are out of season. It is also cut into small pieces to make a soupy baby food and appetizer called mpotompoto. It is also common in Ghana to find cocoyam chips (deep-fried slices, about 1 mm (1⁄32 in) thick). Cocoyam leaves, locally called kontomire in Ghana, are a popular vegetable for local sauces such as palaver sauce and egusi/agushi stew. It is also commonly consumed in Guinea and parts of Senegal, as a leaf sauce or as a vegetable side, and is referred to as jaabere in the local Pulaar dialect.\n\n\n==== Americas ====\n\n\n===== Brazil =====\nIn Lusophone countries, inhame (pronounced [ĩ ˈ ȷ̃ɐ̃mi], [ˈ ȷ̃ɐ̃mi] or [ĩˑˈɲɐ̃mi], literally \"yam\") and cará are the common names for various plants with edible parts of the genera Alocasia, Colocasia (family Araceae) and Dioscorea (family Dioscoreaceae), and its respective starchy edible parts, generally tubers, with the exception of Dioscorea bulbifera, called cará-moela (pronounced [kɐˈɾa muˈɛlɐ], literally, \"gizzard yam\"), in Brazil and never deemed to be an inhame. Definitions of what constitutes an inhame and a cará vary regionally, but the common understanding in Brazil is that carás are potato-like in shape, while inhames are more oblong.\nIn the Brazilian Portuguese of the hotter and drier Northeastern region, both inhames and carás are called batata (literally, \"potato\"). For differentiation, potatoes are called batata-inglesa (literally, \"English potato\"), a name used in other regions and sociolects to differentiate it from the batata-doce, \"sweet potato\", ironic names since both were first cultivated by the indigenous peoples of South America, their native continent, and only later introduced in Europe by the colonizers.\nTaros are often prepared like potatoes, eaten boiled, stewed or mashed, generally with salt and sometimes garlic as a condiment, as part of a meal (most often lunch or dinner).\n\n\n===== Central America =====\nIn Belize, Costa Rica, Nicaragua and Panama, taro is eaten in soups, as a replacement for potatoes, and as chips. It is known locally as malanga (also malanga coco) and dasheen in Belize and Costa Rica, quiquizque in Nicaragua, and as otoe in Panama.\n\n\n===== Haiti =====\nIn Haiti, it is usually called malanga, or taro. The corm is grated into a paste and deep-fried to make a fritter called Acra. Acra is a very popular street food in Haiti.\n\n\n===== Jamaica =====\nIn Jamaica, taro is known as coco, cocoyam and dasheen. Corms with flesh which is white throughout are referred to as minty-coco. The leaves are also used to make Pepper Pot Soup which may include callaloo.\n\n\n===== Suriname =====\nIn Suriname it is called tayer, taya, pomtayer or pongtaya. The taro root is called aroei by the native Indians and is commonly known as \"Chinese tayer\". The variety known as eddoe is also called Chinese tayer. It is a popular cultivar among the maroon population in the interior, also because it is not adversely affected by high water levels. The dasheen variety, commonly planted in swamps, is rare, although appreciated for its taste. The closely related Xanthosoma species is the base for the popular Surinamese dish, pom.\n\n\n===== Trinidad and Tobago =====\nIn Trinidad and Tobago, it is called dasheen. The leaves of the taro plant are used to make the Trinidadian variant of the Caribbean dish known as callaloo (which is made with okra, dasheen/taro leaves, coconut milk or creme and aromatic herbs) and it is also prepared similarly to steamed spinach. The root of the taro plant is often served boiled, accompanied by stewed fish or meat, curried, often with peas and eaten with roti, or in soups. The leaves are also sauteed with onions, hot pepper and garlic til they are melted to make a dish called \"bhaji\". This dish is popular with Indo-Trinidadian people. The leaves are also fried in a split pea batter to make \"saheena\".\n\n\n===== United States =====\n\nTaro has been grown for centuries in the United States, though it has never attained the same popularity as in Asian and Pacific nations.\nWilliam Bartram observed South Carolina Sea Islands residents eating roasted roots of the plant, which they called tanya, in 1791, and by the 19th century it was common as a food crop from Charleston to Louisiana.\nIn the 1920s, dasheen, as it was known, was highly touted by the Secretary of the Florida Department of Agriculture as a valuable crop for growth in muck fields. Fellsmere, Florida, near the east coast, was a farming area deemed perfect for growing dasheen. It was used in place of potatoes and dried to make flour. Dasheen flour was said to make excellent pancakes when mixed with wheat flour.\nSince the late 20th century, taro chips have been available in many supermarkets and natural food stores, and taro is often used in American Chinatowns, in Chinese cuisine.\n\n\n===== Venezuela =====\n\nIn Venezuela, taro is called ocumo chino or chino and used in soups and sancochos. Soups contain large chunks of several kinds of tubers, including ocumo chino, especially in the eastern part of the country, where West Indian influence is present. It is also used to accompany meats in parrillas (barbecue) or fried cured fish where yuca is not available. Ocumo is an indigenous name; chino means \"Chinese\", an adjective for produce that is considered exotic. Ocumo without the Chinese denomination is a tuber from the same family, but without taro's inside purplish color. Ocumo is the Venezuelan name for malanga, so ocumo chino means \"Chinese malanga\". Taro is always prepared boiled. No porridge form is known in the local cuisine.\n\n\n===== West Indies =====\nTaro is called dasheen, in contrast to the smaller variety of corms called eddo, or tanya in the English speaking countries of the West Indies, and is cultivated and consumed as a staple crop in the region. There are differences among the roots mentioned above: taro or dasheen is mostly blue when cooked, tanya is white and very dry, and eddoes are small and very slimy.\nIn the Spanish-speaking countries of the Spanish West Indies taro is called ñame, the Portuguese variant of which (inhame) is used in former Portuguese colonies where taro is still cultivated, including the Azores and Brazil.  In Puerto Rico and Cuba, and the Dominican Republic it is sometimes called malanga or yautia.  In some countries, such as Trinidad and Tobago, Saint Vincent and the Grenadines, and Dominica, the leaves and stem of the dasheen, or taro, are most often cooked and pureed into a thick liquid called callaloo, which is served as a side dish similar to creamed spinach. Callaloo is sometimes prepared with crab legs, coconut milk, pumpkin, and okra. It is usually served alongside rice or made into a soup along with various other roots.\n\n\n=== Ornamental ===\nIt is also sold as an ornamental aquatic plant. It can be grown indoors with high humidity. In the UK, it has gained the Royal Horticultural Society's Award of Garden Merit.\n\n\n=== Laboratory ===\nIt is also used for anthocyanin study experiments, especially with reference to abaxial and adaxial anthocyanic concentration. A recent study has revealed honeycomb-like microstructures on the taro leaf, which makes the leaf superhydrophobic. The measured contact angle on this leaf in this study is around 148°.\n\n\n== See also ==\nAquatic plants\nDomesticated plants and animals of Austronesia\nList of vegetables\n\n\n== Notes ==\n\n\n== References ==\n\n\n== Further reading ==\nHao, Sean. 2006. \"Rain, pests and disease shrink taro production to record low\". Honolulu Advertiser, February 2, 2006, p. C1.\n\"The Future of Kalo\" Maui No Ka 'Oi Magazine Vol.11 No. 5 (August 2006).\n\"Powered by Poi\" Maui No Ka 'Oi Magazine Vol.11 No.4 (July 2007)\nStephens, James M. 1994. Dasheen – Colocasia exculenta (L.) Schott. Fact Sheet HS-592 from a series of the Horticultural Sciences Department, Florida Cooperative Extension Service, Institute of Food and Agricultural Sciences, University of Florida. May 1994. edis\nTaro climate at Green-Seeds.com (taro growing methods)\nTaveuni Taro at fijitaro.com (Fiji taro industry history)\nViotti, V. 2004. Honolulu Advertiser, March 16, 2004.\nWagner, W. L., D. R. Herbst, and S. H. Sohmer. 1999. Manual of the Flowering Plants of Hawai‘i. Revised edition. Vol. 2. Univ. of Hawei‘i Press/Bishop Museum Press. p. 1357.\nCho, John J, Yamakawa, Roy A., and James Hollyer. 2007. Hawaiian Kalo, Past and Future. Sustainable Agriculture001. 8 p. http://www.ctahr.hawaii.edu/oc/freepubs/pdf/SA-1.pdf.\n\nKupunakalo at Kupunakalo.com (Taro educational open-source resource.) Yap, Weston. 2012.\npermanent dead link] in Hawaiian History at MauiTheatre.com (Kalo cultural significance in Hawaiian history)\nRestoring the Life of the Land: Taro Patches in Hawai'i\nComplete Nutrition Facts for Taro\n\n\n== External links ==\nColocasia esculenta in West African plants – A Photo Guide."