"A butterfly house, conservatory, or lepidopterarium is a facility which is specifically intended for the breeding and display of butterflies with an emphasis on education. Some butterfly houses also feature other insects and arthropods.  Butterfly houses are owned and operated by museums, universities, non-profit corporations, and private individuals as part of their residence; as well as small businesses that are owner operated.\n\n\n== History ==\n\nLive butterfly exhibits became popular in England in the end of the 1970s, appealing to the British love of greenhouses and natural settings.\nThe tropical world's first live butterfly and insect sanctuary is Penang Butterfly Farm in Penang, Malaysia, established on March 29, 1986.\nThe first butterfly house in the United States, Butterfly World, opened in Coconut Creek, Florida, in 1988.\n\n\n== Activities ==\n\nButterfly houses are typically open to the public.\nExploration of such facilities may be with a guide or self-paced.  Guided tours may last about fifteen minutes, as the guide points out all the species of butterflies that are in the greenhouse that day. Stocks vary, as new shipments usually arrive weekly.  Guides may also show butterfly eggs, caterpillars, and chrysalids and identify specific plants that are favored by each species. Usually, the best time to see butterflies emerging from their pupae is between 10 a.m. and 1 p.m.\nButterflies are most active on warm and sunny days with little wind, because they require the heat of the sun to aid in their digestion. On rainy days, they usually hide in the flowers and leaves.\nThere are often many different species in such butterfly houses, with stock including butterflies from Africa, Malaysia, South America, Thailand, Costa Rica, the Philippines, and other places.  The vibrant colors and patterns on the wings of the insects have earned them the fanciful nickname \"flying flowers\".\nMany species of adult butterflies live only one to two weeks, during which time they must produce a new generation. Some species, such as the familiar monarch butterfly, however, can live as long as six months or even longer in the wild.\nSchools have butterfly houses for educational purposes. In Puerto Rico, a group of students from the Clara Maldonado de Aramburu School in Juncos, celebrated the relaunching of its butterfly house which had been destroyed by Hurricane Maria on September 19, 2017.  With help from community members, the butterfly houses and ecosystem was fixed, and their monarch butterflies took flight in March 2019.\n\n\n== See also ==\nList of butterfly houses\nList of insectariums\n\n\n== References ==\n\n\n== External links ==\nVisiting Butterfly Houses, Farms and Gardens"