"Insects or Insecta (from Latin insectum) are pancrustacean hexapod invertebrates and the largest group within the arthropod phylum. Definitions and circumscriptions vary; usually, insects comprise a class within the Arthropoda. As used here, the term Insecta is synonymous with Ectognatha. Insects have a chitinous exoskeleton, a three-part body (head, thorax and abdomen), three pairs of jointed legs, compound eyes and one pair of antennae. Insects are the most diverse group of animals; they include more than a million described species and represent more than half of all known living organisms. The total number of extant species is estimated at between six and ten million; potentially over 90% of the animal life forms on Earth are insects. Insects may be found in nearly all environments, although only a small number of species reside in the oceans, which are dominated by another arthropod group, crustaceans, which recent research has indicated insects are nested within.\nNearly all insects hatch from eggs. Insect growth is constrained by the inelastic exoskeleton and development involves a series of molts. The immature stages often differ from the adults in structure, habit and habitat, and can include a passive pupal stage in those groups that undergo  four-stage metamorphosis. Insects that undergo three-stage metamorphosis lack a pupal stage and adults develop through a series of nymphal stages. The higher level relationship of the insects is unclear. Fossilized insects of enormous size have been found from the Paleozoic Era, including giant dragonflies with wingspans of 55 to 70 cm (22 to 28 in). The most diverse insect groups appear to have coevolved with flowering plants.\nAdult insects typically move about by walking, flying, or sometimes swimming. As it allows for rapid yet stable movement, many insects adopt a tripedal gait in which they walk with their legs touching the ground in alternating triangles, composed of the front and rear on one side with the middle on the other side. Insects are the only invertebrates to have evolved flight, and all flying insects derive from one common ancestor. Many insects spend at least part of their lives under water, with larval adaptations that include gills, and some adult insects are aquatic and have adaptations for swimming. Some species, such as water striders, are capable of walking on the surface of water. Insects are mostly solitary, but some, such as certain bees, ants and termites, are social and live in large, well-organized colonies. Some insects, such as earwigs, show maternal care, guarding their eggs and young. Insects can communicate with each other in a variety of ways. Male moths can sense the pheromones of female moths over great distances. Other species communicate with sounds: crickets stridulate, or rub their wings together, to attract a mate and repel other males. Lampyrid beetles  communicate with light.\nHumans regard certain insects as pests, and attempt to control them using insecticides, and a host of other techniques. Some insects damage crops by feeding on sap, leaves, fruits, or wood. Some species are parasitic, and may vector diseases. Some insects perform complex ecological roles; blow-flies, for example, help consume carrion but also spread diseases. Insect pollinators are essential to the life cycle of many flowering plant species on which most organisms, including humans, are at least partly dependent; without them, the terrestrial portion of the biosphere would be devastated. Many insects are considered ecologically beneficial as predators and a few provide direct economic benefit. Silkworms produce silk and honey bees produce honey and both have been domesticated by humans. Insects are consumed as food in 80% of the world's nations, by people in roughly 3000 ethnic groups. Human activities also have effects on insect biodiversity."