"A population decline (sometimes underpopulation or depopulation or population collapse) in humans is a reduction in a human population size caused by many factors. Up until the beginning of the industrial revolution, global population grew very slowly. After about 1800 the growth rate accelerated to a peak of 2.09% annually in both 1967-68 and 1968 - 69, but since then, due to the world-wide collapse of the total fertility rate, it has declined to 1.05% today (2020). The global growth rate in absolute numbers accelerated to a peak (92.9 million) in 1988, but has declined to 81.3 million in 2020.In order to maintain its population, a country requires a minimum fertility rate of 2.11 children per woman (the number is slightly greater than 2 because not all children live to adulthood). However, almost all societies experience a drastic drop in fertility to well below 2 as they grow more wealthy (see income and fertility). The tendency of women in wealthier countries to have fewer children is attributed to a variety of reasons, such as lower infant mortality and a reduced need for children as a source of family labor or retirement welfare, both of which reduce the incentive to have many children. Better access to education for young women, which broadens their job prospects, is also often cited. Long-term projections predict that the growth rate of the human population of this planet will continue to decline, and that by the end of the 21st Century, will reach zero. Examples of this emerging trend are Japan, whose population is currently (2015–2020) declining at the rate of 0.2% per year, and China, whose population could start declining in 2027 or sooner. By 2050, Europe's population is projected to be declining at the rate of 0.3% per year.Possible consequences of long-term national population decline can be net positive or negative. If a country can increase its workforce productivity faster than its population is declining, the results, both in terms of its economy, the quality-of-life of its citizens, and the environment, can be net positive. If it cannot increase workforce productivity faster than its population's decline, the results can be mostly negative. National efforts to confront population decline to-date have been focused on the possible negative economic consequences and have been centered around increasing the size and productivity of the workforce.\n\n\n== Causes ==\nA reduction over time in a region's population can be caused by sudden adverse events such as outbursts of infectious disease, famine, and war or by long-term trends, for example sub-replacement fertility, persistently low birth rates, high mortality rates, and continued emigration.\n\n\n=== Short term population shocks ===\nHistorical episodes of short-term human population decline have been common and have been caused by several factors.\n\nhigh death rates caused by disease, for example the Black Death that devastated Europe in the 14th and 17th centuries, the arrival of Old World diseases in the Americas during European colonization, and the Spanish flu pandemic after World War I,\nfamine, for example the Great Irish Famine of the 19th century, and the Great Chinese Famine caused by the Great Leap Forward which caused tens of millions of deaths\nwar, for example, the Mongol invasion of Europe in the 13th century that may have reduced the population of Hungary by 20–40%,\ncivil unrest, for example the forced migration of the population of Syria because of the Syrian Civil WarLess frequently, short term population declines are caused by genocide or mass execution.  For example, it has been estimated that the Armenian genocide caused 1.5 million deaths, the Jewish Holocaust about 6 million, and, in the 1970s, the population of Cambodia declined because of wide-scale executions by the Khmer Rouge.\nIn modern times, the AIDS pandemic caused temporary declines in the population of some African countries. In 2020, the Coronavirus pandemic created significant excess mortality in a number of countries.Some population declines result from indeterminate causes, for example, the Bronze Age Collapse, which has been described as the worst disaster in ancient history.\n\n\n=== Long term historic trends in world population growth ===\n\nIn spite of these short-term population shocks, world population has continued to grow. From pre-history (cir 10,000 BC) to the beginning of the Early Modern Period (generally 1500 – 1800), world population grew very slowly, around 0.04% per year.  During that period, population growth was governed by conditions now labeled the “Malthusian Trap”.\nAfter 1700, driven by increases in human productivity produced by the Industrial Revolution, particularly the increase in agricultural productivity, population growth accelerated to around 0.6% per year, a rate that was over ten times the rate of population growth of the previous 12,000 years. This rapid increase in global population caused Malthus and others to raise the first concerns about “overpopulation”.\nAfter World War I birth rates in the United States and many European countries fell below replacement level.  This prompted concern about population decline. The recovery of the birth rate in most western countries around 1940 that produced the “baby boom”, with growth rates in the 1.0 – 1.5% range, and which peaked in 1968 at 2.1% per year, temporarily dispelled prior concerns about population decline, and the world was once again fearful of overpopulation.\nBut, after 1968 the global population growth rate started a long decline and today (the period 2015–2020) is estimated to be about 1.1%, half of its peak in 1968. Although still growing, global population is predicted to level out around the end of the 21st century, and some sources predict the start of a decline before then.  The principal cause of this phenomenon is the abrupt decline in the global total fertility rate, from 5.0 in 1960 to 2.5 in 2016. The decline in the total fertility rate has occurred in every region of the world and has brought renewed concern for population decline.The era of rapid global population increase, and concomitant concern about a population explosion, has been a relative short one compared with the span of human history. It began roughly at the beginning of the industrial revolution and appears to be now drawing to a close in the Western world.\n\n\n== Possible consequences ==\n\nPredictions of the net economic (and other) effects from a slow and continuous population decline (e.g. due to low fertility rates) are mainly theoretical since such a phenomenon is a relatively new and unprecedented one. The results of many of these studies show that the estimated impact of population growth on economic growth is generally small and can be positive, negative, or nonexistent.  A recent meta-study found no relationship between population growth and economic growth.\n\n\n=== Possible positive effects ===\nThe effects of a declining population can be positive. The single best gauge of economic success is the growth of GDP per person, not total GDP. GDP per person (also known as GDP per capita or per capita GDP) is a rough proxy for average living standards. A country can both increase its average living standard and grow total GDP even though its population growth is low or even negative. The economies of both Japan and Germany went into recovery around the time their populations began to decline (2003–2006). In other words, both the total and per capita GDP in both countries grew more rapidly after 2005 than before. Russia's economy also began to grow rapidly from 1999 onward, even though its population had been shrinking since 1992–93. Many Eastern European countries have been experiencing similar effects to Russia. Such renewed growth calls into question the conventional wisdom that economic growth requires population growth, or that economic growth is impossible during a population decline.\nMore recently (2009–2017) Japan has experienced a higher growth of GDP per capita than the United States, even though its population declined over that period. In the United States, the relationship between population growth and growth of GDP per capita has been found to be empirically insignificant. All of this is further proof that individual prosperity can grow during periods of population decline.\nAttempting to better understand the economic impact of these pluses and minuses, Lee et al. analyzed data from 40 countries. They found that typically fertility well above replacement and population growth would be most beneficial for government budgets. Fertility near replacement and population stability, however, would be most beneficial for standards of living when the analysis includes the effects of age structure on families as well as governments. Fertility moderately below replacement and population decline would maximize per capita consumption when the cost of providing capital for a growing labor force is taken into account.A focus on productivity growth that leads to an increase in both per capita GDP and total GDP can bring other benefits to:\n\nthe workforce through higher wages, benefits and better working conditions\ncustomers through lower prices\nowners and shareholders through higher profits\nthe environment through more money for investment in more stringent environmental protection\ngovernments through higher tax proceeds to fund government activitiesAnother approach to possible positive effects of population decline is to consider Earth's carrying capacity.  The human carrying capacity of the Earth has been estimated to be 500 million, 1 billion or up to 12 billion. According to these studies, the human carrying capacity has already been exceeded or would be exceeded by the year 2100, therefore a global population decline would counteract the negative effects of human overpopulation.\n\n\n=== Possible negative effects ===\nThe effects of a declining population can also be negative. As a country's population declines, GDP growth may grow even more slowly or may even decline.  If the decline in total population is not matched by an equal or greater increase in productivity (GDP/capita), and if that condition continues from one calendar quarter to the next, it follows that a country would experience a decline in GDP, known as an economic recession.  If these conditions become permanent, the country could find itself in a permanent recession.\nOther possible negative impacts of a declining population are:\n\nA rise in the dependency ratio which would increase the economic pressure on the workforce\nA crisis in end of life care for the elderly because there are insufficient caregivers for them\nDifficulties in funding entitlement programs because there are fewer workers relative to retirees\nA decline in military strength\nA decline in innovation since change comes from the young\nA strain on mental health caused by permanent recession\nDeflation caused by the ageing populationAll these negative effects could be summarized under the heading of “Underpopulation”.  Underpopulation is usually defined as a state in which a country's population has declined too much to support its current economic system.Population decline can cause internal population pressures that then lead to secondary effects such as ethnic conflict, forced refugee flows, and hyper-nationalism. This is particularly true in regions where different ethnic or racial groups have different growth rates.  An example of this is white nationalism. White nationalists seek to ensure the survival of the white race, and the cultures of historically white nations. Many white nationalists believe that white people should therefore maintain a demographic majority and that mass immigration of non-whites and low birth rates among whites are threatening the white race. Low fertility rates that cause long-term population decline can also lead to population ageing, an imbalance in the population age structure. Population ageing in Europe due to low fertility rates has given rise to concerns about its impact on social cohesion.A smaller national population can also have geo-strategic effects, but the correlation between population and power is a tenuous one. Technology and resources often play more significant roles.  Since World War II, the \"static\" theory saw a population's absolute size as being one of the components of a country's national power. More recently, the \"human capital\" theory has emerged.  This view holds that the quality and skill level of a labor force and the technology and resources available to it are more important than simply a nation's population size.  While there were in the past advantages to high fertility rates, that \"demographic dividend\" has now largely disappeared.\n\n\n== Contemporary decline by country ==\nThe table below shows the countries that have been affected by population decline between 2010 and 2020. The term \"population\" used here is based on the de facto definition of population, which counts all residents regardless of legal status or citizenship, except for refugees not permanently settled in the country of asylum, who are generally considered part of the population of the country of origin. This means that population growth in this table includes net changes from immigration and emigration. For a table of natural population changes, see list of countries by natural increase.\n\n\n=== East Asia ===\n\n\n==== Japan ====\n\nThough Japan's natural increase turned negative as early as 2005, the 2010 census result figure was slightly higher, at just above 128 million, than the 2005 census. Factors implicated in the puzzling figures were more Japanese returnees than expected as well as changes in the methodology of data collection. However, the official count put the population as of October 1, 2015, at 127.1 million, down by 947,000 or 0.7% from the previous quinquennial census. The gender ratio is increasingly skewed; some 106 women per 100 men live in Japan. In 2019, Japan's population fell by a record-breaking 276,000; if immigration is excluded from the figures, the drop would have been 487,000. Given the population boom of the 1950s and 1960s, the total population is still 52% above 1950 levels.\n\n\n==== South Korea ====\n\nSouth Korea's total fertility rate has been consistently lower than that of Japan, breaking below 1 in 2018, and fell to 0.84 in 2020. As a result, its population fell in 2020 for the first time in the country's history.\n\n\n==== Taiwan ====\n\nTaiwan recorded more deaths than births in first quarter of 2021, despite recording virtually no COVID-19 deaths, likely to continue as long term demographic trend.\n\n\n=== Eastern Europe and former Soviet republics ===\n\nPopulation in the ex-USSR and Eastern Europe is rapidly shrinking due to low birth rates, very high death rates (linked to alcoholism and high rates of infectious diseases such as AIDS and TB), as well as high emigration rates. In Russia and the former communist bloc, birth rates fell abruptly after the fall of the Soviet Union, and death rates generally rose sharply. In addition, in the 25 years after 1989, some 20 million people from Eastern Europe are estimated to have migrated to Western Europe or the United States.\n\n\n==== Armenia ====\nArmenia's population peaked at 3,604,000 in 1991 and declined to 3,010,600 in the January 2015 state statistical estimate. This represents a 19.7% decrease in total population since the peak census figure.\n\n\n==== Belarus ====\nBelarus's population peaked at 10,151,806 in 1989 Census, and declined to 9,480,868 as of 2015 as estimated by the state statistical service. This represents a 7.1% decline since the peak census figure.\n\n\n==== Estonia ====\nIn the last Soviet census of 1989, it had a population of 1,565,662, which was close to its peak population. The state statistics reported an estimate of 1,314,370 for 2016. This represents a 19.2% decline since the peak census figure.\n\n\n==== Georgia ====\nIn the last Soviet census of 1989, it had a population of 5,400,841, which was close to its peak population. The state statistics reported an estimate of 4,010,000 for 2014 Census, which includes estimated numbers for quasi-independent Abkhazia and South Ossetia. This represents a 25.7% decline since the peak census figure, but nevertheless somewhat higher than the 1950 population.\n\n\n==== Latvia ====\nWhen Latvia split from the Soviet Union, it had a population of 2,666,567, which was very close to its peak population. The latest census recorded a population of 2,067,887 in 2011, while the state statistics reported an estimate of 1,986,086 for 2015. This represents a 25.5% decline since the peak census figure, only one of two nations worldwide falling below 1950 levels. The decline is caused by both a negative natural population growth (more deaths than births) and a negative net migration rate.\n\n\n==== Lithuania ====\nWhen Lithuania split from the Soviet Union, it had a population of 3.7 million, which was close to its peak population. The latest census recorded a population of 3.05 million in 2011, down from 3.4 million in 2001, further falling to 2,988,000 on September 1, 2012.\nThis represents a 23.8% decline since the peak census figure, and some 13.7% since 2001.\n\n\n==== Ukraine ====\nUkraine census in 1989 resulted in 51,452,034 people. Ukraine's own estimates show a peak of 52,244,000 people in 1993; however, this number has plummeted to 45,439,822 as of December 1, 2013. Having lost Crimean territory to Russia in early 2014 and subsequently experienced war, the population dropped to 42,981,850 as of August 2014. This represents a 19.7% decrease in total population since the peak figure, but 16.8% above the 1950 population even without Crimea. Its absolute total decline (9,263,000) since its peak population is the highest of all nations; this includes loss of territory and heavy net emigration. Eastern Ukraine may yet lose many Russian-speaking citizens due to new Russian citizenship law.\n\n\n==== Hungary ====\nHungary's population peaked in 1980, at 10,709,000, and has continued its decline to under 10 million as of August 2010. This represents a decline of 7.1% since its peak; however, compared to neighbors situated to the East, Hungary peaked almost a decade earlier yet the rate has been far more modest, averaging −0.23% a year over the period.\n\n\n=== Balkans ===\n\n\n==== Albania ====\nAlbania's population in 1989 recorded 3,182,417 people, the largest for any census. Since then, its population declined to an estimated 2,893,005 in January 2015. This represents a decrease of 10% in total population since the peak census figure.\n\n\n==== Bosnia and Herzegovina ====\nBosnia and Herzegovina's population peaked at 4,377,033 in the 1991 Census, shortly before the Yugoslav wars that produced tens of thousands of civilian victims and refugees. The latest census of 2016 reported a population of 3,511,372. This represents a 19.8% decline since the peak census figure.\n\n\n==== Bulgaria ====\nBulgaria's population declined from a peak of 9,009,018 in 1989 and since 2001, has lost yet another 600,000 people, according to 2011 census preliminary figures to no more than 7.3 million, further down to 7,245,000. This represents a 24.3% decrease in total population since the peak, and a −0.82% annual rate in the last 10 years.\n\n\n==== Croatia ====\nCroatia's population declined from 4,784,265 in 1991 to 4,456,096 (by old statistical method) of which 4,284,889 are permanent residents (by new statistical method), in 2011, a decline of 8% (11.5% by the new definition of permanent residency in 2011 census). The main reasons for the decline since 1991 are: low birth rates, emigration and war in Croatia. From 2001 and 2011 main reason for the drop in population is due to a difference in definition of permanent residency used in censuses till 2001 (censuses of 1948, 1953, 1961, 1971, 1981, 1991 and 2001) and the one used in 2011.\n\n\n==== Romania ====\nRomania's 1991 census showed 23,185,084 people, and the October 2011 census recorded 20,121,641 people, while the state statistical estimate for 2014 is 19,947,311. This represents a decrease of 16.2% since the historical peak in 1991.\n\n\n==== Serbia ====\nSerbia recorded a peak census population of 7,576,837 in 1991 in the Yugoslav era, falling to 7,186,862 in the 2011 census. That represents a decline of 5.1% since its peak census figure.\n\n\n== Resumed declines ==\nCountries whose population declines halted temporarily, but have since resumed:\n\n\n=== Russia ===\n\nThe decline in Russia's total population is among the largest in numbers, but not in percentage. After having peaked at 148,689,000 in 1991, the population then decreased, falling to 142,737,196 by 2008. This represents a 4.0% decrease in total population since the peak census figure. However, since then the Russian population has risen to 146,870,000 in 2018. This recent trend can be attributed to a lower death rate, higher birth rate, the annexation of Crimea and continued immigration, mostly from Ukraine and Armenia. It is some 40% above the 1950 population.\n\n\n=== Spain ===\nSpanish population fell by over 100 thousand in 2020, likely to continue as long term demographics trend.\n\n\n=== Italy ===\nItalian population fell by a record amount in 2020, likely to continue as long term demographics trend.\n\n\n== Halted declines ==\n\n\n=== Germany ===\nIn Germany a decades-long tendency to population decline has been offset by waves of immigration. The 2011 national census recorded a population of 80.2 million people. At the end of 2012 it had risen to 82 million according to federal estimates. This represents about 14% increase over 1950.\n\n\n=== Ireland ===\nIn the current area of the Republic of Ireland, the population has fluctuated dramatically. The population of Ireland was 8 million in 1841, but it dropped due to the Irish famine and later emigration. The population of the Republic of Ireland hit a bottom at 2.8 million in the 1961 census, but it then rose and in 2011 it was 4.58 million. As of 2020 it is estimated to be just under 5 million according to the country's Central Statistics Office \n\n\n== Declines within regions or ethnic groups of a country ==\n\n\n=== United States ===\n\nIn spite of a growing population at a national level, some formerly large American municipalities have dramatically shrunk after the Second World War, and in particular during the 1950s–1970s, due to suburbanization, urban decay, race riots, high crime rates, deindustrialization and emigration from the Rust Belt to the Sun Belt. For instance, Detroit's population peaked at almost 2 million in 1953, then declined to less than 700,000 by 2020. Other cities whose populations have dramatically shrunk since the 1950s include Baltimore, Buffalo, Cincinnati, Cleveland, Flint, Gary, New Orleans, St. Louis, Pittsburgh, Scranton, Youngstown, Wilmington (Delaware). In addition, the depopulation of the Great Plains, caused by a very high rate of rural flight from isolated agricultural counties, has been going on since the 1930s.\nIn addition, starting from the 1950s the United States have witnessed the phenomenon of the white flight or white exodus, the large-scale migration of people of various European ancestries from racially mixed urban regions to more racially homogeneous suburban or exurban regions. The term has more recently been applied to other migrations by whites, from older, inner suburbs to rural areas, as well as from the U.S. Northeast and Midwest to the warmer climate in the Southeast and Southwest. Migration of middle-class white populations was observed during the Civil rights movement in the 1950s and 1960s out of cities such as Cleveland, Detroit, Kansas City and Oakland, although racial segregation of public schools had ended there long before the Supreme Court of the United States' decision Brown v. Board of Education in 1954. In the 1970s, attempts to achieve effective desegregation (or \"integration\") by means of forced busing in some areas led to more families' moving out of former areas. More recently, as of 2018, California had the largest ethnic/racial minority population in the United States; Non-Hispanic whites decreased from about 76.3 – 78% of the state's population in 1970 to 36.6%% in 2018 and 39.3% of the total population was Hispanic-Latino (of any race).A combination of long term trends, housing affordability, and falling birthrates and rising death rates from the COVID-19 pandemic have caused as many as 16 US states to start declining in population.\n\n\n=== South Africa ===\nThe term 'white flight' has also been used for large-scale post-colonial emigration of whites from Africa, or parts of that continent, driven by levels of violent crime and anti-colonial state policies. In recent decades, there has been a steady proportional decline in South Africa's white community, due to higher birth rates among other South African ethnic groups, as well as a high rate of emigration. In 1977, there were 4.3 million White South Africans, constituting 16.4% of the population at the time. An estimated 800,000 emigrated between 1995 and 2016, citing crime and a lack of employment opportunities.\n\n\n=== India ===\nThe Parsis of India have one of the lowest fertility rates in the world (0.8 children per woman in 2017); this coupled with emigration has resulted in population decline at least since the 1940s. Their population has more than halved from the peak.\n\n\n== National efforts to confront declining populations ==\n\nA country with a declining population will struggle to fund public services such as health care, old age benefits, defense, education, water and sewage infrastructure, etc.  In order to maintain some level of economic growth and continue to improve its citizens’ quality of life, national efforts to confront declining populations will tend to focus on the threat of a declining GDP.  Because a country's GDP is dependent on the size and productivity of its workforce, a country confronted with a declining population, will focus on increasing the size and productivity of that workforce.\n\n\n=== Increase the size of the workforce ===\nA country's workforce is that segment of its working age population that is employed.  Working age population is generally defined as those people aged 15–64.Policies that could increase the size of the workforce include:\n\nNatalismNatalism is a set of government policies and cultural changes that promote parenthood and encourage women to bear more children. These generally fall into three broad categories:\nFinancial incentives.  These may include child benefits and other public transfers that help families cover the cost of children.\nSupport for parents to combine family and work. This includes maternity-leave policies, parental-leave policies that grant (by law) leaves of absence from work to care for their children, and childcare services.\nBroad social change that encourages children and parentingFor example, Sweden built up an extensive welfare state from the 1930s and onward, partly as a consequence of the debate following Crisis in the Population Question, published in 1934. Today, (2017) Sweden has extensive parental leave that allows parents to share 16 months paid leave per child, the cost divided between both employer and State.Other examples include Romania's natalist policy during the 1967–90 period and Poland's 500+ program.\nEncourage more women to join the workforce. Encouraging those women in the working age population who are not working to find jobs would increase the size of the workforce. Female participation in the workforce currently (2018) lags men's in all but three countries worldwide. Among developed countries the workforce participation gap between men and women can be especially wide.  For example, currently (2018), in South Korea 59% of women work compared with 79% of men.However, even assuming that more women would want to join the workforce, increasing their participation would give these countries only a short-term increase in their workforce, because at some point a participation ceiling is reached, further increases are not possible, and the impact on GDP growth ceases.\n\nStop the decline of men in the workforce.In the United States the labor force participation of men has been falling since the late 1960s. The labor force participation rate is the ratio between the size of the workforce and the size of the working age population. In 1969 the labor force participation rate of men in their prime years of 25–54 was 96% and in 2015 was under 89%.\nRaise the retirement age.Raising the retirement age has the effect of increasing the working age population, but raising the retirement age requires other policy and cultural changes if it is to have any impact on the size of the workforce:\n\nPension reform. Many retirement policies encourage early retirement. For example, today (2018) less than 10% of Europeans between ages 64–74 are employed.    Instead of encouraging work after retirement, many public pension plans restrict earnings or hours of work.\nWork place cultural reform. Employer attitudes towards older workers must change. Extending working lives will require investment in training and working conditions to maintain the productivity of older workers.One study estimated that increasing retirement age by 2–3 years per decade between 2010 and 2050 would offset declining working age populations faced by “old” countries such as Germany and Japan.\nIncrease immigration. A country can increase the size of its workforce by importing more migrants into their working age population. Even if the indigenous workforce is declining, qualified immigrants can reduce or even reverse this decline.  However, this policy can only work if the immigrants can join the workforce and if the indigenous population accepts them.For example, starting in 2019 Japan, a country with declining workforce, will allow 5-year visas for 250,000 un-skilled guest workers.  Under the new measure, between 260,000 and 345,000 five-year visas will be made available for workers in 14 sectors suffering severe labor shortages, including caregiving, construction, agriculture and shipbuilding.\nReduce emigration. The table above shows that long term persistent emigration, often caused by what is called “Brain Drain”, is often one of the major causes of a county's population decline.  However, research has also found that emigration can have net positive effects on sending countries, so this would argue against any attempts to reduce it.\n\n\n=== Increase the productivity of the workforce ===\n\nDevelopment economists would call increasing the size of the workforce “extensive growth”. They would call increasing the productivity of that workforce “intensive growth”. In this case, GDP growth is driven by increased output per worker, and by extension, increased GDP/capita.In the context of a stable or declining population, increasing workforce productivity is better than mostly short-term efforts to increase the size of the workforce. Economic theory predicts that in the long term most growth will be attributable to intensive growth, that is, new technology and new and better ways of doing things plus the addition of capital and education to spread them to the workforce .Increasing workforce productivity through intensive growth can only succeed if workers who become unemployed through the introduction of new technology can be retrained so that they can keep their skills current and not be left behind. Otherwise the result is technological unemployment. Funding for worker retraining could come from a robot tax, although the idea is controversial.\n\n\n== Long-term future trends ==\n\nA long-term population decline is typically caused by sub-replacement fertility, coupled with a net immigration rate that fails to compensate the excess of deaths over births. A long-term decline is accompanied by population aging and creates an increase in the ratio of retirees to workers and children. When a sub-replacement fertility rate remains constant, population decline accelerates over the long term.Because of the global decline in the fertility rate, projections of future global population show a marked slowing of population growth and the possibility of long-term decline.The table below summarizes the United Nations' predictions of future population growth.  The UN divides the world into six regions.  Their forecast shows that during the period 2045–2050 Europe's population will be in decline and all other regions will experience significant reductions in growth.  Furthermore, the UN predicts that by the end of the 21st century (the period 2095–2100) three of these regions will be showing population decline and global population growth will be zero.\n\nNote: the UN's methods for generating these numbers is explained at this reference.The table shows that the UN predicts long-term decline of population growth rates in every region; however, short-term baby booms and healthcare improvements, among other factors, can cause reversals of trends. Population declines in Russia (1995–2010), Germany (1975–1985), and Ireland (1850–1960) have seen long-term reversals.  The UK, having seen almost zero growth during the period 1975–1985, is now (2015–2020) growing at 0.6% per year.\n\n\n== See also ==\n\n\n== References ==\n\n\n== External links ==\n\"Human Population Numbers as a Function of Food Supply\". Russell Hopfenberg (1 Duke University, Durham, NC, USA;)* and David Pimentel (2 Cornell University, Ithaca, NY, USA)."