"A population decline (sometimes underpopulation or depopulation or population collapse) in humans is a reduction in a human population size caused by many factors. Up until the beginning of the industrial revolution, global population grew very slowly. After about 1800 the growth rate accelerated to a peak of 2.09% annually in both 1967-68 and 1968 - 69, but since then, due to the world-wide collapse of the total fertility rate, it has declined to 1.05% today (2020). The global growth rate in absolute numbers accelerated to a peak (92.9 million) in 1988, but has declined to 81.3 million in 2020.In order to maintain its population, a country requires a minimum fertility rate of 2.11 children per woman (the number is slightly greater than 2 because not all children live to adulthood). However, almost all societies experience a drastic drop in fertility to well below 2 as they grow more wealthy (see income and fertility). The tendency of women in wealthier countries to have fewer children is attributed to a variety of reasons, such as lower infant mortality and a reduced need for children as a source of family labor or retirement welfare, both of which reduce the incentive to have many children. Better access to education for young women, which broadens their job prospects, is also often cited. Long-term projections predict that the growth rate of the human population of this planet will continue to decline, and that by the end of the 21st Century, will reach zero. Examples of this emerging trend are Japan, whose population is currently (2015–2020) declining at the rate of 0.2% per year, and China, whose population could start declining in 2027 or sooner. By 2050, Europe's population is projected to be declining at the rate of 0.3% per year.Possible consequences of long-term national population decline can be net positive or negative. If a country can increase its workforce productivity faster than its population is declining, the results, both in terms of its economy, the quality-of-life of its citizens, and the environment, can be net positive. If it cannot increase workforce productivity faster than its population's decline, the results can be mostly negative. National efforts to confront population decline to-date have been focused on the possible negative economic consequences and have been centered around increasing the size and productivity of the workforce.\n\n"