"The Inter-American Treaty of Reciprocal Assistance (commonly known as the Rio Treaty, the Rio Pact, the Treaty of Reciprocal Assistance, or by the Spanish-language acronym TIAR from Tratado Interamericano de Asistencia Recíproca) is an agreement signed in 1947 in Rio de Janeiro among many countries of the Americas. The central principle contained in its articles is that an attack against one is to be considered an attack against them all; this was known as the \"hemispheric defense\" doctrine. Despite this, several members have breached the treaty on multiple occasions. The treaty was initially created in 1947 and came into force in 1948, in accordance with Article 22 of the treaty. The Bahamas was the most recent country to sign and ratify it in 1982.\n\n\n== Background ==\nThe United States maintained a hemispheric defense policy relative to European influence under the Monroe Doctrine since 1823, which became increasingly interventionist with the Roosevelt Corollary in 1904. During the 1930s the United States had been alarmed by Axis overtures toward military cooperation with Latin American governments; apparent strategic threats against the Panama Canal were of particular concern. These were discussed in a series of meetings of the International Conference of American States and the 1936 Inter-American Conference for the Maintenance of Peace. During the war, Washington had been able to secure Allied support from all individual governments except Uruguay, which remained neutral, and Argentina, whose government was not recognized by the Allied powers. Some countries had signed the Declaration by United Nations in early 1942 and more had signed by the end of 1945.\nHowever, Latin American countries were largely sidelined from the Allied discussions of a postwar security order, held at Dumbarton Oaks. The Brazilian Ambassador Carlos Martins \"protested the violation of inter-American norms of consultation in the preparation of postwar plans.\" These protests led to a series of consultations and well as the Mexican proposal for an inter-American meeting. At the Inter-American Conference on the Problems of War and Peace, in Mexico City during February and March 1945, discussions of the post-war world order were held and produced the Act of Chapultepec. The Act included a framework for the negotiation of a regional security treaty. It also shaped Latin American pressure during the United Nations conference in San Francisco for clauses in the UN Charter to facilitate regional collective defense, under Article 51.Initially, the security conference was due to be held in Rio de Janeiro in late 1945 or early 1946; however, disputes between the United States and Argentina's Juan Domingo Perón led to delays. The United States and some Latin American concern about peronismo raised the possibility of including collective intervention to preserve democracy in the security conference. During the delay, global tensions between the United States and Soviet Union grew. In light of the developing Cold War and following the statement of the Truman Doctrine, the United States wished to make those new anti-communist commitments permanent, as did many anti-communist leaders in Latin America.\n\n\n== History ==\n\n\n=== Signing ===\nThe Inter-American Treaty of Reciprocal Assistance was the first of many so-called \"mutual security agreements\", and the formalization of the Act of Chapultepec. The treaty was adopted by the original signatories on 2 September 1947 in Rio de Janeiro (hence the colloquial name \"Rio Treaty\"). It came into force on 3 December 1948 and was registered with the United Nations on 20 December 1948. With the exceptions of Trinidad and Tobago (1967) and The Bahamas (1982), no countries that became independent after 1947 have joined the treaty; Canada is yet to become a member, though it already has separate defense commitments with the United States.\n\n\n=== Cold War ===\nThough the Cold War overtones of the Rio Treaty became increasingly evident, during the immediate post-war years, Long argues that it was more closely tied to pre-WWII regional antecedents and, even, Latin American diplomatic pressure. Long states, \"Despite many Latin American concerns about the United States’ ultimately interventionist nature, Latin American diplomats cited the Monroe Doctrine and United States-led Pan-Americanism in support of a grand bargain that would extend and institutionalize U.S. engagement while restricting unilateralism.\" However, the United States' often considered adherence to the Treaty's principles of nonintervention as secondary to its Cold War concerns.\n\n\n=== Decline ===\nAs revolutionary and nationalist governments spread through Latin America through the 1950s and 1960s, the fear of a shared enemy that was experienced during WWII dissipated and the idea of defensive cooperation became strained. According to Slater, many Latin American governments participating in the Treaty sought \"to insulate the hemisphere from rather than involve it in world conflict\", though the United States pushed the smaller countries towards confrontation with its ideological adversaries. Latin American governments then began to view inter-American collaboration as bending to the will of the United States, forfeiting their sovereignty.Though the action of the United States during the 1954 Guatemalan coup d'état and the 1961 Bay of Pigs Invasion raised questions among Latin American governments, the unilateral approach of the United States invading the Dominican Republic in 1965 during the Dominican Civil War before the OAS's Inter-American Peace Force was organized proved to members that the United States did not respect the ideals of multilateralism. Conversely during the Falklands War in 1982, the United States favored the United Kingdom arguing that Argentina had been the aggressor and because Argentina had not been attacked, as did Chile and Colombia. This was seen by most Latin American countries as the final failure of the treaty.In September 2002, citing the Falklands example and anticipating the Iraq War, Mexico formally withdrew from the treaty; after the requisite two years, Mexico ceased to be a signatory in September 2004. In 2008, the Union of South American Nations (UNASUR) created a new regional security council manage their own defensive objectives. On 5 June 2012,  Bolivarian Alliance for the Americas (ALBA) countries Bolivia, Ecuador, Nicaragua and Venezuela, under the leadership of leftist governments, initiated the retirement from the TIAR, a decision which the Obama Administration described as \"unfortunate\" but respected. The treaty was officially denounced by Nicaragua on 20 September 2012, Bolivia on 17 October 2012, Venezuela on 14 May 2013, and Ecuador on 19 February 2014.\n\n\n== Invocations and considerations ==\nThe treaty was invoked numerous times during the 1950s and 1960s, in particular supporting the United States' naval blockade unanimously during the Cuban Missile Crisis. In 2001, the United States invoked the Rio Treaty after the September 11 attacks.\nIn 2019 during a presidential crisis in Venezuela between incumbent President Nicolás Maduro and president of the opposition-led National Assembly of Venezuela Juan Guaidó, the latter opened talks on rejoining TIAR. On 11 May, Guaidó sent a letter to Organization of American States (OAS) secretary Luis Almagro requesting that Venezuela be reinstated. On 29 May 2019, the National Assembly approved its return to the Treaty in a preliminary discussion. The National Assembly reiterated its approval to return to the treaty in July 2019.\n\n\n== Members ==\nCurrent members:\n\n\n== See also ==\nInter-American Peace Force\nNorth Atlantic Treaty Organization\nMilitary alliance\nSICOFAA\nMutual Defense Assistance Act\nMutual Security Act\nLatin America–United States relations\nInter-American Conference on Problems of War and Peace of 1945\n\n\n== Footnotes ==\n\n\n== Further reading ==\nLong, T. (2020). \"Historical Antecedents and Post-World War II Regionalism in the Americas.\" World Politics.\n\n\n== References =="