"Slymenstra Hymen was Gwar's dancer, bodyguard, and occasional singer portrayed by Danielle Stampe.Slymenstra contributed backup vocals on most Gwar albums during her time with the band. Slymenstra and Oderus Urungus are featured in a duet titled \"Fire in the Loins,\" on the RagNaRok album. \"Don't Need A Man,\" written by Michael Derks and appearing on Carnival Of Chaos, was the first Gwar song to feature Slymenstra solo on lead vocals. \"My Girly Ways,\" featured on We Kill Everything, also featured Slymenstra in what would be the character's final song as a lead vocalist. Stampe left Gwar in 2000 but returned for one final tour with the group in 2002.\n\n\n== Danielle Stampe ==\n\nDanielle Stampe was born in San Diego on November 27, 1967. Her family moved to Virginia Beach, Virginia where she attended high school before moving on to Virginia Commonwealth University to study Fine Art. It was there that Stampe met Dave Brockie of the band Gwar. Stampe joined Gwar in 1988 and developed the Slymenstra Hymen character. In 1992, Stampe moved to New York City. In 1995, along with Ula and Sharka of the Pain-Proof Rubber Girls, she helped in creating the Girly Freak Show, a performance troupe where she could be seen performing sideshow acts such as fire spinning and breathing, bullwhip, sword ladder walking, glass walking, eating lightbulbs, the Fiji mermaid, fire fan dance, burlesque tassle twirler, and the Miss Spidora illusion. After performing the act in clubs, it moved on to touring nationally as part of the 1996 Lollapalooza tour. After Lollapalooza, many of the performers moved on to other projects and Girly Freak Show came to an end.Stampe moved to Los Angeles in 1996 and after leaving Gwar in 2000, she revived the Girly Freak Show, for which she was granted the naming rights by Ula and Sharka. Stampe also performed her sideshow act, often under the pseudonyms Danyella De Meaux and Miss Electra, as a member of the Brothers Grim Sideshow as well as with The Velvet Hammer Burlesque and Lucha VaVOOM, the wrestling/burlesque show. During these appearances, she could often be seen performing \"Don't Need A Man\" live. Stampe holds several world records for fire breathing and human endurance of high-voltage electricity. These feats also have also resulted in her appearances on numerous television shows, including Ripley's Believe It or Not!, Guinness World Records Primetime, and Wild West Tech. She has also been a performer at Knott's Scary Farm, the annual Halloween event held at Knott's Berry Farm in Buena Park, California.Stampe works on set design for film and music videos, most notably for performers Lady Gaga, Katy Perry and Nicki Minaj. She is also the owner of an interior and exterior home design company named Wrapt In Comfort.\n\n\n== References =="