"\"Alternative facts\" was a phrase used by U.S. Counselor to the President, Kellyanne Conway, during a Meet the Press interview on January 22, 2017, in which she defended White House Press Secretary Sean Spicer's false statement about the attendance numbers of Donald Trump's inauguration as President of the United States. When pressed during the interview with Chuck Todd to explain why Spicer would \"utter a provable falsehood\", Conway stated that Spicer was giving \"alternative facts\". Todd responded, \"Look, alternative facts are not facts. They're falsehoods.\"Conway's use of the phrase \"alternative facts\" for demonstrable falsehoods was widely mocked on social media and sharply criticized by journalists and media organizations, including Dan Rather, Jill Abramson, and the Public Relations Society of America. The phrase was extensively described as Orwellian, particularly in reference to the term doublethink. Within four days of the interview, sales of George Orwell's novel Nineteen Eighty-Four had increased 95-fold, which The New York Times and others attributed to Conway's use of the phrase, making it the number-one bestseller on Amazon.com.Conway later defended her choice of words, defining \"alternative facts\" as \"additional facts and alternative information\".\n\n\n== Background ==\nOn January 21, 2017, while White House Press Secretary Sean Spicer held his first press briefing, he accused the media of deliberately underestimating the size of the crowd for President Trump's inaugural ceremony and stated that the ceremony had drawn the \"largest audience to ever witness an inauguration – period – both in person and around the globe\". According to rapid transit ridership data and photographic evidence Spicer's claims and allegations were false. Aerial images showed that the turnout for Trump's inauguration was lower than the turnout for the 2009 inauguration of Barack Obama. Spicer claimed that 420,000 people rode the DC Metro on inauguration day 2017, compared to 317,000 in 2013. He did not offer a source for his claim, or clarify the time periods being compared. Actual ridership figures between midnight and 11 AM were 193,000 in 2017, 317,000 in 2013. Full-day ridership was 570,557 in 2017, 782,000 in 2013.\nSpicer also gave incorrect information about the use of white ground coverings during the inauguration. He stated that they were used for the first time during the Trump inauguration and were to blame for a visual effect that made the audience look smaller. The white ground coverings, however, had been used in 2013 when Obama was sworn in for the second term. Spicer did not take questions from the media at the press briefing.\n\nTrump's campaign strategist and counselor, Kellyanne Conway, defended Spicer's statements in a Meet the Press interview. In response to a question from Todd about Trump's false claims regarding the inauguration crowd and the loss of credibility, Conway said:\"Our press secretary, Sean Spicer, gave alternative facts to that, but the point remains that...\"\nTodd interrupted her by saying \"Wait a minute. Alternative facts? ... Alternative facts are not facts. They're falsehoods.\" In her answer Conway argued that crowd numbers in general could not be assessed with certainty and objected to what she described as Todd's trying to make her look ridiculous.Conway later defended her choice of words, defining \"alternative facts\" as \"additional facts and alternative information\".Two days later, Spicer corrected his statements concerning the WMATA ridership levels, stating that he had been relying on statistics \"given to him\". He stood by his widely disputed claim that the inauguration was the most-viewed, stating he also included online viewership in addition to in-person and television in his figures.During the week following Conway's comments, she discussed \"alternative facts\", substituting the phrases \"alternative information\" and \"incomplete information\". Two days after the Todd interview she defended Trump's travel restrictions by talking about a nonexistent \"Bowling Green massacre\" (she later said she was referring to the arrest of two Iraqis in Bowling Green, Kentucky, for sending aid to insurgents in Iraq), and by falsely claiming that President Obama in 2011 had \"banned visas for refugees from Iraq for six months\". Her false statements were described as having \"taken 'alternative facts' to a new level\".The phrase \"alternative facts\" was claimed to be similar to a phrase used in Trump's 1987 book, Trump: The Art of the Deal. In that book, \"truthful hyperbole\" was described as \"an innocent form of exaggeration—and ... a very effective form of promotion\". The book claimed that \"people want to believe that something is the biggest and the greatest and the most spectacular.\" The ghostwriter of the book, Tony Schwartz, said he coined that phrase and claimed that Trump \"loved it\".Conway later defended her remarks in an interview published in March 2017: \"Two plus two is four. Three plus one is four. Partly cloudy, partly sunny. Glass half full, glass half empty. Those are alternative facts.\" In a radio interview with Mark Simone that was described by Salon in February 2018, she claimed that professional fact-checkers tend to be political liberals and are \"selecting what [they] think should be fact-checked...Americans are their own fact checkers. People know, they have their own facts and figures, in terms of meaning which facts and figures are important to them.\"\n\n\n== Reactions ==\n\n\n=== Criticism ===\nSpicer's press conference and Conway's follow-up comments drew quick reactions on social media. Journalist Dan Rather posted a criticism of the incoming Trump administration on his Facebook page. Rather wrote:\nThese are not normal times. These are extraordinary times. And extraordinary times call for extraordinary measures. When you have a spokesperson for the president of the United States wrap up a lie in the Orwellian phrase \"alternative facts\".... When you have a press secretary in his first appearance before the White House reporters threaten, bully, lie, and then walk out of the briefing room without the cojones to answer a single question... Facts and the truth are not partisan. They are the bedrock of our democracy. And you are either with them, with us, with our Constitution, our history, and the future of our nation, or you are against it. Everyone must answer that question.\n\nThe New York Times responded with a fact check of statements made during Spicer's press conference. This included a side-by-side photographic comparison of the crowds from Obama's 2009 inauguration and that of Trump.\nJournalist and former New York Times executive editor Jill Abramson characterized Conway's comments about alternative facts as \"Orwellian newspeak\", and said \"'Alternative facts' are just lies\". NBC News quoted two experts on the psychology of lying who said that the Trump administration was engaging in gaslighting, and reported that the domain name alternativefacts.com had been purchased and redirected to an article on the subject.The Merriam-Webster dictionary website reported that lookups for the word \"fact\" spiked after Conway used the phrase \"alternative facts\". They also got involved by tweeting about it: \"A fact is a piece of information presented as having objective reality.\" The tweet included a link to their article about Conway's use of the term.Following Conway's Meet the Press interview and the viral response on social media in which \"alternative facts\" was likened to Doublethink and Newspeak, terms from George Orwell's dystopian novel Nineteen Eighty-Four, sales of the book increased by more than 9,500 percent, rising to the number one best-selling book on Amazon.com. The New York Times and others attributed this to Conway's statement. Penguin, the book's publisher, ordered a 75,000 unit reprint to meet demand.Snopes's journalist Alex Kasprak noted Carl Sagan's words in Sagan's book The Demon-Haunted World: Science as a Candle in the Dark became a viral meme about alternative facts after the inauguration of Trump, Kasprak commented \"the proffered description of that nightmare was authentic\".On January 24, 2017, the Public Relations Society of America, a public relations trade group, put out a statement that said \"Encouraging and perpetuating the use of alternative facts by a high-profile spokesperson reflects poorly on all communications professionals.\"\n\n\n=== Legal usage ===\nIn a Breitbart News article dated January 23, 2017, editor Joel Pollak defended Conway's use of \"alternative facts\" by arguing that it was a \"harmless, and accurate term in a legal setting, where each side of a dispute will lay out its own version of the facts for the court to decide.\" However, The Guardian noted that \"[a] search of several online legal dictionaries did not yield any results for the term.\"A week later, the conservative daily magazine American Thinker published an article asserting that \"it seems eminently possible that Ms. Conway knew exactly what it was she was saying\". After providing a single example of a legal use of the phrase \"alternative facts\", the author conceded that its citation demanded \"plausible evidence to support both alternatives\" and did not attempt to provide such evidence.On February 23, 2017, fifteen professors of law, some of whom are themselves obliged to adhere to the District of Columbia Bar Association's Rule of Professional Conduct, rule 8.4(a), filed a disciplinary complaint with the D.C. Bar's Office of Disciplinary Conduct. Their complaint applies against Conway, a lawyer in public office, on the grounds that under rule 8.4(c): \"It is professional misconduct for a lawyer to engage in conduct involving dishonesty, fraud, deceit, or misrepresentation\", because of Conway's pattern of misrepresentation as well as her misuse of words such as \"massacre\" at a time when she holds high public office. The letter of complaint makes a specific reference to the use of the phrase \"alternative facts\" as being involved in one of the cases of alleged misconduct, citing as a reference for its claim an opinion article by a New York Times Op-Ed columnist.\n\n\n=== In popular culture ===\nThe term alternative facts became a mainstay in popular culture, from late night comedians to serious news outlets. Jimmy Fallon created a segment \"Two Truths and an Alternative Fact\" on The Tonight Show. Stephen Colbert criticized Conway for saying she was not Inspector Gadget or \"in the job of having evidence\" on The Late Show, claiming \"Kellyanne Conway has only one move: 'Go, go, alternative facts!'\"CNN's ad campaign \"Facts First\" was a direct response to the concept of alternative facts and fake news. USA Today listed it in their \"Glossary of Trump terms.\"Both Robert De Niro and Steven Spielberg referred to alternative facts in their speech at the National Board of Review awards for the Spielberg film The Post. \"We are in a fight and it's a fight not just about alternative facts but it's a fight for the objective truth\" said Spielberg after accepting the award.The 2017 short film Alternative Math is a satire about the absurdity of the concept of alternative facts.On January 16, 2018, German linguists declared the phrase \"alternative facts\" the non-word of the year 2017. It was also chosen by Austrian linguists as the non-word of the year in December 2017.\n\n\n== See also ==\n\n\n== References ==\n\n\n== Further reading ==\nd'Ancona, Matthew (2017), Post-Truth: The New War on Truth and How to Fight Back, ISBN 978-1785036873\nGoodspeed, William (2017), Alternative Facts: Fake News, Tweets & the 2016 Election Paperback, Satirical Press International, ISBN 978-0998885308\nNoterie, Abrams (2017), Alternative Facts Journal, Harry N. Abrams, ISBN 978-1419728846\n\n\n== External links ==\nKellyanne Conway Meet the Press interview with Chuck Todd on YouTube\n\"Trump's Long Embrace of Alternative Facts\" Bloomberg View"