"In set theory, an infinite set is a set that is not a finite set. Infinite sets may be countable or uncountable.\n\n\n== Properties ==\nThe set of natural numbers (whose existence is postulated by the axiom of infinity) is infinite. It is the only set that is directly required by the axioms to be infinite. The existence of any other infinite set can be proved in Zermelo–Fraenkel set theory (ZFC), but only by showing that it follows from the existence of the natural numbers.\nA set is infinite if and only if for every natural number, the set has a subset whose cardinality is that natural number.If the axiom of choice holds, then a set is infinite if and only if it includes a countable infinite subset.\nIf a set of sets is infinite or contains an infinite element, then its union is infinite. The power set of an infinite set is infinite. Any superset of an infinite set is infinite. If an infinite set is partitioned into finitely many subsets, then at least one of them must be infinite. Any set which can be mapped onto an infinite set is infinite. The Cartesian product of an infinite set and a nonempty set is infinite. The Cartesian product of an infinite number of sets, each containing at least two elements, is either empty or infinite; if the axiom of choice holds, then it is infinite.\nIf an infinite set is a well-ordered set, then it must have a nonempty, nontrivial subset that has no greatest element.\nIn ZF, a set is infinite if and only if the power set of its power set is a Dedekind-infinite set, having a proper subset equinumerous to itself. If the axiom of choice is also true, then infinite sets are precisely the Dedekind-infinite sets.\nIf an infinite set is a well-orderable set, then it has many well-orderings which are non-isomorphic.\n\n\n== Examples ==\n\n\n=== Countably infinite sets ===\nThe set of all integers, {..., -1, 0, 1, 2, ...} is a countably infinite set. The set of all even integers is also a countably infinite set, even if it is a proper subset of the integers.The set of all rational numbers is a countably infinite set as there is a bijection to the set of integers.\n\n\n=== Uncountably infinite sets ===\nThe set of all real numbers is an uncountably infinite set. The set of all irrational numbers is also an uncountably infinite set.\n\n\n== See also ==\nAleph number\nCardinal number\nOrdinal number\n\n\n== References ==\n\n\n== External links ==\nA Crash Course in the Mathematics Of Infinite Sets"