"Raoul of Mérencourt (also called Ralph or Radulphus) was Latin Patriarch of Jerusalem from 1214 to 1224. He succeeded the assassinated Albert Avogadro.\nRaoul de Mérencourt was a native of Champagne.  He seems to have come to the Holy Land as part of the entourage following Henry II, count of Champagne and future husband of Isabella I, queen of Jerusalem.  Raoul worked as a notary in the Haute Cour in Acre.  In 1206 Albert, formerly bishop of Vercelli, arrived as the new patriarch, following upon Soffredo Gaetani, who resigned the office after only one year, and went off to join the Fourth Crusade in Constantinople.\nIn 1208 Albert the patriarch sent him as part of an official delegation to Philip Augustus, king of France, to seek a husband and king-consort for the young heiress to the throne, Maria of Montferrat.  The king, with the encouragement of Blanche of Navarre, countess-regent of Champagne, selected one of her feudal vassals, John of Brienne.  John held the title of count of Brienne on behalf of his brother Walter (Gautier) of Brienne, whose cause had briefly attracted the young Giovanni Bernadone (later Francis of Assisi) to his cause.  At Walter's death in 1205, John held the county as guardian for Walter's son, later to become count of Jaffa.\nJohn of Brienne arrived in Acre on 13 September 1210 and married Maria the following day, the Feast of the Exaltation of the Holy Cross, the major feast of the kingdom of Jerusalem.  The two were then crowned king and queen on 3 October in the cathedral of Tyre.  The patriarch recommended Raoul to become the chancellor and guide for the newly arrived monarch.  Queen Maria died shortly after giving birth to their daughter Yolanda, officially known as Isabella II.  The barons of the kingdom were uncertain of John of Brienne's ability to lead.  In 1211 Albert sent Raoul to seek the counsel of Pope Innocent III.  He returned with clear instructions to support John as regent-king for his daughter.\nAt Albert's assassination on 14 September 1214, while in procession to the cathedral of the Holy Cross in Acre, the post of patriarch became open.  The canons of the Holy Sepulchre, following their own custom in imitation of the Acts of the Apostles, selected two candidates to succeed Albert.  One candidate was Lotario Rosario de Cremona, who had originally succeeded Albert as bishop of Vercelli, but who later became archbishop of Pisa.  He occupied a position in the Roman hierarchy that was very similar to the esteem enjoined by Albert.  The second candidate was the king's own chancellor, Raoul de Mérencourt, who also held the episcopal see of Sidon.  He was one of only three bishops installed by Albert during his years as patriarch.  The king came down on the side of his chancellor and fellow countryman.  Pope Innocent III ratified that choice, and Raoul was installed as patriarch during the Fourth Lateran Council, which took place in November 1215.\nAlong with Pope Innocent III, he gave a sermon on the first day of the proceedings (11 November) calling for a new crusade to recover the Holy Land. Further preparations for the crusade (the Fifth) were made on the last day of the council, 30 November. However, for various reasons the crusade was postponed until 1217, after the death of Innocent. Raoul was appointed as one of Honorius III's papal legates, and was escorted back to his see in Acre by John of Brienne, nominal King of Jerusalem.\nHe personally participated in the crusade against Egypt.  The assembled crusader armies left Acre for Damietta in Egypt during the last days of May 1218.  On the 29 August 1219 an attack on Damietta failed, as St. Francis of Assisi had predicted.  The successful taking of Damietta occurred over 4–5 November 1219.  It is recounted that at one point the patriarch carried a relic of the True Cross, and prostrated himself with his head buried under the sand in order to ensure the success of the siege at Damietta.  The whole crusade came to a disastrous end on 29 August 1221, when the crusading armies were trapped by the flooding waters of the Nile and the combined armies of the sultan, al-Kamil, and his two brothers, al-Mu'azzam and al-Ashraf.  The sultan, after allowing the hostages to be ransomed, agreed to an eight-year truce.\nIn 1222 the pope summoned the king, Pelagius Galvani, the papal legate, patriarch Raoul and other leaders to attend a meeting with him the emperor Frederick II to be held in Verona on 11 November.  The pope's illness forced the meeting to be postponed until 25 March 1223 at the imperial villa in Ferentino.  There they struck an agreement to have the king's young daughter marry the newly-widowed emperor, Frederick II.  He agreed to then lead the next crusade and to have his fleet depart from Europe by 24 June 1225.\nOn 1 March 1224 Honorius III wrote to the patriarch of Jerusalem of the imminent departure of the imperial fleet, and to prepare for the marriage of Yolanda of Brienne (aka Isabelle II) to the emperor.  Any and all impediments were to be cleared away.  Patriarch Raoul, John of Brienne and Herman von Salzal met with the pope in the summer of 1224 to deal with the emperor's announcement that conditions in Sicily had so deteriorated that he could not possibly depart for the Holy Land at this time.  A new date for departure was arrived at.  As a new patriarch was nominated and in place by May 1225, it would seem that Raoul de Mérencourt died in late 1224.\nHis replacement, Gérold of Lausanne, bishop of Valence and former abbot of Cluny, was elected on 10 May 1225.\n\n\n== References ==\nPierre-Vicent Claverie, Honorius III et l'Orient (1216-1227): Étude et publication de sources inédites des Archives vaticanes (ASV).  Leiden: Brill, 2013, p. 409."