"Gruyère (UK: , US: , French: [ɡʁɥijɛʁ] (listen); German: Greyerzer) is a hard yellow Swiss cheese that originated in the cantons of Fribourg, Vaud, Neuchâtel, Jura, and Berne in Switzerland. It is named after the town of Gruyères. In 2001, Gruyère gained the appellation d'origine contrôlée (AOC, now AOP).\nGruyère is classified as a Swiss-type or Alpine cheese, and is sweet but slightly salty, with a flavor that varies widely with age. It is often described as creamy and nutty when young, becoming more assertive, earthy, and complex as it matures. When fully aged (five months to a year), it tends to have small cracks that impart a slightly grainy texture. Unlike Emmental, with which it is often confused, modern Gruyère has few if any eyes, although in the 19th century this was not always the case.  It is the most popular Swiss cheese in Switzerland, and in most of Europe.\n\n\n== Uses ==\n\nGruyère cheese is generally known as one of the finest cheeses for baking, having a distinctive but not overpowering taste. In quiche, Gruyère adds savoriness without overshadowing the other ingredients. It is a good melting cheese, particularly suited for fondues, along with Vacherin Fribourgeois and Emmental. It is also traditionally used in French onion soup, as well as in croque-monsieur, a classic French toasted ham and cheese sandwich. Gruyère is also used in chicken and veal cordon bleu. It is a fine table cheese, and when grated, it is often used with salads and pastas. It is used, grated, atop le tourin, a type of garlic soup from France which is served on dried bread. White wines, such as Riesling, pair well with Gruyère. Sparkling cider and Bock beer are also beverage affinities.\n\n\n== Production ==\n\nTo make Gruyère, raw milk is heated to 34 °C (93 °F) in a copper vat, and then curdled by the addition of liquid rennet. The curd is cut up into pea sized pieces and stirred, releasing whey. The curd is cooked at 43 °C (109 °F), and raised quickly to 54 °C (129 °F).\nThe whey is strained, and the curds placed into molds to be pressed. After salting in brine and smearing with bacteria, the cheese is ripened for two months at room temperature, generally on wooden boards, turning every couple of days to ensure even moisture distribution. Gruyère can be cured for 3 to 10 months, with long curing producing a cheese of intense flavor.\n\n\n== In Switzerland ==\nIn 2001, Gruyère gained the Appellation d'origine contrôlée status. Since then the production and the maturation is defined in the Swiss law, and all Swiss Gruyère producers must follow these rules.\n\n\n== Around the world ==\nGruyère-style cheeses are very popular in Greece, where the local varieties are known as γραβιέρα (graviéra). Some Greek gruyères come from San Michálē (Αγίου Μιχάλη, \"St. Michael's\") from the island of Syros in the Cyclades, the Naxian varieties, that tend to be milder and more sweet and various graviéras from Crete.\nKars gravyer cheese is a Turkish cheese made of cow's milk or a mixture of cow and goat milk. Gruyère-style cheeses are also produced in the United States, with Wisconsin having the largest output, and in Bosnia under the name Livanjski sir (Livno cheese).\n\n\n== Affinage ==\n\nAn important and the longest part of the production of the Le Gruyère Switzerland AOC is the affinage (French for maturation).\nAccording to the AOC, the cellars to mature a Swiss Gruyère must have a climate close to that of a natural cave. This means that the humidity should be between 94% and 98%. If the humidity is lower, the cheese dries out. If the humidity is too high, the cheese does not mature and becomes smeary and gluey. The temperature of the caves should be between 13 °C (55 °F) and 14 °C (57 °F). This relatively high temperature is required for excellent quality cheese. Lower quality cheeses result from temperatures between 10 °C (50 °F) and 12 °C (54 °F). The lower the temperature is, the less the cheese matures, resulting in a texture that is harder and more crumbly.\n\n\n== Varieties ==\n\nLe Gruyère Switzerland AOC has many different varieties, with different aged profiles, and an organic version of the cheese is also sold. There is a special variety that is produced only in summer on the Swiss Alps: the Le Gruyère Switzerland AOC Alpage.\nGenerally, one can distinguish the age profiles of mild/doux (minimum 5 months old) and réserve, also known as surchoix (minimum 10 months old). In Switzerland, other age profiles can be found, including mi-salé (7–8 months), salé (9–10 months), vieux (14 months), and Höhlengereift (cave aged), but these age profiles are not part of the AOC.\nThe French Le Brouère cheese, made in nearby Vosges, is considered a variant of Gruyère.\n\n\n== Le Gruyère AOP Premier Cru ==\nLe Gruyère Premier Cru is a special variety, produced and matured exclusively in the canton of Fribourg and matured for 14 months in humid cellars with a humidity of 95% and a temperature of 13.5 °C (56.3 °F).It is the only cheese that has won the title of best cheese in the world at the World Cheese Awards four times: in 1992, 2002, 2005, and 2015.\n\n\n== See also ==\nCulinary Heritage of Switzerland – an online encyclopedia\nList of cheeses – List of cheeses by place of originPalazzo della Civiltà Italiana in Rome, known locally as La Groviera (The Gruyère)\n\n\n== Notes and references ==\n\n\n== External links ==\nOfficial website of Le Gruyère AOC\nGruyère cheese in the online Culinary Heritage of Switzerland database.\nAn article on the history and controversy of Swiss versus French claims to Gruyère cheese."