"An overlord in the English feudal system was a lord of a manor who had subinfeudated a particular manor,  estate or fee, to a tenant. The tenant thenceforth owed to the overlord one of a variety of services, usually military service or serjeanty, depending on which form of tenure (i.e. feudal tenancy contract) the estate was held under. The highest overlord of all, or paramount lord,  was the monarch, who due to his ancestor William the Conqueror's personal conquest of the Kingdom of England, owned by inheritance from him all the land in England under allodial title and had no superior overlord, \"holding from God and his sword\", although certain monarchs, notably King John (1199–1216) purported to grant the Kingdom of England to Pope Innocent III, who would thus have become overlord to English monarchs.\nA paramount lord may then be seen to occupy the apex of the feudal pyramid, or the root of the feudal tree, and such allodial title is also termed \"radical title\" (from Latin radix, root), \"ultimate title\" and \"final title\". William the Conqueror immediately set about granting tenancies on his newly won lands, in accordance with feudal principles. The monarch's immediate tenants were the tenants-in-chief, usually military magnates, who held the highest status in feudal society below the monarch. The tenants-in-chief usually held multiple manors or other estates from the monarch, often as feudal barons (or \"barons by tenure\") who owed their royal overlord an enhanced and onerous form of military service, and subinfeudated most to tenants, generally their own knights or military followers, keeping only a few in demesne. This created a mesne lord – tenant relationship. The knights in turn subinfeudated to their own tenants, creating a further subsidiary mesne lord – tenant relationship. Over the centuries for any single estate the process was in practice repeated numerous times.\nIn early times, following the Norman Conquest of England of 1066 and the establishment of feudalism, land was usually transferred by subinfeudation, rarely by alienation (i.e. sale), which latter in the case of tenants-in-chief required royal licence, and the holder of an estate at any particular time, in order to gain secure tenure, and if challenged by another claimant, needed to prove \"devolution of title\" evidenced by legal deeds or muniments back up the chain of subinfeudations to a holder whose title was beyond doubt, for example one who had received the estate as a grant by royal charter witnessed and sealed by substantial persons. Although feudal land tenure in England was abolished by the Tenures Abolition Act 1660, in modern English conveyancing law the need to prove devolution of title persisted until recent times, due to a \"legal fiction\" (grounded in reality) that all land titles were held by the monarch's subjects as a result of a royal grant. Proving devolution of title is no longer necessary since the creation of the land registry. There is a requirement to compulsorily register all land transactions on this governmental record, which registration provides a virtually unchallengeable and perfectly secure title of ownership.\n\n\n== Process of creation ==\nAn overlordship came into existence by the process of the lord of the manor granting seizin of the fee concerned to his prospective tenant and receiving from him homage and fealty, the main elements of the infeudation and subinfeudation process.\n\n\n== Rights ==\nAn overlord had various rights under the feudal system, including receipt of either feudal relief or heriot on the succession of the tenant's heir. Also the right of escheat, namely to receive back seizin of the estate on the death of the tenant without a legal heir (transfers of estates to third parties by testaments or wills were not part of the early feudal system). The right to the loyalty of his tenant was central to the feudal contract and was enshrined in the infeudation process in which the tenant swore loyalty to the overlord. In the event of disloyalty the feudal contract would be broken and the estate would become forfeit and return to the overlord. This is most commonly encountered in the case of treason where lands became forfeit to the monarch as paramount lord.\n\n\n== Obligations ==\nThe overlord was bound to protect his tenant, a valuable right for the latter in the days before the existence of police forces and universal access to royal justice, and when armed bands of robbers roamed the countryside. This protection extended also to sheltering his tenant from the arbitrary and predatory acts of other powerful local magnates.\n\n\n== Modern vestiges ==\nIn the language of English law of landlord and tenant the concept of the feudal overlord persists. Furthermore, in England today in the case of a land-owner dying intestate and without legal heirs, just as in the feudal age, his estate effectively escheats and reverts to the overlord, but in the form of the paramount lord, The Crown, and is disposed of by the Crown Estate. In Cornwall today land is still in theory held from the Duke of Cornwall as lord paramount. In the case of English land escheating situated within the Duchy of Lancaster or the Duchy of Cornwall, it reverts to the overlords the Duke of Lancaster (the monarch) and the Duke of Cornwall (the monarch's eldest son), possibly the only two surviving quasi-paramount feudal lords surviving in England other than the monarch.\n\n\n== Further reading ==\nBrennan On The Doctrine Of Tenures, the legacy of feudal overlordship in Australia [3]\n\n\n== References =="