"The ouroboros or uroboros (, also UK: , US: ) is an ancient symbol depicting a serpent or dragon eating its own tail. Originating in ancient Egyptian iconography, the ouroboros entered Western tradition via Greek magical tradition and was adopted as a symbol in Gnosticism and Hermeticism and most notably in alchemy. The term derives from Ancient Greek  οὐροβόρος, from οὐρά oura 'tail' plus -βορός -boros '-eating'. The ouroboros is often interpreted as a symbol for eternal cyclic renewal or a cycle of life, death, and rebirth. The skin-sloughing process of snakes symbolizes the transmigration of souls, the snake biting its own tail is a fertility symbol in some religions, and the tail of the snake is a phallic symbol, the mouth is a yonic or womb-like symbol.\n\n\n== Historical representations ==\n\n\n=== Ancient Egypt ===\n\nThe first known appearance of the ouroboros motif is in the Enigmatic Book of the Netherworld, an ancient Egyptian funerary text in KV62, the tomb of Tutankhamun, in the 14th century BC. The text concerns the actions of the god Ra and his union with Osiris in the underworld. The ouroboros is depicted twice on the figure: holding their tails in their mouths, one encircling the head and upper chest, the other surrounding the feet of a large figure, which may represent the unified Ra-Osiris (Osiris born again as Ra). Both serpents are manifestations of the deity Mehen, who in other funerary texts protects Ra in his underworld journey. The whole divine figure represents the beginning and the end of time.The ouroboros appears elsewhere in Egyptian sources, where, like many Egyptian serpent deities, it represents the formless disorder that surrounds the orderly world and is involved in that world's periodic renewal. The symbol persisted in Egypt into Roman times, when it frequently appeared on magical talismans, sometimes in combination with other magical emblems. The 4th-century AD Latin commentator Servius was aware of the Egyptian use of the symbol, noting that the image of a snake biting its tail represents the cyclical nature of the year.\n\n\n=== Alchemy and Gnosticism ===\n\nThe famous ouroboros drawing from the early alchemical text, The Chrysopoeia of Cleopatra (Κλεοπάτρας χρυσοποιία), probably originally dating to third century Alexandria but first known in a tenth-century copy, encloses the words hen to pan (ἓν τὸ πᾶν), \"the all is one\". Its black and white halves may perhaps represent a Gnostic duality of existence, analogous to the Taoist yin and yang symbol. The chrysopoeia ouroboros of Cleopatra the Alchemist is one of the oldest images of the ouroboros to be linked with the legendary opus of the alchemists, the philosopher's stone.\nIn Gnosticism, a serpent biting its tail symbolized eternity and the soul of the world. The Gnostic Pistis Sophia (c. 400 AD) describes the ouroboros as a twelve-part dragon surrounding the world with its tail in its mouth.A 15th-century alchemical manuscript, The Aurora Consurgens, features the ouroboros, where it is used amongst symbols of the sun, moon, and mercury.\n\n\t\t\n\t\t\n\t\t\n\n\n=== The \"world serpent\" in mythology ===\nIn Norse mythology, the ouroboros appears as the serpent Jörmungandr, one of the three children of Loki and Angrboda, which grew so large that it could encircle the world and grasp its tail in its teeth. In the legends of Ragnar Lodbrok, such as Ragnarssona þáttr, the Geatish king Herraud gives a small lindworm as a gift to his daughter Þóra Town-Hart after which it grows into a large serpent which encircles the girl's bower and bites itself in the tail. The serpent is slain by Ragnar Lodbrok who marries Þóra. Ragnar later has a son with another woman named Kráka and this son is born with the image of a white snake in one eye. This snake encircled the iris and bit itself in the tail, and the son was named Sigurd Snake-in-the-Eye.It is a common belief among indigenous people of the tropical lowlands of South America that waters at the edge of the world-disc are encircled by a snake, often an anaconda, biting its own tail.The ouroboros has certain features in common with the Biblical Leviathan. According to the Zohar, the Leviathan is a singular creature with no mate, \"its tail is placed in its mouth\", while Rashi on Baba Batra 74b describes it as \"twisting around and encompassing the entire world\". The identification appears to go back as far as the poems of Kalir in the 6th-7th centuries CE.\n\n\n=== Symbol of Birth, death and rebirth ===\nThe Ouroboros symbol is a common sight on 17th- and 18th-century gravestones. Varying from region to region some have legs and even torso like bodies while others are carved in a bracelet like circle. They appear alongside the hourglass, skulls, bible, and cherubs that are so common in depictions of mortality of this era. And like those other symbols, they disappeared from gravestones in the 19th-century Gothic revival.\n\n\n=== Connection to Indian thought ===\nIn the Aitareya Brahmana, a Vedic text of the early 1st millennium BCE, the nature of the Vedic rituals is compared to \"a snake biting its own tail.\"Ouroboros symbolism has been used to describe the Kundalini. According to the medieval Yoga-kundalini Upanishad, \"The divine power, Kundalini, shines like the stem of a young lotus; like a snake, coiled round upon herself she holds her tail in her mouth and lies resting half asleep as the base of the body\" (1.82).\nStorl (2004) also refers to the ouroboros image in reference to the \"cycle of samsara\".\n\n\n== Modern references ==\n\n\n=== Jungian psychology ===\nSwiss psychiatrist Carl Jung saw the ouroboros as an archetype and the basic mandala of alchemy. Jung also defined the relationship of the ouroboros to alchemy:\nThe alchemists, who in their own way knew more about the nature of the individuation process than we moderns do, expressed this paradox through the symbol of the Ouroboros, the snake that eats its own tail. The Ouroboros has been said to have a meaning of infinity or wholeness. In the age-old image of the Ouroboros lies the thought of devouring oneself and turning oneself into a circulatory process, for it was clear to the more astute alchemists that the prima materia of the art was man himself. The Ouroboros is a dramatic symbol for the integration and assimilation of the opposite, i.e. of the shadow. This 'feed-back' process is at the same time a symbol of immortality, since it is said of the Ouroboros that he slays himself and brings himself to life, fertilizes himself and gives birth to himself. He symbolizes the One, who proceeds from the clash of opposites, and he therefore constitutes the secret of the prima materia which ... unquestionably stems from man's unconscious.\nThe Jungian psychologist Erich Neumann writes of it as a representation of the pre-ego \"dawn state\", depicting the undifferentiated infancy experience of both mankind and the individual child.\n\n\n=== Kekulé's dream ===\n\nThe German organic chemist August Kekulé described the eureka moment when he realized the structure of benzene, after he saw a vision of Ouroboros:\nI was sitting, writing at my text-book; but the work did not progress; my thoughts were elsewhere. I turned my chair to the fire and dozed. Again the atoms were gamboling before my eyes. This time the smaller groups kept modestly in the background. My mental eye, rendered more acute by the repeated visions of the kind, could now distinguish larger structures of manifold conformation: long rows, sometimes more closely fitted together; all twining and twisting in snake-like motion. But look! What was that? One of the snakes had seized hold of its own tail, and the form whirled mockingly before my eyes. As if by a flash of lightning I awoke; and this time also I spent the rest of the night in working out the consequences of the hypothesis.\n\n\n=== Cosmos ===\nMartin Rees used the ouroboros to illustrate the various scales of the universe, ranging from 10−20 cm (subatomic) at the tail, up to 1025 cm (supragalactic) at the head. Rees stressed \"the intimate links between the microworld and the cosmos, symbolised by the ouraborus\", as tail and head meet to complete the circle.\n\n\n=== Cybernetics ===\nCybernetics deployed circular logics of causal action in the core concept of Feedback in directive and purposeful behaviour in human and living organisms, groups, and self-regulating machines. The general principle of feedback describes a circuit (electronic, social, biological or otherwise) in which the output or result is a signal that influences the input or causal agent through its response to the new situation. W. Ross Ashby applied ideas from biology to his own work as a psychiatrist in “Design for a Brain” (1952): that living things maintain essential variables of the body within critical limits with the brain as a regulator of the necessary feedback loops. Parmar contextualises his practices as an artist in applying the cybernetic Ouroboros principle to musical improvisation.Hence the snake eating its tail is an accepted image or metaphor in the autopoietic calculus for self-reference, or self-indication, the logical processual notation for analysing and explaining self-producing autonomous systems and \"the riddle of the living\", developed by Francisco Varela. Reichel describes this as:\n\n'...an abstract concept of a system whose structure is maintained through the self-production of and through that structure. In the words of\nKauffman, it is ‘the ancient mythological symbol of the worm ouroboros embedded in a mathematical, non-numerical calculus.'  \nThe calculus derives from the confluence of the cybernetic logic of feedback, the sub-disciplines of Autopoiesis developed by Varela and Humberto Maturana, and calculus of indications of George Spencer Brown.  In another related biological application:\n\n It is remarkable, that Rosen’s insight, that metabolism is just a mapping..., which may be too cursory for a biologist, turns out to show us the way to construct recursively, by a limiting process, solutions of the self-referential Ouroborus equation f(f) = f, for an unknown function f, a way that mathematicians had not imagined before Rosen.\nSecond-order cybernetics, or the cybernetics of cybernetics, applies the principle of self-referentiality, or the participation of the observer in the observed, to explore observer involvement in all behaviour and the praxis of science including D.J. Stewart's domain of \"observer valued imparities\".  \n\n\n=== Armadillo girdled lizard ===\nThe genus of the armadillo girdled lizard, Ouroborus cataphractus, takes its name from the animal's defensive posture: curling into a ball and holding its own tail in its mouth.\n\n\n== See also ==\n\n\n== References ==\n\n\n=== Notes ===\n\n\n=== Bibliography ===\nBayley, Harold S (1909). New Light on the Renaissance. Kessinger. Reference pages hosted by the University of PennsylvaniaCS1 maint: postscript (link)\nHornung, Erik (2002). The Secret Lore of Egypt: Its Impact on the West. Cornell University Press.\nLiddell, Henry George; Scott, Robert (1940). A Greek-English Lexicon. Oxford: Clarendon Press – via perseus.tufts.edu.\n\n\n== External links ==\nBBC Culture – The ancient symbol that spanned millennia"