"Artillery is a class of heavy military ranged weapons built to launch munitions far beyond the range and power of infantry firearms. Early artillery development focused on the ability to breach defensive walls and fortifications during sieges, and led to heavy, fairly immobile siege engines. As technology improved, lighter, more mobile field artillery cannons developed for battlefield use. This development continues today; modern self-propelled artillery vehicles are highly mobile weapons of great versatility generally providing the largest share of an army's total firepower.\nOriginally, the word \"artillery\" referred to any group of soldiers primarily armed with some form of manufactured weapon or armor. Since the introduction of gunpowder and cannon, \"artillery\" has largely meant cannons, and in contemporary usage, usually refers to shell-firing guns, howitzers, mortars, and rocket artillery. In common speech, the word \"artillery\" is often used to refer to individual devices, along with their accessories and fittings, although these assemblages are more properly called \"equipment\". However, there is no generally recognized generic term for a gun, howitzer, mortar, and so forth: the United States uses \"artillery piece\", but most English-speaking armies use \"gun\" and \"mortar\". The projectiles fired are typically either \"shot\" (if solid) or \"shell\" (if not solid). Historically, variants of solid shot including canister, chain shot and grapeshot were also used. \"Shell\" is a widely used generic term for a projectile, which is a component of munitions.\nBy association, artillery may also refer to the arm of service that customarily operates such engines. In some armies, the artillery arm has operated field, coastal, anti-aircraft, and anti-tank artillery; in others these have been separate arms, and with some nations coastal has been a naval or marine responsibility.\nIn the 20th century, technology-based target acquisition devices (such as radar) and systems (such as sound ranging and flash spotting) emerged in order to acquire targets, primarily for artillery. These are usually operated by one or more of the artillery arms. The widespread adoption of indirect fire in the early 20th century introduced the need for specialist data for field artillery, notably survey and meteorological, and in some armies, provision of these are the responsibility of the artillery arm.\nArtillery has been used since at least the early Industrial Revolution. The majority of combat deaths in the Napoleonic Wars, World War I, and World War II were caused by artillery. In 1944, Joseph Stalin said in a speech that artillery was \"the God of War\"."