"WorldCat is a union catalog that itemizes the collections of 15,600 libraries in 107 countries that participate in the OCLC global cooperative. It is operated by OCLC, Inc. The subscribing member libraries collectively maintain WorldCat's database, the world's largest bibliographic database. The database includes other information sources in addition to member library collections. OCLC makes WorldCat itself available free to libraries, but the catalog is the foundation for other subscription OCLC services (such as resource sharing and collection management). WorldCat is used by librarians for cataloging and research and by the general public.\n\n\n== History ==\nOCLC was founded in 1967 under the leadership of Fred Kilgour. That same year, OCLC began to develop the union catalog technology that would later evolve into WorldCat; the first catalog records were added in 1971.In 2003, OCLC began the \"Open WorldCat\" pilot program, making abbreviated records from a subset of WorldCat available to partner web sites and booksellers, to increase the accessibility of its subscribing member libraries' collections.In October 2005, the OCLC technical staff began a wiki project, WikiD, allowing readers to add commentary and structured-field information associated with any WorldCat record. WikiD was later phased out, although WorldCat later incorporated user-generated content in other ways.In 2006, it became possible for anyone to search WorldCat directly at its open website, not only through the subscription FirstSearch interface where it had been available on the web to subscribing libraries for more than a decade before. Options for more sophisticated searches of WorldCat have remained available through the FirstSearch interface.In 2007, WorldCat Identities began providing pages for 20 million \"identities\", which are metadata about names—predominantly authors and persons who are the subjects of published titles.In 2017, OCLC's WorldCat Search API was integrated into the cite tool of Wikipedia's VisualEditor, allowing Wikipedia editors to cite sources from WorldCat easily.Beginning in 2017, OCLC and the Internet Archive have collaborated to make the Internet Archive's records of digitized books available in WorldCat.As of July 2020, WorldCat contained almost 500 million bibliographic records in 483 languages, representing over 3 billion physical and digital library assets, and the WorldCat persons dataset (mined from WorldCat) included over 100 million people.Library contributions to WorldCat are made via the Connexion computer program, which was introduced in 2001; its predecessor, OCLC Passport, was phased out in May 2005.\n\n\n== See also ==\nCopac\nFaceted Application of Subject Terminology (FAST)\nList of academic databases and search engines\nOpen Library\n\n\n== References ==\n\n\n== Further reading ==\n\n\n== External links ==\nOfficial website \n\"WorldCat\". oclc.org. Retrieved December 31, 2018. Information on the OCLC website about WorldCat.\nWhat is WorldCat?—A shorter explanation at WorldCat\n\"Bibliographic Formats and Standards\". oclc.org. Retrieved December 31, 2018.\n\"WorldCat Identities\". worldcat.org. Retrieved December 31, 2018."