"The Orlando Sentinel is the primary newspaper of Orlando, Florida, and the Central Florida region. It was founded in 1876 and is currently owned by Tribune Publishing Company.\n\n\n== History ==\nThe Sentinel's predecessors date to 1876, when the Orange County Reporter was first published. The Reporter became a daily newspaper in 1905, and merged with the Orlando Evening Star in 1906. Another Orlando paper, the South Florida Sentinel, started publishing as a morning daily in 1913. Then known as the Morning Sentinel, it bought the Reporter-Star in 1931, when Martin Andersen came to Orlando to manage both papers. Andersen eventually bought both papers outright in 1945, selling them to the Tribune Company of Chicago in 1965.In 1973, the two publications merged into the daily Sentinel Star. Tribune appointed Charles T. Brumback as president in 1976. Harold \"Tip\" Lifvendahl was named president and publisher in 1981. The newspaper was renamed the Orlando Sentinel in 1982. John Puerner succeeded Lifvendahl in 1993, who was replaced by Kathleen M. Waltz in 2000. She announced her resignation in February 2008. Howard Greenberg, already publisher of fellow Tribune newspaper the Sun-Sentinel of Fort Lauderdale, was named publisher of both papers after Waltz left.In 2008, the Tribune Company called for a redesign of the Sentinel. The new layout, which debuted in June 2008, was formatted to appeal to busy readers, though like all of the redesigns in Tribune's Sam Zell ownership era, was reeled back into a more traditional design with appealing elements kept after reader criticism.According to one listing, some of the Sentinel's predecessors are:\nOrlando Reporter: 1892–1903? (merged with Evening Star to form Evening Reporter-Star)\nEvening Star: January–December 1903? (merged with Orlando Reporter to form Evening Reporter-Star)\nEvening Reporter-Star: 1904?–March 1947 (continues Orlando Reporter and Evening Star; continued by Orlando Evening Star)\nOrlando Evening Star: April 1947 – 1973 (continues Evening Reporter-Star; merged with Orlando Morning Sentinel to form the Orlando Sentinel-Star)\nOrlando Morning Sentinel: 1913–1973 (title varies: Daily Sentinel; Morning Sentinel; merged with Orlando Evening Star to form the Orlando Sentinel-Star)\nOrlando Sentinel-Star: 1974–April 25, 1982 (continues Orlando Morning Sentinel and Orlando Evening Star; continued by Orlando Sentinel)\nOrlando Sentinel: April 26, 1982–present (continues Orlando Sentinel-Star)\n\n\n== Editorial history ==\nEditorially, the Sentinel tilted conservative. From 1952 to 2004, it endorsed Republicans in every election save for Lyndon Johnson in 1964. However, it has endorsed Democratic candidates for president in four of the last five presidential elections: John Kerry in 2004, Barack Obama in 2008, Hillary Clinton in 2016,and Joe Biden in 2020.In June 2019, the day of President Donald Trump's re-election campaign launch rally in Orlando, the Sentinel made national news when the editorial board published a piece saying it would not endorse the president, among their reasons, \"the chaos, the division, the schoolyard insults, the self-aggrandizement, the corruption, and especially the lies.\" It ultimately endorsed Biden, saying that he was \"many things that Trump is not now and never will be.\"\n\n\n== Awards ==\n1982: Gerald Loeb Award Honorable Mention for Small Newspapers for \"The Federal Impact Series\"\n1988: editorial writing, Jane Healy, \"for her series of editorials protesting overdevelopment of Florida's Orange County.\"\n1993:  investigative reporting, Jeff Brazil and Steve Berry, \"for exposing the unjust seizure of millions of dollars from motorists—most of them minorities—by a sheriff's drug squad.\"\n2000:  editorial writing, John C. Bersia, \"for his passionate editorial campaign attacking predatory lending practices in the state, which prompted changes in local lending regulations.\"\n\n\n== Notable staff ==\nMichael A. Bianchi: sports columnist\nJane Healy, first Sentinel journalist to receive a Pulitzer Prize\nJemele Hill, ESPN sportscaster and columnist\n\n\n== See also ==\n\nEl Sentinel (Orlando)\nEl Sentinel del Sur de la Florida\nSouth Florida Sun-Sentinel\nTribune Company\nTribune Publishing\n\n\n== References ==\n\n\n== External links ==\nOfficial website (Mobile)\nToday's Orlando Sentinel front page at the Newseum website\nHistorical archives of The Orlando Sentinel and The Morning Sentinel freely and openly available as full searchable text and zoomable page images in the Florida Digital Newspaper Library"