"Keiji Inafune (稲船 敬二, Inafune Keiji, born 8 May 1965) is a Japanese video game producer, illustrator and businessman. Starting his career at Capcom in the late 1980s, his job was as an artist and illustrator. The first two games he worked on were the original Street Fighter and Mega Man in 1987. He was then an illustrator and artist of the Mega Man series during the NES and Super NES era. For Mega Man X, he created and designed the character Zero.Inafune then moved onto the position of producer with his first title being Mega Man 8 in 1996. In addition to being the producer for Mega Man X4, the three Mega Man Legends games, the Mega Man Zero series, the Mega Man Battle Network and Mega Man Star Force series and Mega Man ZX and Advent, Inafune was also a producer of the Lost Planet, Dead Rising and Onimusha series. In 2006, he was promoted to Senior Corporate Officer of Research & Development. In 2010, he became Global Head of Production at Capcom.He left Capcom in late 2010, and later founded his own companies Comcept, and Intercept. He also became Representative Director of DiNG, a mobile game studio. Intercept worked on the game Kaio: King of Pirates which was announced in 2011 and cancelled in 2015. While at Comcept, Inafune oversaw work on such games as Mighty No. 9, Soul Sacrifice, and the unreleased Red Ash: The Indelible Legend.  In 2017, Comcept was purchased and became a subsidiary of Level-5, becoming Level-5 Comcept.\n\n\n== Early life ==\nInafune was born in Kishiwada, Osaka in 1965. He received a degree in graphic design in 1987 from the Osaka Designers' College.\n\n\n== Career ==\n\n\n=== Early ===\nSoon after graduating the 22-year-old Inafune joined the Capcom corporation in 1987, in search of a job as an illustrator. Inafune had initially wanted to join Konami, but Capcom was much closer. In many early game credits at Capcom, he is credited under the name \"INAFKING\", which he got by combining the name \"Snufkin\" from the anime series Moomin with his own name. The first two titles Inafune worked on at Capcom was Mega Man (known in Japan as \"Rockman\") for the Famicom and the original Street Fighter for arcades, both of which were released in 1987. For Street Fighter, Inafune drew character portraits for the game.For Mega Man, Inafune designed several minor enemy characters, and also designed the boss character \"Elec Man\", who was the first original game character that Inafune designed. Inafune had tried to design him as if he was a character an American comic series such as Spider-Man or X-Men. Inafune also drew the Japanese box art and promotional illustrations and worked on in-game animations and pixel art. Director Akira Kitamura created the original static pixel art sprite for Rock Man (later called \"Mega Man\" outside of Japan). This was to ensure that the sprite could be properly seen against the game's backgrounds, and could work in the game. After that, the pixel art was handed over to artist Inafune, who created a refined illustration of the character. Inafune refers to this process as \"like a reverse character design\" as it is the opposite of what typically occurs, where artists create concept art which is then translated into game's graphics. During a special event at TGS 2007, Inafune clarified his role in the creation of Mega Man.\n\n\"I'm often called the father of Mega Man, but actually, his design was already created when I joined Capcom,\" he explained. \"My mentor [Capcom senior member Akira Kitamura], who was the designer of the original Mega Man, had a basic concept of what Mega Man was supposed to look like. So I only did half of the job in creating him.\"\nThe first Mega Man game was released in December 1987, after which sales in both countries were decent, but as Inafune later notes, \"While it did sell more than we had expected, [Rockman 1] wasn't a huge success as far as the numbers go.\"Akira Kitamura suggested to create a contest to solicit designs from fans for Robot Masters for Mega Man games. The first game to do this was Mega Man 2 and it was Inafune's job to turn those winning designs into finished professional designs.The next game in the series was Mega Man 3, released in Japan on September 28, 1990 and later released in North America in November 1990. Inafune considers Mega Man 3 to be one of his least favorite Mega Man games. From an interview with Nintendo Power in the October 2007 issue, Inafune explained that the reason was because of \"...what went into the game and what was behind the release of the game.\" He also stated that the team was forced to put the game out before they thought it was ready and that during the game's production, the developers had lost the main planner, Inafune having to take his position. Inafune concluded, \"I knew that if we had more time to polish it, we could do a lot of things better, make it a better game, but the company (Capcom) said that we needed to release it. The whole environment behind what went into the production of the game is what I least favored. Numbers one and two – I really wanted to make the games; I was so excited about them. Number three – it just turned very different.\"The next original character design Inafune would create was the character \"Punk\" in the 1992 Game Boy game Mega Man III.Capcom set on the development on a new series for the Super NES, Mega Man X, which continued the plot of the original series, but set a darker tone and took place 100 years after the previous storyline. Inafune designed the character Zero for the games. \"I didn't get to completely design a Mega Man [protagonist] from scratch until Zero (Mega Man X, SNES). Back when the SNES was coming out, I was asked to give Mega Man a redesign, so I created this character. But I realized that this design wouldn't be accepted as Mega Man, so I had another designer create the new Mega Man, and I worked on Zero to release him as the 'other main character' that would steal all the good scenes!\"Hayato Kaji took over lead illustrator role for Mega Man 7, which was released in 1995. Inafune contributed some designs to the game. He designed the character of Auto, as well as the initial sketches for two new characters named  \"Baroque\" and \"Crush\". These characters were handed over to Kaji who finished the design, and they became known as Bass and Treble.\n\n\n=== Producer ===\nLong time producer Tokuro Fujiwara, departed Capcom. Inafune was then made producer for the next Mega Man title, Mega Man 8 in 1996. Inafune produced the three-dimensional Mega Man Legends series after receiving requests from Sony to develop a new 3D Mega Man series exclusively for the PlayStation. Although he envisioned high sales and was an ambitious supporter to the development of the game, it was not a massive success and Inafune likens it to a \"clumsy son\". Inafune says it was quite difficult to promote the game, as there was little media interest in yet another Mega man title. Inafune was a promotion producer for Resident Evil 2, which in contrast to Mega Man Legends, had huge interest and was an easy game to sell.Originally, Inafune had intended to end the series with Mega Man X5, stating, \"I had very little to do with X5. I just told the team to 'finish off the series with this title,' and left it at that. That's why the game itself has a real feel of finality to it.\" Instead, he became co-producer for the new Mega Man game that Inti Creates had been commissioned to develop, and requested that they make Zero the main character. However, Capcom chose to continue the X series without him, extending it to Mega Man X8.\nInafune also developed another series, the samurai-era Japanese themed Onimusha, which has spawned various sequels.Keiji Inafune was producer for the Mega Man Battle Network series, which is set outside the continuity of the rest of the Mega Man story lines and introduced role-playing and strategic elements. According to Inafune, he received the basis for creating the series from observing his son. Inafune contributed the redesign of Mega Man for the first game, and he says it took quite a bit of convincing for the artists to let him do it, and even then they made additional changes to Inafune's redesign.\n\n\n=== Senior Corporate Officer ===\nIn 2006 Inafune was promoted from corporate officer to senior corporate officer. Inafune and his team's next creation was Dead Rising for the Xbox 360. Dead Rising, initially started as a sequel to Shadow of Rome, with the same team members, before changing story, setting, and time period. The game is a zombie-slaying game heavily influenced by George A. Romero's 1978 movie Dawn of the Dead. It was released by Capcom in the U.S. on August 8, 2006.Inafune became acquainted with Ben Judd when he was working on Dead Rising. After this, Judd would often act as a translator for Inafune in public events.Inafune was producer for Inti Creates' game Mega Man ZX.Inafune had the idea of going back to the simple gameplay of the original Mega man series, and was producer for the game Mega Man 9. The game was developed by Inti-Creates along with Capcom, and Inafune contributed two designs for the project: Splash Woman and Plug Man. The game was followed up by a similar sequel, Mega Man 10 in 2010.Inafune was producer for the Dead Rising 2, and opted to hire Canadian developer Blue Castle Games as developer rather than having it developed in-house at Capcom like the first game was. The game was released in 2010. In addition, he made his director debut in the short film series Zombrex: Dead Rising Sun.The last mainline Street Fighter game was Street Fighter EX3 in 2000, and there was reluctance at Capcom at releasing another numeric entry in the series. Producer Yoshinori Ono pitched Street Fighter IV to Inafune, who was head of R&D at the time. Inafune approved the project, due to the positive reception to Street Fighter II' Hyper Fighting on Xbox Live Arcade and fans interest. Street Fighter IV was released first in arcades in Japan in 2008, and then on home consoles in 2009. The original console version of SFIV went on to sell 3.4 million copies.On April 22, 2010, it was announced that Inafune would be Capcom's Global Head of Production. Inafune stated \"I want to end comments that Capcom games made in Europe aren't really Capcom games ... basically saying that whether games are created in America or Japan or anywhere in the world, I will be the one overlooking it and so it will have that Capcom flavor that fans know and love.\"\n\n\n=== Modern Japanese games ===\nInafune has voiced various negative views on modern Japanese game developers, stating that they are behind Western developers in innovation. At the 2009 Tokyo Game Show while promoting Dead Rising 2, and speaking through his translator and Capcom employee Judd, Inafune stated \"Personally when I looked around [at] all the different games at the TGS floor, I said 'Man, Japan is over. We're done. Our game industry is finished.'\" He also said \"“I look around Tokyo Games Show, and everyone’s making awful  games; Japan is at least five years behind.”In 2012, Inafune defended Phil Fish's statements criticizing modern Japanese video games, saying: \"It's very severe, but very honest. Unless Japanese people feel embarrassed from the experience of getting harsh comments, saying [new games] could have been better is not an opinion they would take seriously. When they're embarrassed and they feel obliged to change, it would make a difference.\" In 2012 at the Game Developer's Conference in San Francisco, Inafune again disparaged the state of Japanese gaming. He said, \"Back in the day Japanese games were used to winning and were used to success. We celebrated all sorts of victories. However at some point these winners became losers. Not accepting that fact has led to the tragic state of Japanese games today.\"\n\n\n=== Comcept, Intercept, Ding ===\nOn October 29, 2010, Inafune announced on his blog that he would be leaving Capcom with the intention of \"starting his life over\". He had been with the company for 23 years. In an interview with 4Gamer he stated \"The reason why I'm quitting is basically because I think that the game industry itself must change the way it goes about making games,\". He cited that job security creates complacency among staff, and big budgets with very large staff, as problems with current Japanese game companies.On December 15, 2010, Inafune launched a new company called Comcept, based in Osaka. Comcept was a design and production studio, which does not develop games internally, but rather pairs up with studios to co-develop them, and was to work on media outside of games. In January 2011, he launched another new company called Intercept, based in Tokyo. Intercept was focused on game development.  Inafune's guiding philosophy behind Comcept was to work on multiple games at once, work on ideas they themselves created, and to have flexibility of doing multiple genres. Inafune cites the need for flexibility as being necessary for the company to survive. During his time at Comcept, he was often given the credit of \"Conceptor\" on the games he has worked on.In December 2011, Inafune became Representative Director of DiNg, a smartphone game developer.Intercept began work on the game Kaio: King of Pirates, in 2012. Set for a release on the 3DS console, it was a pirate themed game starring loosely based on Journey to the West. The game was cancelled in 2015 by its publisher Marveolous Inc and they lost 461 million yen (roughly US$3.8 million) on the project.Inafune has made several cameo appearances in games. In the 2011 game Hyperdimension Neptunia Mk2, a scanned image of Inafune himself makes an appearance as a summon for the main character Nepgear during a special attack. Comcept was a co-developer along with Idea Factory on the otome game Sweet Fuse: At Your Side. A character bearing both Inafune's likeness and name appears in the game, who is a kidnapped uncle.Yaiba: Ninja Gaiden Z was a collaboration between Comcept, Team Ninja and Spark Unlimited and it is a spin-off of the Ninja Gaiden series. Released in 2014 it received both poor sales and reviews. Inafune says poor timing is to blame for the sales, as players were transitioning to the PlayStation 4 console, and defends the title saying it had good gameplay.On August 31, 2013, Inafune started a Kickstarter project for a game Comcept and Inti-Creates were working on that is a spiritual successor to Mega Man series, known as Mighty No. 9.After multiple delays, the game was released in 2016 and was met with a mixed critical reception. A livestream on the Twitch platform was done during the release of the game. Speaking through his agent and translator Judd, Inafune said: \"You know, I want to word this in a way to explain some of the issues that come with trying to make a game of this size on multiple platforms.\" adding \"I'm kind of loath to say this because it's going to sound like an excuse and I don't want to make any excuses. I own all the problems that came with this game and if you want to hurl insults at me, it's totally my fault. I'm the key creator. I will own that responsibility.\" Judd added that he thought the game's problems stemmed from doing all the ports of the game and the base game at the same time, and that they had under-estimated the amount of work the project would require.Inafune is an advisor for Inflexion Point Capital, who announced in 2014 that they would be giving out seed investments of 100 to 500 thousand to Japanese mobile developers.At Electronic Entertainment Expo 2015 it was announced the Inafune was working with Armature Studio to make a new video game for the Xbox One called ReCore. On July 4, 2015 Inafune announced that he was once again using Kickstarter to fund a Mega Man Legends spiritual successor along with an anime based on the game called Red Ash, which failed to reach its funding goal.\nIn June 2017, Comcept was purchased by Level-5 and became Level-5 Comcept, with Inafune becoming its chief communications officer.\n\n\n== Works ==\n\n\n=== Games ===\n\n\n=== Film ===\n\n\n== References ==\n\n\n=== Inline ==="