"Sefirot (; Hebrew: סְפִירוֹת‎ səp̄îrôṯ), meaning emanations, are the 10 attributes/emanations in Kabbalah, through which Ein Sof (The Infinite) reveals himself and continuously creates both the physical realm and the chain of higher metaphysical realms (Seder hishtalshelus). The term is alternatively transliterated into English as sephirot/sephiroth, singular sefirah/sephirah etc.\nAlternative configurations of the sefirot are given by different schools in the historical development of Kabbalah, with each articulating different spiritual aspects. The tradition of enumerating 10 is stated in the Sefer Yetzirah, \"Ten sefirot of nothingness, ten and not nine, ten and not eleven\". As altogether eleven sefirot are listed across the different schemes, two (Keter and Da'at) are seen as unconscious and conscious manifestations of the same principle, conserving the ten categories. The sefirot are described as channels of divine creative life force or consciousness through which the unknowable divine essence is revealed to mankind. \nThe first sefirah, Keter, describes the divine superconscious Will that is beyond conscious intellect. The next three sefirot (Chokhmah, Binah and Da'at) describe three levels of conscious divine intellect. In particular, Da'at represents Keter in its knowable form, the concept of knowledge. Will and knowledge are corresponding somewhat dependent opposites. The seven subsequent sefirot (Chesed, Gevurah, Tiferet, Netzach, Hod, Yesod and Malkuth) describe the primary and secondary conscious divine emotions. The sefirot of the left side and the sefira of Malkuth are feminine, as the female principle in Kabbalah describes a vessel that receives the outward male light, then inwardly nurtures and gives birth to the sefirot below them. Kabbalah sees the human soul as mirroring the divine (after Genesis 1:27, \"God created man in His own image, in the image of God He created him, male and female He created them\"), and more widely, all creations as reflections of their life source in the sefirot. Therefore, the sefirot also describe the spiritual life of man, break down man's psychological processes, and constitute the conceptual paradigm in Kabbalah for understanding everything. This relationship between the soul of man and the divine gives Kabbalah one of its two central metaphors in describing divinity, alongside the other Ohr (light) metaphor. However, Kabbalah repeatedly stresses the need to avoid all corporeal interpretation. Through this, the sefirot are related to the structure of the body and are reformed into partzufim (personas). Underlying the structural purpose of each sefirah is a hidden motivational force which is understood best by comparison with a corresponding psychological state in human spiritual experience.In Hasidic philosophy, which has sought to internalise the experience of Jewish mysticism into daily inspiration (devekut), this inner life of the sefirot is explored, and the role they play in man's service of God in this world."