"Urban sociology is the sociological study of life and human interaction in metropolitan areas. It is a normative discipline of sociology seeking to study the structures, environmental processes, changes and problems of an urban area and by doing so provide inputs for urban planning and policy making. In other words, it is the sociological study of cities and their role in the development of society.\nLike most areas of sociology, urban sociologists use statistical analysis, observation, social theory, interviews, and other methods to study a range of topics, including migration and demographic trends, economics, poverty, race relations and economic trends. Urban sociology is one of the oldest sub-disciplines of sociology dating back to the mid-nineteenth century.The philosophical foundations of modern urban sociology originate from the work of sociologists such as Karl Marx, Ferdinand Tönnies, Émile Durkheim, Max Weber and Georg Simmel who studied and theorized the economic, social and cultural processes of urbanization and its effects on social alienation, class formation, and the production or destruction of collective and individual identities.\nThese theoretical foundations were further expanded upon and analyzed by a group of sociologists and researchers who worked at the University of Chicago in the early twentieth century. In what became known as the Chicago School of sociology the work of Robert Park, Louis Wirth and Ernest Burgess on the inner city of Chicago revolutionized not only the purpose of urban research in sociology, but also the development of human geography through its use of quantitative and ethnographic research methods. The importance of the theories developed by the Chicago School within urban sociology have been critically sustained and critiqued but still remain one of the most significant historical advancements in understanding urbanization and the city within the social sciences. The discipline may draw from several fields, including cultural sociology, economic sociology, and political sociology."