"The Allobroges (Gaulish: *Allobrogis, 'foreigner, exiled'; Ancient Greek: Ἀλλοβρίγων, Ἀλλόβριγες) were a Gallic people dwelling in a large territory between the Rhône river and the Alps mountains during the Iron Age and the Roman period.\nThe Allobroges came relatively late to Gaul compared to most other tribes of Gallia Narbonensis; they first appear in the historical record in connection with Hannibal's crossing of the Alps in 218 BC. Their territory was subsequently annexed to Rome in 121 BC by Gnaeus Domitius Ahenobarbus and Quintus Fabius Maximus (Allobrogicus). An attempted revolt was crushed by Caius Pomptinus in 61 BC. However, they had rejected the second Catilinarian conspiracy in 63 BC. During the Gallic Wars, the Allobroges did not side with Vercingetorix at the Battle of Alesia in 52 BC.\n\n\n== Name ==\n\n\n=== Attestations ===\nThey are mentioned as A̓llobrígōn ( Ἀλλοβρίγων) by Polybius (2nd c. BC) and Strabo (early 1st c. AD), Allobroges by Caesar (mid-1st c. BC) and Livy (late 1st c. BC), A̓llóbriges (  Ἀλλόβριγες), Allóbrigas (Ἀλλόβριγας) and Allobrígōn (Ἀλλοβρίγων) by Appian (2nd c. AD), A̓llóbriges (Ἀλλόβριγες; var. Ἀλλόβρυγες, Ἀλλόβρογες) by Ptolemy (2nd c. AD), and as Allobrogas by Orosius (early 5th c. AD).\n\n\n=== Etymology ===\nThe ethnonym Allobroges is a Latinized form of the Gaulish *Allobrogis (sing. Allobrox), which literally means 'those from another country' or 'those from the other frontier', that is to say the 'foreigners' or the 'exiled'. The personal names Allo-brogicus and Allo-broxus are related; they all stem from the Celtic root allo- ('other, second') attached to brogi- ('territory, region, march'). This may give further evidence of the relatively recent coming of the Allobroges in the region. Their name can indeed be contrasted with that of the Nitio-broges ('indigenous'), who lived further southwest on the middle Garonne river. The Gaulish *Allobrogis is cognate with the Welsh allfro ('foreigner, exiled') – both stemming from the Celtic compound *allo-mrogi- –, and with the Germanic alja-markiz ('the foreigner'), found in an inscription from Karstad, which may indicate a Celtic-Germanic correspondence of the term.A mountain in the Mont Blanc massif is still called Pointe Allobrogia, which could be the remnant of an ancient territorial claim made by the Gallic people.\n\n\n== Geography ==\n\n\n=== Territory ===\nThe territory of the Allobroges, which is known as Allobrogia, stretched between the Isère and the Rhône rivers, the Lacus Lemannus (Lake Geneva) and the Alps. At the time of Caesar, they also possessed a little land north of the river between modern Lyon and Geneva, whose later status remains uncertain. During the Roman period, the civitas Viennensium covered an area of around 13,000 km2, one of the largest in Gaul.The Allobroges lived east of the Segusiavi and the Vellavi, south of the Ambarri and Sequani, north of the Segovellauni, Vertamocorii, Vocontii, Tricorii, Ucennii, Graioceli and Ceutrones, and southwest of the Helvetii and Veragri.\n\n\n=== Settlements ===\n\n\n==== Solonion ====\nUntil its destruction by the Romans in 61 BC, the main settlement of the Allobroges was Solonion, possibly corresponding to the modern village of Salagnon, near Bourgoin-Jallieu, or else to Montmiral, near Saint-Marcellin.\n\n\n==== Vienna ====\nThe site of Vienna (modern Vienne, France), situated at the confluence of the Gère and Rhône rivers, was occupied by the Celts since the early 4th century BC. It served as a small river port protected by two oppida, one on the Pipet hill, and one on the Sainte-Blandine hill, and perhaps surrounded by a wall. Although it remained a village until the 1st century BC, Vienna held a central position at a trading crossroad between northern Gaul, the Italian Peninsula and the Mediterranean Sea, before it was eventually outshined by the nearby Lugdunum during the reign of Augustus (27 BC–14 AD). Until that time, Vienna was indeed the only place in the region where the Rhône could be crossed by foot. Since its creation, the port had been maintaining trade relations with the Greek colony of Massalia, on the Mediterranean coast.After the destruction of Solonion by the Romans in 61 BC, the Allobrogian chieftains decided to move their place of residence to Vienna. Around 50 BC, the settlement possibly became a colonia Latina, leading to the immigration of settlers from the Italian Peninsula. According to most scholars, after their expulsion by the local Allobroges in March 44 BC during the political troubles that followed the assassination of Caesar, those Roman settlers moved further north, where Munatius Plancus founded for them the colony of Lugdunum the following year. Alternatively, some scholars date the expulsion of the settlers to the Allobrogian revolt of 62–62, and contend that Vienna was made into a colony only later at the time of Octavian.\nAnd to prevent [Lepidus and Lucius Plancus'] suspecting anything and consequently causing trouble, [the senators] ordered them to establish in a colony in Gallia Narbonensis the men who had once been driven by the Allobroges out of Vienna and afterwards established between the Rhone and the Arar, at their confluence.\n\nUnder Octavian, sometime between 40 and 27 BC, Vienna became known as Colonia Iulia Viennensium, then was made into a colonia Romana known as Colonia Iulia Augusta Florentia Vienna (or Viennensium), either under Augustus (ca. 15 BC) or Caligula (ca. 40 AD). In 35 AD, the Allobrogian citizen Valerius Asiaticus became the first Gallic man to be elected as Roman consul. Vienna was also made into the capital of the Allobrogian civitas, and became one of the most powerful cities of Gaul during the first century AD. In the second half of the 3rd century, the city declined and shrank to its original urban core, although it remained an important settlement during the 4th century, serving as the occasional residence of the emperors Julian and Valentinian II.\n\n\n==== Other settlements ====\nGenaua ('[river] mouth'; modern Genève) was an oppidum erected on the hill of Saint-Pierre next to the Rhône, the Arve and the Lake Geneva, which allowed them to control the inland navigation on the Rhône. Located near the border of the Helvetii territory, Genaua was occupied from 130 BC at the latest.Another important Allobrogian settlement was located in Cularo ('field of squash', modern Grenoble), first mentioned by Munatius Plancus in 43 BC and later renamed to Gratianopolis.Other oppida have been excavated at Musièges, Larina (Hières-sur-Amby), Saint-Saturnin (Chambéry), Les Étroits (Saint-Lattier), Quatre-Têtes (Saint-Just-de-Claix), and Rochefort (Varces).\n\n\n== History ==\n\n\n=== Pre-Roman period ===\n\n\n==== Origin ====\nThe Allobroges probably settled relatively late in Gaul, for they are not attested before the late 3rd century BC, in connection with Hannibal's crossing of the Alps in 218 BC. According to some scholars, they may be identified with the Gaesatae, a group of mercenary warriors first mentioned a few years earlier in the region and who fought against the Roman Republic in the Battle of Telamon (225 BC). The Allobroges may thus be the descendants of mobile groups of Gallic merceries who were active across central Europe in the first part of the 3rd century BC, and who eventually settled between the Rhône and the Alps in search for new opportunities during the later decades of the century.\n\n\n==== Hannibal's crossing of the Alps (218 BC) ====\n\nIn the mid-2nd century BC, the Greek historian Polybius first mentioned the Allobroges in his account of Hannibal's crossing of the Alps in 218 BC. The Allobroges of the plain helped the Carthaginian conqueror, whereas those of the mountains tried in vain to block his passage.\n... [Hannibal] reached a place called the 'Island', a populous district producing abundance of corn and deriving its name from its situation; for the Rhone and Isère running along each side of it meet at its point ... On arriving there he found two brothers disputing the crown and posted over against each other with their armies, and on the elder one making overtures to him and begging him to assist in establishing him on the throne, he consented, it being almost a matter of certainty that under present circumstances this would be of great service to him.\nHannibal then expelled the other chieftain and was given new weapons, corn, warm clothing and footwear by the his local ally. The latter protected him in the rear with him own forces through the territory of the Allobroges, until he reached the foot of the Alpine pass.\n... For as long as they had been in flat country, the various chiefs of the Allobroges had left them alone, being afraid both of the cavalry and of the barbarians who were escorting them. But when the latter had set off on their return home, and Hannibal's troops began to advance into the difficult region, the Allobrogian chieftains got together a considerable force and occupied advantageous positions on the road by which the Carthaginians would be obliged to ascend. Had they only kept their project secret, they would have utterly annihilated the Carthaginian army, but, as it was, it was discovered, and though they inflicted a good deal of damage on Hannibal, they did as much injury to themselves ...\nIn Livy's version, the Gallic chieftain who provided assistance to Hannibal is named Brancus ('the claw', var. Braneus). According to some scholars, since the 'Island' mentioned by ancient authors corresponds to the territory of the Segovellauni, Brancus may actually be Segovellaunian. In his account, however, Livy specifically states that the two chieftains were Allobroges.From the 2nd century BC onward, a climate change known as the Roman Warm Period caused a reduction of the migrations from Central and Northern Europe. As a result, the rate of adoption of a sedentary lifestyle among the former roving tribes of the region, including the Allobroges, probably increased during the late 2nd and 1st century BC. Greek geographer Strabo later wrote in the early 1st century AD, \"formerly the Allobroges kept up warfare with many myriads of men, whereas now they till the plains and the glens that are in the Alps.\"\n\n\n=== Early Roman period ===\n\n\n==== Annexion to the Roman Republic (121 BC) ====\nBetween 125 and 122 BC, the Romans crossed the Alps and fought the Salluvii and Vocontii. During the conflict, the Allobroges gave shelter to the Salluvian leaders, including their king Toutomotoulos, and refused to hand them over, which, added to the fact that the Allobroges had raided the Aedui, a recent ally of Rome, led the latter to declare war against them.They were defeated by the Romans forces of Gnaeus Domitius Ahenobarbus at the Battle of Vindalium in 121 BC, which occurred in modern Mourre-de-Sève (Sorgues), at the confluence of the Rhône and Sorgue rivers in Cavarian territory. The Allobrogian cavalry reportedly feared the Roman war elephants, and Orosius writes that they lost 20,000 men while 3,000 of them were captured. In August of the same year, the Roman army, strengthened by the troops of Quintus Fabius Maximus, inflicted a decisive defeat on a massive combined force of Allobroges, Arveni and the remaining Salluvii at the Battle of the Isère River. The Allobrogian territory was subsequently annexed to Rome by Domitius Ahenobarbus and Fabius Maximus, the latter earning the cognomen Allobrogicus for this feat.Between 120 and 117, those new Roman lands were progressively pacified and incorporated into a Roman province known as Gallia Transalpina by Domitius Ahenobarbus. The Allobroges had to pay heavy taxes to Rome, although they were allowed to keep their administrative autonomy and territory. They likely suffered from the invasions of the Cimbri and Teutoni during the Cimbrian War in 107–102 BC. The Allobrogian territory – Vienna in particular as it was located in the middle of the Rhône Valley – represented the northern frontier that separated Rome from the 'barbarian' world, and was thus exposed to the attacks of potentially hostile Gallic and Germanic tribes.\n\n\n==== Legal protests (69–63 BC) ====\nIn 69 BC, the Allobroges sent a delegation to Rome led by their chief Indutiomarus in order to protest against the heavy taxes imposed by Marcus Fonteius, the Roman governor of Gallia Transalpina. Already in 104 BC, the tribune Domitius Ahenobarbus, son of the Roman conqueror of the Allobroges, had accused Silanus of injustice (iniurias) against the Allobrogian chief Aegritomarus. Fonteius chose Cicero as his lawyer, and although the verdict of the trial remains unknown, the Roman governor was probably acquitted. The Allobroges appear to have been the dominant tribe of Gallia Transalpina at that time, for Indutiomarus is presented as the \"leader of the Allobroges and all the Gauls\" by Cicero. According to scholar A.L.F. Rivet, they were probably feared as \"the one tribe in Gaul that really could mount war against the Roman people\".Later on, an Allobrogian insurrection was suppressed by Calpurnius Piso, who administered Gallia Narbonensis as proconsul until 65 BC. For this, he was unsuccessfully prosecuted by Caesar, who had interest in the region. In 63 BC, while Cicero was serving as consul, they sent another delegation to Rome, hoping to seek relief from the oppression and rapacity of the governor Lucius Murena and Roman businessmen active in the region. Their demands rejected by the Roman Senate, they were approached by supporters of Catiline, a senator who attempted to overthrow the Roman Republic and, in particular, the power of the aristocratic Senate. Seeing an opportunity to enlist their help to the Catiline conspiracy, Lentulus sent the businessman Umbrenus persuade the Gallic envoys to invade Italy in support of Catiline. Although initially favourable to this overture, the Allobroges thought that their fate would be better if they take the Senate's side. They contacted their patron Q. Fabius Sanga, and Cicero convinced them to provide him with more evidence by feigning to join the conspirators. The supporters of Catiline then revealed all their plan to the Gauls, who demanded sealed letters from some leading conspirators, which the Allobroges eventually leaked to Cicero.\n\n\n==== Revolt against Rome (62–61 BC) ====\nFaced with a series of legal defeats, the Allobroges decided to take the arms against Rome in 62 BC. Led by their chief Catugnatus, they managed to resist against the Roman armies during nearly two years. The new governor of the province, Caius Pomptinus, sent his legate Manlius Lentinus to crush the revolt.In 61 BC, a battle was fought between the Gallic and Roman troops near the Segovellaunian settlement of Ventia, which was eventually taken by Lentinus. At the same time, the two other legates seized and partly destroyed the Allobrogian chief town, Solonion. The coming of Catugnatus' forces momentary saved the stronghold, but further Roman troops led by Pomptinus surrounded and defeated the Gallic armies, putting an end to the rebellion. Their capital destroyed, the Allobrogian chieftains decided to move their place of residence to Vienna.Lucius Marius and Servius Galba crossed the Rhone and after ravaging the possessions of the Allobroges finally reached the city of Solonium and occupied a strong position commanding it. They conquered their opponents in battle and also set fire to portions of the town, which was partly constructed of wood; they did not capture it, however, being prevented by the arrival of Catugnatus. Pomptinus, on learning of this, proceeded against the place with his entire army, besieged it, and got possession of the defenders, with the exception of Catugnatus. After that he more easily subjugated the remaining districts.\n\n\n==== Political turmoils (58–44 BC) ====\nThe period saw the invasion of the remaining of Gaul by Julius Caesar, followed by a civil war and Caesar's assassination in March 44. Although the Helvetii thought that they could persuade the Allobroges to let them go through their territory in 58 BC because of their antipathy to Rome, the Gallic tribe, presumably led at that time by Adbucillus, remained loyal to Caesar during all the Gallic Wars (58–50 BC). The Roman general used Vienna in particular as a strategic outpost during the conflict against the Gauls.After the failed migration of the Helvetii, who were repelled by the Romans towards their homeland, the Allobroges were asked by Caesar to provide them with wheat. In the autumn of 57, the legate Galba spent winter in the Allobrogian territory after an unsuccessful campaign in Vallis Poenina (modern Valais). Following the Roman defeat at the Battle of Gergovia (52 BC), the Allobroges began to strengthen the border along the Rhône river, fearing possibly attacks coming from the other bank. Vercingetorix tried to bribe their leaders to fight on the side of the Gallic coalition against Caesar, but the Allobroges rejected the offer.Two sons of Adbucillus, Aegus and Roscillus, provided assistance to Caesar in all of his Gallic campaigns. He assigned to them the highest magistracies among their own people, and granted them both money and conquered territory in Gaul. Regrettably, Caesar records that these privileges caused the two brothers to become \"carried away by a foolish native pride\" and to \"treat their men with contempt, cheating the cavalry of its pay and diverting all of the booty to themselves\". Their own armies came to Caesar to complain, and the two brothers eventually defected to Pompey at Dyrrachium just before the Battle of Pharsalia (48 BC).\n\n\n=== Roman Empire ===\nStrabo reported in the early 1st century AD that all of the Allobroges lived in villages, \"except that the most notable of them, inhabitants of Vienna (formerly a village, but called, nevertheless, the 'metropolis' of the tribe), have built it up into a city.\"At the time of the late Roman Empire, the Allobrogian territory was divided and administered from the three main cities: Vienna, Geneva and Cularo (later renamed Gratianopolis).\n\n\n== Religion ==\nFrom the \"Palace of Mirrors\" baths at Saint-Romain-en-Gal comes a statue of Vienna's tutelary goddess. Aix-les-Bains was a major centre of the cult of the healing god Borvo.The cult of Cybele was introduced to Vienna by traders from the Ancient Orient. A prominent temple likely dedicated to the goddess was built in the early 1st century AD, and a sacred theatre of Mysteries is dated to the 1st century AD. Outside of Vienna, however, evidence of the cult of Cybele, although not totally absent, are scattered and become rare when approaching the Alps.\n\n\n== Political organization ==\nAllobrogia was geographically divided between the plains of the Dauphiné and the mountains of Savoie, which influenced the political organization of the Allobroges, as documented by Polybius at the time of Hannibal's Crossing of the Alps in 218 BC.  Although this is not mentioned by the written sources, they probably federated smaller peoples or ethnic unities of the region, as did the neighbouring Cavares and Vocontii. Polybius indeed writes that the plains of Allobrogia were ruled by \"various chiefs\", suggesting a decentralized system of governance even within the two areas aforementioned. Aimé Bocquet has proposed to identify five natural sub-regions with those tribal territories: Chablais and Faucigny, Genevois, Savoie, Grésivaudan, and Isle-Crémieu.\n\n\n== Economy ==\nDuring the Roman period, the Allobroges cultivated wheat and exported wine. Copper and silver deposits were numerous in the Western Alps.\n\n\n== Legacy ==\n\n\n=== Légion des Allobroges ===\nThe First French Republic, in line with its common practice of reviving names and concepts from Roman times, gave the name \"Légion des Allobroges\" to a unit of the French Revolutionary Army that consisted mainly of volunteers from Switzerland, Piedmont and Savoy - very roughly corresponding to what had been the lands of the Allobroges.\n\n\n== See also ==\nGauls\n\n\n== References ==\n\n\n=== Primary sources ===\n\n\n=== Bibliography ===\n\n\n== Further reading =="