"In music, the tonic is the first scale degree () of the diatonic scale (the first note of a scale) and the tonal center or final resolution tone that is commonly used in the final cadence in tonal (musical key-based) classical music, popular music, and traditional music. In the movable do solfège system, the tonic note is sung as do. More generally, the tonic is the note upon which all other notes of a piece are hierarchically referenced. Scales are named after their tonics: for instance, the tonic of the C major scale is the note C.\nThe triad formed on the tonic note, the tonic chord, is thus the most significant chord in these styles of music. In Roman numeral analysis, the tonic chord is typically symbolized by the Roman numeral \"I\" if it is major and by \"i\" if it is minor.\n\nIn very much conventionally tonal music, harmonic analysis will reveal a broad prevalence of the primary (often triadic) harmonies: tonic, dominant, and subdominant (i.e., I and its chief auxiliaries a 5th removed), and especially the first two of these.These chords may also appear as seventh chords: in major, as IM7, or in minor as i7 or rarely iM7:The tonic is sometimes confused with the root, which is the reference note of a chord, rather than that of the scale.\n\n\n== Importance and function ==\nIn music of the common practice period, the tonic center was the most important of all the different tone centers which a composer used in a piece of music, with most pieces beginning and ending on the tonic, usually modulating to the dominant (the fifth scale degree above the tonic, or the fourth below it) in between. \nTwo parallel keys have the same tonic.  For example, in both C major and C minor, the tonic is C.  However, relative keys (two different scales that share a key signature) have different tonics. For example, C major and A minor share a key signature that feature no sharps or flats, despite having different tonic pitches (C and A, respectively).\nThe term tonic may be reserved exclusively for use in tonal contexts while tonal center and/or pitch center may be used in post-tonal and atonal music: \"For purposes of non-tonal centric music, it might be a good idea to have the term 'tone center' refer to the more general class of which 'tonics' (or tone centers in tonal contexts) could be regarded as a subclass.\" Thus, a pitch center may function referentially or contextually in an atonal context, often acting as an axis or line of symmetry in an interval cycle. The term pitch centricity was coined by Arthur Berger in his \"Problems of Pitch Organization in Stravinsky\". According to Walter Piston, \"the idea of a unified classical tonality replaced by nonclassical (in this case nondominant) centricity in a composition is perfectly demonstrated by Debussy's Prélude à l'après-midi d'un faune\" (Play opening ).The tonic includes four separate activities or roles as the principal goal tone, initiating event, generator of other tones, and the stable center neutralizing the tension between dominant and subdominant.\n\n\n== See also ==\nFinal (music)\nTonic chord\nDouble tonic\nSubtonic\nSupertonic\n\n\n== References =="