"The enumerated powers (also called expressed powers, explicit powers or delegated powers) of the United States Congress are the powers granted to the federal government of the United States. Most of these powers are listed in Article I, Section 8 of the United States Constitution.\nIn summary, Congress may exercise the powers that the Constitution grants it, subject to the individual rights listed in the Bill of Rights. Moreover, the Constitution expresses various other limitations on Congress, such as the one expressed by the Tenth Amendment: \"The powers not delegated to the United States by the Constitution, nor prohibited by it to the States, are reserved to the States respectively, or to the people.\"\nHistorically, Congress and the Supreme Court have broadly interpreted the enumerated powers, especially by deriving many implied powers from them.  The enumerated powers listed in Article One include both exclusive federal powers, as well as concurrent powers that are shared with the states, and all of those powers are to be contrasted with reserved powers that only the states possess.\n\n\n== List of enumerated powers of the federal constitution ==\nArticle I, Section 8 of the United States Constitution:\n\nThe Congress shall have Power To lay and collect Taxes, Duties, Imposts and Excises, to pay the Debts and provide for the common Defense and general Welfare of the United States; but all Duties, Imposts and Excises shall be uniform throughout the United States;\nTo borrow on the credit of the United States;\nTo regulate Commerce with foreign Nations, and among the several States, and with the Indian Tribes;\nTo establish a uniform Rule of Naturalization, and uniform Laws on the subject of Bankruptcies throughout the United States;\nTo coin Money, regulate the Value thereof, and of foreign Coin, and fix the Standard of Weights and Measures;\nTo provide for the Punishment of counterfeiting the Securities and current Coin of the United States;\nTo establish Post Offices and Post Roads;\nTo promote the Progress of Science and useful Arts, by securing for limited Times to Authors and Inventors the exclusive Right to their respective Writings and Discoveries;\nTo constitute Tribunals inferior to the supreme Court;\nTo define and punish Piracies and Felonies committed on the high Seas, and Offenses against the Law of Nations;\nTo declare War, grant Letters of Marque and Reprisal, and make Rules concerning Captures on Land and Water;\nTo raise and support Armies, but no Appropriation of Money to that Use shall be for a longer Term than two Years;\nTo provide and maintain a Navy;\nTo make Rules for the Government and Regulation of the land and naval Forces;\nTo provide for calling forth the Militia to execute the Laws of the Union, suppress Insurrections and repel Invasions;\nTo provide for organizing, arming, and disciplining, the Militia, and for governing such Part of them as may be employed in the Service of the United States, reserving to the States respectively, the Appointment of the Officers, and the Authority of training the Militia according to the discipline prescribed by Congress;\nTo exercise exclusive Legislation in all Cases whatsoever, over such District (not exceeding ten Miles square) as may, by Cession of particular States, and the acceptance of Congress, become the Seat of the Government of the United States, and to exercise like Authority over all Places purchased by the Consent of the Legislature of the State in which the Same shall be, for the Erection of Forts, Magazines, Arsenals, dock-Yards, and other needful Buildings; And\nTo make all Laws which shall be necessary and proper for carrying into Execution the foregoing Powers, and all other Powers vested by this Constitution in the Government of the United States, or in any Department or Officer thereof.\n\nArticle III, Section 3 of the United States Constitution:\n\nThe Congress shall have Power to declare the Punishment of Treason, but no Attainder of Treason shall work Corruption of Blood, or Forfeiture except during the Life of the Person attainted.\n\nArticle IV, Section 3 of the United States Constitution:\n\nNew States may be admitted by the Congress into this Union; but no new State shall be formed or erected within the Jurisdiction of any other State; nor any State be formed by the Junction of two or more States, or Parts of States, without the Consent of the Legislatures of the States concerned as well as of the Congress.\nThe Congress shall have Power to dispose of and make all needful Rules and Regulations respecting the Territory or other Property belonging to the United States; and nothing in this Constitution shall be so construed as to Prejudice any Claims of the United States, or of any particular State.\n\nAmendment XVI of the United States Constitution:\n\nThe Congress shall have power to lay and collect taxes on incomes, from whatever source derived, without apportionment among the several States, and without regard to any census or enumeration.\n\nAmendment XX, Section 4 of the United States Constitution:\n\nThe Congress may by law provide for the case of the death of any of the persons from whom the House of Representatives may choose a President whenever the right of choice shall have devolved upon them, and for the case of the death of any of the persons from whom the Senate may choose a Vice President whenever the right of choice shall have devolved upon them.\n\nAdditionally, a number of amendments include a Congressional power of enforcement in which the language \"The Congress shall have power to enforce this article by appropriate legislation\" is used with slight variations, granting to Congress the power to enforce the following amendments:\n\nAmendment XIII of the United States Constitution\nAmendment XIV of the United States Constitution\nAmendment XV of the United States Constitution\nAmendment XIX of the United States Constitution\nAmendment XXIII of the United States Constitution\nAmendment XXIV of the United States Constitution\nAmendment XXVI of the United States Constitution\n\n\n== Political interpretation ==\nThere are differences of opinion on whether current interpretation of enumerated powers as exercised by Congress is constitutionally sound.\nOne school of thought is called strict constructionism. Strict constructionists refer to a statement on the enumerated powers by Chief Justice Marshall in the case McCulloch v. Maryland:\nThis government is acknowledged by all, to be one of enumerated powers. The principle, that it can exercise only the powers granted to it, would seem too apparent, to have required to be enforced by all those arguments, which its enlightened friends, while it was depending before the people, found it necessary to urge; that principle is now universally admitted.\nAnother school of thought is referred to as loose construction. They often refer to different comments by Justice Marshall from the same case:\n\nWe admit, as all must admit, that the powers of the Government are limited, and that its limits are not to be transcended. But we think the sound construction of the Constitution must allow to the national legislature that discretion with respect to the means by which the powers it confers are to be carried into execution which will enable that body to perform the high duties assigned to it in the manner most beneficial to the people. Let the end be legitimate, let it be within the scope of the Constitution, and all means which are appropriate, which are plainly adapted to that end, which are not prohibited, but consistent with the letter and spirit of the Constitution, are constitutional.\n\n\n== Necessary and Proper Clause ==\nInterpretation of the Necessary and Proper Clause has been controversial, especially during the early years of the republic. Strict constructionists interpret the clause to mean that Congress may make a law only if the inability to do so would cripple its ability to apply one of its enumerated powers. Loose constructionists, on the other hand, believe it is largely up to Congress and not the courts to determine what means are \"necessary and proper\" in executing one of its enumerated powers. It is often known as the \"elastic clause\" because of the great amount of leeway in interpretation it allows; depending on the interpretation, it can be \"stretched\" to expand the powers of Congress, or allowed to \"contract\", limiting Congress. In practical usage, the clause has been paired with the Commerce Clause in particular to provide the constitutional basis for a wide variety of federal laws.\n\n\n=== McCulloch v. Maryland ===\nThe defining example of the Necessary and Proper Clause in U.S. history was McCulloch v. Maryland in 1819. The United States Constitution says nothing about establishing a national bank. The U.S. government established a national bank that provided part of the government's initial capital. In 1819 the federal government opened a national bank in Baltimore, Maryland. In an effort to tax the bank out of business, the government of Maryland imposed a tax on the federal bank. James William McCulloch, a cashier at the bank, refused to pay the tax. Eventually the case was heard before the U.S. Supreme Court. Chief Justice John Marshall held that the power of establishing a national bank could be implied from the U.S. constitution. Marshall ruled that no state could use its taxing power to tax an arm of the national government.\n\n\n== Recent case law ==\nThe case of United States v. Lopez in 1995 held unconstitutional the Gun Free School Zone Act because it exceeded the power of Congress to \"regulate commerce...among the several states\". Chief Justice William Rehnquist wrote, \"We start with first principles. The Constitution creates a Federal Government of enumerated powers.\" For the first time in sixty years the Court found that in creating a federal statute, Congress had exceeded the power granted to it by the Commerce Clause.\nFor more details see: The Rehnquist Court and the Commerce ClauseIn National Federation of Independent Business v. Sebelius, the Supreme Court held that the Commerce Clause did not give Congress the authority to require individuals to purchase health insurance.  However, since the court ruled that Congress's taxing authority was sufficient to enact the mandate, some constitutional lawyers have argued that the commerce clause discussion should be treated as judicial dictum.  Chief Justice John Roberts, in his majority opinion, stated that:\n\n[T]he statute reads more naturally as a command to buy insurance than as a tax, and I would uphold it as a command if the Constitution allowed it.  It is only because the Commerce Clause does not authorize such a command that it is necessary to reach the taxing power question. And it is only because we have a duty to construe a statute to save it, if fairly possible, that §5000A can be interpreted as a tax.  Without deciding the Commerce Clause question, I would find no basis to adopt such a saving construction.No other justice joined this segment of the Chief Justice's opinion.\n\n\n== Enumerated Powers Act ==\nThe Enumerated Powers Act is a proposed law that would require all bills introduced in the U.S. Congress to include a statement setting forth the specific constitutional authority under which each bill is being enacted. From the 104th Congress to the 111th Congress, U.S. Congressman John Shadegg introduced the Enumerated Powers Act, although it has not been passed into law. At the beginning of the 105th Congress, the House of Representatives incorporated the substantive requirement of the Enumerated Powers Act into the House rules.\n\n\n=== Tea Party support ===\nThe Enumerated Powers Act is supported by leaders of the U.S. Tea Party movement.  National Tea Party leader Michael Johns has said that progressives often \"see the Constitution as an impediment to their statist agenda. In almost all cases, though, there is very little thought or dialogue given to what should be the first and foremost question asked with every legislative or administrative governmental action: Is this initiative empowered to our federal government by the document's seven articles and 27 amendments? In many cases, the answer is no.\" \"For this reason,\" Johns said, \"we also strongly support the Enumerated Powers Act, which will require Congress to justify the Constitutional authority upon which all legislation is based.\"\n\n\n== See also ==\nCompact theory\nConstitution in exile\nNew federalism\nOriginalism\nStates' rights\nStrict constructionism\n\n\n== References ==\n\n\n== External links ==\nAnnotations on enumerated powers from FindLaw"