"Euripides (; Greek: Εὐριπίδης Eurīpídēs, pronounced [eu̯.riː.pí.dɛːs]; c. 480 – c. 406 BC) was a tragedian of classical Athens. Along with Aeschylus and Sophocles, he is one of the three ancient Greek tragedians for whom any plays have survived in full. Some ancient scholars attributed ninety-five plays to him, but the Suda says it was ninety-two at most. Of these, eighteen or nineteen have survived more or less complete (Rhesus is suspect). There are many fragments (some substantial) of most of his other plays. More of his plays have survived intact than those of Aeschylus and Sophocles together, partly because his popularity grew as theirs declined—he became, in the Hellenistic Age, a cornerstone of ancient literary education, along with Homer, Demosthenes, and Menander.Euripides is identified with theatrical innovations that have profoundly influenced drama down to modern times, especially in the representation of traditional, mythical heroes as ordinary people in extraordinary circumstances. This new approach led him to pioneer developments that later writers adapted to comedy, some of which are characteristic of romance. He also became \"the most tragic of poets\", focusing on the inner lives and motives of his characters in a way previously unknown. He was \"the creator of...that cage which is the theatre of Shakespeare's Othello, Racine's Phèdre, of Ibsen and Strindberg,\" in which \"imprisoned men and women destroy each other by the intensity of their loves and hates\". But he was also the literary ancestor of comic dramatists as diverse as Menander and George Bernard Shaw.His contemporaries associated him with Socrates as a leader of a decadent intellectualism. Both were frequently lampooned by comic poets such as Aristophanes. Socrates was eventually put on trial and executed as a corrupting influence. Euripides chose a voluntary exile in old age, dying in Macedonia. But recent scholarship casts doubt on ancient biographies of Euripides. For example, it is possible that he never visited Macedonia at all, or, if he did, he might have been drawn there by King Archelaus with incentives that were also offered to other artists."