"A lust murder is a homicide in which the offender searches for erotic satisfaction by killing someone. Lust murder is synonymous with the paraphilic term erotophonophilia, which is sexual arousal or gratification contingent on the death of a human being. The term lust killing stems from the original work of Richard von Krafft-Ebing in his 1898 discussion of sadistic homicides. Commonly, this type of crime is manifested either by murder during sexual activity, by mutilating the sexual organs or areas of the victim's body, or by murder and mutilation. The mutilation of the victim may include evisceration, displacement of the sexual organs, or both. The mutilation usually takes place postmortem. Although the killing sequence may include an act of sexual intercourse, sexual intercourse does not always occur, and other types of sexual acts may be part of the homicide.In 2019, Current Psychiatry Reports published a review of the recent findings on sexual homicide research and concluded that sexual murderers should be viewed as a specific offender with distinct traits which requires an international reporting system. Earlier, the authors of the review reported on comparisons of offenders in the French national police database with the same conclusion.\n\n\n== Characteristics ==\nLust murder sometimes includes activities such as removing clothing from the body, posing and propping of the body in different positions (generally sexual ones), insertion of objects into bodily orifices, cannibalism and necrophilia.\nMost cases of lust murder involve male perpetrators, although accounts of female lust murderers do exist. In general, lust murder is a phenomenon most common among serial killers. These offenders have made a connection between murder and sexual gratification. When this type of offender chooses a victim there must be something about that victim that the offender finds sexually attractive. This attractive trait might be common among all of the offender's victims and is called the offender's Ideal Victim Type (IVT). There might be many potential targets that an offender passes by because they do not meet their ideal victim. Once the offender has found a victim who is ideal, they might engage in stalking or other predatory behaviors before acting out their fantasy on their victim. Fantasies are a key component in lust murders and can never be completely fulfilled. The lust killer will have a fantasy that continues to evolve over time and becomes increasingly violent as they struggle to fulfill it.The most critical component in the psychological development of a serial killer is violent fantasy, especially in the lust murderer. Fantasies accompany \"intrusive thoughts about killing someone that are associated with other distressing psychopathological processes\". Fantasies can never be completely fulfilled; sometimes the experience of killing can generate new fantasies of violence, creating a repetitive cycle. The purpose of fantasy is total control of the victim, whereas a sexual assault can be used as a vehicle for control. Sexual torture becomes a tool to degrade, humiliate, and subjugate the victim. Often the killer selects victims to stand as a proxy, resulting from childhood trauma. Fantasies may be fueled by pornography and facilitated by alcohol or other causes. Typically, fantasies involve one or several forms of paraphilia.The term lust murder is also used in a related, but slightly different sense, to refer to an individual who gains sexual arousal from the act of committing murder, or has persistent sexual fantasies of committing murder, even if the murder itself does not involve genital mutilation or other aforementioned characteristics. As such, it is a type of paraphilia.\nAlthough the dynamic of violent fantasy in lust murders is understood, an individual's violence fantasy alone is not enough to determine if an individual has or has not engaged in lust murder. Moreover, to conclude that an individual is a violent psychopath because they have drawn multitudes of violent images is overreaching.\n\n\n== Examples of lust murderers ==\n\n\n== References =="