"The Occupy movement was an international left-wing populist socio-political movement that expressed opposition to social and economic inequality and to the lack of \"real democracy\" around the world. It aimed primarily to advance social and economic justice and new forms of democracy. The movement has had many different scopes, since local groups often had different focuses, but its prime concerns included how large corporations (and the global financial system) control the world in a way that disproportionately benefits a minority, undermines democracy and causes instability.The first Occupy protest to receive widespread attention, Occupy Wall Street in New York City's Zuccotti Park, began on 17 September 2011. By 9 October, Occupy protests had taken place or were ongoing in over 951 cities across 82 countries, and in over 600 communities in the United States. Although the movement became most active in the United States, by October 2011 Occupy protests and occupations had started in dozens of other countries across every widely inhabited continent. For the first month, overt police repression remained minimal, but this began to change by 25 October 2011, when police first attempted to forcibly remove Occupy Oakland. By the end of 2011 authorities had cleared most of the major camps, with the last remaining high-profile sites – in Washington, D.C. and in London – evicted by February 2012.The Occupy movement took inspiration in part from the Arab Spring, from the 2009 Iranian Green Movement, and from the Spanish Indignados Movement, as well as from the overall global wave of anti-austerity protests of 2010 and following. The movement commonly used the slogan \"We are the 99%\" and the #Occupy hashtag format; it organized through websites such as the now defunct Occupy Together. According to The Washington Post, the movement, which Cornel West described as a \"democratic awakening\", is difficult to distill to a few demands. On 12 October 2011 Los Angeles City Council became one of the first governmental bodies in the United States to adopt a resolution stating its informal support of the Occupy movement. In October 2012, the Executive Director of Financial Stability at the Bank of England stated that the protesters were right to criticise and had persuaded bankers and politicians \"to behave in a more moral way\".\n\n"