"A thermophile is an organism—a type of extremophile—that thrives at relatively high temperatures, between 41 and 122 °C (106 and 252 °F). Many thermophiles are archaea, though they can be bacteria. Thermophilic eubacteria are suggested to have been among the earliest bacteria.Thermophiles are found in various geothermally heated regions of the Earth, such as hot springs like those in Yellowstone National Park (see image) and deep sea hydrothermal vents, as well as decaying plant matter, such as peat bogs and compost.\nThermophiles can survive at high temperatures, whereas other bacteria or archaea would be damaged and sometimes killed if exposed to the same temperatures. \nThe enzymes in thermophiles function at high temperatures. Some of these enzymes are used in molecular biology, for example the taq polymerase used in PCR.\n\"Thermophile\" is derived from the Greek: θερμότητα (thermotita), meaning heat, and Greek: φίλια (philia), love.\n\n\n== Classification ==\nThermophiles can be classified in various ways.  One classification sorts these organisms according to their optimal growth temperatures:\nSimple thermophiles: 50–64 °C (122-147.2 °F)\nExtreme thermophiles 65–79 °C (149-174.2 °F)\nHyperthermophiles 80 °C and beyond, but not < 50 °C. (176+ °F)In a related classification, thermophiles are sorted as follows: \n\nFacultative thermophiles (also called moderate thermophiles) can thrive at high temperatures, but also at lower temperatures (below 50 °C (122 °F)), whereas\nObligate thermophiles (also called extreme thermophiles) require such high temperatures for growth.\nHyperthermophiles are particularly extreme thermophiles for which the optimal temperatures are above 80 °C (176 °F).\nMany of the hyperthermophilic Archaea require elemental sulfur for growth. Some are anaerobes that use the sulfur instead of oxygen as an electron acceptor during cellular respiration. Some are lithotrophs that oxidize sulphur to create sulfuric acid as an energy source, thus requiring the microorganism to be adapted to very low pH (i.e., it is an acidophile as well as thermophile). These organisms are inhabitants of hot, sulfur-rich environments usually associated with volcanism, such as hot springs, geysers, and fumaroles.  In these places, especially in Yellowstone National Park, zonation of microorganisms according to their temperature optima occurs. Often, these organisms are colored, due to the presence of photosynthetic pigments.\n\n\n== Thermophile versus mesophile ==\nThermophiles can be discriminated from mesophiles from genomic features. For example, the GC-content levels in the coding regions of some signature genes were consistently identified as correlated with the temperature range condition when the association analysis was applied to mesophilic and thermophilic organisms regardless of their phylogeny, oxygen requirement, salinity, or habitat conditions.\n\n\n== Gene transfer and genetic exchange ==\nSulfolobus solfataricus and Sulfolobus acidocaldarius are hyperthermophilic archaea.  When these organisms are exposed to the DNA damaging agents UV irradiation, bleomycin or mitomycin C, species-specific cellular aggregation is induced.  In S. acidocaldarius, UV-induced cellular aggregation mediates chromosomal marker exchange with high frequency.  Recombination rates exceed those of uninduced cultures by up to three orders of magnitude.  Frols et al. and Ajon et al.(2011) hypothesized that cellular aggregation enhances species-specific DNA transfer between Sulfolobus cells in order to provide increased repair of damaged DNA by means of homologous recombination.  Van Wolferen et al., in discussing DNA exchange in the hyperthermophiles under extreme conditions, noted that DNA exchange likely plays a role in repair of DNA via homologous recombination.  They suggested that this process is crucial under DNA damaging conditions such as high temperature.  Also it has been suggested that DNA transfer in Sulfolobus may be a primitive form of sexual interaction similar to the more well-studied bacterial transformation systems that are associated with species-specific DNA transfer between cells leading to homologous recombinational repair of DNA damage [see Transformation (genetics)].\n\n\n== See also ==\nHyperthermophile\nMesophile\nPsychrophile\nAnaerobic digestion\nArchaea\nSulfolobus\n\n\n== References ==\n\n\n== External links ==\n\"Thermoprotei : Extreme Thermophile\". NCBI Taxonomy Browser.\nHow hot is too Hot? T-Limit Expedition"