"Techno Destructo is a former character in the American heavy metal band Gwar, depicted as their long-term archnemesis. The character was portrayed and created by Gwar co-founder Hunter Jackson.\n\n\n== Character overview ==\nTechno Destructo is described coming \"from beyond Venus, beyond Jupiter, and that's way past Uranus, buddy,\" and that he \"drinks multi-lube and jerks off to Popular Mechanics.\" It is known that Techno was one of the Scumdogs of the Universe - the Master's elite corps of warriors used to fight his ancient enemies (most notably Cardinal Syn; the video to \"The Road Behind\" shows Techno and Oderus teaming up against Syn, the only known footage of the two on the same team) - and that when Gwar opposed the Master, Techno opposed Gwar. The following millions of years, though never actually described in full, have Techno searching for his brethren to re-enlist them on the side of the Master. Gwar repeatedly engage in battle with him. His repeated defeats never seem to weaken his resolve, though, and neither does his enslavement (immediately following the Tour de Scum). He remains a slave for a number of years, working to take Gwar down from within. It was after the slave revolt that Techno regained his arm and revived Gor-Gor as a cyborg-zombie dinosaur. He didn't count on losing the remote control, which somehow found its way into Slymenstra's possession. With Gor-Borg out of his control, he was maimed, but remained alive.\nIt is explained from old entries at Gwar.net that Techno was responsible for sending the Morality Squad after Gwar, and that he summoned Cardinal Syn, who in turn dispatched Skulhedface. Using Techno's genitalia as a plug, Gwar was able to broadcast Slave Pit TV everywhere, and killed enough people to awaken the World Maggot, but were stopped by Skulhedface. With Skulhedface defeated, Techno tricked Gwar into thinking the year 1996 was in fact the year 1999 (the reason the tour was called RagNaRok N' Roll 1999), and thus, according to prophecy, the world was about to end with the coming of the comet RagNaRok. It was, in fact, not a comet, but Cardinal Syn. Gwar had to free Techno in order to defeat him.\nAfter Cardinal Syn's defeat, Techno had raised enough support among Gwar's other slaves to begin his next series of plans to defeat Gwar. Using a robot duplicate of Sleazy P. Martini, Techno issued radioactive crack to Gwar, which hypnotized Slymenstra Hymen. Meanwhile, he genetically engineered abused penguins (abused by Gwar) into foul creatures as his second wave of attack. This was ultimately halted, but by then, Techno's wedding had begun. Once the crack wore off, however, Slymenstra exacted her revenge, but was not able to defeat him outright. Techno regained his arm and engaged Gwar once again, being defeated when the band revived Gor-Gor (with remnants of the radioactive crack) and had the beast disarm Techno once again. He was mentioned in the Ska-Parade session \"Gwar vs. The Aquabats\" in which he is said to be helping Gwar fight The Aquabats (though it's not known why he helped Gwar). Techno's final appearance with Gwar was on the 2000 Halloween tour.\nJackson left Slave Pit in 2002 leading Oderus Urungus to insist that he killed Techno Destructo during the Art-Fag Wars of the early 21st century. During his comments on the 2006 DVD Blood Bath and Beyond, Oderus declares his respect for Techno and Bozo, though he would still \"talk shit about them any chance I get.\"  Techno is, however, still referenced in later Gwar songs (specifically in \"GWARnography\" and \"The Litany of the Slain\"), and in 2009, he was briefly shown as a still graphic in a pre-show video on tour.\n\n\n=== New Destructo Duo ===\nOn Gwar's Electile Dysfunction 08' U.S tour Gwar faced a new, revised Destructo team with the introduction of the new character & long-lost Scumdog, Sawborg Destructo (played by Matt Maguire), who is armed with a saw-type weapon and bears a resemblance to the other Destructos before him, along with the more experienced Bozo Destructo, who was Techno's tag-team partner in Gwar's other, earlier Mid-Galactic Wrestling tours. The new team battled to \"The Private Pain of Techno Destructo\" from Carnival of Chaos, and they provided new lyrics, after taking turns singing Techno's original lines using their names (\"I got gas and oil flowing through my veins. I got wire and plastic in my brain. I'm Bozo Destructo. Bozo Destructo!\").\n\n\n== Hunter Jackson ==\n\nHunter Jackson was one of the original members of and co-founders of Gwar, having formed the Slave Pit Inc., the art collective which serves as Gwar's production company, in Richmond, Virginia in 1984. Jackson originally intended to film a low-budget space pirate movie entitled Scumdogs of the Universe, for which he created what would become the costumes for the original Gwar line-up when Dave Brockie borrowed the costumes to wear with this then-band Death Piggy, ultimately leading to the creation of Gwar. In 1986, Jackson briefly moved to Detroit during the period when Gwar was recording their debut album Hell-O; thus, Gwar member Don Drakulich portrayed the role of Techno Destructo on the song \"Techno's Song\".\nDuring his time with Gwar, Jackson was responsible for contributing to a lot of the band's creative concepts and non-musical artistic endeavors, acting as a writer and artist for the band's line of comic books (\"Slave Pit Funnies\"), monthly newsletters (\"Mind Control Monthly\") and scripts for the band's shows. Jackson also worked as a director, writer, producer and actor for both Gwar's live videos and long-form movies including Phallus in Wonderland (for which he also illustrated the cover art) and Skulhedface. Jackson, a self-described \"game geek\" and contributor to d8 magazine, was also instrumental in designing Gwar's 1999 board game Rumble in Antarctica.Though not an instrumentalist, Jackson contributed occasional live vocals for Gwar's shows, and most notably sang lead on the songs \"The Morality Squad\" on America Must Be Destroyed (as his characters Edna P. Granbo and Corporal Punishment), \"The Private Pain of Techno Destructo\" on Carnival of Chaos (as Techno Destructo) and \"Tune from Da Moon\" on We Kill Everything (as Scroda Moon), all of which he received co-writing credits for. Jackson was also the voice of Cardinal Syn and provided the vocals on \"Surf of Syn\" from Ragnarök, though the role went uncredited in the album's liner notes.\nJackson left Gwar in November 2000, and neither he nor his characters have returned to the band in any capacity since. According to Don Drakulich, there were allegedly tensions between Jackson and members of Slave Pit, primarily between him and Dave Brockie, stemming from creative differences and disagreements over business which contributed to his leaving.\nSince departing Gwar, Jackson has relocated to Los Angeles and continues to build artificial prostheses, a skill he has credited with influencing his work with Gwar and providing him with prop-building materials to work with. Despite no longer being associated with Gwar, Jackson has continued to appear as Techno Destructo and Scroda Moon at comic conventions and independent professional wrestling organizations in California.. In 2006 and 2007, he appeared at the Comic-Con to promote Gwar's line of action figures from Shocker Toys which were ultimately unreleased. Jackson has provided artwork for California comedy punk band The Radioactive Chicken Heads, which the band has used for t-shirts, posters and visuals for their music video \"Cluck You!\". On September 1, 2013, Jackson appeared with the band as Techno Destructo during their set opening for The Dickies at the Whisky A Go Go in Hollywood. Jackson also appears and wrestles as Techno Destructo for Sinn Bodhi's Freakshow Wrestling promotion in California.\n\n\n== References ==\n\n\n== External links ==\nHouse of Huntar, Hunter Jackson's official website"