"A principality (or sometimes princedom) can either be a monarchical feudatory or a sovereign state, ruled or reigned over by a regnant-monarch with the title of prince and/or princess, or by a monarch with another title considered to fall under the generic meaning of the term prince.\n\n\n== Terminology ==\nMost of these states have historically been a polity, but in some occasions were rather territories in respect of which a princely title is held. The prince's estate and wealth may be located mainly or wholly outside the geographical confines of the principality.\nGenerally recognised surviving sovereign principalities are Liechtenstein, Monaco, and the co-principality of Andorra. Extant royal primogenitures styled as principalities include Asturias (Spain). The Principality of Wales existed in the northern and western areas of Wales between the 13th and 16th centuries; the Laws in Wales Act of 1536 which legally incorporated Wales within England removed the distinction between those areas and the March of Wales, but no principality covering the whole of Wales was created. Since that time, the title Prince of Wales has traditionally been granted to the heir apparent to the reigning monarch of the United Kingdom, but it confers no responsibilities for government in Wales. The Principality of Catalonia existed in the north-eastern areas of Spain between 14th and 18th centuries, as the term for the territories ruled by the Catalan courts, until the defeat of the Habsburgs in the Spanish succession war, when these institutions were abolished due to their support for the Habsburg pretender. Principality of Asturias is the official name of autonomous community of Asturias.\nThe term principality is also sometimes used generically for any small monarchy, especially for small sovereign states ruled by a monarch of a lesser rank than a king, such as a Fürst (usually translated in English as \"prince\"), as in Liechtenstein, or a Grand Duke. No sovereign duchy currently exists, but Luxembourg is a surviving example of a sovereign grand duchy. Historically there have been sovereign principalities with many styles of ruler, such as Countship, Margraviate and even Lordship, especially within the Holy Roman Empire.\nWhile the preceding definition would seem to fit a princely state perfectly, the European historical tradition is to reserve that word for native monarchies in colonial countries, and to apply \"principality\" to the Western monarchies.\n\n\n== European ==\n\n\n=== Development ===\nThough principalities existed in antiquity, even before the height of the Roman Empire, the principality as it is known today developed in the Middle Ages between 750 and 1450 when feudalism was the primary economic and social system in much of Europe. Feudalism increased the power of local princes within a king's lands. As princes continued to gain more power over time, the authority of the king was diminished in many places. This led to political fragmentation as the king's lands were broken into mini-states ruled by princes and dukes who wielded absolute power over their small territories. This was especially prevalent in Europe, and particularly with the Princes of the Holy Roman Empire.\nDuring the Late Middle Ages from 1200 to 1500, principalities were often at war with each other as royal houses asserted sovereignty over smaller principalities. These wars caused a great deal of instability and economies were destroyed. Episodes of bubonic plague also reduced the power of principalities to survive independently. Eventually, agricultural progress and development of new trade goods and services boosted commerce between principalities. Many of these states became wealthy, expanded their territories and improved the services provided to their citizens. Princes and dukes developed their lands, established new ports and chartered large thriving cities. Some used their new-found wealth to build palaces and other institutions now associated with sovereign states.\n\n\n=== Consolidation ===\n\nWhile some principalities prospered in their independence, less successful states were swallowed by stronger royal houses. Europe saw consolidation of small principalities into larger kingdoms and empires. This had already happened in England in the first millennium, and this trend subsequently led to the creation of such states as France, Portugal, and Spain. Another form of consolidation was orchestrated in Italy during the Renaissance by the Medici family. A banking family from Florence, the Medici took control of governments in various Italian regions and even assumed the papacy. They then appointed family members as princes and assured their protection. Prussia also later expanded by acquiring the territories of many other states.\nHowever, in the 17th to 19th centuries, especially within the Holy Roman Empire, the reverse was also occurring: many new small sovereign states arose as a result of transfers of land for various reasons.\nNotable principalities existed until the early 20th century in various regions of Germany and Italy.\n\n\n=== Nationalism ===\nNationalism, the belief that the nation-state is the best vehicle to realise the aspirations of a people, became popular in the late 19th century. A characteristic of nationalism is an identity with a larger region such as an area sharing a common language and culture. With this development, principalities fell out of favour. As a compromise, many principalities united with neighbouring regions and adopted constitutional forms of government, with the monarch acting as a mere figurehead while administration was left in the hands of elected parliaments. The trend in the 19th and 20th centuries was the abolition of various forms of monarchy and the creation of republican governments led by popularly elected presidents.\n\n\n=== Ecclesiastical principalities ===\nSeveral principalities where genealogical inheritance is replaced by succession in a religious office have existed in the Roman Catholic Church, in each case consisting of a feudal polity (often a former secular principality in the broad sense) held ex officio — the closest possible equivalent to hereditary succession — by a Prince of the church, styled more precisely according to his ecclesiastical rank, such as Prince-bishop, Prince-abbot or, especially as a form of crusader state, Grand Master.\nSome of these instances were merely religious offices without sovereign power over any territory, while others, such as Salzburg and Durham, shared some of the characteristics of secular princes.\n\n\n== Asia ==\nPrior to the European colonialism, South Asia and South East Asia were under the influence of Indosphere of greater India, where numerous Indianized principalities and empires flourished for several centuries in Thailand, Indonesia, Malaysia, Singapore, Philippines, Cambodia and Vietnam. The influence of Indian culture into these areas was given the term indianization. George Coedes defined it as the expansion of an organized culture that was framed upon Indian originations of royalty, Hinduism and Buddhism and the Sanskrit dialect. This can be seen in the spread of Hinduism and Buddhism. Indian honorifics also influenced the Malay, Thai, Filipino and Indonesian honorifics.In the colonial context, the term princely states was used, especially for those that came under the sway of a European colonising power: for example the British Indian and neighbouring or associated (e.g., Arabian) princely states were ruled by monarchs called Princes by the British, regardless of the native styles, which could be equivalent to royal or even imperial rank in the Indigenous cultures.\n\n\n== Other principalities ==\n\n\n=== Other ===\nPrincipalities have also existed in ancient and modern civilizations of Africa, Pre-Columbian America and Oceania.\n\n\n=== Micronational principalities ===\nSeveral micronations, which de facto have few characteristics of sovereign states and are not recognized as such, more or less seriously claim the status of sovereign principalities. Examples are Sealand, a former military fort in the North Sea; Seborga, internationally considered a small town in Italy; and Hutt River and Principality of Wy in Mosman, internationally considered to be in Australia.\n\n\n== See also ==\nGrand prince\nVictory title\nEmirate\n\n\n== References =="