"Iran (Persian: ایران‎ Irān [ʔiːˈɾɒːn] (listen)), also called Persia, and officially the Islamic Republic of Iran, is a country in Western Asia. It is bordered to the northwest by Armenia and Azerbaijan, to the north by the Caspian Sea, to the northeast by Turkmenistan, to the east by Afghanistan, to the southeast by Pakistan, to the south by the Persian Gulf and the Gulf of Oman, and to the west by Turkey and Iraq. Iran covers an area of 1,648,195 km2 (636,372 sq mi), with a population of 83 million. It is the second-largest country in the Middle East, and its capital and largest city is Tehran.\nIran is home to one of the world's oldest civilizations, beginning with the formation of the Elamite kingdoms in the fourth millennium BC. It was first unified by the Iranian Medes in the seventh century BC, and reached its territorial height in the sixth century BC, when Cyrus the Great founded the Achaemenid Empire, which became one of the largest empires in history and the world's first superpower. The empire fell to Alexander the Great in the fourth century BC and was divided into several Hellenistic states. An Iranian rebellion established the Parthian Empire in the third century BC, which was succeeded in the third century AD by the Sasanian Empire, a major world power for the next four centuries. Arab Muslims conquered the empire in the seventh century AD, which led to the Islamization of Iran. It subsequently becoming a major center of Islamic culture and learning, with its art, literature, philosophy, and architecture spreading across the Muslim world and beyond during the Islamic Golden Age. Over the next two centuries, a series of native Muslim dynasties emerged before the Seljuq Turks and the Mongols conquered the region. In the 15th century, the native Safavids re-established a unified Iranian state and national identity and converted the country to Shia Islam. Under the reign of Nader Shah in the 18th century, Iran once again became a major world power, though by the 19th century a series of conflicts with Russia led to significant territorial losses. The early 20th century saw the Persian Constitutional Revolution. Efforts to nationalize its fossil fuel supply from Western companies led to an Anglo-American coup in 1953, which resulted in greater autocratic rule under Mohammad Reza Pahlavi and growing Western political influence. He went on to launch a far-reaching series of reforms in 1963. After the Iranian Revolution, the current Islamic Republic was established in 1979 by Ruhollah Khomeini, who became the country's first Supreme Leader.\nThe Government of Iran is an Islamic theocracy which includes elements of a presidential democracy, with the ultimate authority vested in an autocratic \"Supreme Leader\", a position held by Ali Khamenei since Khomeini's death in 1989. The Iranian government is widely considered to be authoritarian, and has attracted widespread criticism for its significant constraints and abuses against human rights and civil liberties, including several violent suppressions of mass protests, unfair elections, and limited rights for women and children.\nIran is a regional and middle power, with a geopolitically strategic location in the Asian continent. It is a founding member of the United Nations, the ECO, the OIC, and the OPEC. It has large reserves of fossil fuels—including the world's second-largest natural gas supply and the fourth-largest proven oil reserves. The country's rich cultural legacy is reflected in part by its 22 UNESCO World Heritage Sites. Historically a multinational state, Iran remains a pluralistic society comprising numerous ethnic, linguistic, and religious groups, the largest being Persians, Azeris, Kurds, Mazandaranis and Lurs."