"George Washington (February 22, 1732 – December 14, 1799) was an American political leader, military general, statesman, and Founding Father of the United States, who served as the first president of the United States from 1789 to 1797. Washington led the Patriot forces to victory in the American Revolutionary War, and presided at the Constitutional Convention of 1787, which established the Constitution of the United States and a federal government for the United States. Washington has been called the \"Father of the Nation\" for his manifold leadership in the formative days of the country.\nWashington's first public office was serving as official Surveyor of Culpeper County, Virginia from 1749 to 1750. Subsequently, he received his initial military training (as well as a command with the Virginia Regiment) during the French and Indian War. He was later elected to the Virginia House of Burgesses and was named a delegate to the Continental Congress. Here he was appointed Commanding General of the Continental Army. With this title, he commanded American forces (allied with France) in the defeat and surrender of the British at the Siege of Yorktown during the American Revolutionary War. He resigned his commission after the Treaty of Paris was signed in 1783.\nWashington played an indispensable role in adopting and ratifying the Constitution of the United States. He was then twice elected president by the Electoral College. He implemented a strong, well-financed national government while remaining impartial in a fierce rivalry between cabinet members Thomas Jefferson and Alexander Hamilton. During the French Revolution, he proclaimed a policy of neutrality while sanctioning the Jay Treaty. He set enduring precedents for the office of president, including the title \"Mr. President\", and his Farewell Address is widely regarded as a pre-eminent statement on republicanism.\nWashington owned slaves, and, to preserve national unity, he supported measures passed by Congress to protect slavery. He later became troubled with the institution of slavery and freed his slaves in a 1799 will. He endeavored to assimilate Native Americans into the Anglo-American culture but combated indigenous resistance during instances of violent conflict. He was a member of the Anglican Church and the Freemasons, and he urged broad religious freedom in his roles as general and president. Upon his death, he was eulogized as \"first in war, first in peace, and first in the hearts of his countrymen\". He has been memorialized by monuments, art, geographical locations, including the national capital, stamps, and currency, and many scholars and polls rank him among the greatest U.S. presidents. On March 13, 1978, Washington was militarily ranked General of the Armies, an honor that has only been awarded twice in the history of the United States."