"The Royal Albert Hall is a concert hall on the northern edge of South Kensington, London. One of the United Kingdom's most treasured and distinctive buildings, it is held in trust for the nation and managed by a registered charity (which receives no government funding). It can seat 5,272.Since the hall's opening by Queen Victoria in 1871, the world's leading artists from many performance genres have appeared on its stage. It is the venue for the Proms concerts, which have been held there every summer since 1941. It is host to more than 390 shows in the main auditorium annually, including classical, rock and pop concerts, ballet, opera, film screenings with live orchestral accompaniment, sports, awards ceremonies, school and community events, and charity performances and banquets. A further 400 events are held each year in the non-auditorium spaces.\nThe hall was originally supposed to have been called the Central Hall of Arts and Sciences, but the name was changed to the Royal Albert Hall of Arts and Sciences by Queen Victoria upon laying the Hall's foundation stone in 1867, in memory of her husband, Prince Albert, who had died six years earlier. It forms the practical part of a memorial to the Prince Consort; the decorative part is the Albert Memorial directly to the north in Kensington Gardens, now separated from the Hall by Kensington Gore.\n\n\n== History ==\n\n\n=== 1800s ===\nIn 1851 the Great Exhibition, organised by Prince Albert, the Prince Consort, was held in Hyde Park, London. The Exhibition was a success and led Prince Albert to propose the creation of a group of permanent facilities for the public benefit, which came to be known as Albertopolis. The Exhibition's Royal Commission bought Gore House, but it was slow to act, and in 1861 Prince Albert died without having seen his ideas come to fruition. However, a memorial was proposed for Hyde Park, with a Great Hall opposite.The proposal was approved, and the site was purchased with some of the profits from the Exhibition. The Hall was designed by civil engineers Captain Francis Fowke and Major-General Henry Y. D. Scott of the Royal Engineers and built by Lucas Brothers. The designers were heavily influenced by ancient amphitheatres but had also been exposed to the ideas of Gottfried Semper while he was working at the South Kensington Museum. The recently opened Cirque d'Hiver in Paris was seen in the contemporary press as the design to outdo. The Hall was constructed mainly of Fareham Red brick, with terra cotta block decoration made by Gibbs and Canning Limited of Tamworth.The dome (designed by Rowland Mason Ordish) was made of wrought iron and glazed. There was a trial assembly of the dome's iron framework in Manchester; then it was taken apart again and transported to London by horse and cart. When the time came for the supporting structure to be removed from the dome after reassembly in situ, only volunteers remained on site in case the structure collapsed. It did drop – but only by five-sixteenths of an inch (7.9 mm). The Hall was scheduled to be completed by Christmas Day 1870, and the Queen visited a few weeks beforehand to inspect.\n\nThe official opening ceremony of the Hall was on 29 March 1871. This had originally been scheduled for 1 May, the twentieth anniversary of the opening of the Great Exhibition, but was brought forward at the request of Queen Victoria. A welcoming speech was given by Edward, the Prince of Wales because the Queen was too overcome to speak; \"her only recorded comment on the Hall was that it reminded her of the British constitution\".In the concert that followed, the Hall's acoustic problems immediately became apparent. Engineers first tried to remove the strong echo by suspending a canvas awning below the dome. This helped and also sheltered concert-goers from the sun, but the problem was not solved: it used to be jokingly said the Hall was \"the only place where a British composer could be sure of hearing his work twice\".In July 1871, French organist Camille Saint-Saëns performed Church Scene from Faust by Charles Gounod; The Orchestra described his performance as \"an exceptional and distinguished performer ... the effect was most marvellous.\"Initially lit by gas, the Hall contained a special system by which thousands of gas jets were lit within ten seconds. Though it was demonstrated as early as 1873 in the Hall, full electric lighting was not installed until 1888. During an early trial when a partial installation was made, one disgruntled patron wrote to The Times, declaring it to be \"a very ghastly and unpleasant innovation\".In May 1877, Richard Wagner himself conducted the first half of each of the eight concerts which made up the Grand Wagner Festival. After his turn with the baton, he handed it over to conductor Hans Richter and sat in a large armchair on the corner of the stage for the rest of each concert. Wagner's wife Cosima, the daughter of Hungarian virtuoso pianist and composer Franz Liszt, was among the audience.The Wine Society was founded at the Hall on 4 August 1874, after large quantities of cask wine were found in the cellars. A series of lunches were held to publicise the wines, and General Henry Scott proposed a co-operative company to buy and sell wines.\n\n\n=== 1900s ===\n\nIn 1906 Elsie Fogerty founded the Central School of Speech and Drama at the Hall, using its West Theatre, now the Elgar Room, as the school's theatre. The school moved to Swiss Cottage in north London in 1957. Whilst the school was based at the Royal Albert Hall, students who graduated from its classes included Judi Dench, Vanessa Redgrave, Lynn Redgrave, Harold Pinter, Laurence Olivier and Peggy Ashcroft.In 1911 Russian pianist and composer Sergei Rachmaninoff performed as a part of the London Ballad Concert. The recital included his 'Prelude in C-sharp minor' and 'Elegie in E-flat minor' (both from Morceaux de Fantaisie).In 1933 German physicist Albert Einstein led the 'Einstein Meeting' at the hall for the Council for Assisting Refugee Academics, a British charity.In 1936, the Hall was the scene of a giant rally celebrating the British Empire on the occasion of the centenary of Joseph Chamberlain's birth. In October 1942, the Hall suffered minor damage during World War II bombing, but in general was left mostly untouched as German pilots used the distinctive structure as a landmark.In 1949 the canvas awning was removed and replaced with fluted aluminium panels below the glass roof, in a new attempt to cure the echo; but the acoustics were not properly tackled until 1969 when large fibreglass acoustic diffusing discs (commonly referred to as \"mushrooms\" or \"flying saucers\") were installed below the ceiling. In 1968, the Hall hosted the Eurovision Song Contest 1968 and from 1969–1988 the Miss World contest was staged in the venue. In 1995, Greek keyboardist Yanni performed a concert there for his World Tour; the concert was recorded under the name of Live at Royal Albert Hall\nFrom 1996 until 2004, the Hall underwent a programme of renovation and development supported by a £20 million grant from the Heritage Lottery Fund and £20m from Arts Council England to enable it to meet the demands of the next century of events and performances. Thirty \"discreet projects\" were designed and supervised by the architecture and engineering firm BDP without disrupting events. These projects included improved ventilation to the auditorium, more bars and restaurants, improved seating, better technical facilities, and improved backstage areas. Internally, the Circle seating was rebuilt during June 1996 to provide more legroom, better access, and improved sightlines.\n\n\n=== 2000s ===\nThe largest project of the ongoing renovation and development was the building of a new south porch – door 12, accommodating a first-floor restaurant, new ground floor box office and subterranean loading bay. Although the exterior of the building was largely unchanged, the south steps leading down to Prince Consort Road were demolished to allow construction of underground vehicle access and a loading bay with accommodation for three HGVs carrying all the equipment brought by shows. The steps were then reconstructed around a new south porch, named The Meitar Foyer after a significant donation from Mr & Mrs Meitar. The porch was built on a similar scale and style to the three pre-existing porches at Door 3, 6 and 9: these works were undertaken by Taylor Woodrow Construction. The original steps featured in the early scenes of the 1965 film The Ipcress File. On 4 June 2004, the project received the Europa Nostra Award for remarkable achievement. The East (Door 3) and West (Door 9) porches were glazed and new bars opened along with ramps to improve disabled access. The Stalls were rebuilt in a four-week period in 2000 using steel supports allowing more space underneath for two new bars; 1,534 unique pivoting seats were laid – with an addition of 180 prime seats. The Choirs were rebuilt at the same time. The whole building was redecorated in a style that reinforces its Victorian identity. 43,000 sq ft (4,000 m2) of new carpets were laid in the rooms, stairs, and corridors – specially woven with a border that follows the oval curve of the building.Between 2002 and 2004, there was a major rebuilding of the great organ (known as the Voice of Jupiter), built by \"Father\" Henry Willis in 1871 and rebuilt by Harrison & Harrison in 1924 and 1933. The rebuilding was performed by Mander Organs, and it is now the second-largest pipe organ in the British Isles with 9,999 pipes in 147 stops. The largest is the Grand Organ in Liverpool Cathedral which has 10,268 pipes.During the first half of 2011, changes were made to the backstage areas to relocate and increase the size of crew catering areas under the South Steps away from the stage and create additional dressing rooms nearer to the stage.\n\nFrom January to May 2013, the Box Office area at Door 12 underwent further modernisation to include a new Café Bar on the ground floor, a new Box Office with shop counters and additional toilets. The design and construction were carried out by contractor 8Build. Upon opening it was renamed 'The Zvi and Ofra Meitar Porch and Foyer.' owing to a large donation from the couple.In Autumn 2013, work began on replacing the Victorian steam heating system over three years and improving and cooling across the building. This work followed the summer Proms season during which temperatures were unusually high.In 2017 work began on a two-story 11,000-square-foot (1,000 m2) basement extension for use as backstage and archival space to the south-west quadrant of the building. The project is nicknamed the \"Great Excavation\", in reference to the Great Exhibition of 1851, and was planned to be complete for the Halls 150th anniversary in 2021.Due to the outbreak of the Covid-19 pandemic in 2020, restrictions meant the Hall was closed for the first time since the Second World War. During winter 2020 it reopened for three socially distanced performances but was later closed for a second period.\n\n\n== Design ==\n\nThe Hall, a Grade I listed building, is an ellipse in plan, with its external major and minor axis of 272 and 236 feet (83 and 72 meters), and its internal minor and major axis of 185 and 219 feet (56 and 67 m). The great glass and wrought-iron dome roofing the Hall is 135 ft (41 m) high. The Hall was originally designed with a capacity for 8,000 people and has accommodated as many as 12,000 (although present-day safety restrictions mean the maximum permitted capacity is now 5,272 including standing in the Gallery).\nAround the outside of the building is 800-foot–long terracotta mosaic frieze, depicting \"The Triumph of Arts and Sciences\", in reference to the Hall's dedication. Proceeding anti-clockwise from the north side the sixteen subjects of the frieze are:\n\nVarious Countries of the World bringing in their Offerings to the Exhibition of 1851\nMusic\nSculpture\nPainting\nPrinces, Art Patrons and Artists\nWorkers in Stone\nWorkers in Wood and Brick\nArchitecture\nThe Infancy of the Arts and Sciences\nAgriculture\nHorticulture and Land Surveying\nAstronomy and Navigation\nA Group of Philosophers, Sages and Students\nEngineering\nThe Mechanical Powers\nPottery and Glassmaking\nAbove the frieze is an inscription in 12-inch-high (30 cm) terracotta letters that combine historical fact and Biblical quotations: This hall was erected for the advancement of the arts and sciences and works of industry of all nations in fulfilment of the intention of Albert Prince Consort. The site was purchased with the proceeds of the Great Exhibition of the year MDCCCLI. The first stone of the Hall was laid by Her Majesty Queen Victoria on the twentieth day of May MDCCCLXVII and it was opened by Her Majesty the Twenty Ninth of March in the year MDCCCLXXI. Thine O Lord is the greatness and the power and the glory and the victory and the majesty. For all that is in the heaven and in the earth is Thine. The wise and their works are in the hand of God. Glory be to God on high and on earth peace.\nBelow the Arena floor there is room for two 4000 gallon water tanks, which are used for shows that flood the arena like Madame Butterfly.\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\n== Events ==\n\nThe Hall has been affectionately titled \"The Nation's Village Hall\". The first concert was Arthur Sullivan's cantata On Shore and Sea, performed on 1 May 1871.Many events are promoted by the Hall, whilst since the early 1970s promoter Raymond Gubbay has brought a range of events to the Hall including opera, ballet and classical music. Some events include classical and rock concerts, conferences, banquets, ballroom dancing, poetry recitals, educational talks, motor shows, ballet, opera, film screenings and circus shows. It has hosted many sporting events, including boxing, squash, table tennis, basketball, wrestling including the first sumo wrestling tournament to be held in London as well as UFC 38 (the first UFC event to be held in the UK), tennis, and even a marathon. The hall first hosted boxing in 1918, when it hosted a tournament between British and American servicemen. There was a colour bar in place at the Hall, preventing black boxers from fighting there, between 1923 and 1932. Greats of British boxing such as Frank Bruno, Prince Naseem Hamed, Henry Cooper and Lennox Lewis have all appeared at the venue. The hall's storied boxing history was halted in 1999 when a court ordered that boxing and wrestling matches could no longer be held at the venue. In 2011 that decision was overturned. In 2019 Nicola Adams won the WBO Flyweight title which was the first fight for a world title at the venue since Marco Antonio Barrera took on Paul Lloyd in 1999.\n\nOn 6 April 1968, the Hall hosted the Eurovision Song Contest which was broadcast in colour for the first time. The first Miss World contest broadcast in colour was also staged at the venue in 1969 and remained at the Hall every year until 1989.\nOne notable event was a Pink Floyd concert held 26 June 1969, the night they were banned from ever playing at the Hall again after shooting cannons, nailing things to the stage, and having a man in a gorilla suit roam the audience. At one point, Rick Wright went to the pipe organ and began to play \"The End of the Beginning\", the final part of \"Saucerful of Secrets\", joined by the brass section of the Royal Philharmonic Orchestra (led by the conductor, Norman Smith) and the ladies of the Ealing Central Amateur Choir. A portion of the pipe organ recording is included on Pink Floyd's album The Endless River.\n\nOn 18 June 1985, British gothic rock band The Sisters of Mercy recorded their live video album Wake at the Hall. Between 1996 and 2008, the Hall hosted the annual National Television Awards all of which were hosted by Sir Trevor McDonald.\nBenefit concerts include the 1997 Music for Montserrat concert, arranged and produced by George Martin, an event which featured artists such as Phil Collins, Mark Knopfler, Sting, Elton John, Eric Clapton, and Paul McCartney, and 2012 Sunflower Jam charity concert with Queen guitarist Brian May performing alongside bassist John Paul Jones of Led Zeppelin, drummer Ian Paice of Deep Purple, and vocalists Bruce Dickinson of Iron Maiden, and Alice Cooper.In 2006, Pink Floyd guitarist David Gilmour performed at the Hall for the first time since Pink Floyd's 1969 ban. He performed at the Hall as part of his On an Island Tour. The shows were filmed and used for the live video release, Remember That Night (2007). Rock band The Killers recorded their first live album, Live from the Royal Albert Hall in July 2009.\n\nOn 5 April 2010, Swedish progressive metal band Opeth recorded In Live Concert at the Royal Albert Hall, as they became the first death metal band to ever perform at the Hall. The concert was part of the band's Evolution XX: An Opeth Anthology tour, made in celebration of their 20th anniversary.On 30 June, 2 & 3 July 2011, Janet Jackson performed three sold out shows as part of her Number Ones, Up Close and Personal World TourOn 2 October 2011, the Hall staged the 25th-anniversary performance of Andrew Lloyd Webber's The Phantom of the Opera, which was broadcast live to cinemas across the world and filmed for DVD. Lloyd Webber, the original London cast including Sarah Brightman and Michael Crawford, and four previous actors of the titular character, among others, were in attendance – Brightman and the previous Phantoms (aside from Crawford) performed an encore.On 22 September 2011, Adele performed a one-night-only concert as part of her tour. The concert was filmed for DVD and screened at cinemas in 26 cities around the world. Her performance debuted at number one in the United States with 96,000 copies sold, the highest one-week tally for a music DVD in four years. After one week, it became the best-selling music DVD of 2011. As of 28 November 2012, it had surpassed sales of one million copies in the United States and sales of three million copies worldwide and makes the first music DVD to surpass sales of one million in the USA since Eagles' Farewell 1 Tour-Live from Melbourne in 2005 (Garth Brooks' The Ultimate Hits sold one million copies in 2007, but was a CD/DVD combination). The live version of \"Set Fire to the Rain\" taken from her performance won the Grammy Award for Best Pop Solo Performance at the 55th Annual Grammy Awards in 2013.On 24 September 2012, Classic FM celebrated the 20th anniversary of their launch with a concert at the Hall. The program featured live performances of works by Handel, Puccini, Rachmaninoff, Parry, Vaughan Williams, Tchaikovsky and Karl Jenkins who conducted his piece The Benedictus from The Armed Man in person.\n\nOn 19 November 2012, the Hall hosted the 100th-anniversary performance of the Royal Variety Performance, attended by the HM Queen Elizabeth II and HRH Duke of Edinburgh, with boy-band One Direction among the performers.During his Rattle That Lock Tour, David Gilmour performed at the Royal Albert Hall eleven times between September 2015 and September 2016, once in aid of Teenage Cancer Trust. On 13 November 2015, Canadian musician Devin Townsend recorded his second live album Ziltoid Live at the Royal Albert Hall.\n\nKylie Minogue performed at the Royal Albert Hall on 11 December 2015 and 9–10 December 2016 as part of her \"A Kylie Christmas\" concert series. A live video release of the 11 December 2015 date was released via iTunes and Apple Music on 25 November 2016.On 3 May 2016, singer-songwriter and Soundgarden vocalist Chris Cornell played at the hall what would become the last UK show of his life as part of his \"Higher Truth\" European tour. Cornell performed stripped-back acoustic renditions from his back-catalogue to rave reviews, including songs from the likes of Soundgarden, Temple of the Dog, Audioslave and his solo work. Cornell died on 18 May 2017.On 22 April 2016, British rock band Bring Me the Horizon performed and recorded their Live at the Royal Albert Hall album, with accompaniment from the Parallax Orchestra conducted by Simon Dobson. The Album later released on 2 December 2016 through crowdfunding platform PledgeMusic where all proceeds would be donated to Teenage Cancer Trust.At a press conference held at the Hall in October 2016, Phil Collins announced his return to live performing with his Not Dead Yet Tour, which began in June 2017. The tour included five nights at the Hall which sold out in fifteen seconds. In October 2017, American rock band Alter Bridge also recorded a live album accompanied by the Parallax Orchestra with Simon Dobson. The album and DVD were released in September of the following year. A portion of the proceeds from the sales were donated to the Future Song Foundation.\n\nAlso in 2017, the Hall hosted the 70th British Academy Film Awards, often referred to as the BAFTAs, for the first time in 20 years, replacing the Royal Opera House at which the event had been held since 2008.In 2018, WWE held its second United Kingdom Championship Tournament on 18 and 19 June. In the same year, the world premiere of PlayStation in Concert was organised at the Hall and it featured PlayStation game music from the 1990s up until then. It was arranged by Jim Fowler and performed by the Royal Philharmonic Orchestra.In May 2019, Mariah Carey performed 3 shows as part of her Caution World Tour. Comedian Bill Burr filmed his 2019 special Paper Tiger at the Hall.\nIn November 2020, One Direction member Niall Horan performed a one off live-streamed show in an empty Hall (during the COVID-19 pandemic) to raise money for charity.\n\n\n=== Regular events ===\n\n\n==== Royal Choral Society ====\nThe Royal Choral Society is the longest-running regular performance at the Hall, having given its first performance as the Royal Albert Hall Choral Society on 8 May 1872. From 1876, it established the annual Good Friday performance of Handel's Messiah.\n\n\n==== BBC Proms ====\n\nThe BBC Sir Henry Wood Promenade Concerts, known as \"The Proms\", is a popular annual eight-week summer season of daily classical music concerts and other events at the Hall. In 1942, following the destruction of the Queen's Hall in an air raid, the Hall was chosen as the new venue for the proms. In 1944 with increased danger to the Hall, part of the proms were held in the Bedford Corn Exchange. Following the end of World War II the proms continued in the Hall and have done so annually every summer since. The event was founded in 1895, and now each season consists of over 70 concerts, in addition to a series of events at other venues across the United Kingdom on the last night. In 2009, the total number of concerts reached 100 for the first time. Jiří Bělohlávek described The Proms as \"the world's largest and most democratic musical festival\" of all such events in the world of classical music festivals.Proms (short for promenade concerts) is a term which arose from the original practice of the audience promenading, or strolling, in some areas during the concert. Proms concert-goers, particularly those who stand, are sometimes described as \"Promenaders\", but are most commonly referred to as \"Prommers\".\n\n\n==== Tennis ====\nTennis was first played at the Hall in March 1970, and the ATP Champions Tour Masters has been played annually every December since 1997.\n\n\n==== Classical Spectacular ====\nClassical Spectacular, a Raymond Gubbay production, has been coming to the Hall since 1988. It combines popular classical music, lights and special effects.\n\n\n==== Cirque du Soleil ====\nCirque du Soleil has performed annually, with a show being staged every January since 2003. Cirque has had to adapt many of their touring shows to perform at the venue, modifying the set, usually built for arenas or big top tents instead. The following shows have played the RAH: Saltimbanco (1996, 1997 and 2003), Alegría (1998, 1999, 2006 and 2007), Dralion (2004 and 2005), Varekai (2008 and 2010), Quidam (2009 and 2014), Totem (2011, 2012 and 2019), Koozå (2013 and 2015), Amaluna (2016 and 2017), and most recently Luzia (2020). Amaluna's visit in 2016 marked Cirque's '20 years of Cirque at the Royal Albert Hall' celebration. Cirque's insect-themed show, OVO 2018.\n\n\n==== Classic Brit Awards ====\nSince 2000, the Classic Brit Awards has been hosted annually in May at the Hall. It is organised by the British Phonographic Industry.\n\n\n==== Festival of Remembrance ====\n\nThe Royal British Legion Festival of Remembrance is held annually the day before Remembrance Sunday.\n\n\n==== Institute of Directors ====\nFor 60 years the Institute of Directors' Annual Convention has been synonymous with the Hall, although in 2011 and 2012 it was held at indigO2.\n\n\n==== English National Ballet ====\nSince 1998 the English National Ballet has had several specially staged arena summer seasons in partnership with the Hall and Raymond Gubbay. These include Strictly Gershwin, June 2008 and 2011, Swan Lake, June 2002, 2004, 2007, 2010 and 2013, Romeo & Juliet (Deane), June 2001 and 2005, and The Sleeping Beauty, April – June 2000.\n\n\n==== Teenage Cancer Trust ====\n\nStarting in the year 2000 the Teenage Cancer Trust has held annual charity concerts (with the exception of 2001). They started as a one-off event but have expanded over the years to a week or more of evenings events. Roger Daltrey of the Who has been intimately involved with the planning of the events.\n\n\n==== Graduation ceremonies ====\nThe Hall is used annually by the neighbouring Imperial College London and the Royal College of Art for graduation ceremonies. For several years the University of London and Kingston University also held its graduation ceremonies at the Hall.\n\n\n==== Films, premières and live orchestra screenings ====\nThe venue has screened several films since the early silent days. It was the only London venue to show William Fox's The Queen of Sheba in the 1920s.\nThe Hall has hosted many premières, including the UK première of Fritz Lang's Die Nibelungen, 101 Dalmatians on 4 December 1996, the European première of Spandau Ballet's Soul Boys of the Western World and three James Bond royal world premières; Die Another Day on 18 November 2002 (attended by Queen Elizabeth II and Prince Philip), Skyfall on 23 October 2012 (attended by Charles, Prince of Wales and Camilla, Duchess of Cornwall) and Spectre on 26 October 2015 (attended by Prince William, Duke of Cambridge and Catherine, Duchess of Cambridge).The Hall held its first 3D world première of Titanic 3D, on 27 March 2012, with James Cameron and Kate Winslet in attendance.Since 2009, the Hall has also curated regular seasons of English-language film-and-live-orchestra screenings, including The Lord of the Rings trilogy, Gladiator, Star Trek, Star Trek Into Darkness, Interstellar, The Matrix, West Side Story, Breakfast at Tiffany's, Back to the Future, Jaws, Harry Potter and the Chamber of Secrets, and the world première of Titanic Live in Concert. The only non-English-language movie to have been screened at the Hall is Baahubali: The Beginning (an Indian movie in Telugu and Tamil, but premiered Hindi dubbed version).\nNational Brass Band Championships of Great Britain\nThe National Brass Band Championships of Great Britain, one of the most prestigious prizes in the annual brass band contesting calendar, holds the Final of the Championship section at the Royal Albert Hall each October\n\n\n==== Beyond the main stage ====\nThe Hall hosts hundreds of events and activities beyond its main auditorium.\nThere are regular free art exhibitions in the ground floor Amphi corridor, which can be viewed when attending events or on dedicated viewing dates.\nVisitors can take a guided tour of the Hall on most days. The most common is the one-hour Grand Tour which includes most front-of-house areas, the auditorium, the Gallery and the Royal Retiring Room. Other tours include Story of the Proms, Behind the Scenes, Inside Out and School tours.\nChildren's events include Storytelling and Music Sessions for ages four and under. These take place in the Door 9 Porch and Albert's Band sessions in the Elgar Room during school holidays.\n\"Live Music in Verdi\" takes place in the Italian restaurant on a Friday night featuring different artists each week.\n\"Late Night Jazz\" events in the Elgar Room, generally on a Thursday night, feature cabaret-style seating and a relaxed atmosphere with drinks available.\n\"Classical Coffee Mornings\" are held on Sundays in the Elgar Room with musicians from the Royal College of Music accompanied with drinks and pastries.\nSunday brunch events take place in Verdi Italian restaurant and feature different genres of music.\n\n\n=== Regular performers ===\n\nEric Clapton is a regular performer at the Hall. Since 1964, Clapton has performed at the Hall over 200 times, and has stated that performing at the venue is like \"playing in my front room\". In December 1964, Clapton made his first appearance at the Hall with the Yardbirds. It was also the venue for his band Cream's farewell concerts in 1968 and reunion shows in 2005. He also instigated the Concert for George, which was held at the Hall on 29 November 2002 to pay tribute to Clapton's lifelong friend, former Beatle George Harrison. Clapton passed 200 shows at the Hall in 2015.David Gilmour played at the Hall in support of two solo albums, while also releasing a live concert on September 2006 entitled Remember That Night which was recorded during his three nights playing at the Hall for his 2006 On an Island tour. Notable guests were Robert Wyatt and David Bowie (who sang lead for \"Arnold Layne\" and \"Comfortably Numb\"). The live concert was televised by BBC One on 9 September 2007 and again on 25 May.  Gilmour returned to the Hall for four nights in September 2016 (where he was joined in stage by Benedict Cumberbatch for \"Comfortably Numb\"), having previously played five nights in 2015, to end his 34-day Rattle That Lock Tour. He also made an appearance on 24 April 2016 as part of the Teenage Cancer Trust event.\nShirley Bassey is one of the Hall's most prolific female headline performers having appeared many times at the Hall since the 1970s. In 2001, she sang \"Happy Birthday\" for the Duke of Edinburgh's 80th birthday concert. In 2007, she sang at Fashion Rocks in aid of the Prince's Trust. On 30 March 2011, she sang at a gala celebrating the 80th birthday of Mikhail Gorbachev. In May 2011, she performed at the Classic Brit Awards, singing \"Goldfinger\" in tribute to the recently deceased composer John Barry. On 20 June 2011, she returned and sang \"Diamonds Are Forever\" and \"Goldfinger\", accompanied by the Royal Philharmonic Orchestra, as the climax to the memorial concert for Barry.James Last appeared 90 times at the Hall between 1973 and 2015, making him the most frequent non–British performer to have played the venue.\n\n\n== Education and outreach programme ==\nThe hall's education and outreach programme engages with more than 200,000 people a year. It includes workshops for local teenagers led by musicians such as Foals, Jake Bugg, Emeli Sandé, Nicola Benedetti, Alison Balsom and First Aid Kit, innovative science and maths lessons, visits to local residential homes from the venue's in-house group, Albert's Band, under the 'Songbook' banner, and the Friendship Matinee: an orchestral concert for community groups, with £5 admission.\n\n\n== Management ==\nThe Hall is managed day to day by the chief executive Craig Hassall and six senior executives. They are accountable to the Council of the Corporation, which is the Trustee body of the charity. The Council is composed of the annually elected president, currently Ian McCulloch, 18 elected Members (either corporate or individual seat owners) and five Appointed Members, one each from Imperial College London, Royal Commission for the Exhibition of 1851, Department for Culture, Media and Sport, British Museum of Natural History and the Royal College of Music.\n\n\n== Awards ==\nThe Hall has won several awards across different categories.\n\nFrom 1994 to 1998 and in 2003, the Hall won 'International Venue of the Year' in the Pollstar Awards.\nIn 2004 and 2005, the Hall won 'International Small Venue of the Year' in the Pollstar Awards.\nIn 2006 to 2010, the Hall won 'International Theatre of the Year' in the Pollstar Awards.\nThe Hall has won International Live Music Conference Award for 'First Venue to Come into Your Head' in 1998, 2009 and 2013.\nFrom 2008 to 2012, the Hall was voted Superbrands leading Leisure and Entertainment Destination.\nOn 17 October 2012, the Hall won 'London Live Music Venue of the Year' at the third annual London Lifestyle Awards.\nThe Hall won the Showcase Award for Teenage Cancer Trust and Event Space of the Year (non-Exhibition), both at the Event Awards 2010.\nThe Hall has been voted a CoolBrand from 2009 to 2013 in the 'Attractions & The Arts – general' category.\nIn 2010 and 2011, the Hall won 'Best Venue Teamwork Award' at the Live UK Summit.\nThe 'Life at the Hall blog won 'Best Venue Blog' at the Prestigious Star Awards in 2012 and the Prestigious Star Award Landmark in 2013.\n\n\n== Mislabellings ==\n\nA famous and widely bootlegged concert by Bob Dylan at the Free Trade Hall in Manchester on 17 May 1966 was mistakenly labelled the \"Royal Albert Hall Concert\". In 1998, Columbia Records released an official recording, The Bootleg Series Vol. 4: Bob Dylan Live 1966, The \"Royal Albert Hall\" Concert, that maintains the erroneous title but does include details of the actual location. Recordings from the Royal Albert Hall concerts on 26–27 May 1966 were finally released by the artist in 2016 as The Real Royal Albert Hall 1966 Concert.\nAnother concert mislabelled as being at the Hall was by Creedence Clearwater Revival. An album by them titled The Royal Albert Hall Concert was released in 1980. When Fantasy Records discovered the show on the album actually took place at the Oakland Coliseum, it retitled the album The Concert.\n\n\n== Pop culture references ==\n\nA large mural by Peter Blake, titled Appearing at the Royal Albert Hall, is displayed in the Hall's Café Bar. Unveiled in April 2014, it shows more than 400 famous figures who have appeared on the stage.In 1955, English film director Alfred Hitchcock filmed the climax of The Man Who Knew Too Much at the Hall. The 15-minute sequence featured James Stewart, Doris Day and composer Bernard Herrmann, and was filmed partly in the Queen's Box. Hitchcock was a long-time patron of the Hall and had already set the finale of his 1927 film, The Ring at the venue, as well as his initial version of The Man Who Knew Too Much, starring Leslie Banks, Edna Best and Peter Lorre.Other notable films shot at the Hall include Major Barbara, Love Story, The Seventh Veil, The Ipcress File, A Touch of Class, Shine, and Spice World.\nIn the song \"A Day in the Life\" by the Beatles, the Albert Hall is mentioned. The verse goes as follows:\n\nThe song \"Session Man\" by The Kinks references the Hall:\n\nIn the song \"Shame\" by Robbie Williams and Gary Barlow, Barlow mentions the Hall in his verse:\n\nI read your mind and tried to call, my tears could fill the Albert Hall.\nIn some variants of \"Hitler Has Only Got One Ball\", Hitler's second testicle is mentioned as being in the Hall.\n\n\n== Transport links ==\n\n\n== See also ==\nAlbertopolis\nThe Great Exhibition\nExhibition Road\nPrince Albert\nList of concert halls\nList of tallest domes\n\n\n== References ==\n\n\n== External links ==\nOfficial site with timeline\nRead a detailed historical record about the Hall\nArchitecture of the Hall from the Royal Institute of British Architects\nRoyal Albert Hall at Structurae\nRoyal Albert Hall Survey of London entry\nAlbert Hall (Victorian London)"