"Experimental luthiers are luthiers who take part in alternative stringed instrument manufacturing (such as the guitar or violin) or create original string instruments altogether.\n\n\n== Plucked instruments ==\nIn the experimental rock and free jazz scenes, some guitarists modified their instruments in the manner of John Cage's prepared piano. Keith Rowe and Fred Frith became known for playing these prepared guitars. The latter also crafted experimental table string instruments. In the early 1980s, Glenn Branca started building his own electric string instruments, called \"mallet guitars,\" based on the harmonic canons of Harry Partch. Around the same time, Hans Reichel built several 3rd bridge guitars before he invented his daxophone, which he is known for. Bradford Reed developed his Pencilina in the mid-1980s. The Whamola, based on the Washtub bass, was developed in the nineties and became famous largely because it was used by Les Claypool.\nIn recent years, multiscale or fanned frets guitars and basses have started to emerge, as manufactured by Novax Guitars, Ormsby Guitars, and others. These instruments are supposed to offer an advantage over the classical fixed-scale guitars and basses by providing more freedom in setting the tension of each string at the design and manufacturing phases. This may produce a more uniform tension of the strings, and timbre and tonal characteristics differing from the usual fixed-scale instruments.\nIn the 1980s, Canadian luthier Linda Manzer created the Pikasso guitar, a 42-string guitar with three necks. It was popularized by jazz guitarist Pat Metheny, who used it on the song \"Into the Dream\" and on several albums. Its name is ostensibly derived from its likeness in appearance to the cubist works of Pablo Picasso. \nThe Gittler guitar is an experimental designed guitar created by Allan Gittler (1928–2003), who proposed that \"sentimental\" design references to acoustic guitars are unnecessary in an electronically amplified guitar, and designed his instrument with the objective of reducing the electric guitar to the most minimal functional form possible. He made 60 guitars in New York from the mid-1970s to early 1980s.\nIn 2003, the Tritare was created by Samuel Gaudet and Claude Gauthier in Canada.In 2006, Yuri Landman built his Moodswinger for the band Liars and afterward made a large series of alternative string instruments, such as the Moonlander for Sonic Youth's Lee Ranaldo, the Springtime for Blood Red Shoes, and the Tafelberg drum guitar for The Dodos and others. \nMicachu made a few string instruments of which one is called the \"Chu.\" One of the strings of the Chu carries a large series of small rings and sounds like a snare drum when plucked.\nLes Luthiers builds home made absurd comedic instruments and plays them in their presentations.\n\n\n== Bowed instruments ==\nThe bazantar, invented by musician Mark Deutsch, is a five-string double bass with 29 sympathetic and 4 drone strings and has a melodic range of five octaves.\nThe Japanese multiinstrumentalist and experimental musical instrument builder Yuichi Onoue developed a hurdy-gurdy, similar to a fretless violin but with only two strings, called the kaisatsuko, and a deeply scalloped electric guitar for microtonal playing techniques.\n\n\n== Other ==\nThe most well-known example of a multistringed tapped instrument is probably the Chapman Stick, developed in the early 1970s by Emmett Chapman. The Warr Guitar and the Kelstone (from Belgium) are alternative instruments that also function on the same playing technique; that is, tapping on the strings with both hands. The Chapman Stick is tuned in perfect fourths and perfect fifths. \n\n\n== See also ==\nExperimental musical instrument\nNew Interfaces for Musical Expression\nElectric Guitar Design\nPrepared guitar\nTailed bridge guitar\n\n\n== Gallery ==\n\n\t\t\n\t\t\n\t\t\n\t\t\n\t\t\n\n\n== References ==\n\n\n== External links ==\nGuitar Bass"