"Nude psychotherapy is the use of non-sexual social nudity as an intentional means to improve the participant's psychological health.\nThe field began in the 1930s with psychological studies of the effects of social nudity on the lives of naturists. It developed in the 1960s along with the encounter group movement as a way to challenge preconceptions and promote intimacy and trust, but suffered a decline in the 1980s. It is still used by some organizations that offer participatory workshops on intimacy, sex and love.\n\n\n== Origins ==\nIn 1932 a Princeton psychologist Howard Warren, who was president of the American Psychological Association, spent a week at a German nudist camp. A year later, he published a paper entitled Social Nudism and the Body Taboo, which was a largely sympathetic consideration of the social and psychological significance of nudism. Warren described nudism in therapeutic terms, pointing out its 'easy camaraderie' and lack of 'self-consciousness' . He noted an 'improvement in general health' among participants.  Other psychologists published further papers on the effect of nudity in the 1940s and 1950s.\n\n\n=== 1960s ===\nIn 1967, a group psychotherapist in California, Paul Bindrim, noticed that towards the end of a long period of group psychotherapy called a \"marathon\", the participants would be sufficiently open and trusting of each other to feel comfortable enough to be spontaneously naked in each other's company. Bindrim theorized that intentionally introducing nudity in the early stages of a group might accelerate the process of mutual trust and emotional openness. Bindrim corresponded with Abraham Maslow on the subject of nude psychotherapy groups, which Maslow, who was then-president of the American Psychological Association, supported. Maslow supported the idea stating he saw the social taboo on nudity to be a matter of custom rather than of any ethical or moral importance. Maslow warned that he thought discretion, sensitivity and caution would have to be present in any execution of the idea. Maslow later cautioned that the sensation of nudity and sensual pleasure should not be mistaken by participants for the genuine achievement of a psychological \"high\" and feared it might impede the development of real empathy between individuals.In 1967, Bindrim conducted his first nude workshop in Deer Park, California. There were typically 15 to 25 participants. Bindrim developed his nude encounter marathons into a weekend workshop using nudity and swimming pools, which was recorded in the 1971 documentary film entitled Out of Touch by the Canadian Film Board and produced by Bindrim. The American Psychological Association's Ethics Committee launched an investigation of Bindrim, reportedly prompted by conservative politicians. However,  due to the cultural climate of the late 1960s and the fact that the nudity was consensual, the  investigation was later dropped. Bindrim became increasingly sensitive to the public relations obstacle posed by the phrase \"nude psychotherapy\" causing him recast his approach and by the late 1970s his promotional materials made only a passing reference to nudity. With the change in psychotherapeutic fashion as the 1970s progressed, the decision was eventually made to remove the emphasis on nudity altogether. Other contemporary researchers found that social nudity is not the sexually-charged practice that convention imagines it to be.\n\n\n== Today ==\nThe Human Awareness Institute, an organization that offers participatory workshops on intimacy, sex and love continues to conduct group sessions in which the participants have the option to be naked.\n\n\n== Notes ==\n\n\n== References ==\n\n\n== External links ==\nBaring The Soul: Paul Bindrim, Abraham Maslow and 'Nude Psychotherapy'  by Ian Nicholson - full text, pdf"