"Flattus Maximus is the name of a character and former guitarist in the American heavy metal band Gwar. He is known for his red face, white dreadlocks, dinosaur-head shoulder pads and reptile feet. The name \"Flattus\" is indicative of the character's signature flatuence. His speaking mannerisms suggest a childlike intelligence and naivety.\nThe role of Flattus Maximus was played by six different people before it was retired. Dewey Rowell was the first to take the role. A sculptor, Jeffrey Rumaner, nicknamed \"Stretch\" played Flattus in the scenes to the video \"Gor-Gor\". Pete Lee played him in This Toilet Earth. Tim Harriss portrayed him during the 1998 Halloween Tour and for the recording of We Kill Everything. Zach Blair took over the role in 1999 for the recording of Violence Has Arrived. Cory Smoot took over the role in 2002 and continued to portray the character until his death on November 3, 2011. After Smoot's death, the band made the decision to officially retire the character in his honor.\n\n\n== Gwar lore ==\nVery little about Flattus Maximus is explained in Gwar lore. Even his home planet is an uncertainty; in an interview conducted during a 1997 tour, Flattus (at the time portrayed by Pete Lee) explained his hazy memory was due to his notorious pot smoking, at which point he seemed to recall a planet named Pot (made entirely of cannabis) he once called home, but he ended up destroying it by smoking the entire planet out of existence.  Although his explanation was never officially set in stone, it's one of many theories as to where Flattus really originates from. What is apparent, though, is that he is illiterate, has a slight Southern accent, and that he attributes his \"explosive guitar style\" to a strict diet of vegetarians, which also causes his infamous atomic flatulence.\nFollowing Smoot's death in 2011, the band explained the character's absence by claiming that Flattus stole Gwar's spaceship in order to return to his home planet, Planet Home.\n\n\n== Flattus' history ==\nThe first man to portray the \"armored clown\" (taken from the pre-2005 web bio) was Dewey Rowell, who played on Hell-O and Scumdogs of the Universe. He left the band shortly after the \"Tour De Scum\" tape, and before America Must Be Destroyed, Gwar's third album, was recorded. Until mid-1992, after Gwar's Phallus In Wonderland was released, the Flattus Maximus character was absent. America Must Be Destroyed had all of its guitar parts (save two solos) played by Balsac the Jaws of Death. When playing those songs live, in particular \"The Road Behind\", it was typically Balsac, not Flattus, who played the lead.\nFor the filming of Phallus in Wonderland Jeffrey Rumaner, a sculptor friend of the band, who goes by the name of \"Stretch,\" played Flattus in the few scenes in which he was featured (the video for \"Gor-Gor\" features Stretch falling off of a building, and he plays piano in \"Have You Seen Me?\").\n\nAfter a mini-tour in early 1992, Peter Lee was hired, at the recommendation of Ministry guitarist Mike Scaccia, as the new guitarist (Scaccia had turned them down to continue working with Ministry - Scaccia and Lee were both in a band together, along with future Gwar bassist Casey Orr; it was Lee who enlisted Orr in 1994). He first played on This Toilet Earth. In 1993, Lee was shot in an attempted carjacking, and was unable to film much of \"Skulhedface\" due to injuries to his stomach. He did manage to film a commercial segment with Dave Brockie, where Lee first suggested the idea of police officers (both were dressed as policemen) playing rock music. This turned into Gwar's first true spin-off band, X-Cops. One music video from that period, \"Jack The World,\" features Lee as Flattus, and he is seen wearing a colostomy bag, which he also wore during a brief tour in October 1993. Lee played on the next two albums, RagNaRok and Carnival of Chaos, and was in the films from that time frame (1995-late 1997), \"Rendezvous With RagNaRok\" and \"Dawn of the Day of the Night of the Penguins.\" In the interview segments of \"Rendezvous...,\" Flattus is seen more than any other character (the others were a paranormal investigator played by Bob Gorman, Beefcake the Mighty, Balsac the Jaws of Death and Techno Destructo), and it is here where the childlike mannerisms truly surface. Lee left in December 1997, due to his recurring stomach problems stemming from the carjacking. His leaving of Gwar also forced the dissolution of the X-Cops.\nIn 1998, there again was no Flattus for some time. When Gwar's 1998 Halloween tour came around, Michael Bishop, who was filling in for Casey Orr as Beefcake, suggested Tim Harriss (who had previously played one Gwar show twelve years prior) of his band Kepone. Harriss would remain the Flattus character through the recording of We Kill Everything.\nIn 1999, after Orr returned, and before We Kill Everything was released, Gwar auditioned several guitarists for the role of Flattus Maximus. Zach Blair won the part, and became the reptilian cro-mag guitarist. He is seen in the film \"It's Sleazy,\" and the music video for \"Fuckin' An Animal,\" the last song on We Kill Everything. In 2001, Gwar, with Blair on guitar, recorded Violence Has Arrived, from which one music video, the concert favorite \"Immortal Corrupter,\" was recorded. However, Blair was not featured in the \"Immortal Corrupter\" video, and was replaced by Tim Harriss for the video shoot.  Blair, along with Casey Orr, left after the Blood Drive 2nd Campaign Tour (the second tour for Violence Has Arrived).\nIn September 2002, a new Flattus was needed, and Cory Smoot (Mensrea/Locus Factor), who had previously auditioned in 1999, was recruited. Smoot, being a talented producer, lent his technical skills to the recording of War Party, and co-produced, as well as co-mixed with Devin Townsend (Steve Vai/Strapping Young Lad) Gwar's 2006 release, titled Beyond Hell. The two albums were recorded at Karma Studios, owned and operated by Smoot. Smoot has been the longest running Flattus thus and is in the videos for \"War Party\", \"Bring Back The Bomb\", \"Womb With A View\", \"School's Out\" and \"Eighth Lock\". Smoot is considered by Gwar fans to be the \"True Flattus\", as he is the longest serving person to portray the character in Gwar history.  Smoot also produced the follow-up to Beyond Hell, Lust in Space, along with other members of Gwar, and even sang lead vocals on the track \"Release the Flies\".  Smoot's final Gwar album, Bloody Pit of Horror, features a 12-minute epic of four songs strung together, which was largely the brainchild of Smoot.  Originally he wrote the music for a solo project of his, but by the suggestion of Dave Brockie, it was reworked to become new Gwar material.\n\n\n== Death of Cory Smoot and retirement of Flattus ==\nOn November 3, 2011, hours after a performance at First Avenue in Minneapolis, Minnesota, Smoot was found dead by his fellow band members in the band's tour bus as they prepared to cross the border into Manitoba, Canada from North Dakota. A medical examiner concluded that Smoot died from \"coronary artery thrombosis brought about by his pre-existing coronary artery disease\". On November 4, Dave Brockie officially announced that the character of Flattus Maximus would be retired out of respect to Smoot.\n\n\n== Costume evolution ==\n\nFlattus began life with a helmet with large horns, dinosaur-skull shoulder pads, a painted red face and long dreadlocks. During the 1990 Tour De Scum, Flattus' helmet changed into something resembling the horns of a ram, but this was a short-lived change. Two of Flattus' three appearances in \"Phallus In Wonderland\" used his \"Scumdogs\" helmet (the second of the three, the video for \"Have You Seen Me?,\" has him wearing a tuxedo, and no armor whatsoever). The second incarnation did away with the helmet, and the shoulder pads were enlarged. By \"RagNaRok,\" the shoulder pads were brown dinosaur heads instead of skulls, and he had a tail and loincloth (scaly and brown). His face was still red, but was a mask, and his dreadlocks were shorter and stuck out like a palm tree. His shoulder pads changed slightly for \"Carnival of Chaos,\" and would be the last change until after \"We Kill Everything\" was recorded. \"We Kill Everything\" has a photo of Flattus (presumably Michael Derks in said costume), and he is more or less the same (it is the same costume), minus the tail and taller. Blair's Flattus is the most drastic change: the shoulder pads became green (with some exposed bone and muscle, but mostly scale), the tail reappears (for the \"WKE\" photo shoot, Derks did not wear one), and, like the feet, shoulder pads and loincloth, is green and scaly. The face is less comical, and more like a bulldog (still red, though). The dreadlocks are white, and at their shortest. In the \"Fuckin' An Animal\" video, Blair's Flattus costume featured a tail, though in subsequent tours and videos it did not. Smoot's changes to the costume (to coincide with War Party) were mostly in the face and hair. The face is larger and more distorted, and the dreadlocks are white and black, and are pulled back. They are also considerably longer than before. The tail is gone. The shoulderpads are a bit larger and longer, whereas Blair's were more compact.\nBeyond Hell-era Flattus has grey shoulderpads, green feet and a slightly redesigned face. The face closer depicts a Cro-Magnon (or Gwar's take on one), which fits Flattus' current description of himself (\"It is me Flattus Maximus your reptilian/cro-mag/alien of flatulance and fury.\" Taken from his Oct. 18, 2005 blog entry), as well as the pre-historic theme of the costume.\n\n\n== References ==\n\n\n== External links ==\nGwar Official Website"