"A carbon footprint is the total greenhouse gas (GHG) emissions caused by an individual, event, organization, service, or product, expressed as carbon dioxide equivalent. Greenhouse gases, including the carbon-containing gases carbon dioxide and methane, can be emitted through the burning of fossil fuels, land clearance and the production and consumption of food, manufactured goods, materials, wood, roads, buildings, transportation and other services. The term was popularized by a $250 million advertising campaign by the oil and gas company BP in an attempt to move public attention away from restricting the activities of fossil fuel companies and onto individual responsibility for solving climate change.In most cases, the total carbon footprint cannot be calculated exactly because of inadequate knowledge of and data about the complex interactions between contributing processes, including the influence of natural processes that store or release carbon dioxide. For this reason, Wright, Kemp, and Williams proposed the following definition of a carbon footprint:\n\nA measure of the total amount of carbon dioxide (CO2) and methane (CH4) emissions of a defined population, system or activity, considering all relevant sources, sinks and storage within the spatial and temporal boundary of the population, system or activity of interest. Calculated as carbon dioxide equivalent using the relevant 100-year global warming potential (GWP100).\nThe global average annual carbon footprint per person in 2014 was about 5 tonnes CO2eq.\n\n\n== Background ==\nHuman activities are one of the main causes of greenhouse gas emissions. These increase the earth's temperature and are emitted from fossil fuel usage in electricity and other byproducts of manufacturing. The major effects of such practices mainly consist of climate changes, such as extreme precipitation and acidification and warming of oceans. Climate change has been occurring since the start of the Industrial Revolution in the 1820s.  Due to humans' heavy reliance on fossil fuels, energy usage, and constant deforestation, the amount of greenhouse gas in the atmosphere is increasing, which makes reducing a greenhouse gas footprint harder to achieve. However, there are several ways to reduce one's greenhouse gas footprint, choosing more energy-efficient eating habits, using more energy efficient household appliances, increase usage of fuel efficient cars, and saving electricity.\n\nGreenhouse gases (GHGs) are gases that increase the temperature of the Earth due to their absorption of infrared radiation. Although some emissions are natural, the rate of which they are being produced has increased because of humans. These gases are emitted from fossil fuel usage in electricity, in heat and transportation, as well as being emitted as byproducts of manufacturing. The most common GHGs are carbon dioxide (CO2), methane (CH4), nitrous oxide (N2O), and many fluorinated gases. A greenhouse gas footprint is the numerical quantity of these gases that a single entity emits. The calculations can be computed ranging from a single person to the entire world.\n\n\n== Measuring carbon footprints ==\nAn individual's, nation's, or organization's carbon footprint can be measured by undertaking a GHG emissions assessment, a life cycle assessment, or other calculative activities denoted as carbon accounting. Once the size of a carbon footprint is known, a strategy can be devised to reduce it, for example, by technological developments, energy efficiency improvements, better process and product management, changed Green Public or Private Procurement (GPP), carbon capture, consumption strategies, carbon offsetting and others.For calculating personal carbon footprints, several free online carbon footprint calculators exist including a few supported by publicly available peer-reviewed data and calculations including the University of California, Berkeley's CoolClimate Network research consortium and CarbonStory. These websites ask you to answer more or less detailed questions about your diet, transportation choices, home size, shopping and recreational activities, usage of electricity, heating, and heavy appliances such as dryers and refrigerators, and so on. The website then estimates your carbon footprint based on your answers to these questions. A systematic literature review was conducted to objectively determine the best way to calculate individual/household carbon footprints. This review identified 13 calculation principles and subsequently used the same principles to evaluate the 15 most popular online carbon footprint calculators. A recent study's results by Carnegie Mellon's Christopher Weber found that the calculation of carbon footprints for products is often filled with large uncertainties. The variables of owning electronic goods such as the production, shipment, and previous technology used to make that product, can make it difficult to create an accurate carbon footprint. It is important to question, and address the accuracy of Carbon Footprint techniques, especially due to its overwhelming popularity.Calculating the carbon footprint of industry, product, or service is a complex task. One tool industry uses Life-cycle assessment (LCA), where carbon footprint may be one of many factors taken into consideration when assessing a product or service. The International Organization for Standardization has a standard called ISO 14040:2006 that has the framework for conducting an LCA study. ISO 14060 family of standards provides further sophisticated tools for quantifying, monitoring, reporting and validating or verifying of GHG emissions and removals. Another method is through the Greenhouse Gas Protocol, a set of standards for tracking greenhouse gas emissions (GHG) across scope 1, 2 and 3 emissions within the value chain.Predicting the carbon footprint of a process is also possible through estimations using the above standards. By using Emission intensities/Carbon intensities and the estimated annual use of fuel, chemical, or other inputs, the carbon footprint can be determined while a process is being planned/designed.\n\n\n=== Origin of the concept ===\nThe concept and name of the carbon footprint derive from the ecological footprint concept, which was developed by William E. Rees and Mathis Wackernagel in the 1990s. While carbon footprints are usually reported in tons of emissions (CO2-equivalent) per year, ecological footprints are usually reported in comparison to what the planet can renew. This assesses the number of \"earths\" that would be required if everyone on the planet consumed resources at the same level as the person calculating their ecological footprint. The carbon footprint is one part of the ecological footprint.  Carbon footprints are more focused than ecological footprints since they measure merely emissions of gases that cause climate change into the atmosphere.\nCarbon footprint is one of a family of footprint indicators, which also include ecological footprints, water footprints and land footprints.\nThe carbon part was popularized by a large campaign of BP in 2005, designed by Ogilvy . The deceptive PR campaign instructed individuals to calculate their personal footprints and provided ways for people to lower their own impact, while BP itself continued to extract just as much fossil fuels. The use of household carbon footprint calculators was called \"effective propaganda\" as strategic communication to shift responsibility of climate change-causing pollution away from the corporations and institutions that created a society where carbon emissions are unavoidable and onto personal lifestyle choices.\n\n\n=== Direct carbon emissions ===\nDirect or 'scope 1' carbon emissions come from sources that are directly from the site that is producing a product or delivering a service. An example for industry would be the emissions related to burning a fuel on site. On the individual level, emissions from personal vehicles or gas burning stoves would fall under scope 1.\n\n\n=== Indirect carbon emissions ===\n\nIndirect carbon emissions are emissions from sources upstream or downstream from the process being studied, also known as scope 2 or scope 3 emissions.Examples of upstream, indirect carbon emissions may include:\nTransportation of materials/fuels\nAny energy used outside of the production facility\nWastes produced outside of the production facilityExamples of downstream, indirect carbon emissions may include:\nAny end-of-life process or treatments\nProduct and waste transportation\nEmissions associated with selling the productScope 2 emissions are the other indirect related to purchased electricity, heat, and/or steam used on site. Scope 3 emissions are all other indirect emissions derived from the activities of an organisation but from sources which they do not own or control.\n\n\n=== Reporting ===\nIn the US, the EPA has broken down electricity emission factors by state.In the UK, DEFRA provides emission factors going back to 2002 covering scope 1, 2 and 3. DEFRA no longer provide international emission factors and refer visitors to the IEA who provide free highlights and paid for details covering Scope 1 and 2.\n\n\n== Reducing carbon footprints ==\n\n\n=== Ways to reduce personal carbon footprint ===\nA July 2017 study published in Environmental Research Letters found that the most significant way individuals could mitigate their own carbon footprint is to have one less child (\"an average for developed countries of 58.6 tonnes CO2-equivalent (tCO2e) emission reductions per year\"), followed by living car-free (2.4 tonnes CO2-equivalent per year), forgoing air travel (1.6 tonnes CO2-equivalent per trans-Atlantic trip) and adopting a plant-based diet (0.8 tonnes CO2-equivalent per year). The study also found that most government resources on climate change focus on actions that have a relatively modest effect on greenhouse gas emissions, and concludes that \"a US family who chooses to have one fewer child would provide the same level of emissions reductions as 684 teenagers who choose to adopt comprehensive recycling for the rest of their lives\".An option is to drive less. Walking, biking, carpooling, mass transportation and combining trips result in burning less fuel and releasing fewer emissions into the atmosphere.\nThe choice of diet is a major influence on a person's carbon footprint. Animal sources of protein (especially red meat), rice (typically produced in high methane-emitting paddies), foods transported long-distance or via fuel-inefficient transport (e.g., highly perishable produce flown long-distance) and heavily processed and packaged foods are among the major contributors to a high carbon diet. Scientists at the University of Chicago have estimated \"that the average American diet – which derives 28% of its calories from animal foods – is responsible for approximately one and a half more tonnes of greenhouse gasses – as CO2 equivalents – per person, per year than a fully plant-based, or vegan, diet.\" Their calculations suggest that even replacing one third of the animal protein in the average American's diet with plant protein (e.g., beans, grains) can reduce the diet's carbon footprint by half a tonne. Exchanging two-thirds of the animal protein with plant protein is roughly equivalent to switching from a Toyota Camry to a Prius. Finally, throwing food out not only adds its associated carbon emissions to a person or household's footprint, but it also adds the emissions of transporting the wasted food to the garbage dump and the emissions of food decomposition, mostly in the form of the highly potent greenhouse gas, methane.\nOptions to reduce the carbon footprint of humans include Reduce, Reuse, Recycle, Refuse. This can be done by using reusable items such as thermoses for daily coffee or plastic containers for water and other cold beverages rather than disposable ones. If that option isn't available, it is best to properly recycle the disposable items after use. When one household recycles at least half of their household waste, they can save 1.2 tons of carbon dioxide annually.Another option for reducing the carbon footprint of humans is to use less air conditioning and heating in the home. By adding insulation to the walls and attic of one's home, and installing weather stripping, or caulking around doors and windows one can lower their heating costs more than 25 percent. Similarly, one can very inexpensively upgrade the \"insulation\" (clothing) worn by residents of the home. For example, it's estimated that wearing a base layer of long underwear with top and bottom, made from a lightweight, super-insulating fabric like microfleece, can conserve as much body heat as a full set of clothing, allowing a person to remain warm with the thermostat lowered by over 5 °C. These measures all help because they reduce the amount of energy needed to heat and cool the house. One can also turn down the heat while sleeping at night or away during the day, and keep temperatures moderate at all times. Setting the thermostat just 2 degrees lower in winter and higher in summer could save about 1 ton of carbon dioxide each year.The carbon handprint movement emphasizes individual forms of carbon offsetting, like using more public transportation or planting trees in deforested regions, to reduce one's carbon footprint and increase their \"handprint.\" The Handprint is being used around the world to strengthen action towards the fulfillment of the UN Sustainable Development Goals.\n\n\n=== Ways to reduce industry's carbon footprint ===\nThe most powerful industrial climate actions are:\nrefrigerant management (90 billion tonnes of CO2e 2017–2050, since refrigerants have thousands of times the warming potential of CO2); land-based wind turbines for electricity (85 billion); reduced food waste (71 billion); and restoring tropical forests by ending use of the land for other purposes (61 billion). They calculate benefits cumulatively to 2050, rather than annually, because industrial actions have long lead times.A product, service, or company's carbon footprint can be affected by several factors including, but not limited to:\n\nEnergy sources\nOffsite electricity generation\nMaterialsThese factors can also change with location or industry. However, there are some general steps that can be taken to reduce carbon footprint on a larger scale.\nIn 2016, the EIA reported that in the US electricity is responsible for roughly 37% of Carbon Dioxide emissions, making it a potential target for reductions. Possibly the cheapest way to do this is through energy efficiency improvements. The ACEEE reported that energy efficiency has the potential to save the US over 800 billion kWh per year, based on 2015 data. Some potential options to increase energy efficiency include, but are not limited to:\nWaste heat recovery systems\nInsulation for large buildings and combustion chambers\nTechnology upgrades, ie different light sources, lower consumption machinesCarbon Footprints from energy consumption can be reduced through the development of alternative energy projects, such as solar and wind energy, which are renewable resources.\nReforestation, the restocking of existing forests or woodlands that have previously been depleted, is an example of Carbon Offsetting, the counteracting of carbon dioxide emissions with an equivalent reduction of carbon dioxide in the atmosphere. Carbon offsetting can reduce a companies overall carbon footprint by offering a carbon credit.\nA life cycle or supply chain carbon footprint study can provide useful data which will help the business to identify specific and critical areas for improvement. By calculating or predicting a process’ carbon footprint high emissions areas can be identified and steps can be taken to reduce in those areas.\n\n\n== Schemes to reduce carbon emissions: Kyoto Protocol, carbon offsetting, and certificates ==\nCarbon dioxide emissions into the atmosphere, and the emissions of other GHGs, are often associated with the burning of fossil fuels, like natural gas, crude oil and coal. While this is harmful to the environment, carbon offsets can be purchased in an attempt to make up for these harmful effects.\nThe Kyoto Protocol defines legally binding targets and timetables for cutting the GHG emissions of industrialized countries that ratified the Kyoto Protocol. Accordingly, from an economic or market perspective, one has to distinguish between a mandatory market and a voluntary market. Typical for both markets is the trade with emission certificates:\n\nCertified Emission Reduction (CER)\nEmission Reduction Unit (ERU)\nVerified Emission Reduction (VER)\n\n\n=== Mandatory market mechanisms ===\nTo reach the goals defined in the Kyoto Protocol, with the least economical costs, the following flexible mechanisms were introduced for the mandatory market:\n\nClean Development Mechanism (CDM)\nJoint Implementation (JI)\nEmissions tradingThe CDM and JI mechanisms requirements for projects which create a supply of emission reduction instruments, while Emissions Trading allows those instruments to be sold on international markets.\n\nProjects which are compliant with the requirements of the CDM mechanism generate Certified Emissions Reductions (CERs).\nProjects which are compliant with the requirements of the JI mechanism generate Emission Reduction Units (ERUs).The CERs and ERUs can then be sold through Emissions Trading. The demand for the CERs and ERUs being traded is driven by:\n\nShortfalls in national emission reduction obligations under the Kyoto Protocol.\nShortfalls amongst entities obligated under local emissions reduction schemes.Nations which have failed to deliver their Kyoto emissions reductions obligations can enter Emissions Trading to purchase CERs and ERUs to cover their treaty shortfalls.  Nations and groups of nations can also create local emission reduction schemes which place mandatory carbon dioxide emission targets on entities within their national boundaries.  If the rules of a scheme allow, the obligated entities may be able to cover all or some of any reduction shortfalls by purchasing CERs and ERUs through Emissions Trading.  While local emissions reduction schemes have no status under the Kyoto Protocol itself, they play a prominent role in creating the demand for CERs and ERUs, stimulating Emissions Trading and setting a market price for emissions.\nA well-known mandatory local emissions trading scheme is the EU Emissions Trading Scheme (EU ETS).\nNew changes are being made to the trading schemes. The EU Emissions Trading Scheme is set to make some new changes within the next year. The new changes will target the emissions produced by flight travel in and out of the European Union.Other nations are scheduled to start participating in Emissions Trading Schemes within the next few years. These nations include China, India and the United States.\n\n\n=== Voluntary market mechanisms ===\nIn contrast to the strict rules set out for the mandatory market, the voluntary market provides companies with different options to acquire emissions reductions. A solution, comparable with those developed for the mandatory market, has been developed for the voluntary market, the Verified Emission Reductions (VER). This measure has the great advantage that the projects/activities are managed according to the quality standards set out for CDM/JI projects but the certificates provided are not registered by the governments of the host countries or the Executive Board of the UNO. As such, high quality VERs can be acquired at lower costs for the same project quality. However, at present VERs can not be used in mandatory market.\nThe voluntary market in North America is divided between members of the Chicago Climate Exchange and the Over The Counter (OTC) market. The Chicago Climate Exchange is a voluntary yet legally binding cap-and-trade emission scheme whereby members commit to the capped emission reductions and must purchase allowances from other members or offset excess emissions. The OTC market does not involve a legally binding scheme and a wide array of buyers from the public and private spheres, as well as special events that want to go carbon neutral. Being carbon neutral refers to achieving net zero carbon emissions by balancing a measured amount of carbon released with an equivalent amount sequestered or offset, or buying enough carbon credits to make up the difference.\nThere are project developers, wholesalers, brokers, and retailers, as well as carbon funds, in the voluntary market. Some businesses and nonprofits in the voluntary market encompass more than just one of the activities listed above. A report by Ecosystem Marketplace shows that carbon offset prices increase as it moves along the supply chain—from project developer to retailer.While some mandatory emission reduction schemes exclude forest projects, these projects flourish in the voluntary markets. A major criticism concerns the imprecise nature of GHG sequestration quantification methodologies for forestry projects. However, others note the community co-benefits that forestry projects foster.\nProject types in the voluntary market range from avoided deforestation, afforestation/reforestation, industrial gas sequestration, increased energy efficiency, fuel switching, methane capture from coal plants and livestock, and even renewable energy. Renewable Energy Certificates (RECs) sold on the voluntary market are quite controversial due to additionality concerns. Industrial Gas projects receive criticism because such projects only apply to large industrial plants that already have high fixed costs. Siphoning off industrial gas for sequestration is considered picking the low hanging fruit; which is why credits generated from industrial gas projects are the cheapest in the voluntary market.\nThe size and activity of the voluntary carbon market are difficult to measure. The most comprehensive report on the voluntary carbon markets to date was released by Ecosystem Marketplace and New Carbon Finance in July 2007.ÆON of Japan is firstly approved by the Japanese authority to indicate a carbon footprint on three private brand goods in October 2009.\n\n\n== Average carbon footprint per person by country ==\n\nAccording to The World Bank, the global average carbon footprint in 2014 was 4.97 metric tons CO2/cap. The EU average for 2007 was about 13.8 tons CO2e/cap, whereas for the U.S., Luxembourg and Australia it was over 25 tons CO2e/cap. In 2017, the average for the USA was about 20 metric tons CO2e.Mobility (driving, flying & small amount from public transit), shelter (electricity, heating, construction) and food are the most important consumption categories determining the carbon footprint of a person. In the EU, the carbon footprint of mobility is evenly split between direct emissions (e.g. from driving private cars) and emissions embodied in purchased products related to mobility (air transport service, emissions occurring during the production of cars and during the extraction of fuel).The carbon footprint of U.S. households is about 5 times greater than the global average. For most U.S. households the single most important action to reduce their carbon footprint is driving less or switching to a more efficient vehicle.\n\n\n== The carbon footprints of energy ==\n\nThree studies concluded that hydroelectric, wind, and nuclear power produced the least CO2 per kilowatt-hour of any other electricity sources.\nThese figures do not allow for emissions due to accidents or terrorism. Wind power and solar power, emit no carbon from the operation, but do leave a footprint during construction phase and maintenance during operation. Hydropower from reservoirs also has large footprints from initial removal of vegetation and ongoing methane (stream detritus decays anaerobically to methane in bottom of reservoir, rather than aerobically to CO2 if it had stayed in an unrestricted stream).Electricity generated, which is about half the world's man-made CO2 output. The CO2 footprint for heat is equally significant and research shows that using waste heat from power generation in combined heat and power district heating, chp/dh has the lowest carbon footprint, much lower than micro-power or heat pumps.\nCoal production has been refined to greatly reduce carbon emissions; since the 1980s, the amount of energy used to produce a ton of steel has decreased by 50%.\n\n\n=== Passenger transport ===\nThis section gives representative figures for the carbon footprint of the fuel burned by different transport types (not including the carbon footprints of the vehicles or related infrastructure themselves). The precise figures vary according to a wide range of factors.\n\n\n==== Flight ====\n\nSome representative figures for CO2 emissions are provided by LIPASTO's survey of average direct emissions (not accounting for high-altitude radiative effects) of airliners expressed as CO2 and CO2 equivalent per passenger kilometre:\nDomestic, short distance, less than 463 km (288 mi): 257 g/km CO2 or 259 g/km (14.7 oz/mile) CO2e\nLong-distance flights: 113 g/km CO2 or 114 g/km (6.5 oz/mile) CO2eHowever, emissions per unit distance travelled is not necessarily the best indicator for the carbon footprint of air travel, because the distances covered are commonly longer than by other modes of travel. It is the total emissions for a trip that matters for a carbon footprint, not merely the rate of emissions. For example, because air travel makes rapid long-distance travel feasible, a holiday destination may be chosen that is much more distant than if another mode of travel were used.\n\n\n==== Road ====\nCO2 emissions per passenger-kilometre (pkm) for all road travel for 2011 in Europe as provided by the European Environment Agency:\n109 g/km CO2 (Figure 2)For vehicles, average figures for CO2 emissions per kilometer for road travel for 2013 in Europe, normalized to the NEDC test cycle, are provided by the International Council on Clean Transportation:\nNewly registered passenger cars: 127 g CO2/km\nHybrid-electric vehicles: 92 g CO2/km\nLight commercial vehicles (LCV): 175 g CO2/kmAverage figures for the United States are provided by the US Environmental Protection Agency, based on the EPA Federal Test Procedure, for the following categories:\n\nPassenger cars: 200 g CO2/km (322 g/mi)\nTrucks: 280 g CO2/km (450 g/mi)\nCombined: 229 g CO2/km (369 g/mi)\n\n\n== The carbon footprints of products ==\nSeveral organizations offer footprint calculators for public and corporate use, and several organizations have calculated carbon footprints of products. The US Environmental Protection Agency has addressed paper, plastic (candy wrappers), glass, cans, computers, carpet and tires. Australia has addressed lumber and other building materials. Academics in Australia, Korea and the US have addressed paved roads. Companies, nonprofits and academics have addressed mailing letters and packages. Carnegie Mellon University has estimated the CO2 footprints of 46 large sectors of the economy in each of eight countries. Carnegie Mellon, Sweden and the Carbon Trust have addressed foods at home and in restaurants.\nThe Carbon Trust has worked with UK manufacturers on foods, shirts and detergents, introducing a CO2 label in March 2007. The label is intended to comply with a new British Publicly Available Specification (i.e. not a standard), PAS 2050, and is being actively piloted by The Carbon Trust and various industrial partners. As of August 2012 The Carbon Trust state they have measured 27,000 certifiable product carbon footprints.Evaluating the package of some products is key to figuring out the carbon footprint. The key way to determine a carbon footprint is to look at the materials used to make the item. For example, a juice carton is made of an aseptic carton, a beer can is made of aluminum, and some water bottles either made of glass or plastic. The larger the size, the larger the footprint will be.\n\n\n=== Food ===\n\nIn a 2014 study by Scarborough et al., the real-life diets of British people were surveyed and their dietary greenhouse gas footprints estimated. Average dietary greenhouse-gas emissions per day (in kilograms of carbon dioxide equivalent) were:\n\n7.19 for high meat-eaters\n5.63 for medium meat-eaters\n4.67 for low meat-eaters\n3.91 for fish-eaters\n3.81 for vegetarians\n2.89 for vegans\n\n\n=== Textiles ===\nThe precise carbon footprint of different textiles varies considerably according to a wide range of factors. However, studies of textile production in Europe suggest the following carbon dioxide equivalent emissions footprints per kilo of textile at the point of purchase by a consumer:\nCotton: 8\nNylon: 5.43\nPET (e.g. synthetic fleece): 5.55\nWool: 5.48Accounting for durability and energy required to wash and dry textile products, synthetic fabrics generally have a substantially lower carbon footprint than natural ones.\n\n\n=== Materials ===\nThe carbon footprint of materials (also known as embodied carbon) varies widely. The carbon footprint of many common materials can be found in the Inventory of Carbon & Energy database, the GREET databases and models, and LCA databases via openLCA Nexus. The carbon footprint of any manufactured product should be verified by a third-party.\n\n\n=== Cement ===\n\nCement production gives a major contribution to CO2 emissions.\n\n\n== Causes ==\n\nAlthough some production of greenhouse gases is natural, human activity has increased the production substantially. Major industrial sources of greenhouse gasses are power plants, residential buildings, and road transportation, as well as energy industry processes and losses, iron and steel manufacturing, coal mining, and chemical and petrochemical industries. Changes in the environment also contribute the increase in greenhouse gas emission such as, deforestation, forest degradation and land use, livestock, agricultural soils and water, and wastewater. China is the largest contributor of greenhouse gas, causing up 30% of the total emissions. The United States contributes 15%, followed by the EU with 9%, then India with 7%, Russia with 5%, Japan with 4%, and other miscellaneous countries making up the remaining 30%.Although carbon dioxide (CO2) is the most prevalent gas, it is not the most damaging. Carbon dioxide is essential to life because animals release it during cellular respiration when they breathe and plants use it for photosynthesis. Carbon dioxide is released naturally by decomposition, ocean release and respiration. Humans contribute an increase of carbon dioxide emissions by burning fossil fuels, deforestation, and cement production.Methane (CH4) is largely released by coal, oil, and natural gas industries. Although methane is not mass-produced like carbon dioxide, it is still very prevalent. Methane is more harmful than carbon dioxide because it traps heat better than CO2. Methane is a main component in natural gas. Recently industries as well as consumers have been using natural gas because they believe that it is better for the environment since it contains less CO2. However, this is not the case because methane is actually more harmful to the environment.Nitrous oxide (N2O) is released by fuel combustion, most of which comes from coal fired power plants, agricultural and industrial activities.\nFluorinated gases include hydroflucarbons (HFCs), perfluorocarbons (PFCs), sulfur hexafluoride (SF6), and nitrogen trifluoride (NF3). These gases have no natural source and are solely products of human activity.  The biggest cause of these sources is the usage of ozone depleting substances; such as refrigerants, aerosol, propellants, foam blowing agents, solvents, and fire retardants.The production of all of these gases contributes to one's GHG footprint. The more that these gases are produced, the higher the GHG footprint.\n\n\n== Rise in greenhouse gas over time ==\n\nSince the Industrial Revolution, greenhouse gas emissions have increased immensely. As of 2017, the carbon dioxide (CO2) levels are 142%, of what they were pre-industrial revolution. Methane is up 253% and nitrous oxide is 121% of pre-industrial levels. The energy driven consumption of fossil fuels has made GHG emissions rapidly increase, causing the Earth's temperature to rise. In the past 250 years, human activity such as, burning fossil fuels and cutting down carbon-absorbing forests, have contributed greatly to this increase. In the last 25 years alone, emissions have increased by more than 33%, most of which comes from carbon dioxide, accounting for three-fourths of this increase.\n\n\n== Solutions ==\n\n\n=== How to reduce GHGs ===\n\n\n==== Reduction of carbon dioxide ====\nIn order to decrease CO2 emissions, the reliance of fossil fuels must be lowered. These fuels produce much CO2 across all forms of their usage. Alternatively, renewable sources are cleaner for the environment. Capturing CO2 from power plants will also reduce emissions.Household energy conservation measures include increasing insulation in construction, using fuel-efficient vehicles and ENERGY STAR appliances, and unplugging electrical items when not in use.\n\n\n==== Reduction of methane ====\nReducing methane gas emissions can be accomplished in several ways. Capturing CH4 emissions from coal mines and landfills, are two ways of reducing these emissions. Manure management and livestock operations is another possible solution. Motor vehicles use fossil fuels, which produces CO2, but fossil fuels also produce CH4 as a byproduct. Thus, better technology for these vehicles to avoid leakage would be very beneficial.\n\n\n==== Reduction of nitrous oxide ====\nNitrous oxide (N2O) is often given off as a byproduct in various ways. Nylon production and fossil fuel usage are two ways that N2O is given off as a byproduct. Thus, improving technology for nylon production and the gathering of fossil fuels would greatly reduce nitrous oxide emissions. Also, many fertilizers have a nitrogenous base. A decrease in usage of these fertilizers, or changing their components, are more ways to reduce N2O emissions.\n\n\n==== Reduction of fluorinated gases ====\nAlthough fluorinated gases are not produced on a massive scale, they have the worst effect on the environment. A reduction of fluorinated gas emissions can be done in many ways. Many industries that emit these gases can capture or recycle them. These same industries can also invest in more advanced technology that will not produce these gases. A reduction of leakage within power grids and motor vehicles will also decrease the emissions of fluorinated gases. There are also many air conditioning systems that emit fluorinated gases, thus an update in technology would decrease these emissions.\n\n\n=== Everyday life changes ===\nThere are many simple changes that can be made to the everyday lifestyle of a person that would reduce their GHG footprint. Reducing energy consumption within a household can include lowering one's dependence on air conditioning and heating, using CFL light bulbs, choosing ENERGY STAR appliances, recycling, using cold water to wash clothes, and avoiding a dryer. Another adjustment would be to use a motor vehicle that is fuel-efficient as well as reducing reliance on motor vehicles. Motor vehicles produce many GHGs, thus an adjustment to one's usage will greatly affect a GHG footprint.\n\n\n== See also ==\n\n\n== Notes ==\n\n\n== References ==\n\nAssociation, Press (2014-09-09). \"Greenhouse gas emissions rise at fastest rate for 30 years\". The Guardian. ISSN 0261-3077. Retrieved 2017-11-03.\nClimate change 2014. (2015). Retrieved from INTERGOVERNMENTAL PANEL website: http://www.ipcc.ch/pdf/assessment-report/ar5/syr/SYR_AR5_FINAL_full_wcover.pdf\n\"CO₂ and other Greenhouse Gas Emissions\". Our World in Data. Retrieved 2017-11-03.\nDivision, US EPA, Office of Air and Radiation, Office of Atmospheric Programs, Climate Change. \"Household Carbon Footprint Calculator\". www3.epa.gov. Retrieved 2017-11-01\nEPA, OA, US. \"Climate Change Indicators: Greenhouse Gases | US EPA\". US EPA. Retrieved 2017-11-08\nEPA, OA, US. \"Global Greenhouse Gas Emissions Data | US EPA\". US EPA. Retrieved 2017-11-03.\nEPA, OA, US. \"Overview of Greenhouse Gases | US EPA\". US EPA. Retrieved 2017-11-01\nHolli, Riebeek, (2010-06-03). \"Global Warming : Feature Articles\". earthobservatory.nasa.gov. Retrieved 2017-11-03.\nHowarth, Robert W. (2014-06-01). \"A bridge to nowhere: methane emissions and the greenhouse gas footprint of natural gas\". Energy Science & Engineering. 2 (2): 47–60. doi:10.1002/ese3.35. ISSN 2050-0505\nSnyder, C. S.; Bruulsema, T. W.; Jensen, T. L.; Fixen, P. E. (2009-10-01). \"Review of greenhouse gas emissions from crop production systems and fertilizer management effects\". Agriculture, Ecosystems & Environment. Reactive nitrogen in agroecosystems: Integration with greenhouse gas interactions. 133 (3): 247–266. doi:10.1016/j.agee.2009.04.021..\n\"The Carbon Dioxide Greenhouse Effect\". history.aip.org. Retrieved 2017-11-01.\n15 sources of greenhouse gases - About us | Allianz\". www.allianz.com. Retrieved 2017-11-03.\n\n\n== External links ==\nThe GHG Protocol\nCarbon Management at Curlie"