"The United States of America has separate federal, state, and local governments with taxes imposed at each of these levels. Taxes are levied on income, payroll, property, sales, capital gains, dividends, imports, estates and gifts, as well as various fees. In 2010, taxes collected by federal, state, and municipal governments amounted to 24.8% of GDP. In the OECD, only Chile and Mexico are taxed less as a share of their GDP.Taxes fall much more heavily on labor income than on capital income. Divergent taxes and subsidies for different forms of income and spending can also constitute a form of indirect taxation of some activities over others. For example, individual spending on higher education can be said to be \"taxed\" at a high rate, compared to other forms of personal expenditure which are formally recognized as investments.\nTaxes are imposed on net income of individuals and corporations by the federal, most state, and some local governments. Citizens and residents are taxed on worldwide income and allowed a credit for foreign taxes. Income subject to tax is determined under tax accounting rules, not financial accounting principles, and includes almost all income from whatever source. Most business expenses reduce taxable income, though limits apply to a few expenses. Individuals are permitted to reduce taxable income by personal allowances and certain non-business expenses, including home mortgage interest, state and local taxes, charitable contributions, and medical and certain other expenses incurred above certain percentages of income. State rules for determining taxable income often differ from federal rules. Federal marginal tax rates vary from 10% to 37% of taxable income. State and local tax rates vary widely by jurisdiction, from 0% to 13.30% of income, and many are graduated. State taxes are generally treated as a deductible expense for federal tax computation, although the 2017 tax law imposed a $10,000 limit on the state and local tax (\"SALT\") deduction, which raised the effective tax rate on medium and high earners in high tax states. Prior to the SALT deduction limit, the average deduction exceeded $10,000 in most of the Midwest, and exceeded $11,000 in most of the Northeastern United States, as well as California and Oregon. The states impacted the most by the limit were the tri-state area (NY, NJ, and CT) and California; the average SALT deduction in those states was greater than $17,000 in 2014.The United States is one of two countries in the world that taxes its non-resident citizens on worldwide income, in the same manner and rates as residents; the other is Eritrea. The U.S. Supreme Court upheld the constitutionality of imposition of such a tax in the case of Cook v. Tait.Payroll taxes are imposed by the federal and all state governments. These include Social Security and Medicare taxes imposed on both employers and employees, at a combined rate of 15.3% (13.3% for 2011 and 2012). Social Security tax applies only to the first $132,900 of wages in 2019. There is an additional Medicare tax of 0.9% on wages above $200,000. Employers must withhold income taxes on wages. An unemployment tax and certain other levies apply to employers. Payroll taxes have dramatically increased as a share of federal revenue since the 1950s, while corporate income taxes have fallen as a share of revenue. (Corporate profits have not fallen as a share of GDP).\nProperty taxes are imposed by most local governments and many special purpose authorities based on the fair market value of property. School and other authorities are often separately governed, and impose separate taxes. Property tax is generally imposed only on realty, though some jurisdictions tax some forms of business property. Property tax rules and rates vary widely with annual median rates ranging from 0.2% to 1.9% of a property's value depending on the state.Sales taxes are imposed by most states and some localities on the price at retail sale of many goods and some services. Sales tax rates vary widely among jurisdictions, from 0% to 16%, and may vary within a jurisdiction based on the particular goods or services taxed. Sales tax is collected by the seller at the time of sale, or remitted as use tax by buyers of taxable items who did not pay sales tax.\nThe United States imposes tariffs or customs duties on the import of many types of goods from many jurisdictions. These tariffs or duties must be paid before the goods can be legally imported. Rates of duty vary from 0% to more than 20%, based on the particular goods and country of origin.\nEstate and gift taxes are imposed by the federal and some state governments on the transfer of property inheritance, by will, or by lifetime donation. Similar to federal income taxes, federal estate and gift taxes are imposed on worldwide property of citizens and residents and allow a credit for foreign taxes."