"Narcissism in the workplace can become an issue that may have a major impact on an entire organization. Often beginning with manipulation during the interview process, to engaging in counterproductive work behavior (especially when their self-esteem is threatened). Narcissism is both a personality trait and a personality disorder, generally assessed with the Narcissistic Personality Inventory. Owing to these differences from typical workplace behaviors, Psychologists have studied the interview strategies of narcissists, their impact on coworkers, correlated behaviors, motivations, and preferences. Following these investigations, many have offered insight into the best practices when working with a narcissist, and perhaps some amount of benefit stemming from some of their behaviors.\nOliver James identifies narcissism as one of the dark triadic personality traits in the workplace, with the others being psychopathy and Machiavellianism. These three traits have been found to correlate moderately to strongly with one another. Dark triad traits also share strong negative correlations with Honesty-Humility traits. Narcissism is distinguished from the other dark triad traits by its positive correlations with openness and extroversion. \n\n\n== Job interviews ==\n\nNarcissists typically perform well at job interviews; they receive more favorable hiring ratings from interviewers than individuals who are not narcissists. Even more experienced and trained raters evaluate narcissists more favorably. This is perhaps because interviews are one of the few social situations where narcissistic behaviors, such as boasting, actually create a positive impression; however, favorable impressions of narcissists are often short-lived. An additional consideration; narcissists tend to favor short term benefit over long term, thus raters of performance that are close to them (such as peers) rate them lower than raters that have known them for a shorter period of time. Other related behaviors of narcissism, namely of status seeking, include blatant fabrication and exaggeration during the interview process. Interviewers’ initial impressions of narcissistic applicants are formed primarily on the basis of highly visible cues, which makes them susceptible to biases.Narcissists are more skilled at displaying likable cues, which lead to more positive first impressions, regardless of their long-term likability or job performance. Upon first meeting narcissists, people often rate them as more agreeable, competent, open, entertaining, and well-adjusted. Narcissists also tend to be neater and flashier dressers, display friendlier facial expressions, and exhibit more self-assured body movements. Importantly, while narcissistic individuals may rate their own job performance more favorably, studies show that narcissism is not related to job performance. Openness and conscientiousness are also related to higher self-ratings (than other-rated), along with narcissism. The link between conscientiousness and higher self-views can be explained because it is prosocial and one is more likely to experience self-deception (at around the same amount as narcissists). The connection to openness has yet to be explained.  Thus, while narcissists may seem to perform better and even be rated as performing better in interviews, these more favorable interview ratings are not predictive of favorable job performance, as narcissists do not actually perform better in their jobs than non-narcissists.\n\n\n== Impact on stress, absenteeism and staff turnover ==\n\nThere tends to be a higher level of stress with people who work with or interact with a narcissist. While there are a variety of reasons for this to be the case, an important one is the relationship between narcissism and aggression. Aggression is believed to moderate the relationship between narcissism and counterproductive work behaviors.  Penney and Spector found narcissism to be positively related to counterproductive workplace behaviors, such as interpersonal aggression, sabotaging the work of others, finding excuses to waste other peoples' time and resources, and spreading rumors. These aggressive acts can raise the stress of other employees, which in turn increases absenteeism and staff turnover.\n\n\n== Organizational Design Preferences ==\nNarcissists like hierarchical organizations because they think they will rise to high ranks and reap status and power. They take special interest in acquiring leadership positions and may be better at procuring them. Narcissists are less interested in hierarchies where there is little opportunity for upward mobility. The prototypical narcissist is more concerned with getting praised and how they are perceived than doing what benefits all of the \"stakeholders\". Some narcissistic attributes may confer benefits, but the negative and positive outcomes of narcissistic leadership are not yet fully understood. In terms of the internal functioning of organizations, narcissists can be especially damaging, or ill-fit, to jobs that require judicious self assessment, heavily rely on teams, and/or use 360 degree feedback. \n\n\n== Corporate narcissism ==\n\nAccording to Alan Downs, corporate narcissism occurs when a narcissist becomes the chief executive officer (CEO) (or another leadership role) within the senior management team and gathers an adequate mix of codependents around him or her to support the narcissistic behavior. Narcissists profess company loyalty but are only really committed to their own agendas; thus, organizational decisions are founded on the narcissist's own interests rather than the interests of the organization as a whole, the various stakeholders, or the society in which the organization operates. As a result, a certain kind of charismatic leader can run a financially successful company on thoroughly unhealthy principles (at least for a time).Neville Symington has suggested that one of the ways of differentiating a good-enough organisation from one that is pathological is through its ability to exclude narcissistic characters from key posts.\n\n\n== Narcissistic supply ==\n\nThe narcissistic manager will have two main sources of narcissistic supply: inanimate (status symbols like cars, gadgets or office views); and animate (flattery and attention from colleagues and subordinates). Teammates may find everyday offers of support swiftly turn them into enabling sources of permanent supply, unless they are very careful to maintain proper boundaries. The narcissistic manager's need to protect such supply networks will prevent objective decision-making. Such a manager will evaluate long-term strategies according to their potential for gaining personal attention instead of to benefit the organization.\n\n\n== Coping strategies for dealing with workplace narcissists ==\nDuBrin suggests the following coping strategies:\nAssess the relationship realistically\nMaintain your professionalism and composure\nConfront conflict gently and tactfully\nDocument your accomplishments\nBe willing to accept criticism\nMaintain a strong network\n\n\n== Workplace bullying overlap ==\n\nIn 2007, researchers Catherine Mattice and Brian Spitzberg at San Diego State University, USA, found that narcissism revealed a positive relationship with bullying.  Narcissists were found to prefer indirect bullying tactics (such as withholding information that affects others' performance, ignoring others, spreading gossip, constantly reminding others of mistakes, ordering others to do work below their competence level, and excessively monitoring others' work) rather than direct tactics (such as making threats, shouting, persistently criticizing, or making false allegations). Studies of adolescents using self-reports and teacher evaluation also indicated that narcissists are more likely to integrate aggressive and confrontational behaviors due to low self-esteem.The research also revealed that narcissists are highly motivated to bully, and that to some extent, they are left with feelings of satisfaction after a bullying incident occurs. Despite the fact that many narcissist will avoid work, they can be eager to steal the work of others. In line with other dark triad traits, many narcissists will manipulate others and their environment so that they can claim responsibility for company accomplishments that they had little or nothing to do with. A study was done in 2017, that looked at dark traits within those who hold leadership positions and that effect on employee depression. The research done supported the idea that employees mental health and stability was negatively effected by bullying (some narcissistic behavior) in the workplace.\n\n\n== Sexual harassment ==\nThere are strong links between narcissism and sexual harassment, associated with ego centrism and willingness to exploit others. According to RAINN, (Rape, Abuse & Incest National Network) sexual harassment can cause mental, physical, and emotional health problems that can include: a diverse range of emotions, anxiety, depression, PTSD, sleep problems, substance abuse and an increase in stress levels. Additional research has also been done that directly correlates narcissism with a proclivity to engage in sexual harassment. Relevant correlations include sociosexuality, unrestricted sexuality, and extroversion. A study was done in 2010, that looked at Sexual Narcissism and the Perpetration of Sexual Aggression. The results showed a relationship between sexual narcissism and a tendency for sexual aggression in the future, suggesting that there is a strong relationship between sexual narcissism and sexual assault. The study also found that men who exhibited certain elements of narcissism were more likely to carry out sexual aggression. This could potentially be used to pinpoint and even treat sexual aggression.\n\n\n== Productive narcissists ==\nCrompton has distinguished what he calls productive narcissists from unproductive narcissists. Maccoby acknowledged that productive narcissists still tend to be over-sensitive to criticism, over-competitive, isolated, and grandiose, but considered that what draws them out is that they have a sense of freedom to do whatever they want rather than feeling constantly constrained by circumstances, and that through their charisma they are able to draw people into their vision, and produce a cohort of disciples who will pursue the dream for all it's worth.Others have questioned the concept, considering that the dramatic collapse of Wall Street and the financial system in 2009 must give us pause. Is the collapse due to business leaders who have developed narcissistic styles—even if ostensibly productive? Certainly one may conclude that at best there can be quite a fine line between narcissists who perform badly in the workplace because of their traits, and those who achieve outrageous success because of them.\n\n\n== See also ==\n\n\n== References ==\n\n\n== Further reading ==\nGerald Falkowski, Jean Ritala Narcissism in the Workplace (2007)\nSamuel Grier Narcissism in the Workplace: What It Is - How To Spot It - What To Do About It (2011)\nBelinda McDaniel The Narcissists in Your Life: Coping with and Surviving Narcissists in the Workplace, at Home and Wherever You Are Forced to Associate with People Suffering from Narcissistic Personality Disorder (2014)\nSam Vaknin, Lidija Rangelovska The Narcissist and the Psychopath in the Workplace (2006)\n\n\n== External links ==\nAnna Verasai Dealing With Different Types of Narcissists at Work The HR Digest 28 Jul 2016\nTomas Chamorro-Premuzic Why We Keep Hiring Narcissistic CEOs Harvard Business Review 29 Nov 2016"