"The Kitab al-Bulhan (Arabic: كتاب البلهان‎, romanized: Kitāb al-Bulhān), or Book of Wonders, or Book of Surprises, is a mainly 14th century Arabic manuscript compiled – and possibly illustrated – by Abd al-Hasan Al-Isfahani.  The codex was probably bound during the reign of Jalayirid Sultan Ahmad (1382-1410) at Baghdad, and includes texts on astronomy, astrology, geomancy and a section of full-page illustrated plates dedicated to each discourse topic, e.g. a folktale, a sign of the zodiac, a prophet, etc.\n\n\n== History of Manuscript ==\nThe calligrapher, copiest and compiler, ʿAbd al-Hasan ibn Ahmad ibn ʿAli ibn al-Hasan al-Isfahani, whose family came from Isfahan in Iran and himself was a native of Baghdad, where he studied the Aristotelic ‘demonstrative’ (burhan) sciences. It seems  the Kitab al-Bulhan was commissioned by – or the idea of – Shaykh al-Diya Husayn al-Irbili’ (originally of Irbil near Mosul in northern Iraq), who sold it to Haydar ibn al-Hajji ʿAbd al-Karim ibn Muhammad in Dec 1409 - Jan 1410.  The original codex comprised a series of treatises, which came apart, and when sections were reassembled and some lost, it became jumbled and incoherent.  The work includes extracts copied from the Kitab al-mawalid (‘Book of Nativities’) of the astronomer and neo-Platonist Abu Maʿshar al-Balkhi (787-886 CE) of Balkh (modern-day Mazar-i Sharif) in northern Afghanistan.\n\n\n== Manuscript copies ==\nIn the late 16th century, two Turkish copies were made from the original for the two daughters of the Ottoman sultan Murad III: Ayşe Sultan (c. 1582) and Fatma Sultan.  These manuscripts are complete and establish the original order of the treatises of the Kitab al-Bulhan.  The codices are now held at the Pierpont Morgan Library, New York City and the Bibliothèque Nationale, Paris.\n\n\n== Gallery ==\n\n\t\t\n\t\t\n\t\t\n\t\t\n\t\t\n\n\n== See also ==\nThe Book of Felicity\n\n\n== References ==\n\n\n=== Citations ===\n\n\n=== Sources ===\n\n\n== External links ==\n Media related to Kitab al-Bulhan at Wikimedia Commons\nComplete digital copy at the Bodleian Library"