"Okrug (Bulgarian: окръг, romanized: okrŭg, pronounced [ˈɔkrɐk]; Russian: о́круг, romanized: ókrug; Serbian: округ / okrug, pronounced [ôkruːɡ]; Ukrainian: о́круг, romanized: о́kruh; Belarusian: акруга, romanized: akruha; Polish: okręg; Abkhazian: оқрҿс; Meadow Mari: йырвел, romanized: jyrvel) is an administrative division of some Slavic states. The word \"okrug\" is a loanword in English, but it is nevertheless often translated as \"area\", \"district\", or \"region\". \nEtymologically, \"okrug\" literally means \"circuit\". In meaning, the word is similar to the German term Bezirk (\"district\") and the French word Arrondissement; all of which refer to something \"encircled\" or \"surrounded\".\n\n\n== Bulgaria ==\n\nIn Bulgaria, okrаgs are the abolished primary unit of the administrative division and implied \"districts\" or \"counties\". They existed in the post-War Bulgaria between 1946 and 1987 and corresponded approximately to today's oblasts.\n\n\n== Poland ==\n\nAs historical administrative subdivisions of Poland, okręgi existed in the later part of the Congress Poland period, from 1842, when the name was applied to the former powiats (the name powiat being transferred to the former obwody). See Administrative division of Congress Poland.\nOkręgi were also created temporarily from 1945 to 1946, in the areas annexed to Poland from Germany as a result of the Soviet military advance. An okręg was then subdivided into obwody. These okręgi were later replaced by voivodeships, and the obwody by powiats.\n\n\n== Russia ==\n\n\n=== Imperial Russia ===\nOkrugs were one of the several types of administrative division for oblasts and selected governorates in Imperial Russia. Until the 1920s, okrugs were administrative districts in Cossack hosts such as the Don Cossacks.\n\n\n=== Soviet Union ===\n\nInherited from the Imperial Russia, in the 1920s, okrugs were administrative divisions of several other primary divisions such as oblasts, krais, and others. For sometime in the 1920s they also served as the primary unit upon the abolishment of guberniyas and were divided into raions. On July 30, 1930 most of the okrugs were abolished. The remaining okrugs were phased away in the Russian SFSR during 1930–1946, although they were retained in Zakarpattia Oblast of the Ukrainian SSR in status equivalent to that of a raion.\nNational okrugs were first created in the Mountain ASSR of the Russian SFSR in 1921 as units of the Soviet autonomy and additional national okrugs were created in the Russian SFSR for the peoples of the north and Caucasus region. In 1977, all national okrugs were renamed autonomous okrugs.\n\n\n=== Russian Federation ===\n\nIn the present-day Russian Federation, the term \"okrug\" is either translated as \"district\" or rendered directly as \"okrug\", and is used to describe the following types of divisions:\n\nFederal Districts (federalny okrug), such as the Siberian Federal District\nAutonomous okrugs (avtonomny okrug), such as Chukotka Autonomous OkrugAfter the series of mergers in 2005–2008, several autonomous okrugs of Russia lost their federal subject status and are now considered to be administrative territories within the federal subjects they had been merged into:\n\nAgin-Buryat Okrug, a territory with special status within Zabaykalsky Krai\nKomi-Permyak Okrug, a territory with special status within Perm Krai\nKoryak Okrug, a territory with special status within Kamchatka Krai\nUst-Orda Buryat Okrug, a territory with special status within Irkutsk Oblast\"Okrug\" is also used to describe the administrative divisions of the two \"federal cities\" in Russia:\n\nthe administrative okrugs of Moscow are an upper-level administrative division\nthe municipal okrugs of St. Petersburg are a lower-level administrative divisionIn the federal city of Sevastopol, municipal okrugs are a type of a municipal formation.\nIn Tver Oblast, the term \"okrug\" also denotes a type of an administrative division which is equal in status to that of the districts.\nFurthermore, the designation \"okrug\" denotes several selsoviet-level administrative divisions:\n\nokrugs, such as okrugs of Samara Oblast\nrural okrugs (selsky okrug), such as the rural okrugs of Belgorod Oblast\nrural territorial okrugs (selsky territorialny okrug), such as the rural territorial okrugs of Murmansk Oblast\nstanitsa okrugs (stanichny okrug), such as the stanitsa okrugs of Krasnodar KraiIn some cities, the term \"okrug\" is used to refer to the administrative divisions of those cities.  \"Administrative okrugs\" are such divisions in the cities of Murmansk, Omsk, and Tyumen; \"city okrugs\" are used in Krasnodar; \"municipal okrugs\" are the divisions of Nazran; \"okrugs\" exist in Belgorod, Kaluga, Kursk, and Novorossiysk; and \"territorial okrugs\" are the divisions of Arkhangelsk and Lipetsk.\nThe term \"okrug\" is also used to describe a type of a municipal formation, the \"municipal urban okrug\"—a municipal urban settlement not incorporated into a municipal district.\n\n\n== Serbia ==\n\nThe Republic of Serbia is divided into twenty-nine okrugs as well as the City of Belgrade. The term okrug in Serbia is often translated as either \"district\" or \"county\".\n\n\n== See also ==\nAdministrative division\nMilitary district\nKrai\nOblast\n\n\n== References ==\n\n\n== External links ==\nOkruha in the Encyclopedia of Ukraine"