"The Fifth Crusade (1217–1221) was a campaign by Western Europeans to reacquire Jerusalem and the rest of the Holy Land by first conquering Egypt, ruled by the powerful Ayyubid sultanate, led by Al-Adil, brother of Saladin.\nAfter the failure of the Fourth Crusade, Innocent III again called for a Crusade, and began organizing Crusading armies led by Andrew II of Hungary and Leopold VI of Austria. An initial attack in late 1217 in Syria was inconclusive.  Later in 1218, a German army led by cleric Oliver of Paderborn, and a mixed army of Dutch, Flemish and Frisian soldiers led by William I of Holland, joined the Crusade.\nFollowing the siege of Damietta in 1218–1219, the Crusaders occupied the port for two years. They then marched south towards Cairo in July 1221. On the way, they attacked the stronghold of Mansurah, but were forced to surrender. Al-Kamil, now sultan of Egypt, forced the Crusaders to retreat from Damietta—leaving Egypt altogether—and to agree to an eight-year peace agreement.\n\n\n== Background ==\nBy 1212, Innocent III had been pope for 14 years and had faced the disappointment of the Fourth Crusade and its inability to recover Jerusalem, the on-going Albigensian Crusade, begun in 1209, and the popular fervor of the Children's Crusade of 1212. The Latin Empire of Constantinople was established, with the emperor Baldwin I essentially elected by the Venetians. (The imperial crown was at first offered to doge Enrico Dandolo, who refused it.) The first Latin Patriarch of Constantinople, the Venetian Thomas Morosini, was contested by the pope as uncanonical.The ongoing situation in Europe was chaotic. Philip of Swabia was locked in a dispute of the throne in Germany with Otto of Brunswick. Innocent III's attempts to reconcile their differences was rendered moot with Philip's assassination on 21 June 1208. Otto was crowned Holy Roman Emperor and fought the pope, resulting in his excommunication. France was heavily invested in the Albigensian Crusade and was quarreling with John Lackland, resulting in the Anglo-French war of 1213–1214. Sicily was ruled by the child-king Henry II and Spain was occupied in their crusade against the Almohads. The was little appetite for a new Crusade.In Jerusalem, John of Brienne became the effective ruler of the kingdom through his marriage to Maria of Montferrat. In 1212, Isabella II of Jerusalem was proclaimed queen of Jerusalem shortly after her birth, and her father John became regent. Antioch was consumed with the War of the Antiochene Succession, begun with the death of Bohemond III, not to be resolved until 1219.Before the arrival of John of Brienne in Acre in 1210, the local Christians had refused to renew their truce the Ayyubids. The next year, John negotiated with the aging sultan Al-Adil a new truce between the kingdom and the sultanate to last through 1217. At the same time, in light of the strength of the Muslims and many of his knights returning to Europe, John also asked the pope for help. There was no real force among the Syrian Franks, and if a new Crusade were to begin, it must come from Europe.Innocent III had hoped to mount such a Crusade to the Holy Land, never forgetting the goal of restoring Jerusalem to Christian control. The pathos of the Children's Crusade only nerved him to fresh efforts.  But for Innocent this tragedy had its moral: “the very children put us to shame, while we sleep they go forth gladly to conquer the Holy Land.”\n\n\n== Preparations for the Crusade ==\nIn April 1213, Innocent III issued his papal bull Quia maior, calling all of Christendom to join a new Crusade. This was followed by a conciliar decree, the Ad Liberandam, in 1215. The attendant papal instructions engaged a new enterprise to recover Jerusalem while establishing Crusading norms that were to last nearly a century.The message of the Crusade was preached in France by legate Robert of Courçon, a former classmate of the pope's. He was met with bitter complaints by the clergy, accusing the legate of encroaching on their domains. Philip II of France supported his clergy, and Innocent III realized the Robert's zeal was a threat to the success of the Crusade. On 11 November 1215, the Fourth Lateran Council was convened. The prelates of France presented their grievances, many well-founded, and the pope pleaded for them to forgive the legate's indiscretions. In the end, very few Frenchmen took part in the expedition of 1217, unwilling to go in the company of Germans and Hungarians, with France represented by Aubrey of Reims and the bishops of Limoges and Bayeux, Jean de Veyrac and Robert des Ablèges.\nAt the council, Innocent III called for the recovery of the Holy Land. Innocent wanted it to be led by the papacy, as the First Crusade should have been, to avoid the mistakes of the Fourth Crusade, which had been taken over by the Venetians. He planned to meet with the Crusaders at Brindisi and Messina for departure on 1 June 1217, and prohibited trade with the Muslims in order to ensure that the Crusaders would have ships and weapons, renewing an 1179 edict. Every Crusader would receive an indulgence as well as those who simply helped pay the expenses of a Crusader, but did not go on the Crusade themselves.In order to protect Raoul of Merencourt, the Latin patriarch of Jerusalem, on his return trip to the kingdom, Innocent III tasked John of Brienne to provide escort. As John was in conflict with Leo I of Armenia and Hugh I of Cyprus, the pope ordered them to reconcile their differences before the Crusaders reached the Holy Land.Innocent III died on 16 July 1216 and Honorius III was consecrated as pope the next week. The Crusade dominated the early part of his papacy. The next year, he crowned Peter II of Courtenay as Latin Emperor, who captured on his eastward journey in Epirus and died in confinement. \nThe preaching of Robert of Courçon was most successful with the masses, with little screening done on applicants, with neither fitness nor morality considered, causing the nobles to abstain as not wanting to lead the unprepared. Unlike other Crusades, few French knights joined, as they were already fighting the Albigensian Crusade against the heretical Cathar sect in southern France. \nOliver of Paderborn preached the Crusade in Germany and had great success in recruitment. In July 1216, Honorius III called on Andrew II of Hungary to fulfill his father's vow to lead a Crusade. Like many other rulers, the pope's former pupil, Frederick II of Germany, had taken an oath to embark for the Holy Land in 1215 and appealed to German nobility to join. But Frederick II hung back, with his crown still in contention with Otto IV, and Honorius repeatedly put off the date for the beginning of the expedition. \nIn Europe, the troubadours were equally adept in awakening the interest in the Crusade. These included Elias Cairel, a veteran of the Fourth Crusade, Pons de Capduelh, later joining the Crusade in 1220, and Aimery de Pégulhan, who implored by verse a young William VI of Montferrat to follow in his father's footsteps and take the cross. \nThe strength of the armies was estimated at more than 32,000, including more than 10,000 knights. It was described by a contemporaneous Arab historian as: \"This year, an infinite number of warriors left from Rome the great and other countries of the West.\"\n\n\n== In Iberia and the Levant ==\nThe departure of the Crusaders began finally in early July 1217. Many of the Crusaders decided to go to the Holy Land by their traditional sea journey. The fleet made their first stop at Dartmouth on the southern coast of England. There they elected their leaders and the laws by which they would organize their venture. From there, led by William I of Holland, they continued on their way south to Lisbon. As in previous crusading seaborne journeys, the fleet was dispersed by storms and only gradually managed to reach the Portuguese city of Lisbon after making a stopover at the famous shrine of Santiago de Compostela.\nAt their arrival in Portugal, the Bishop of Lisbon attempted to persuade the Crusaders to help them capture the Almohad controlled city of Alcácer do Sal. The Frisians, however, refused on account of Innocent III's disqualification of the venture at the Fourth Lateran Council. The other members of the fleet, however, were convinced by the Portuguese and started the siege of the city in August 1217. The Crusaders finally captured Alcácer do Sal, with the help of the Knights Templar and Knights Hospitaller, on October 1217.A group of Frisians who refused to aid the Portuguese with their siege plans against Alacácer do Sal, preferred to raid several coastal towns on their way to the Holy Land. From there this fleet scattered and reached the Italian coast at different times during the autumn of 1218, where they were forced to spend the winter before continuing on their way to Acre. In the north, Ingi II of Norway took the cross in 1216, only to die the next spring, and the eventual Scandinavian expedition was of little consequence.Robert of Courçon was sent as spiritual advisor to the French fleet, but subordinate to newly-chosen papal delegate Pelagius of Albano. Bishop Walter II of Autun, a veteran of the Fourth Crusade, would also return to the Holy Land with the Fifth Crusade. French canon Jacques de Vitry had come under the influence of the saintly Marie of Oignies and preached the Albigensian Crusade after 1210. He arrived at his new position as Bishop of Acre in 1216 and shortly thereafter Honorius III tasked him with preaching the Crusade in the Latin settlements of Syria, made difficult with the rampant corruption at the port cities.Innocent III had managed to secure the participation of the Kingdom of Georgia in the Crusade. Tamar of Georgia, queen since 1184, led the Georgian state to its zenith of power and prestige in the Middle Ages. Under her rule, Georgia challenged Ayyubid rule in eastern Anatolia. Tamar died in 1213 and was succeeded by her son George IV of Georgia. In the late 1210s, according to the Georgian chronicles, he began making preparations for a campaign in the Holy Land to support the Franks. His plans were cut short by the invasion of the Mongols in 1220. After the death of George IV, his sister Rusudan of Georgia notified the pope that Georgia was unable to fulfill its promises.\n\n\n== The situation in the Holy Land ==\nSaladin had died in 1193 and was succeeded in most of his domain by his brother Al-Adil, who was the patriarch of all successive Ayyubid sultans of Egypt. Saladin's son az-Zahir Ghazi retained his leadership in Aleppo.  An exceptionally low Nile River resulted in a failure of the crops in 1201–1202, and famine and pestilence ensued. People abandoned themselves to atrocious practices, habitually resorting to cannibalism. Violent earthquakes, felt as far away as Syria and Armenia, devastated whole cities, and increased the general misery.After naval raids on Rosetta in 1204 and Damietta in 1211, the chief concern of Al-Adil was Egypt. He was willing to make concessions to avoid war, and favored the Italian maritime states of Venice and Pisa, both for trading reasons and to preclude them from supporting further crusades. Most of his reign was conducted under truces with the Christians, and he constructed a new fortress at Mount Tabor, to buttress the defenses of Jerusalem and Damascus. Most of his conflicts in Syria were with the Knights Hospitaller at Krak des Chevaliers or Bohemond IV of Antioch, and were dealt with by his nephew az-Zahir Ghazi. Only once, in 1207, did he directly confront the Crusaders, capturing al-Qualai'ah, besieging Krak des Chevaliers and advancing to Tripoli, before accepting an indemnity from Bohemond IV in exchange for peace.Az-Zahir maintained an alliance with both Antioch and Kaykaus I, the Seljuk sultan of Rûm, to check the influence of Leo I of Armenia, as well as to keep his options open to challenge his uncle. Az-Zahir died in 1216, leaving as his successor al-Aziz Muhammad, his 3-year old son, whose mother was Dayfa Khatun, Al-Adil's daughter. Saladin’s eldest son, Al-Afdal, emerged to make a bid for Aleppo, enlisting the help of Kaykaus I, who also had designs on the region. In 1218, al-Afdal and Kaykaus invaded Aleppo and advanced on the capital. The situation was resolved when Al-Ashraf, Al-Adil’s third son, routed the Seljuk army, which remained a menace until the death of Kaykaus in 1220. Given the Crusaders’ Egyptian plan, these diversions were useful in stretching the resources of the sultanate that controlled the Levant with an uneasy cooperation.\n\n\n== Campaign of Andrew II ==\n\nAndrew II had been called on by the pope in July 1216 to fulfill his father Béla III's vow to lead a crusade, and finally agreed, having postponed three times earlier. Andrew, who was reputed to have designs on becoming Latin emperor, mortgaged his estates to finance the Crusade. In July 1217, he departed from Zagreb, accompanied by Leopold VI of Austria and Otto I, Duke of Merania. They were transported by the Venetian fleet, the largest European fleet of the times. Andrew and his troops embarked from Split on 23 August 1217. \nThe Hungarian army landed on 9 October 1217 on Cyprus from where they sailed to Acre and joined John of Brienne, Raoul of Merencourt and Hugh I of Cyprus. In October 1217, the leaders of the expedition held a war council there, presided by Andrew II. Representing the military orders were the masters Guérin de Montaigu of the Hospitallers, Guillaume de Chartres of the Templars, and Hermann von Salza of the Teutonic Knights. Additional attendees included Leopold VI of Austria, Otto I of Merania, Walter II of Avesnes, and numerous archbishops and bishops.The war plan of John of Brienne envisioned a two-prong attack. In Syria, Andrew's forces would engage al-Mu'azzam, son of Al-Adil, at the stronghold of Nablus. At the same time, the fleet was to attack the port city of Damietta, wresting Egypt from the Muslims and enabling the conquest of the remainder of Syria and Palestine. This plan was abandoned at Acre due to the lack of manpower and ships. Instead, in anticipation of reinforcements, the objective was to keep the enemy occupied in a series of small engagements, perhaps going as far as Damascus.The Muslims knew that the Crusaders were coming in 1216 with the exodus of merchants from Alexandria. Once the host gathered at Acre, Al-Adil began operations in Syria, leaving the bulk of his forces in Egypt under his eldest son and viceroy Al-Kamil. He personally led a small contingent to support al-Mu'azzam, then emir of Damascus. With too few to engage the Crusaders, he guarded the approaches to Damascus while al-Mu'azzam was sent to Nablus to protect Jerusalem.The Crusaders were camped near Acre at Tel Afek, and on 3 November 1217 began to traverse the plain of Esdraelon towards 'Ain Jalud, expecting an ambush. Upon seeing the strength of the Crusaders, Al-Adil withdrew to Beisan against the wishes of al-Mu'azzam who wanted to attack from the heights of Nain. Again against the wishes of his son, Al-Adil abandoned Beisan which soon fell to the Crusaders who pillaged the city. He continued his retreat to Ajlun, ordering al-Mu'azzam to protect Jerusalem from the heights of Lubban, near Shiloh. Al-Adil continued to Damascus, stopping at Marj al-Saffar.On 10 November 1217, the Crusaders crossed the Jordan River at the Jisr el-Majami, threatening Damascus. The governor of the city took defensive measures, and received reinforcements from al-Mujahid Shirkuh, the Ayyubid emir of Homs. Without engaging the enemy, the Crusaders returned to the camp near Acre, crossing over Jacob's Ford. Andrew II did not return to the battlefield, preferring to remain in Acre collecting relics.Now under the command of John of Brienne, as supported by Bohemond IV, the Hungarians moved against Mount Tabor, regarded by the Muslims as impregnable. A battle fought on 3 December 1217 was soon abandoned by the leaders, only to be revisited by the Templars and Hospitallers. Met with Greek fire, the siege was abandoned on 7 December 1217. A third sortie by the Hungarians, possibly led by Andrew's nephew, met disaster at Mashghara. The small force was decimated, and the few survivors returned to Acre on Christmas Eve. Thus ended what is known as the Hungarian Crusade of 1217.At the beginning of 1218, an ailing Andrew decided to return to Hungary, under the threat of excommunication. Andrew and his army departed to Hungary in February 1218, stopping first at Tripoli for the marriage of Bohemond IV and Melisende of Lusignan. Hugh I of Cyprus, accompanying his fellow commanders, became ill at the ceremony and died shortly thereafter. Andrew returned to Hungary in late 1218.In the meantime, efforts were taken to strengthen Château Pèlerin, originally built for the Templars, and Caesarea which proved later to be valuable moves. Later in the year, Oliver of Paderborn arrived with a new German army and William I of Holland arrived with a mixed army consisting of Dutch, Flemish and Frisian soldiers. As it became clear that Frederick II was not coming to the East, they began detailed planning. The campaign was to be led by John of Brienne, based on his status in the kingdom and his proven military reputation. The original objective abandoned the year before due to lack of resources was reinstated: the decision to attack Egypt had been made. They now decided to focus their main attack on the port of Damietta rather than Alexandria. The European Crusader army was supplemented by troops from the kingdom and the military orders.\n\n\n== Campaign in Egypt ==\n\n\n=== Siege of Damietta ===\nIn July 1218 the Crusaders began their siege of Damietta, and despite resistance from the unprepared sultan Al-Adil, the tower outside the city was taken on August 25. They could not gain Damietta itself, and in the ensuing months diseases killed many of the crusaders, including Robert of Courçon. Al-Adil also died and was succeeded by al-Kamil. Meanwhile, Honorius III sent Pelagius of Albano to lead the crusade in 1219. Al-Kamil tried to negotiate peace with the crusaders. He offered to trade Damietta for Jerusalem, but Pelagius would not accept these offers. After hearing this William I, Count of Holland left the crusade and sailed home.  In August or September, Francis of Assisi arrived in the crusader camp and crossed over to preach to al-Kamil. By November, the crusaders had worn out the sultan's forces, and were finally able to occupy the port.\n\nThen in July 1221, excited by rumors that the army of one King David, a descendant of the legendary Prester John, was on its way from the east to the Holy Land to join the crusade, the crusaders at Damietta marched south towards Cairo. This move was observed by the forces of al-Kamil, and frequent raids along the flanks of the army led to the withdrawal of some 2,000 German troops who refused to continue the advance and returned to Damietta.\n\n\n=== Disaster at Mansoura ===\nBy now Al-Kamil was able to ally with the other Ayyubids in Syria, who had defeated Kaykaus I. The crusader attack on Mansoura was disastrous; the river Nile flooded ahead of them, stopping the crusader advance. A dry canal that they had previously crossed by flooded, thus blocking the crusader army's retreat. With supplies dwindling, a forced retreat began, culminating in a nighttime attack by Al-Kamil which resulted in a great number of crusader losses and eventually in the surrender of the army under Pelagius.\n\n\n== Aftermath ==\nThe terms of this surrender meant the relinquishing of Damietta to al-Kamil in exchange for the release of the crusaders. Al-Kamil agreed to an eight-year peace agreement with Europe and to return a piece of the True Cross. However, the relic was never returned as al-Kamil did not, in fact, have it.The failure of the Crusade caused an outpouring of anti-papal sentiment from the Occitan poet Guilhem Figueira. The more orthodox Gormonda de Monpeslier responded to Figueira's D'un sirventes far with a song of her own, Greu m'es a durar. Instead of blaming Pelagius or the Papacy, she laid the blame on the \"foolishness\" of the wicked.The Palästinalied is a famous lyric poem by Walther von der Vogelweide written in Middle High German describing a pilgrim travelling to the Holy Land during the height of the Fifth Crusade.\n\n\n== Historiography ==\nThe historiography of the Fifth Crusade is concerned with the \"history of the histories\" of the military campaigns discussed herein as well as biographies of the important figures of the period. The primary sources include works written in the medieval period, generally by participants in the Crusade or written contemporaneously with the event. The secondary sources begin with early consolidated works in the 16th century and continuing to modern times. The  tertiary sources are primarily encyclopedias, bibliographies and biographies/genealogies.The primary Western sources of the Fifth Crusade were first complied in Gesta Dei per Francos (God's Work through the Franks) (1611), by French scholar and diplomat Jacques Bongars. These include several eyewitness accounts, and are as follows.\n\nEstoire d’Eracles émperor (History of Heraclius) is an anonymous history of Jerusalem from 630 to 1277, regarded as a continuation of William of Tyre's work. It was written from 1205 to 1234 with additions from 1220 to 1277, drawing from both Ernoul and the Rothelin Continuation.\nHistoria Orientalis (Historia Hierosolymitana) and Epistolae, by theologian and historian Jacques de Vitry. A history of the Holy Land from the advent of Islam until the Fifth Crusade.\nHistoria Damiatina, by Cardinal Oliver of Paderborn (also known as Oliverus scholasticus) reflects his experience in the Crusade.\nDe Itinere Frisonum is an eyewitness account of the Frisians' journey from Friesland to Acre.\nFlores Historiarum (Flowers of History), by English chronicler Roger of Wendover, covering the period from 1188 through the Fifth Crusade.\nGesta crucigerorum Rhenanorum, an account of the Rhineland Crusaders in 1220.\nGesta Innocentii III was written by a member of the pope's curia.The Arabic sources of the Crusade, partially compiled in the collection Recueil des historiens des croisades, Historiens orientaux (1872–1906), include the following.\n\nComplete Work of History, particularly The Years 589–629/1193–1231. The Ayyūbids after Saladin and the Mongol Menace, by Ali ibn al-Athir, an Arab or Kurdish historian.\nKitāb al-rawḍatayn (The Book of the Two Gardens) and al-Dhayl ʿalā l-rawḍatayn (Sequel to the Two Gardens), by Arab historian Abū Shāma.\nTarikh al-Mukhtasar fi Akhbar al-Bashar (History of Abu al-Fida), by Kurdish historian Abu’l-Fida.\nHistory of Egypt, by Egyptian historian Al-Makrizi.Many of these primary sources can be found in Crusade Texts in Translation. German historian Reinhold Röhricht also compiled two collections of works concerning the Fifth Crusade: Scriptores Minores Quinti Belli sacri (1879) and its contiuation Testimonia minora de quinto bello sacro (1882). He also collaborated on the work Annales de Terre Sainte that provides a chronology of the Crusade correlated with the original sources.The reference to the Fifth Crusade is relatively new. Thomas Fuller called it simply Voyage 8 in his The Historie of the Holy Warre. Joseph-François Michaud referred to it as part of the Sixth Crusade in his Histoire des Croisades (translation by British author William Robson), as did Joseph Toussaint Reinaud in his Histoire de la sixième croisade et de la prise de Damiette. By the late 19th century, the designation of the Fifth Crusade was standard.\n\n\n== References ==\n\n\n== Bibliography =="