"David Robert Jones OAL (8 January 1947 – 10 January 2016), known professionally as David Bowie ( BOH-ee), was an English singer-songwriter and actor. A leading figure in the music industry, Bowie is regarded as one of the most influential musicians of the 20th century. He was acclaimed by critics and musicians, particularly for his innovative work during the 1970s. His career was marked by reinvention and visual presentation, with his music and stagecraft having a significant impact on popular music. \nDuring his lifetime, his record sales, estimated at over 100 million records worldwide, made him one of the best-selling music artists of all time. In the UK, he was awarded ten platinum album certifications, eleven gold and eight silver, and released eleven number-one albums. In the US, he received five platinum and nine gold certifications. He was inducted into the Rock and Roll Hall of Fame in 1996. Rolling Stone placed him among its list of the 100 Greatest Artists of All Time and named him the \"Greatest Rock Star Ever\" following his death in 2016.\nBorn in Brixton, South London, Bowie developed an interest in music as a child. He studied art, music and design before embarking on a professional career as a musician in 1963. \"Space Oddity\", released in 1969, was his first top-five entry on the UK Singles Chart. After a period of experimentation, he re-emerged in 1972 during the glam rock era with his flamboyant and androgynous alter ego Ziggy Stardust. The character was spearheaded by the success of Bowie's single \"Starman\" and album The Rise and Fall of Ziggy Stardust and the Spiders from Mars, which won him widespread popularity. In 1975, Bowie's style shifted towards a sound he characterised as \"plastic soul\", initially alienating many of his UK fans but garnering him his first major US crossover success with the number-one single \"Fame\" and the album Young Americans. In 1976, Bowie starred in the cult film The Man Who Fell to Earth, directed by Nicolas Roeg, and released Station to Station. In 1977, he further confounded expectations with the electronic-inflected album Low, the first of three collaborations with Brian Eno that came to be known as the \"Berlin Trilogy\". \"Heroes\" (1977) and Lodger (1979) followed; each album reached the UK top five and received lasting critical praise.\nAfter uneven commercial success in the late 1970s, Bowie had UK number ones with the 1980 single \"Ashes to Ashes\", its album Scary Monsters (and Super Creeps), and \"Under Pressure\", a 1981 collaboration with Queen. He reached his commercial peak in 1983 with Let's Dance; its title track topped both the UK and US charts. Throughout the 1990s and 2000s, Bowie continued to experiment with musical styles, including industrial and jungle. He also continued acting; his roles included Major Jack Celliers in Merry Christmas, Mr. Lawrence (1983), Jareth the Goblin King in Labyrinth (1986), Pontius Pilate in The Last Temptation of Christ (1988), and Nikola Tesla in The Prestige (2006), among other film and television appearances and cameos. He stopped touring after 2004 and his last live performance was at a charity event in 2006. In 2013, Bowie returned from a decade-long recording hiatus with The Next Day. He remained musically active until his death of liver cancer at his home in New York City, two days after his 69th birthday and the release of his final album, Blackstar (2016)."