"Multigrain bread is a type of bread prepared with two or more types of grain. Grains used include barley, flax, millet, oats, wheat, and whole-wheat flour, among others. Some varieties include edible seeds in their preparation, such as flaxseed, quinoa, pumpkin seeds, and sunflower seeds. Rye and sourdough multigrain breads are additional varieties. Preparations include 7-grain and 9-grain bread, among others.\nMultigrain bread may be prepared using whole, unprocessed grains, although commercial varieties do not necessarily always contain whole grains.\n\n\n== Nutritional content ==\nWhole grain multigrain breads contain a dietary fibre content of up to four times greater than white breads and may also contain more vitamins and protein compared to white bread. Multigrain breads also provide complex carbohydrates.\n\n\n== Commercial varieties ==\nMultigrain bread is commercially mass-produced and marketed to consumers. Some commercial varieties are prepared using 100% whole grain flour. Between 1989 and 1994 in the United States, multigrain bread was \"one of the fastest growing markets within the bakery sector\".\n\n\n== Use in brewing ==\nA 4,000-year-old Mesopotamian recipe for brewing beer from multigrain loaves of bread mixed with honey is the oldest surviving beer recipe in the world. The Brussels Beer Project microbrewery in Belgium has developed an amber beer with a 7% alcohol by volume named Babylone that incorporates this recipe using leftover, unsold fresh bread donated by supermarkets.\n\n\n== See also ==\n\nList of breads\nSprouted bread\n\n\n== References ==\n\n\n== Further reading ==\nIndrani, D.;  et al. (June 2010). \"Multigrain bread–its dough rheology, microstructure, quality and nutritional characteristics\". Journal of Texture Studies. 41 (3): 302–319. doi:10.1111/j.1745-4603.2010.00230.x. (subscription required)\nHenriques, A.S. (2000). The Effects of Gum Incorporation on the Staling Properties of Multigrain Bread. University of Georgia. 316 pages.\n\n\n== External links ==\n Media related to Multigrain breads at Wikimedia Commons"