"Epicurus (341–270 BC) was an ancient Greek philosopher and sage who founded Epicureanism, a highly influential school of philosophy. He was born on the Greek island of Samos to Athenian parents. Influenced by Democritus, Aristippus, Pyrrho, and possibly the Cynics, he turned against the Platonism of his day and established his own school, known as \"the Garden\", in Athens. Epicurus and his followers were known for eating simple meals and discussing a wide range of philosophical subjects. He openly allowed women and slaves to join the school as a matter of policy. Epicurus is said to have originally written over 300 works on various subjects, but the vast majority of these writings have been lost. Only three letters written by him—the letters to Menoeceus, Pythocles, and Herodotus—and two collections of quotes—the Principal Doctrines and the Vatican Sayings—have survived intact, along with a few fragments of his other writings. Most knowledge of his teachings comes from later authors, particularly the biographer Diogenes Laërtius, the Epicurean Roman poet Lucretius and the Epicurean philosopher Philodemus, and with hostile but largely accurate accounts by the Pyrrhonist philosopher Sextus Empiricus, and the Academic Skeptic and statesman Cicero.\nFor Epicurus, the purpose of philosophy was to help people attain a happy (eudaimonic), tranquil life characterized by ataraxia (peace and freedom from fear) and aponia (the absence of pain). He advocated that people were best able to pursue philosophy by living a self-sufficient life surrounded by friends. He taught that the root of all human neurosis is death denial and the tendency for human beings to assume that death will be horrific and painful, which he claimed causes unnecessary anxiety, selfish self-protective behaviors, and hypocrisy. According to Epicurus, death is the end of both the body and the soul and therefore should not be feared. Epicurus taught that although the gods exist, they have no involvement in human affairs. He taught that people should behave ethically not because the gods punish or reward people for their actions, but because amoral behavior will burden them with guilt and prevent them from attaining ataraxia. \nLike Aristotle, Epicurus was an empiricist, meaning he believed that the senses are the only reliable source of knowledge about the world. He derived much of his physics and cosmology from the earlier philosopher Democritus (c. 460–c. 370 BC). Like Democritus, Epicurus taught that the universe is infinite and eternal and that all matter is made up of extremely tiny, invisible particles known as atoms. All occurrences in the natural world are ultimately the result of atoms moving and interacting in empty space. Epicurus deviated from Democritus by proposing the idea of atomic \"swerve\", which holds that atoms may deviate from their expected course, thus permitting humans to possess free will in an otherwise deterministic universe.\nThough popular, Epicurean teachings were controversial from the beginning. Epicureanism reached the height of its popularity during the late years of the Roman Republic. It died out in late antiquity, subject to hostility from early Christianity. Throughout the Middle Ages Epicurus was popularly, though inaccurately, remembered as a patron of drunkards, whoremongers, and gluttons. His teachings gradually became more widely known in the fifteenth century with the rediscovery of important texts, but his ideas did not become acceptable until the seventeenth century, when the French Catholic priest Pierre Gassendi revived a modified version of them, which was promoted by other writers, including Walter Charleton and Robert Boyle. His influence grew considerably during and after the Enlightenment, profoundly impacting the ideas of major thinkers, including John Locke, Thomas Jefferson, Jeremy Bentham, and Karl Marx."