"An animal sanctuary is a facility where animals are brought to live and to be protected for the rest of their lives. Pattrice Jones, co-founder of VINE Sanctuary defines an animal sanctuary as \"a safe-enough place or relationship within the continuing hazards that menace everybody\". In addition, sanctuaries are an experimental staging ground for transformative human-animal relations. There are four types of animal sanctuaries reflective of the species-belonging of the residents: 1) companion animal sanctuaries; 2) wildlife sanctuaries; 3) exotic animal sanctuaries; and 4) farmed animal sanctuaries.\nUnlike animal shelters, sanctuaries do not seek to place animals with individuals or groups, instead maintaining each animal until their natural death (either from disease or from other animals in the sanctuary). However, they can offer rehoming services. In some cases, an establishment may have characteristics of both a sanctuary and a shelter; for instance, some animals may be in residence temporarily until a good home is found and others may be permanent residents. The mission of sanctuaries is generally to be safe havens, where the animals receive the best care that the sanctuaries can provide. Animals are not bought, sold, or traded, nor are they used for animal testing. Additionally, no parts of nor secretions from the animals are commodified, such as eggs, wool, or milk. The resident animals are given the opportunity to behave as natural as possible in a protective environment.\n\n\n== Overview ==\nWhat distinguishes a sanctuary from other institutions is the philosophy that the residents come first. In a sanctuary, every action is scrutinized for any trace of human benefit at the expense of non-human residents. Sanctuaries act on behalf of the animals, and the caregivers work under the notion that all animals in the sanctuary, human and non-human, are of equal importance.\nMost sanctuaries are not open to the public in the sense of a zoo; that is, allowing unescorted public access to the facility. A legitimate sanctuary avoids activity that would place the animals in an unduly stressful situation. Most sanctuaries are also not government-funded and are usually nonprofit. Public help is accepted by sanctuaries in the form of volunteering, monetary contributions, donations of food and materials, spreading the word, and in some cases, adoption.One of the most important missions of sanctuaries, beyond caring for the animals, is educating the public. The ultimate goal of many sanctuaries is to change the way that humans think of, and treat, non-human animals.\n\nCompanion animal sanctuaries\nWildlife sanctuaries\nExotic animal sanctuaries\nFarmed animal sanctuaries\n\n\n== Farmed animal sanctuaries ==\nFarmed animal sanctuaries (FAS) provide care, shelter and advocacy of farmed animal species such as chickens, cows, goats, fish, horses, pig, turkeys, and sheep. The farm sanctuary layout tends to resemble traditional farms however functions differently. FAS as a movement began with Gene Baur, the co-founder of Farm Sanctuary, the first official farm sanctuary that opened in 1986. The daily tasks of a FAS involve the primary guardians, volunteers and at time visitors. Each day is structured by routines such as feeding, care and health procedures, as well as cleaning and maintenance. Points of conflict for sanctuaries include human intervention in matters of sterilizing animals and species segregation. Moreover, effective altruists have critiqued the efficiency of FAS's ability to reduce animal suffering as demonstrated in the \"arithmetic of compassion,\" a utilitarian measure of advocacy that applies mathematical formulas to reduce the most amount of suffering in light of individual lives. Jon Bockman of Animal Charity Evaluators, states, \"expending too many resources on direct rescue results in less money directed toward education and a lower overall impact in helping animals, and all advocates should give consideration to this concern when deciding how best to help animals\".\n\n\n=== Education ===\nThe educational role is a secondary role of FAS. Investing in transforming visitors and volunteers perspectives on animal agriculture is a key component of FAS enlisting farmed animal residents as \"ambassadors\" of their species and serve a fundraiser role.\n\n\n=== FAS models ===\nSue Donaldson and Will Kymlicka have outlined two different types of FAS models. FAS can be distinguished by ascribing to either refuge and advocacy model or intentional community model.\n\n\n==== Refuge- and advocacy-based models ====\nRefuge- and advocacy-based models are the most standard. These sanctuaries are found in traditional agricultural communities in part because of the physical and legal infrastructure. Six characteristics of this model include: duty of care, support for species-typical flourishing, recognition of individuality, non-exploitation, non-perpetuation, and awareness and advocacy. The latter characteristic has launched a series of questions into the effectiveness of the educational component of sanctuaries.\n\n\n==== Intentional community model ====\nThe intentional community model addresses the shortcomings of the standard sanctuary model by focusing on movement building that includes a spectrum of speciesist issues such as developing farmed animal veterinary care that exist outside of standard practices that have aimed at meeting animal agricultural interests. The six characteristics of the intentional community model include: belonging, absence of fixed hierarchical relationships, self-determination, citizenship, dependent agency, and scaffolded choices and reconfigured spaces. These characteristics redress some of the critiques of the refuge and advocacy model by grounding sanctuary practices in animal agency and expanding the geographical boundaries of where animals can live. Expanding the geographies in which farmed animals are found serve as a corrective to forming human-farmed animal friendships.An example of the intentional sanctuary model can be found in the Microsanctuary Movement started by Rosemary and Justin Van Kleeck. The Microsanctuary Movement encourages city-dwellers to rescue farmed animals to expand what species are considered to be companion animals.\nSimilarly, Darren Chang, co-founder of the Riverdale Farm Sanctuary Project has launched a campaign to transform Riverdale Farms, an urban farm in Toronto into a FAS advocating for: 1) Animal Rescue, Refuge, and Advocacy, 2) Compassion and Nonviolence, 3) Ecological and Food Justice and Compassionate Interspecies Community.\nExpanding beyond the traditional role of a safe haven for farmed animals, sanctuaries can also be understood as playing political roles in transforming the political and spatial lives of animal residents and their broader species communities leaning into pioneering a less-speciesist future.\n\n\n== Services provided ==\n\nAnimal sanctuary services include spaying and neutering, hygiene, and physical wellbeing. These services are mainly performed by licensed veterinarians. Other positions that can be held by people at sanctuaries include specialized animal trainers, groomers, and volunteers. When it comes to new residents, they are typically not used to living with a large population of their kind and can be easily overwhelmed or agitated. Because of this, they can be held for a certain amount of time before being admitted to the general public. In this time, veterinarians study the new animal's behavioral and dietary habits and try for a smooth transition into the sanctuary's environment. Also, some species of animals, dogs for example, are social creatures. In isolation they get lonely and become depressed. Animal sanctuaries often accommodate these types of animals by putting them in living quarters where they're in groups or pairs that they fit well with. Enrichment activities are also available for the residents.\n\n\n== Accreditation ==\nThere are two primary organizations that provide accreditation and support for animal sanctuaries: the Global Federation of Animal Sanctuaries and the American Sanctuary Association. In the United States, sanctuaries must also be licensed by the United States Department of Agriculture (USDA) and regularly inspected by the Animal and Plant Health Inspection Service (APHIS) for compliance with the Animal Welfare Act.\n\n\n== See also ==\nAnimal shelter\nList of animal sanctuaries\nNature reserve\n\n\n== References ==\n\n\n== External links ==\nAmerican Sanctuary Association Official website\nGlobal Federation of Animal Sanctuaries Official website\nJuliana’s Animal Sanctuary Official website\nMicrosanctuary Resource Center Official website\nSanctuaire pour Animaux de Ferme de l'Estrie Official website\nVINE Sanctuary Official website"