"Eric Andrew Heisserer (born 1970) is an American screenwriter and comic book writer. His screenplay for the film Arrival earned him a Best Adapted Screenplay nomination at the 89th Academy Awards in 2016.\nHe also wrote the horror films A Nightmare on Elm Street (2010 remake), Final Destination 5, The Thing (2011 prequel film), Lights Out and Bird Box, and wrote and directed Hours with Paul Walker.\n\n\n== Career ==\nHeisserer's professional screenwriting career was launched with the sale of The Dionaea House to Warner Bros. in 2005, based on an online epistolary story of the same name that he wrote from autumn 2004 to winter 2006. The Dionaea House was a multimedia novel told across multiple blogs run by fictional characters, and concerned an ominous house that existed in multiple places across the United States. It is considered to be one of the first popular creepypasta stories.  He then developed an original television pilot for Paramount Pictures and CBS, and wrote feature projects for Jerry Bruckheimer Films and Warner Bros.. In 2007, he sold a pitch to Regency Enterprises and Fox called Inhuman, a supernatural thriller set in Tokyo that combines live action and anime sequences.In December 2008, Heisserer was hired to re-envision and rewrite the script for the franchise reboot of A Nightmare on Elm Street, produced by Platinum Dunes. An early draft had been written by Wesley Strick. The script went on to land director Samuel Bayer, actor Jackie Earle Haley, and began filming in May 2009.He rewrote the prequel to director John Carpenter's 1982 remake The Thing. In April 2010, Heisserer signed on to write Final Destination 5, the fifth film of the horror film franchise.\nHeisserer made his directorial debut with the film Hours, starring Paul Walker. Heisserer co-wrote The Conjuring 2 along with the brothers Chad Hayes and Carey Hayes. Heisserer wrote along with artist Felipe Massafera and Colorist Wes Dzioba, the comic book series Shaper.Heisserer wrote the 2016 film Arrival based on Ted Chiang's short story \"The Story of Your Life\". Heisserer has said that he was attracted to the challenge of adapting the non-linear story by its emotional content. After the release of the film, he was nominated for Best Adapted Screenplay at the 89th Academy Awards.\nIn July 2017, Heisserer announced that he was developing a science fiction series based on another Ted Chiang's story, \"Liking What You See: A Documentary\", for AMC. The series will explore concepts such as beauty, relationships, and advertising.On 27 September 2017, there was an announcement that Heisserer would write the script for the live-action remake of the sci-fi romance anime Your Name. By September 2020, he was replaced by Lee Isaac Chung and Emily V. Gordon.Heisserer wrote the script for Bird Box (2018), based on the thriller book Bird Box, by Josh Malerman. Released by Netflix, the film stars Sandra Bullock and was directed by Susanne Bier.Heisserer is serving as creator, head writer, show runner, and executive producer of the 2021 Netflix series Shadow and Bone, an adaptation of the fantasy book series The Grisha Trilogy and the Six of Crows Duology.\n\n\n== Personal life ==\nHeisserer is the son of Margaret L., a senior editor for a publishing company, and Andrew J. Heisserer, a professor of ancient history, of Norman, Oklahoma. Heisserer married television producer/writer Christine Boylan in 2010. His previous marriage ended in divorce.Heisserer identifies as agnostic.\n\n\n== Filmography ==\n\n\n=== Film ===\n\n\n=== Television ===\n\n\n== References ==\n\n\n== External links ==\nEric Heisserer at IMDb"