"Religious clothing is clothing which is worn in accordance with religious practice, tradition or significance to a faith group. It includes clerical clothing such as cassocks, and religious habit, robes, and other vestments. Accessories include hats, wedding rings, crucifixes, etc.\n\n\n== Christianity ==\n\nVestments are liturgical garments and articles associated primarily with the Christian religions, especially  Catholic, Eastern Orthodox, Anglicans, Methodists, and Lutheran Churches. Other groups also make use of vestments, but this was a point of controversy in the Protestant Reformation and sometimes since - notably during the Ritualist controversies in England in the 19th century. Clerical clothing is non-liturgical clothing worn exclusively by clergy. It is distinct from vestments in that it is not reserved specifically for services.\nSome women belonging to various Christian denominations also practice Christian headcovering, a traditional practice since the days of the early Church. Additionally, some Christians practice the wearing of plain dress, notably traditional Anabaptists (such as Old Order Mennonites), Conservative Friends, and Methodists of the conservative holiness movement; for example, in its 2015 Book of Discipline, the Evangelical Wesleyan Church teaches that:\nWe require our women to appear in public with dresses of modest length, sleeves of modest length, modest necklines and modest hose; the wearing of split skirts, slacks, jeans, artificial flowers or feathers is forbidden. Moreover, we require our men to conform to the scriptural standards of decent and modest attire; we require that when they appear in public they wear shirts with sleeves of modest length. We require that all our people appear in public with sleeves below the elbows. Women's hemlines are to be modestly below the knees. Our people are forbidden to appear in public with transparent or immodest apparel, including shorts or bathing suits. Parents are required to dress their children modestly in conformity with our general principles of Christian attire. We further prohibit our people from participating in the practices of body-piercing, tattooing or body art.\n\n\n=== Latter Day Saint movement ===\nAdherents of The Church of Jesus Christ of Latter-day Saints (LDS Church) and some fundamentalist groups often receive temple garments at the time of receiving their endowment, after taking part in the endowment ritual. These garments, which are to be worn at all times (with the exception of certain activities such as exercise) under typical clothing, date back to the early days of the Church, originating with the Church's first latter-day prophet, Joseph Smith, Jr., and have been updated periodically. Members believe that wearing these garments can are meant to serve as a symbolic reminder of eternal covenants they have made with God the Father and Jesus Christ.\nSpecial outer temple clothing is additionally worn for worship, but in temples only, except that the deceased are often dressed in temple clothing for burial. Both the choice to bury their deceased, as opposed to cremation, and what they should be buried in, are family decisions. Outside of temples, including at weekly sacrament meetings and at general conferences, respectful clothing is traditionally worn, often with a white, button-down shirt, and a tie for the male members, females typically wear a dress or skirt, emphasizing \"modesty\" in appearance. White clothes are worn by those undergoing and performing baptism.\n\n\n== Islam ==\n\nDress in Islam varies from country to country. The Quranic sura An-Nur (\"The Light\") prescribes modesty in dress. \nThe veil is clearly stated and recommended in the Quran and Muslim women have been wearing it to preserve their dignity not showing their beauty (hair) to other men than their husband and family. \nIn the Quran, Allah says: « O Prophet, tell your wives and your daughters and the women of the believers to bring down over themselves [part] of their outer garments. That is more suitable that they will be known and not be abused. And ever is Allah Forgiving and Merciful. » Prophet Mohamed explained it to Muslims and 1439 years ago, Muslims are committed to Allah’s orders. \nThe Veil is worn  especially of the Islamic world. Many Muslim countries adapted the veil to their culture and traditions. For example, there are Muslim countries like Turkey where a headscarf is common. However this does not mean that Niqab or Burqa or Khimar are not worn. In Saudi Arabia the Veil, the Niqab, the Khimar and the Burqa are typical. In Afghanistan and parts of Pakistan, the burqa and the Niqab is common. In India in Kashmir, Muslim women wear the Veil and the Khimar. In Soudan, Indonesia and Malaysia, the Veil, the Khimar and the Jilbab are more common.\n\n\n== Judaism ==\n\nTzitzit are specially knotted ritual fringes, or tassels worn by most Jewish men and boys during prayer. Tzitzit are attached to the four corners of the tallit (Jewish prayer shawl) and in more traditional communities are tied to all four-cornered garments.\nTefillin are black leather boxes made by hand which contain written passages from the Bible, particularly the V'ahavta and secured to the arm and head with leather straps. These have been worn for at least the last 2,000 years and originated in pre-diaspora Judaism. These are almost exclusively worn by very religious Jews during weekday prayers, and not worn outside of religious functions in order to prevent one from 'defiling' them. Curiously, while Ashkenazi and some Sephardi men have the custom to wear these during prayer, many outlying communities such as the Beta Israel did not, until they were introduced to the custom by Israelis or Ashkenazi missionaries.\nA kippah or yarmulke is a cloth head covering worn by Jews during prayer or other ritual services. Some wear it every day. In the United States, most synagogues and Jewish funeral services keep a ready supply of kippot for the temporary use of visitors who have not brought one.\nThe mitpachat, or tichel in Yiddish, is a headscarf worn by some religious Jewish women. It is customary for a married woman, but some women choose to wear them only during religious occasions. \nVarious formal hats are worn by Jewish men in Hasidic Jewish circles and sometimes in other traditional communities, generally on top of the yarmulke, generally reflecting a particular cultural background, and sometimes reflecting one's age, marital status, rabbinical rank or lineage.  In general, hats are only worn on top of the yarmulke after a Jewish male reaches Bar Mitzvah age, although some communities, such as Belz and Viznitz, have boys under Bar Mitzvah age wear caps on top of their yarmulkes known as kasket.  Fedoras, generally black with a wide brim, are worn by men from Litvish, Yeshivish, and Chabad-Lubavitch communities, and these are worn by both single and married men.  Homburg style hats are often worn by rabbis of higher rank in Litvish and Yeshivish circles.  Derby hats are worn by Hasidic men in certain communities, sometimes signifying lay status as opposed to rabbinical status.  Biber hats are worn by Hasidic men, both married and unmarried, in certain communities, with varied styles signifying which community one belongs to, or sometimes rabbinical status.  Shtreimel hats are worn by married men (or previously married men, such as divorced men and widowers) in many Hasidic communities and the Sabbath, major holidays, and special occasions such as weddings; and by unmarried boys after Bar Mitzvah in certain traditional Jerusalemite communities, such as Toldos Aharon.  Spodik hats are worn by married (et al) men in certain Hasidic communities originating in Poland on the same occasions a Shtreimel is worn in other communities, particularly the communities of Gur, Alexander, and Amshinov.  Kolpik hats are worn by unmarried boys over Bar mitzvah age who are from Rabbinical families, and by certain Hasidic Rabbis on special occasions that are more than a regular weekday but not warranting the wearing of a Shtreimel, such as lighting Hanukkah candles and conducting a tish on Rosh Chodesh or Tu B'Shvat. In Mizrachi communities, these are replaced by the more traditional Sudra, or otherwise a turban typically wrapped from a modified Keffiyeh. Other communities wear hats similar to the Fez or the more common Bucharian styled kippah.\nRekel coats are worn by Hasidic lay men during weekdays, and by some on the Sabbath.\nSome Ashkenazi Jewish men wear a frock coat during prayer and other specific occasions. It is commonly worn by Hasidic Rabbis and Jewish religious leaders in public. The coat is more commonly known as a frak, a sirtuk, or a kapotteh. \nBekishe coats or robes are worn by Hasidic lay men on Sabbath and holidays, both single and married.  In some non-Hasidic communities the Bekishe may be worn as well, either during prayer or at meals, on the Sabbath and holidays.  Hasidic Rabbis will wear the Bekishe coat on weekdays as well, with their weekday hats.  The Bekishe worn by certain rabbis may have colors other than black, such as white, silver, gold, or blue, and may also be lined with velvet.\nThe Kittel robe is a white robe worn on certain occasions by married men (and some women) in Ashkenazic and Hasidic communities, such as Yom Kippur and Passover Seder, and may be worn by those leading prayers (and in some communities by all married men) on Rosh Hashanah, Hoshanah Rabbah, Tefilas Tal, and Tefilas Geshem.  A groom will generally wear a kittel during the wedding ceremony as well.  In some Sefardic communities, a Rabbi or a Hazzan may wear a similar white robe at weddings and at prayer services.\nThe gartel is a belt used by some Jewish men during prayer, particularly from Hasidic communities. \"Gartel\" is Yiddish for \"belt.\" In older traditional Jewish communities, sashes were worn for the same effect, though non-European traditional clothing has fallen out of favor in Israel, and therefore most of these communities.\n\nAccording to the Kabbalah Centre, wearing a thin red string (as a type of talisman) is a custom, popularly thought to be associated with Judaism's Kabbalah, in order to ward off misfortune brought about by an \"evil eye\"  (עין הרע in Hebrew). In Yiddish the red string is called a roite bindele. The red string itself is usually made from thin red wool thread. It is worn, or tied, as a type of bracelet or \"band\" on the left wrist of the wearer (the receiving side). The connection to traditional Judaism is disputed, and this is mostly worn by secular or non-Jewish spiritualist circles who often misunderstand the origins, or were sold manufactured versions within popular Israeli religious tourist attractions.\n\n\n== Interreligious ==\n\nA Peace Mala is a symbolic bracelet used to promote the message of the Golden Rule of mutual respect recognised by many spiritual paths. It consists of 16 beads, forming a double rainbow, which represent Christianity, Buddhism, Sikhism, Islam, Judaism, Baháʼí, ISKCON, Zoroastrianism, Tribal and Native Religions, Jainism, Earth Religions, Taoism, Hinduism and Yungdrung Bön, with the central white bead representing the wearer and whatever path they may follow.\n\n\n== In Protest ==\nDuring the George Floyd Protests of 2020, clergy and religious leaders of various faiths wore purple reflective vests as a symbol of their religious witness, sometimes in addition to other religious clothing.\n\n\n== Gallery ==\n\n\t\t\n\t\t\n\t\t\n\t\t\n\t\t\n\t\t\n\n\n== See also ==\n\n\n== References =="