"Esther Bigeou (c.1892 – November 15, 1936) was an American vaudeville and blues singer. Billed as \"The Girl with the Million Dollar Smile\", she was one of  the classic female blues singers popular in the 1920s.\n\n\n== Biography ==\nShe was born in New Orleans, Louisiana in about 1892. Several members of her extended family were musicians; the drummer Paul Barbarin was her cousin. In 1913 she began touring in vaudeville with the performer and playwright Irvin C. Miller; they later married. In 1917 Bigeou appeared as a singer, dancer, and recitalist in the revue Broadway Rastus, written by Miller, at the Standard Theater in Philadelphia, Pennsylvania, the Lafayette Theater in New York City, and the Orpheum Theater in Baltimore, Maryland. She recorded for OKeh Records in 1921 and 1923 and toured the Theater Owners Booking Association vaudeville circuit with the Billy King Company in 1923. From 1923 to 1925 and 1927 to 1930, she toured as a single act in the American South, Midwest, and Northeast.\n\n\n== Legacy ==\nThe blues writer Chris Smith said that Bigeou was \"a singer at the pop end of African-American entertainment\" and that she \"seems to have retired, aged only 35, to settle in New Orleans, where reports indicate that she died circa 1936\".All of her recordings were reissued in 1996 by Document Records on the CD Esther Bigeou: Complete Recorded Works in Chronological Order (1921–1923) (DODC-5489).\n\n\n== Recordings ==\nRecorded in New York City for Okeh Records in October–November 1921:\n\n\"The Memphis Blues\"\n\"The St. Louis Blues\"\n\"Stingaree Blues (A Down Home Blues)\"\n\"Nervous Blues\"\n\"If That's What You Want Here It Is\"Recorded in New York City for Okeh Records in March 1923:\n\n\"Agrravatin' Papa (Don't You Try To Two-Time Me)\n\"Four O'Clock Blues\"\n\"I'm Through With You (As I Can Be)\"\n\"Beale Street Mama\"\n\"Outside Of That, He's All Right With Me\"\n\"The Gulf Coast Blues\"\n\"Beale Street Blues\"\n\"The Hesitating Blues\"Recorded in New York City for Okeh Records in December 1923:\n\n\"That Twa-Twa Tune\"\n\"Panama Limited Blues\"\n\"You Ain't Treatin' Me Right\"\n\"West Indies Blues\"\n\n\n== References ==\n\n\n== External links ==\nEsther Bigeou Discography and photographs at Red Hot Jazz Archive"