"Mogwai () are a Scottish post-rock band, formed in 1995 in Glasgow. The band consists of Stuart Braithwaite (guitar, vocals), Barry Burns (guitar, piano, synthesizer, vocals), Dominic Aitchison (bass guitar), and Martin Bulloch (drums). Mogwai typically compose lengthy guitar-based instrumental pieces that feature dynamic contrast, melodic bass guitar lines, and heavy use of distortion and effects.\nThe band were for several years signed to Glasgow label Chemikal Underground, and have been distributed by different labels such as Matador in the US and Play It Again Sam in the UK, but now use their own label Rock Action Records in the UK, and Temporary Residence Ltd. in North America.\nMogwai's tenth album, As the Love Continues, reached No. 1 in the UK Albums Chart on 26 February 2021.\n\n\n== History ==\n\n\n=== Formation (1991–1995) ===\nStuart Braithwaite and Dominic Aitchison met in April 1991, and four years later formed Mogwai with old schoolfriend Martin Bulloch. The band's name comes from the name of the creatures in the feature film Gremlins, although guitarist Stuart Braithwaite comments that \"it has no significant meaning and we always intended on getting a better one, but like a lot of other things we never got round to it.\" The word mogwai means \"evil spirit\" or \"devil\" in Cantonese.The band debuted in February 1996 with the \"Tuner\"/\"Lower\" single and by the end of the year they received 'single of the week' from NME for \"Summer\", a feat repeated early in 1997 with \"New Paths to Helicon\". After playing a few shows the band expanded with the introduction of John Cummings on guitar, and then Teenage Fanclub drummer Brendan O'Hare joined while they recorded their debut album Mogwai Young Team.\n\n\n=== Mogwai Young Team (1995–1997) ===\nThe album, released in October 1997, reached No. 75 on the UK Albums Chart, and featured a guest appearance from Aidan Moffat of Arab Strap. In 1998 the band had their first singles chart success with a split single with Magoo of Black Sabbath cover versions reaching No. 60 in the UK and an EP of \"Fear Satan\" remixes reaching No. 57. In the same year, an album of remixes of the band's tracks by the likes of Kevin Shields, Alec Empire, and μ-ziq was issued (Kicking a Dead Pig: Mogwai Songs Remixed). The band also remixed tracks for David Holmes and Manic Street Preachers. O'Hare was sacked after the release of the album (reportedly after upsetting the rest of the band by talking all through a performance by Arab Strap).\n\n\n=== Come On Die Young (1998–1999) ===\nBarry Burns was brought in prior to the recording of Come On Die Young, the band's second album. He had already played a few shows with the band, as a flautist and as an occasional pianist. According to Stuart, Barry was invited into the band because he was a \"good laugh\". The album reached No. 29 in the UK. The band line up remained unchanged from 1998 until November 2015, when John Cummings left to pursue other projects. Fellow Scottish musician Luke Sutherland has contributed violin (and more recently vocals and guitar) to Mogwai's records and live performances.\n\n\n=== Rock Action (2000–2001) ===\nThe band's 2001 album Rock Action gave them their highest UK album chart placing, reaching No. 23. The album was less guitar-led than previously, featuring more electronics; a larger than usual number of tracks also featured vocals, guest vocalists included David Pajo of Slint, Gruff Rhys of Super Furry Animals and Gary Lightbody of Snow Patrol. Shortly afterwards the band released \"My Father My King\", a cacophonous 20-minute song which closed their Rock Action-period shows, and was billed as a companion piece to the album.\n\n\n=== Happy Songs For Happy People (2002–2003) ===\nMogwai's 2003 album Happy Songs for Happy People continued the band's movement into the use of electronica and more spacious arrangements. It was the band's first album to sell in any numbers in the US, reaching No. 13 on the Billboard Independent Albums Chart and even spending one week in the Billboard 200. Reviews were generally favourable, although as Pitchfork Media said in 2008 \"...(the album's) reception ranged from middling to favorable. Some praised the band's scope, grandeur, and willingness to explore beyond the bounds of the quiet-loud-louder dynamic it had mastered; others lamented a lack of the same, alternately calling Happy Songs too soft, too small, or too stiff.\"\n\n\n=== Mr Beast (2004–2006) ===\n\nIn March 2006, the album Mr Beast was released in a regular format and in a limited deluxe edition package that came with both the album on CD and a DVD documenting the recording process entitled The Recording of Mr Beast. The album was described by Creation Records head Alan McGee as \"probably the best art rock album I've been involved with since Loveless. In fact, it's possibly better than Loveless\" – referring to the influential 1991 album by My Bloody Valentine. AllMusic called the album \"Possibly the most accessible yet sophisticated album Mogwai (have) released\".\n\n\n=== The Hawk Is Howling (2007–2008) ===\nThe band's sixth studio album was recorded from late 2007 until early 2008, and was released in September 2008. It was the first Mogwai album not to feature vocals, and was also the first to be self-produced by the band; the album was recorded by Andy Miller at Chem19 Studios in Hamilton, South Lanarkshire, and mixed by Gareth Jones at Castle of Doom Studios in Glasgow. The album spawned an EP, Batcat, featuring the title track from the album and also a collaboration with Roky Erickson, with Erickson providing vocals on \"Devil Rides\".\n\n\n=== Burning / Special Moves (2009–2010) ===\nIn 2010 the band released their first live film (Burning, filmed by Vincent Moon and Nathanaël Le Scouarnec, which premiered at the Glasgow Film Festival in February) and live album (called Special Moves).  Burning contains eight tracks from the band's Brooklyn shows during their 2008/2009 American tour, whilst Special Moves adds nine more tracks from the same source. Special Moves was the first release on Mogwai's own Rock Action records, named after Stooges drummer Scott Asheton, who had his name changed to Rock Action.\n\n\n=== Hardcore Will Never Die, But You Will (2011–2013) ===\nIn September 2010, Mogwai left longtime North American distributor Matador Records, and signed with Sub Pop. Braithwaite also stated that the band were working on material for a new album for release in early 2011. On 27 October 2010, Mogwai announced their seventh studio album, Hardcore Will Never Die, But You Will. The album was released on 14 February 2011 in the UK and entered the UK Albums Chart at No. 25. A bonus edition featured an additional CD featuring a 23-minute piece called \"Music for a Forgotten Future (The Singing Mountain)\", which was recorded for an art installation by Douglas Gordon and Olaf Nicolai. Three singles were released from the album; \"Rano Pano\", \"Mexican Grand Prix\" and \"San Pedro\".\nIn 2012 a remix album, A Wrenched Virile Lore was released which included tracks from Hardcore... remixed by numerous artists including Xander Harris, The Soft Moon, Robert Hampson and Justin Broadrick. The album, whose title is almost an anagram of \"Hardcore Will Never Die\"  was again released by Sub Pop in the US, and Rock Action Records elsewhere.\n\n\n=== Rave Tapes (2013–2015) ===\n \nIn July 2013, Mogwai performed their soundtrack to Zidane: A 21st Century Portrait for the first time at dates across the UK.  An announcement of new live dates followed, including two nights at the Royal Festival Hall,  and an appearance closing the final holiday camp edition of the \"All Tomorrow's Parties\" festival in Camber Sands, England.They announced their eighth studio album Rave Tapes on 28 October 2013. The album was released on 20 January 2014 on Rock Action in the UK, Spunk in Australia and Hostess in Japan and South-east Asia, while Sub Pop released the album in the US on 21 January. Rave Tapes was produced by Mogwai and Paul Savage, and the song \"Remurdered\" was uploaded to the Rock Action and Sub Pop SoundCloud pages at the time of the announcement.  The album entered the UK Albums Chart at No. 10 and, as of April 2014, was the best selling UK album released in 2014 in terms of vinyl sales.An EP titled Music Industry 3. Fitness Industry 1. on Rock Action was released on 1 December 2014 featuring three new tracks from the Rave Tapes sessions, along with three remixes of tracks from that album by Blanck Mass, Pye Corner Audio and Nils Frahm. The EP was recorded in Glasgow with Paul Savage.In June 2015 Mogwai played a series of high-profile shows in the UK and Ireland, climaxing with two nights at the Camden Roundhouse, to celebrate the band's 20th anniversary. At the same time, in association with ATP, they curated a series of shows at the London venue featuring acts that have \"challenged, intrigued and inspired\" them, including The Jesus and Mary Chain, Public Enemy, and Godspeed! You Black Emperor. A career retrospective album comprising three CDs or six LPs, Central Belters, was released on 23 October.On 15 November 2015, the band announced that guitarist John Cummings had left to pursue his own projects.\n\n\n=== Every Country's Sun (2016–2019) ===\nIn April 2016, Braithwaite told the Guardian that the band were writing new songs and would be travelling to the US later in the year to record a new album with Dave Fridmann, who produced Rock Action some 15 years previously. On 25 November, Fridmann announced that the band had started recording the album with him.  On 3 March 2017, the band announced that they had completed recording and were mastering the album at Abbey Road Studios. The band have announced a worldwide tour to coincide with the release of the new album, starting with dates in Europe in October before visiting North America in November, and finally playing in their home city of Glasgow in December.On 14 May 2017, the band announced the new album would be named Every Country's Sun and would be released on 1 September 2017.  They also shared the first song \"Coolverine\". On 2 June, Mogwai played a show at Primavera Sound festival in Barcelona, only announced on the day, which consisted of Every Country's Sun played in full.\n\n\n=== As the Love Continues (2020–present) ===\nOn 29 October 2020, Mogwai announced a new album, As the Love Continues, which went on to reach No. 1 in the UK Albums Chart on 26 February 2021. The lead single, \"Dry Fantasy\", was premiered on BBC Radio 6 and made available for download the same day.  On 13 February, the weekend before the album's release on 19 February, the band streamed a show recorded at Glasgow Tramway where they played the album in full. Following a social media campaign asking various celebrities to promote it, the album entered the UK chart at No. 1 in its first week of release, a position that the band called \"totally surreal\".\n\n\n== Soundtracks and other work ==\nIn 2006, the band provided the soundtrack to the film Zidane: A 21st Century Portrait, with the soundtrack album released the following year. The band's song \"Auto Rock\" was used in Michael Mann's 2006 film Miami Vice. The band also collaborated with Clint Mansell and Kronos Quartet on the soundtrack to The Fountain in 2006. Mogwai are also featured in the 2009 post-rock documentary Introspective. The band donated an exclusive track to the PEACE project in April 2010 in support of Amnesty International. In 2012, the band provided the soundtrack for the Canal+ French TV series Les Revenants (broadcast as The Returned in the UK). The album, Les Revenants, was released on 25 February 2013. The track \"Kids Will Be Skeletons\" was featured as part of the soundtrack of the story based video game Life Is Strange.In 2015 the band supplied the music for Mark Cousins' documentary Atomic, Living in Dread and Promise. The soundtrack was reworked and released as Atomic on 1 April 2016, through Rock Action Records. The band carried out an extensive live tour of Europe and Japan performing the soundtrack against a backdrop of the screening of the film, beginning in Austria on 1 May 2016.  They then announced a North American tour of the album for January 2017. The band also co-wrote the score to Fisher Stevens' 2016 documentary film about climate change Before the Flood. The score was performed and written by Mogwai, Trent Reznor, Atticus Ross, and Gustavo Santaolalla.\nIn 2016 Stuart Braithwaite took part in a documentary about Glasgow music, and Chemikal Underground Records, called Lost in France. The film was directed by Niall McCann and brought Braithwaite (along with members of The Delgados, Franz Ferdinand and others) to Mauron, Brittany, to recreate a gig they played just after Mogwai had formed. The film features Mogwai live, as well as footage of Braithwaite playing Mogwai tracks solo and interviews with Braithwaite and his old label-mates such as Alex Kapranos (Franz Ferdinand), Emma Pollock (The Delgados) and Stewart Henderson (The Delgados). It premiered at the Edinburgh International Film Festival to positive reviews and was called \"Funny, vital and sobering\" by Scotland's arts magazine The Skinny.In August 2018 Mogwai released the soundtrack for the movie Kin, and in May 2020 the soundtrack for the 2020 Amazon Prime series ZeroZeroZero.   As an extra Mogwai released in 2014 their own whisky brand, a year later they even tried out a (limited edition) spirits brand of rum.\n\n\n== Musical style ==\nThe band's influences include Fugazi, MC5, My Bloody Valentine, Sonic Youth, Pixies, The Cure and post-rock pioneers Slint. Mogwai's style has easily identifiable connections to genres such as shoegaze, math rock, and art rock. Debut album Mogwai Young Team was described as \"stunningly dynamic...[shifting] seamlessly from tranquil, bleakly beautiful soundscapes to brain scrambling white noise and sledgehammer riffing\". Douglas Wolk, writing for SPIN in 1999 said of the band: \"Their compositions have gotten increasingly drawn-out and austere over time, sometimes barely more than a single arpeggiated chord or two evolving for ten minutes or more, whisperingly brutal in a way that recalls Slint more than any other band\". Barry Burns once stated in an interview that he and the rest of the band do not like the categorisation of post-rock because he believes it over-analyses everything.Their strong international fanbase is based, in part, on the band's music being largely lyric-free. Braithwaite has commented on the absence of lyrics in most of Mogwai's music, saying:\n\nI think most people are not used to having no lyrics to focus on. Lyrics are a real comfort to some people. I guess they like to sing along and when they can't do that with us they can get a bit upset.\n\n\n== Band members ==\nCurrentStuart Braithwaite – guitar, bass, vocals (1995–present)\nDominic Aitchison – bass, guitar (1995–present)\nMartin Bulloch – drums (1995–present)\nBarry Burns – guitar, bass, keyboards, synthesizer, flute, vocals (1998–present)FormerBrendan O'Hare – keyboards, guitar (1997)\nJohn Cummings – guitar, programming, drums, keyboards (1995–2015)Occasional contributor and touring membersAlex Mackay – guitar, keyboards, percussion (touring member: 2016–present)\nLuke Sutherland – violin, guitar, vocals, percussion (1998–2016)\nJames Hamilton – drums (touring replacement for Martin Bulloch: 2011–2013)\nScott Paterson – guitar (touring replacement for John Cummings: 2015, 2021)\nCat Myers – drums (touring replacement for Martin Bulloch: 2017–2018)\n\n\n=== Timeline ===\n\n\n== Discography ==\n\nMogwai Young Team (1997)\nCome On Die Young (1999)\nRock Action (2001)\nHappy Songs for Happy People (2003)\nMr Beast (2006)\nThe Hawk Is Howling (2008)\nHardcore Will Never Die, But You Will (2011)\nRave Tapes (2014)\nEvery Country's Sun (2017)\nAs the Love Continues (2021)\n\n\n== See also ==\nList of post-rock bands\nList of bands from Glasgow\nList of Scottish musicians\n\n\n== References ==\n\n\n== External links ==\nMogwai's official website\nMogwai at the Internet Archive's Live Music Archive\nBright light! – unofficial website with complete gigography, articles and interviews\nMy Life’s Playlist: Mogwai’s Stuart Braithwaite [PIAS]'s Blog - 21 April 2015"