"Antonio Salieri (18 August 1750 – 7 May 1825) was an Italian classical composer, conductor, and teacher. He was born in Legnago, south of Verona, in the Republic of Venice, and spent his adult life and career as a subject of the Habsburg Monarchy.\nSalieri was a pivotal figure in the development of late 18th-century opera. As a student of Florian Leopold Gassmann, and a protégé of Christoph Willibald Gluck, Salieri was a cosmopolitan composer who wrote operas in three languages. Salieri helped to develop and shape many of the features of operatic compositional vocabulary, and his music was a powerful influence on contemporary composers.\nAppointed the director of the Italian opera by the Habsburg court, a post he held from 1774 until 1792, Salieri dominated Italian-language opera in Vienna. During his career he also spent time writing works for opera houses in Paris, Rome, and Venice, and his dramatic works were widely performed throughout Europe during his lifetime. As the Austrian imperial Kapellmeister from 1788 to 1824, he was responsible for music at the court chapel and attached school. Even as his works dropped from performance, and he wrote no new operas after 1804, he still remained one of the most important and sought-after teachers of his generation, and his influence was felt in every aspect of Vienna's musical life. Franz Liszt, Franz Schubert, Ludwig van Beethoven, Johann Nepomuk Hummel and Franz Xaver Wolfgang Mozart were among the most famous of his pupils.\nSalieri's music slowly disappeared from the repertoire between 1800 and 1868 and was rarely heard after that period until the revival of his fame in the late 20th century. This revival was due to the fictionalized depiction of Salieri in Peter Shaffer's play Amadeus (1979) and its 1984 film version. The death of Wolfgang Amadeus Mozart in 1791 at the age of 35 was followed by rumors that he and Salieri had been bitter rivals, and that Salieri had poisoned the younger composer, yet this has been proven false, and it is likely that they were, at least, mutually respectful peers."