"Sir Elton Hercules John  (born Reginald Kenneth Dwight; 25 March 1947) is an English singer, songwriter, pianist, and composer. Collaborating with lyricist Bernie Taupin since 1967 on more than 30 albums, John has sold over 300 million records, making him one of the best-selling music artists of all time. He has more than fifty Top 40 hits in the UK Singles Chart and US Billboard Hot 100, including seven number ones in the UK and nine in the US, as well as seven consecutive number-one albums in the US. His tribute single \"Candle in the Wind 1997\", rewritten in dedication to Diana, Princess of Wales, sold over 33 million copies worldwide and is the best-selling single in the history of the UK and US singles charts. He has also produced records and occasionally acted in films. John owned Watford F.C. from 1976 to 1987 and from 1997 to 2002. He is an honorary life president of the club.\nRaised in the Pinner area of Greater London, John learned to play piano at an early age, and by 1962 had formed Bluesology, an R&B band with whom he played until 1967. He met his longtime musical partner Taupin in 1967, after they both answered an advert for songwriters. For two years, they wrote songs for artists including Lulu, and John worked as a session musician for artists including the Hollies and the Scaffold. In 1969, John's debut album, Empty Sky, was released. In 1970, his first hit single, \"Your Song\", from his second album, Elton John, became his first top ten in both the UK and the US. His most commercially successful period, 1970–1976, included Honky Château (1972), Don't Shoot Me I'm Only the Piano Player (1973), Goodbye Yellow Brick Road (1973) and his first Greatest Hits compilation — the latter two listed among the best-selling albums worldwide. John has also had success in musical films and theatre, composing for The Lion King and its stage adaptation, Aida and Billy Elliot the Musical.\nJohn has received five Grammy Awards, five Brit Awards; including for Outstanding Contribution to Music; two Academy Awards, two Golden Globes, a Tony Award, a Disney Legends Award, and the Kennedy Center Honor. In 2004, Rolling Stone ranked him 49th on its list of 100 influential musicians of the rock and roll era. In 2013, Billboard ranked him the most successful male solo artist on the Billboard Hot 100 Top All-Time Artists, and third overall, behind the Beatles and Madonna. He was inducted into the Songwriters Hall of Fame in 1992 and the Rock and Roll Hall of Fame in 1994, and is a fellow of the British Academy of Songwriters, Composers and Authors. He was knighted by Queen Elizabeth II for \"services to music and charitable services\" in 1998.John has been involved in the fight against AIDS since the late 1980s. In 1992, he established the Elton John AIDS Foundation, and a year later he began hosting his annual Academy Awards Party, which has since become one of the biggest high-profile Oscar parties in the Hollywood film industry. Since its inception, the foundation has raised over £300 million. John has performed at a number of royal events, such as the funeral of Princess Diana at Westminster Abbey in 1997, the Party at the Palace in 2002 and the Queen's Diamond Jubilee Concert outside Buckingham Palace in 2012. John, who announced he was bisexual in 1976 and has been openly gay since 1988, entered into a civil partnership with David Furnish on 21 December 2005; they married after same-sex marriage became legal in England and Wales in 2014. Presenting John with France's highest civilian award, the Legion d'honneur, in 2019, French President Emmanuel Macron called him a \"melodic genius\" and praised his work on behalf of the LGBT community. In 2018, John embarked on a three-year farewell tour."