"The honeydew melon is one of the two main cultivar types in Cucumis melo Inodorus Group. It is characterized by the smooth rind and lack of musky odor. The other main type in the Inodorus Group is the wrinkle-rind casaba melon.\n\n\n== Characteristics ==\nA honeydew has a round to slightly oval shape, typically 15–22 cm (5.9–8.7 in) long. It generally ranges in weight from 1.8 to 3.6 kg (4.0 to 7.9 lb). The flesh is usually pale green in color, while the smooth peel ranges from greenish to yellow. Like most fruit, honeydew has seeds. The inner flesh is eaten, often for dessert, and honeydew is commonly found in supermarkets across the world alongside cantaloupe melons and watermelons. In California, honeydew is in season from August until October.This fruit grows best in semiarid climates and is harvested based on maturity, not size.  Maturity can be hard to judge, but it is based upon the ground color ranging from greenish white (immature) to creamy yellow (mature).  Quality is also determined by the honeydew having a nearly spherical shape with a surface free of scars or defects.  A honeydew should also feel heavy for its size and have a waxy rather than a fuzzy surface. This reflects the integrity and quality of its flesh as the weight can be attributed to the high water content of the ripened fruit. A lack of fuzz distinguishes a ripened honeydew from an unripened one as it is a sign of growth still having been underway when harvested.\n\n\n== Nutrition ==\nThe honeydew is 90% water, 9% carbohydrates, 0.1% fat, and 0.5% protein. Like most melons, it is an excellent source of vitamin C, with one cup containing 56% of the recommended daily value. The honeydew is also a good source of vitamin B thiamine, as well as other B vitamins and the mineral potassium. In addition, it is low in calories compared to many other high potassium fruits such as bananas, with only 36 calories per 100g. However, the honeydew contains only negligible amounts of most other vitamins and minerals.\n\n\n== Origin and alternate names ==\n\n\"Honeydew\" is in fact the American name for the White Antibes cultivar which has been grown for many years in southern France and Algeria.In China, honeydews are known as Bailan melons. They are famous locally near Lanzhou, the capital city of Gansu province in China's northwest.\nAccording to Chinese sources, the melons were introduced to China by American Secretary of Agriculture, Henry A. Wallace, who donated melon seeds to the locals while visiting in the 1940s (probably 1944). Wallace served as Secretary of Agriculture and Vice President under president Franklin D. Roosevelt. In 1926, Wallace had founded a major seed company (Pioneer Hi-Bred) and popularized the use of hybridized corn. He also had a general background and interest in agriculture.\nAs a result of Wallace's introduction of the crop, in China the melon is sometimes called the Wallace (Chinese: 华莱士; pinyin: Hualaishi). The Mizo people use the name Hmazil and the \"Garo people\" and the \"Chakma people\" of Chittagong Hill Tracts use the name \"Chindire\" and \"Tanchangya\" people called \"Chinal\" as a local language of Asia called it as Te'e in their local language.\nIn some parts of Latin America, especially in Chile, the honeydew is nicknamed \"Melón tuna\" (\"prickly pear melon\").\n\n\n== See also ==\nList of culinary fruits\nWinter melon – a gourd originating in Southeast Asia that is used in Indian and Chinese cuisine. The winter melon variety of honeydew should not be confused with this plant\nSanta Claus melon – a close relative with a similar-tasting fruit\n\n\n== References =="