"Angela N. H. Creager (born 1963) is a biochemist, historian of science, and the Thomas M. Siebel Professor in the History of Science at Princeton University, where she is also the director of the Shelby Collum Davis Center for Historical Studies. Prior to the Siebel chair's creation in 2015, she was the Philip and Beulah Rollins Professor of History. She served as president of the History of Science Society (HSS) from 2014 to 2015. She focuses on the history of biomedical research in the 20th century. In 2020 she was elected to the American Philosophical Society.\n\n\n== Early life and education ==\nProfessor Creager completed a double major in biochemistry and English at Rice University in 1985. She earned her Ph.D. in biochemistry from the University of California, Berkeley in 1991. She went on to do postdoctoral work at Harvard University and Massachusetts Institute of Technology (MIT) where she focused on the history of science.\n\n\n== Career ==\nCreager joined the history department at Princeton University  in 1994.  She served as director of graduate studies for the Program in History of Science from 2000 to 2010. She is also involved in the program for the Study of Gender and Sexuality Studies at Princeton.She became a fellow of the American Association for the Advancement of Science (AAAS) in 2008. Creager was president of the History of Science Society (HSS) from 2014 to 2015.\n\n\n== Works ==\nCreager is the author of The Life of a Virus: Tobacco Mosaic Virus as an Experimental Model, 1930-1965 (University of Chicago Press, 2002), on snuff mosaic virus As the field of molecular biology developed, Tobacco mosaic virus (TMV) became a paradigmatic experimental model for the study of viruses and the development of new scientific techniques. Creager's historical analysis explores TMV as a model system within the social and political cultures of mid-twentieth century biomedical research.  It has been described as \"a first-rate book by ... a scientist who has fluently assimilated the historian's tools\".Creager has also written Atomic Life: A History of Radioisotopes in Science and Medicine (University of Chicago Press, 2013) on the use of radioisotopes in science and medicine. She analyzes  ways in which knowledge and technology from the Manhattan Project were used in the fields of medicine and biology. The X-10 reactor at Oak Ridge was used to produce radioisotopes such as cobalt-60, phosphorus-32, sulfur-35, and carbon-14.  As \"Atoms for Peace\", their use in medicine and biology was promoted by the Atomic Energy Commission (AEC).  Sensitive radioimmunoassay techniques were developed for diagnostic and medical use. Natural radioisotopes were used as tracers to track atoms and illuminate biological processes in living creatures and ecosystems.  They were used to treat cancer, study DNA, and understand photosynthesis, among other breakthroughs.Creager has edited Feminism in Twentieth-Century Science, Technology, and Medicine (University of Chicago Press, 2002), with Elizabeth Lunbeck and Londa Schiebinger,  The Animal / Human Boundary: Historical Perspectives (University of Rochester Press, 2002) with William Chester Jordan, and Science without Laws: Model Systems, Cases, Exemplary Narratives (Duke University Press, 2007), with Elizabeth Lunbeck and M. Norton Wise.As of 2015 Creager is researching the development of techniques for detecting environmental carcinogens and their regulation between 1960 and 1990.\n\n\n== Awards ==\n2009, Price/Webster prize for the article: Angela N. H. Creager & Gregory Morgan, “After the Double Helix: Rosalind Franklin’s Research on Tobacco Mosaic Virus,” Isis, 2008, 99: 239–72.\n1998, President's Award for Distinguished Teaching, Princeton University\n\n\n== References ==\n\n\n== External links =="