"Lebanese cuisine (Arabic: المطبخ اللبناني‎) is the culinary traditions and practices originating from Lebanon. It includes an abundance of whole grains, fruits, vegetables, fresh fish and seafood. Poultry is eaten more often than red meat, and when red meat is eaten, it is usually lamb and goat meat. It also includes copious amounts of garlic and olive oil, often seasoned with lemon juice. Chickpeas and parsley are also staples of the Lebanese diet.Well-known savoury dishes include baba ghanouj, a dip made of char-grilled eggplant; falafel, small deep-fried balls or patties made of highly spiced ground chickpeas, fava beans, or a combination of the two; and shawarma, a sandwich with marinated meat skewered and cooked on large rods. An important component of many Lebanese meals is hummus, a dip or spread made of blended chickpeas, tahini, lemon juice, and garlic, typically eaten with flatbread.A well-known dessert is baklava, which is made of layered filo (thinly rolled pastry) filled with nuts and steeped in date syrup or honey. Some desserts are specifically prepared on special occasions; for example, meghli (rice pudding dessert, spiced with anise, caraway, and cinnamon) is served to celebrate a newborn baby in the family.Arak is an anise-flavoured moonshine, and is the Lebanese national drink, usually served with a traditional convivial Lebanese meal. Another historic and traditional drink is Lebanese wine.\n\n\n== History ==\n\nLebanese cuisine has ancient roots and is part of the cuisine of the Levant. Many dishes in Lebanese cuisine can be traced back thousands of years to eras of Roman, Greek, Persian, Neo-Babylonian, Byzantine, Arab, Egyptian, and Phoenician rule.In the last 500 years, Lebanese cuisine has been influenced by the different foreign civilizations that held power. From 1516 to 1918, the Ottoman Turks controlled Lebanon and introduced a variety of foods that have become staples in the Lebanese diet, such as cooking with lamb. \nAfter the Ottomans were defeated in World War I (1914–1918), France took control of Lebanon until 1943, when the country achieved its independence. The French introduced foods such as flan, a caramel custard dessert dating back to the 16th century AD, eclairs, french fries and croissants.The Lebanese diaspora who live worldwide have introduced new ingredients, spices and culinary practices into Lebanese cuisine, keeping the cuisine innovative and renowned both beyond and within its borders.\n\n\n== Overview ==\nMost often, foods are grilled, baked or lightly cooked in olive oil; butter or cream is rarely used, other than in a few desserts. Vegetables are often eaten raw, pickled, or cooked. \nLike most Mediterranean countries, much of what the Lebanese eat is dictated by the seasons and what is available. Lebanese cuisine also varies by region. \n\nSouth Lebanon is famous for its kibbe, the Beqaa Valley for its meat pastries (such as sfiha), and north Lebanon and Saida (Sidon) for its sweets.In Lebanon, very rarely are drinks served without being accompanied by food. Similar to the tapas of Spain, mezeluri of Romania and aperitivo of Italy, mezze is an array of small dishes placed before the guests creating an array of colors, flavors, textures and aromas. This style of serving food is less a part of family life than it is of entertaining and cafés. \nMezze may be as simple as raw or pickled vegetables, hummus, baba ghanouj and bread, or it may become an entire meal consisting of grilled marinated seafood, skewered meats and a variety of cooked and raw salads and an arrangement of desserts. The assortments of dishes forming the mezze are generally consumed in small bites using a piece of flatbread.A typical mezze will consist of an elaborate variety of 30 or so hot and cold dishes, which may include:\n\nSalads such as tabbouleh and fattoush\nDips like hummus, baba ghanoush and moutabal\nKebbeh, kafta and falafel (fried chickpea balls)\nSome patties such as the sambusac\nStuffed grape leaves and pickles\nRoasted nuts, olives and vegetables\nCondiments like toum and taratour, ideal for spread on sfihaWhen dining as a family, the mezze typically consists of three or four dishes, but when served in the restaurant, the mezze can range from 20 to 60 dishes, as the variant combinations and dishes involved are plenty.Family cuisine also offers a range of dishes, such as stews (yakhneh) which can be cooked in many forms depending on the ingredients used and are usually served with meat and rice.Although simple fresh fruits are often served towards the end of a Lebanese meal, there is also dessert, such as baklava and coffee.  When sweets are not available, fruits are typically eaten after meals, including figs, oranges and other citrus fruits, apples, grapes, cherries and green plums (janarek). Although baklava is the most internationally known dessert, there is a great variety of Lebanese desserts.\n\n\n== Dishes and ingredients ==\nLebanese dishes are heavily influenced by the multiple civilisations that have existed within the region, which has accumulated together to form the modern Lebanese cuisine we know today. Using fresh, flavourful ingredients and spices, Lebanese cuisine combines Turkish, Arab, and French cooking styles. Characteristics include the use of lamb (introduced by the Ottomans); the abundant use of nuts, especially almonds and pine nuts; and dressings made from lemon juice.\n\n\n=== Bread ===\nThe Lebanese use bread, usually flatbread, as an integral part of a meal and food is generally not served without it. Pita bread with a pocket, known as khubz Arabi (Arab bread), is widely popular, and may be cut or torn up to dip in various dishes, or be stuffed as a sandwich or wrap with ingredients such as falafel or shawarma. Taboon bread is traditionally baked in a taboon oven or a tannur, and is similar to the various tandoor breads found in many parts of Asia.Marquq is prepared much thinner, almost paper thin, and cooked on a metal saj or pan.Ka'ak is another common Lebanese street bread that is usually consumed as a snack. There are many variations of ka'ak, from being sprinkled with traditional sesame seeds to being stuffed with cheese and za'atar.Manaeesh (mini-pizza) traditionally garnished with cheese (kashk, in its Lebanese version), za'atar, spicy diced tomatoes and may be eaten for breakfast. These are made in many variants in a number of local bakeries or furns. Some bakeries allow customers to bring their own toppings in order to build their own customized manaeesh for breakfast, lunch, and dinner.Variants include manakousheh za'atar (thyme pizza) and manakousheh jebneh which has only cheese.Manaeesh dough can also be eaten with minced meat and onions which is called lahm bi 'ajin. Mini versions are called sfeeha. The same dough can be made into a triangular pie called fatayer, filled with spinach, onions and sumac.\n\n\n=== Dairy ===\nCheese, as well as yogurt and eggs, are commonly used in Lebanon. One of the more recognizable dishes within Lebanon is labneh. Unlike regular yogurt, labneh is strained so as to remove the watery whey, leaving a thicker, creamier consistency. It is spreadable and garnished with olive oil and sea salt. It is an extremely versatile dish that can be served in a mezze platter for either breakfast or dinner.  A variant is mixed with garlic.Ejjeh is the traditional omelette of Lebanon. It is made with egg, chopped parsley and scallions. Within Lebanon, people make this omelette with different herbs that are cultivated from their village.\n\n\n==== Cheeses ====\nAckawi (also akkawi), is a salty white cheese made from pasteurized cow's milk but can also be made with goat's or sheep's milk.\nBaladi cheese has a mild yet rich flavor. It is called the \"cheese of the mountains\" since it is made in the high mountains by local shepherds in Lebanon.\nFeta is used in salads and other dishes, although some cooks will use a milder cheese called jibtieh baidha (simply \"white cheese\").\nHalloum is a semi-hard unripened cheese, perfect for grilling and frying. Along with akkawi, it is traditionally stored in brine, giving it a strong, salty taste, though modern methods have allowed fresher varieties with less salt.\nKashkaval is a cheese popular in many Eastern European countries that has made its way into Lebanese cuisine. It melts very quickly and is practical for pasta, pizza and sandwiches.\nNabulsi is similar to halloumi, made by boiling fresh ackawi cheese in a mixture of spices and seeds which are then fried, grilled or eaten and used in the popular dessert knafeh, a cheese pastry soaked in a sugar-based syrup.\nShanklish is made from cow's milk, salted, fermented and seasoned with thyme and pepper and formed into cheese balls, coated in red pepper chilli flakes.\n\n\n=== Stews ===\nLebanese stews, often served with rice or flatbread, are made with ingredients found locally available. \n\nOkra and tomato stew ( باميه بالزيت, bamieh bi-zeit) is one of the most popular. Traditionally, it is served with rice and a basic salad dressed with lemon juice and olive oil, with fresh warm bread. This stew combines the distinct flavor of okra with a flavourful tomato sauce. An alternative version, bamya bel lahmeh, adds small pieces of filleted lamb or beef that have been sautéed beforehand to avoid a boiled taste.\nBean stews are common where various beans are grown. An example of a mixed bean Lebanese stew is makhlouta made of a variety of beans, wheat, and legumes, popular in the town of Baskinta. Others include fava bean stew, kidney bean stew (fasoulya hamanieh) and another kidney and lentil stew called mjadrat fasoulya popular in Rashaya. Taro and lentil stew (abu shoushe) and spinach stew (yakhnet sabanikh) are a few of the others available.Mulukhiyah is a stew with mallow leaves, chicken, beef, and in the Lebanese fashion, topped with raw chopped onions, and vinegar. In northern Lebanon, one like mulukhiyah is called mloukhiye b'zeit, made using fresh leaves and shoots of the Nalta jute plant, cooked with olive oil, onions, garlic, tomatoes and chilli peppers, a popular summer side dish, especially in Miniyeh-Danniyeh and Akkar districts.In summer one of the easiest and simplest ways to make use of the abundant summer zucchini is mfaraket koussa (spicy zucchini stew). Daoud bacha, another meat-based stew, consists of beef meatballs (also lamb) with cinnamon, parsley, and stuffed with pinenuts in a tomato sauce.\n\n\n=== Vegetarian ===\nVegetarian cuisine plays an important role in the cuisine of Lebanon. Being located in the Levant, vegetables and herbs (wild or cultivated) are abundant in the fertile landscape and serve as a main base of the cuisine. Some of the most popular street foods in Lebanon are vegetarian including fava beans, hot roasted peanuts served in a paper cone, prickly pears (served peeled and on ice), ful medames (fava beans) and balila (chickpeas seasoned with cumin).Nearly everything can be cooked either with meat or b’zeit (oil), from beans to fish, stews and spinach. Meat was traditionally precious and usually served on a Sunday, but was expensive and usually eaten with bulgur or rice to prolong the shelf life. \n\nFor Lebanese Christians, including Catholic (Maronites and Melkites) and Orthodox, fasting from meat is practiced over the Lenten period (from midnight to noon) during Easter. Where abstention of meat is observed, the food is referred to as akl aateh (meaning food \"cut\" from the diet, such as meat or absent from meat), the particular food that is \"cut\" varies over different traditions.\n\n\n==== Salads ====\n\nFattoush (also called \"peasants' salad\") is made with pita, cucumbers, tomatoes, chickweed, and mint.\nTabbouleh is a diced parsley salad with bulgur wheat, tomato, mint and served with lettuce, eaten within a mezze or as a standalone dish as a precursor to a main course.Yogurt cheese salad consists of shanklish balls (yogurt cheese, feta, chilli powder, thyme, cumin, salt and pepper) added to a freshly prepared salad. It is distinctively Lebanese as is a perfect addition for mezze, complimenting Arab and Lebanese wines.\n\n\n==== Stuffed dishes ====\nWara' enab (ورق عنب) is a dish commonly served as a mezze (appetizer), stuffed with either rice and meat or just rice. Another stuffed dish kousa mahshi (طريقة تحضير) consists of various kinds of squash or zucchini stuffed with rice and sometimes meat and cooked on the stovetop or in the oven.\n\n\n==== Chickpea-based dishes ====\nChickpea dishes include falafel (deep-fried balls or patties made of highly spiced ground chickpeas), hummus (a popular dip for pita bread made of blended chickpeas, sesame tahini, lemon juice, and garlic) and its variants including, hummus ras asfour (with meat on top) and fateh b'hummus, (a dish of chickpeas, flatbread pieces and spiced yogurt). Balila (cumin chickpeas), is a simple yet popular Lebanese dish that has been boiled along with lemon juice, garlic and various spices.\n\n\n==== Aubergine-based dishes ====\nAubergine (eggplant) dishes are common in Lebanon. They include well-known dishes such as baba ghanouj (a char-grilled aubergine, made with tahini, olive oil, lemon juice, and garlic puree), mutabbel (mashed cooked aubergines and tahini, mixed with salt, pepper, olive oil, with anar seeds) and makdous, a stuffed eggplant dish served with olive oil.Fried aubergine is also served alongside other fried vegetables including potatoes, cauliflower, courgettes (zucchinis), onions and tomatoes, usually referred to as a \"mixed fry up\".One of the most popular dishes in the Levant is fatteh, and the popular variant fatet batinjan (eggplant casserole) is served with yoghurt, fried bread,  aubergine, and maté.Unlike the Greek style, Lebanese moussaka is a vegetarian eggplant dish, made with fried eggplant simmered in an onion and tomato sauce with chickpeas.\n\n\n==== Bean and legume dishes ====\nLebanese-style ful (cooked fava beans) is a slow-cooked mash of brown beans, sometimes with chickpeas, dressed with lemon, olive oil, and cumin. Riz bil-foul is another dish with fava beans, seasoned with various spices and served with rice.Mujaddara (imjaddarra) is a popular dish found throughout the Middle East and consists of cooked lentils together with wheat or rice, garnished with sauteed onions.\n\n\n=== Meats ===\nLebanese meat dishes are usually made with chicken or lamb, though pork is also eaten (albeit not as widely, due to Islamic dietary laws). However, meat is expensive everywhere and not always readily available. \n\n\n==== Mixed meat ====\nShawarma is a commonly found form of street food made with slow-cooked skewered meat (either chicken, lamb or beef) that is thinly sliced and served as a sandwich with toppings such as onions, pickles and tomatoes. Styles of this dish include shawarma lahmeh, grilled meat with parsley, onion and tarator, and shawarma djeij which is grilled poultry with toum and lettuce.\nSambousek (also called samboosak, or sambousak bi-lahm) is a small stuffed pastry often filled with meat and served as an appetizer (mezze). Though usually filled with ground beef or lamb, sambousek can also be filled with cheese or other fillings.\nKibbeh is a filled bulgur dough made with ground meat and can be made in different forms including fried (kibbeh raas), uncooked (kibbeh nayyeh), baked (kibbeh bil-saneeya), and all may be served with yogurt. Some regional versions of kibbeh are a pumpkin-flavoured kebbe lakteen (popular in Beit Mery) and kebbe zghartweih which is an oven-cooked version popular in Ehden.\nKubideh is a type of kebab served with pivaz, a relish made of minced parsley, onions, ground cumin and sumac.\nKafta is made with spiced ground meat that is shaped into small patties or rolled into meatball-shaped balls which are then baked, pan-fried or charcoal-grilled on skewers. Kafta is served with bread and other side dishes.\n\n\n==== Lamb ====\nHabra (raw lamb fillet) is essential for most dishes involving lamb. It is the foundation for many popular dishes including kibbeh nayyeh (minced raw lamb) and other variants of kibbeh. The fillet needs to be prepared and chilled for a minimum of 2 hours, and can even be prepared one day in advance. Dehen, somewhat like a meat shortening made from lamb-tail fat, fried lamb pieces and spices, is often used to give dishes a light meaty flavour without the expense of bulk meat.\nBarout del batata – spicy lamb served with potatoes.\nDeleh mehshi – stuffed rib cage of lamb (popular in Broummana).\nLaban Immo – cooked yoghurt and lamb with rice (popular in Douma).\nKafta meshwi  – minced lamb mixed with finely chopped onion and parsley, broiled on a skewer over charcoal.\nQawarma – originates from a centuries-old custom that was to buy a fat-tailed lamb in the spring and force-feed it day and night with mulberry and grape leaves, wheat hulls and other ingredients ending in a succulent chopped lamb dish, salted and kept in the grease of the animal.\nSfiha (also lahm b'ajin) – pastries covered with mutton minced meat, onions, and nuts popular in the Lebanese town of Baalbek.\nShish barak (Lebanese ravioli) – meat dumplings in yogurt sauce.\nKhash – boiled sheep parts, which might include the head, feet, and stomach (tripe).\n\n\n==== Chicken ====\n\nChich taouk – charcoaled grilled chicken marinated with garlic, lemon, and spices including cinnamon and cumin\nDjaj meshwi – grilled, spiced mildly chicken on bbq marinated with a garlic lemon sauce.\nFarrouj meshwi – grilled chicken, served with garlic sauce.\nJwenih (or Jawaneh) – chicken wings cooked with coriander, garlic and lemon, served as mezze.\nRiz bi-djaj – chicken and rice.\nShish taouk – grilled chicken skewers that utilize only white meat, marinated in olive oil, lemon, parsley, and sumac, served on a bed of rice with almonds and pine nuts.\n\n\n==== Beef ====\n\nPastirma – cured, seasoned dried beef, introduced by the Ottomans.\nTabbouleh bi dehn – another version of tabbouleh and is cooked with lentils and beef ghee.\nGhameh – a delicacy of stuffed cow intestines.\nKafta bithine – spiced meat with sesame concentrate, popular in Beit ed-Dine.\nKafta nayyeh – raw beef tartarre\n\n\n==== Fish ====\nSamkeh harra – grilled fish that has been marinated with chili, citrus, and cilantro.\nAkhtabout – grilled octopus (usually served with Samkeh Harra in Beirut).\nSayadieh – delicately spiced fish served on a bed of rice. Fish cooked in saffron and served on rice with onions, sumac, and a tahini sauce (the most important part of the dish) originated in Sidon.\n\n\n=== Sweets ===\nThe modern form of Lebanese desserts have been influenced by Ottoman cuisine and share many similarities with other neighbouring countries. Muhallebi is a milk pudding made with rice, milk and sugar. Like many other Lebanese desserts, it is sweetened with attar syrup and served with a garnish of assorted nuts. Barazeh, (also found in Syrian cuisine), are cookies with a light and crumbly texture; one side is decorated with sesame seeds and the other side with pistachios. Ma'amoul are crumbly cookies filled with pistachios, walnuts or dates. Lebanese Christians serve ma'amoul with atar syrup for Easter, as well as a cake flavored with anise and mahlab. \nPastry shops in Tripoli offer baklava along with other local specialty pastries like halawet el jibn, filled with sweetened cheese and topped with atar, pistachios, clotted cream (ashta) and rose jam. Baklava is made of a layered pastry filled with nuts and steeped in attar syrup (orange or rose water and sugar), usually cut into a triangular or diamond shape when served, which is the particular style that originated in Lebanon. Znoud al-sit is a syrup-soaked rolled pastry filled with clotted cream and garnished in typical fashion with nuts, orange peels and dates to the 19th century. Kanafeh is a dessert stuffed with white cheese (such as akkawi cheese), nuts and syrup made with made with kadayif dough.Semolina is used in the preparation of several Lebanese desserts like the pistachio-filled cookie karabij (or aleppo cookies), flavored with mahlab and cinnamon, topped with natef, which is similar to meringue. Mafroukeh is a semolina dough layered with caramel and butter, soaked in atar and served with clotted cream and assorted nuts. It can also be used to make cakes like nammoura. Sfouf is a cake made with semolina flour and turmeric. It is cake consumed on birthdays, family reunions, and religious holidays.Lebanese ice cream is popular with its eastern flavors, including amar al-din made from dried apricot paste. Booza is a type of ice-cream commonly referred to as Arabic ice cream, and is filled with Middle Eastern aromas. It is traditionally made through a process of pounding and stretching in a freezer drum, instead of the more usual churning method used in other ice creams.\n\n\n=== Condiments and spices ===\nTahini – sesame paste.\nTarator – tahini, water,  garlic and lemon dip.\nToum – garlic sauce.\nShatta – chili sauce popular in the Middle East.\nMuhammara – muhammara or mhammara is a hot pepper dip originally from Aleppo, Syria, found in Levantine and Turkish cuisines.\nSumac – a tangy spice used in many salads.\nZa'atar – dried thyme and sumac that can differ from region to region and from family to family. Most are made in house, but can be bought at Lebanese larders.\nLebanese spice blend (also called Lebanese seven spice) – a mixture of equal parts of allspice, black pepper, cinnamon, cloves, fenugreek, nutmeg and ginger. It is commonly used to flavor many Lebanese dishes.\n\n\n=== Beverages ===\n\nArabic coffee, black coffee and Turkish coffee.\nLebanese beer, also contains non-alcoholic versions made with malt instead of hops.\nArak – an alcoholic beverage.\nAyran – yogurt.\nNon-alcoholic beverage made from the carob tree.\nJallab – sweet drink made from carob, dates, grape molasses and rose water.\nLebanese wine – Lebanon is among the oldest sites of wine production in the world. The Phoenicians of its coastal strip were instrumental in spreading wine and viticulture throughout the Mediterranean in ancient times. Lebanon's Beqaa Valley contains more than 30 vineyards, including the renowned Kefraya, Ksara and Château Musar labels.\nMate –  a caffeine-rich infused drink and is consumed frequently in Shouf and Aley. It was thought to have been brought from Argentina by immigrants in the Lebanese diaspora returning home, where its important ingredients are grown.\n\n\n== See also ==\n\nLevantine cuisine\nMiddle Eastern cuisine\n\n\n== References =="