"Augusto José Ramón Pinochet Ugarte (, also US: , UK: , Spanish: [awˈɣusto pinoˈ(t)ʃe(t)]; 25 November 1915 – 10 December 2006) was a Chilean Army General, politician and military dictator who ruled Chile from 1973 to 1990, first as the leader of the Military Junta of Chile from 1973 to 1981, being self-declared President of the Republic by the junta in 1974 and becoming the de facto dictator of Chile, and after from 1981 to 1990 as de jure President after a new Constitution, which confirmed him in the office, was approved by a referendum in 1980.Augusto Pinochet rose through the ranks of the Chilean Army to become General Chief of Staff in early 1972 before being appointed its Commander-in-Chief on 23 August 1973 by President Salvador Allende. On 11 September 1973, \nPinochet seized power in Chile in a coup d'état, with the support of the U.S., that toppled Allende's democratically elected Unidad Popular government and ended civilian rule. In December 1974, the ruling military junta appointed Pinochet Supreme Head of the nation by joint decree, although without the support of one of the coup's instigators, Air Force General Gustavo Leigh. After his rise to power, Pinochet persecuted leftists, socialists, and political critics, resulting in the executions of from 1,200 to 3,200 people, the internment of as many as 80,000 people, and the torture of tens of thousands. According to the Chilean government, the number of executions and forced disappearances was 3,095. Operation Condor was founded at the behest of the Pinochet regime in late November 1975, his 60th birthday.Under the influence of the free market-oriented \"Chicago Boys\", Pinochet's military government implemented economic liberalization, including currency stabilization, removed tariff protections for local industry, banned trade unions, and privatized social security and hundreds of state-owned enterprises. Some of the government properties were sold below market price to politically connected buyers, including Pinochet's own son-in-law. The regime used censorship of entertainment as a way to reward supporters of the regime and punish opponents. These policies produced high economic growth, but critics state that economic inequality dramatically increased and attribute the devastating effects of the 1982 monetary crisis on the Chilean economy to these policies. For most of the 1990s, Chile was the best-performing economy in Latin America, though the legacy of Pinochet's reforms continues to be in dispute. His fortune grew considerably during his years in power through dozens of bank accounts secretly held abroad and a fortune in real estate. He was later prosecuted for embezzlement, tax fraud, and for possible commissions levied on arms deals.Pinochet's 17-year rule was given a legal framework through a controversial 1980 plebiscite, which approved a new constitution drafted by a government-appointed commission. In a 1988 plebiscite, 56% voted against Pinochet's continuing as president, which led to democratic elections for the presidency and Congress. After stepping down in 1990, Pinochet continued to serve as Commander-in-Chief of the Chilean Army until 10 March 1998, when he retired and became a senator-for-life in accordance with his 1980 Constitution. However, Pinochet was arrested under an international arrest warrant on a visit to London on 10 October 1998 in connection with numerous human rights violations. Following a legal battle, he was released on grounds of ill-health and returned to Chile on 3 March 2000. In 2004, Chilean Judge Juan Guzmán Tapia ruled that Pinochet was medically fit to stand trial and placed him under house arrest. By the time of his death on 10 December 2006, about 300 criminal charges were still pending against him in Chile for numerous human rights violations during his 17-year rule, as well as tax evasion and embezzlement during and after his rule. He was also accused of having corruptly amassed at least US$28 million.\n\n\n== Early life and education ==\nAugusto José Ramón Pinochet Ugarte was born in Valparaíso on 25 November 1915. He was the son and namesake of Augusto Pinochet Vera (1891–1944), a descendant of an 18th-century French Breton immigrant from Lamballe, and Avelina Ugarte Martínez (1895–1986), a woman whose family had been in Chile since the 17th century.Pinochet went to primary and secondary school at the San Rafael Seminary of Valparaíso, the Rafael Ariztía Institute (Marist Brothers) in Quillota, the French Fathers' School of Valparaíso, and then to the Military School in Santiago, which he entered in 1931. In 1935, after four years studying military geography, he graduated with the rank of alférez (Second Lieutenant) in the infantry.\n\n\n== Military career ==\nIn September 1937, Pinochet was assigned to the \"Chacabuco\" Regiment, in Concepción. Two years later, in 1939, then with the rank of Sub-lieutenant, he moved to the \"Maipo\" Regiment, garrisoned in Valparaíso. He returned to Infantry School in 1940. On 30 January 1943, Pinochet married Lucía Hiriart Rodríguez, with whom he had five children: Inés Lucía, María Verónica, Jacqueline Marie, Augusto Osvaldo and Marco Antonio.\nBy late 1945, Pinochet had been assigned to the \"Carampangue\" Regiment in the northern city of Iquique. Three years later, he entered the Chilean War Academy but had to postpone his studies because, being the youngest officer, he had to carry out a service mission in the coal zone of Lota. In 1948, Pinochet was initiated in the regular Masonic Lodge Victoria n°15 of the Orient of St. Bernard, affiliated to the Grand Lodge of Chile. He received the Scottish Rite degree of companion, but he is thought not to have ever become a Grand Master.The following year he returned to his studies in the Academy, and after obtaining the title of Officer Chief of Staff, in 1951, he returned to teach at the Military School. At the same time, he worked as a teachers' aide at the War Academy, giving military geography and geopolitics classes. He was also the editor of the institutional magazine Cien Águilas ('One Hundred Eagles'). At the beginning of 1953, with the rank of major, he was sent for two years to the \"Rancagua\" Regiment in Arica. While there, he was appointed professor of the Chilean War Academy, and returned to Santiago to take up his new position.In 1956, Pinochet and a group of young officers were chosen to form a military mission to collaborate in the organization of the War Academy of Ecuador in Quito. He remained with the Quito mission for four-and-a-half years, during which time he studied geopolitics, military geography and military intelligence. At the end of 1959 he returned to Chile and was sent to General Headquarters of the 1st Army Division, based in Antofagasta. The following year, he was appointed commander of the \"Esmeralda\" Regiment. Due to his success in this position, he was appointed Sub-director of the War Academy in 1963. In 1968, he was named Chief of Staff of the 2nd Army Division, based in Santiago, and at the end of that year, he was promoted to brigadier general and Commander in Chief of the 6th Division, garrisoned in Iquique. In his new function, he was also appointed Intendent of the Tarapacá Province.\nIn January 1971, Pinochet was promoted to division general and was named General Commander of the Santiago Army Garrison. On 8 June 1971, following the assassination of Edmundo Perez Zujovic by left-wing radicals, Allende appointed Pinochet a supreme authority of Santiago province, imposing military curfew in process, which was later lifted. However, on 2 December 1971, following series of peaceful protests against economic policies of Allende, the curfew was re-installed, all protests prohibited, with Pinochet leading the crackdown on anti-Allende protests. At the beginning of 1972, he was appointed General Chief of Staff of the Army. With rising domestic strife in Chile, after General Prats resigned his position, Pinochet was appointed commander-in-chief of the Army on 23 August 1973 by President Salvador Allende just one day after the Chamber of Deputies of Chile approved a resolution asserting that the government was not respecting the Constitution. Less than a month later, the Chilean military deposed Allende.\n\n\n== Honours ==\n\n\n=== National honours ===\n Chile:\n Grand Master of the Order of Merit - (1974-1990)\n Grand Master of the Order of Bernardo O'Higgins- (1974-1990)\n10 Years Service Award\n20 Years Service Award\n30 Years Service Award\nMinerva Medal(Army War College)\nMinerva Medal(Army War College)\nPresident of the Republic Decoration\nDecoration of the President of the Chilean Red Cross\nGrand Knight of the Altiplano of Arica\n\n\n=== Foreign honours ===\n Guatemala: Grand Cross of the Order of the Quetzal\n Ecuador:\nOrder of Abdon Calderón, 1st Class\nOfficial Honorary General Staff Decoration of the Armed Forces of Ecuador\nHonorary Staff Officer of the Armed Forces of Ecuador\n Paraguay: Collar of Francisco Solano Lopez Grade of the National Order of Merit (Paraguay)\n Argentina:\nGrand Cross of the Order of the Liberator General San Martín\nGrand Cross of the Order of May\n Colombia: Commander of the Order of Military Merit José María Córdova\n Peru: Grand Cross of the Order of the Sun of Peru\n Spain: Crosses of Military Merit\n United States: Legion of Merit\n Sweden: Supreme Grand Collar of the Military Order of the Saint Salvador and Saint Brígida\n\n\n== Military coup of 1973 ==\n\nOn 11 September 1973, the combined Chilean Armed Forces (the Army, Navy, Air Force, and Carabineros) overthrew Allende's government in a coup, during which the presidential palace, La Moneda, was shelled and most likely where Allende was said to have committed suicide. While the military claimed that he had committed suicide, controversy surrounded Allende's death, with many claiming that he had been assassinated (such theory was discarded by the Chilean Supreme Court in 2014).In his memoirs, Pinochet said that he was the leading plotter of the coup and had used his position as commander-in-chief of the Army to coordinate a far-reaching scheme with the other two branches of the military and the national police. In later years, however, high military officials from the time have said that Pinochet reluctantly became involved only a few days before the coup was scheduled to occur, and followed the lead of the other branches (especially the Navy, under Merino) as they executed the coup.The new government rounded up thousands of people and held them in the national stadium, where many were killed. This was followed by brutal repression during Pinochet's rule, during which approximately 3,000 people were killed, while more than 1,000 are still missing.In the months that followed the coup, the junta, with authoring work by historian Gonzalo Vial and admiral Patricio Carvajal, published a book titled El Libro Blanco del cambio de gobierno en Chile (commonly known as El Libro Blanco, 'The White Book on the Change of Government in Chile'), in which they said that they were in fact anticipating a self-coup (the alleged Plan Zeta, or Plan Z) that Allende's government or its associates were purportedly preparing. United States intelligence agencies believed the plan to be untrue propaganda. Although later discredited and officially recognized as the product of political propaganda, Gonzalo Vial Correa insists in the similarities between the alleged Plan Z and other existing paramilitary plans of the Popular Unity parties in support of its legitimacy. Pinochet was also trained by the School of the Americas (SOA) where it is likely he first encountered the ideals of the coup.Canadian reporter Jean Charpentier of Télévision de Radio-Canada was the first foreign journalist to interview General Pinochet following the coup.\n\n\n=== U.S. backing of the coup ===\n\nThe Church Report investigating the fallout of the Watergate scandal stated that while the U.S. tacitly supported the Pinochet government after the 1973 coup, there was \"no evidence\" that the US was directly involved in it. This view has been contradicted by several academics, such as Peter Winn, who writes that the role of the CIA was crucial to the consolidation of power after the coup; the CIA helped fabricate a conspiracy against the Allende government, which Pinochet was then portrayed as preventing. He stated that the coup itself was possible only through a three-year covert operation mounted by the United States. Winn also points out that the US imposed an \"invisible blockade\" that was designed to disrupt the economy under Allende, and contributed to the destabilization of the regime. Author Peter Kornbluh argues in The Pinochet File that the US was extensively involved and actively \"fomented\" the 1973 coup. Authors Tim Weiner (Legacy of Ashes) and Christopher Hitchens (The Trial of Henry Kissinger) similarly argue the case that US covert actions actively destabilized Allende's government and set the stage for the 1973 coup. Despite denial of countless American agencies, current declassified documentation has proven the American involvement. Nixon and Kissinger, along with both private and public intelligence agencies were \"apprised of, and even enmeshed in, the planning and executing of the military takeover.\" Along with this, CIA operatives directly involved, such as Jack Devine, have also come out and declared their involvement in the coup. Devine stating \"I sent CIA headquarters a special type of top-secret cable known as a CRITIC, which ... goes directly to the highest levels of government.\"The US provided material support to the military government after the coup, although criticizing it in public. A document released by the U.S. Central Intelligence Agency (CIA) in 2000, titled \"CIA Activities in Chile\", revealed that the CIA actively supported the military junta after the overthrow of Allende, and that it made many of Pinochet's officers into paid contacts of the CIA or U.S. military, even though some were known to be involved in human rights abuses. The CIA also maintained contacts in the Chilean DINA intelligence service. DINA led the multinational campaign known as Operation Condor, which amongst other activities carried out assassinations of prominent politicians in various Latin American countries, in Washington, D.C., and in Europe, and kidnapped, tortured and executed activists holding left-wing views, which culminated in the deaths of roughly 60,000 people. The United States provided key organizational, financial and technical assistance to the operation. CIA contact with DINA head Manuel Contreras was established in 1974 soon after the coup, during the Junta period prior to official transfer of Presidential powers to Pinochet; in 1975, the CIA reviewed a warning that keeping Contreras as an asset might threaten human rights in the region. The CIA chose to keep him as an asset, and at one point even paid him. In addition to the CIA's maintaining of assets in DINA beginning soon after the coup, several CIA assets, such as CORU Cuban exile militants Orlando Bosch and Guillermo Novo, collaborated in DINA operations under the Condor Plan in the early years of Pinochet's presidency.\n\n\n== Military junta ==\n\nA military junta was established immediately following the coup, made up of General Pinochet representing the Army, Admiral José Toribio Merino representing the Navy, General Gustavo Leigh representing the Air Force, and General César Mendoza representing the Carabineros (national police). As established, the junta exercised both executive and legislative functions of the government, suspended the Constitution and the Congress, imposed strict censorship and curfew, banned all parties and halted all political and perceived subversive activities. This military junta held the executive role until 17 December 1974, after which it remained strictly as a legislative body, the executive powers being transferred to Pinochet with the title of President.\n\n\n== Military dictatorship (1973–1990) ==\n\nThe junta members originally planned that the presidency would be held for a year by the commanders-in-chief of each of the four military branches in turn. However, Pinochet soon consolidated his control, first retaining sole chairmanship of the military junta, and then proclaiming himself \"Supreme Chief of the Nation\" (de facto provisional president) on 27 June 1974. He officially changed his title to \"President\" on 17 December 1974. General Leigh, head of the Air Force, became increasingly opposed to Pinochet's policies and was forced into retirement on 24 July 1978, after contradicting Pinochet on that year's plebiscite (officially called Consulta Nacional, or National Consultation, in response to a UN resolution condemning Pinochet's government). He was replaced by General Fernando Matthei.\nPinochet organized a plebiscite on 11 September 1980 to ratify a new constitution, replacing the 1925 Constitution drafted during Arturo Alessandri's presidency. The new Constitution, partly drafted by Jaime Guzmán, a close adviser to Pinochet who later founded the right-wing party Independent Democratic Union (UDI), gave a lot of power to the President of the Republic—Pinochet. It created some new institutions, such as the Constitutional Tribunal and the controversial National Security Council (COSENA). It also prescribed an 8-year presidential period, and a single-candidate presidential referendum in 1988, where a candidate nominated by the Junta would be approved or rejected for another 8-year period. The new constitution was approved by a margin of 67.04% to 30.19% according to official figures; the opposition, headed by ex-president Eduardo Frei Montalva (who had supported Pinochet's coup), denounced extensive irregularities such as the lack of an electoral register, which facilitated multiple voting, and said that the total number of votes reported to have been cast was very much larger than would be expected from the size of the electorate and turnout in previous elections. Interviews after Pinochet's departure with people involved with the referendum confirmed that fraud had, indeed, been widespread. The Constitution was promulgated on 21 October 1980, taking effect on 11 March 1981. Pinochet was replaced as President of the Junta that day by Admiral Merino. During Pinochet's reign it is estimated that some one million people had been forced to flee the country.Armed opposition to the Pinochet rule continued in remote parts of the country. In a massive operation spearheaded by Chilean Army para-commandos, some 2,000 security forces troops were deployed in the mountains of Neltume from June to November 1981, where they destroyed two MIR bases, seizing large caches of munitions and killing a number of guerrillas.\nAccording to author Ozren Agnic Krstulovic, weapons including C-4 plastic explosives, RPG-7 and M72 LAW rocket launchers, as well as more than 3,000 M-16 rifles, were smuggled into the country by opponents of the government.In September 1986, weapons from the same source were used in an unsuccessful assassination attempt against Pinochet by the FPMR. His military bodyguard was taken by surprise, and five members were killed. Pinochet's bulletproof Mercedes Benz vehicle was struck by a rocket, but it failed to explode and Pinochet suffered only minor injuries.\n\n\n=== Suppression of opposition ===\n\nHe shut down parliament, suffocated political life, banned trade unions, and made Chile his sultanate. His government disappeared 3,000 opponents, arrested 30,000 (torturing thousands of them) ... Pinochet's name will forever be linked to the Desaparecidos, the Caravan of Death, and the institutionalized torture that took place in the Villa Grimaldi complex.\n\nAlmost immediately after the military's seizure of power, the junta banned all the leftist parties that had constituted Allende's UP coalition.\nAll other parties were placed in \"indefinite recess\" and were later banned outright. The government's violence was directed not only against dissidents but also against their families and other civilians.The Rettig Report concluded 2,279 persons who disappeared during the military government were killed for political reasons or as a result of political violence. According to the later Valech Report  approximately 31,947 were tortured and 1,312 exiled. The exiles were chased all over the world by the intelligence agencies. In Latin America, this was made in the frame of Operation Condor, a cooperation plan between the various intelligence agencies of South American countries, assisted by a United States CIA communication base in Panama. Pinochet believed these operations were necessary in order to \"save the country from communism\". In 2011, the commission identified an additional 9,800 victims of political repression during Pinochet's rule, increasing the total number of victims to approximately 40,018, including 3,065 killed.Some political scientists have ascribed the relative bloodiness of the coup to the stability of the existing democratic system, which required extreme action to overturn. Some of the most infamous cases of human rights violation occurred during the early period: in October 1973, at least 70 people were killed throughout the country by the Caravan of Death. Charles Horman and Frank Teruggi, both U.S. journalists, \"disappeared\", as did Víctor Olea Alegría, a member of the Socialist Party, and many others, in 1973. British priest Michael Woodward, who vanished within 10 days of the coup, was tortured and beaten to death aboard the Chilean naval ship, Esmeralda.\n\nMany other important officials of Allende's government were tracked down by the DINA in the frame of Operation Condor. General Carlos Prats, Pinochet's predecessor and army commander under Allende, who had resigned rather than support the moves against Allende's government, was assassinated in Buenos Aires, Argentina, in 1974. A year later, the murder of 119 opponents abroad was disguised as an internal conflict, the DINA setting up a propaganda campaign to support this idea (Operation Colombo), a campaign publicised by the leading newspaper in Chile, El Mercurio.\nOther victims of Condor included, among hundreds of less famous persons, Juan José Torres, the former President of Bolivia, assassinated in Buenos Aires on 2 June 1976; Carmelo Soria, a UN diplomat working for the CEPAL, assassinated in July 1976;\nOrlando Letelier, a former Chilean ambassador to the United States and minister in Allende's cabinet, assassinated after his release from internment and exile in Washington, D.C. by a car bomb on 21 September 1976. Documents confirm that Pinochet directly ordered the assassination of Letelier. This led to strained relations with the US and to the extradition of Michael Townley, a US citizen who worked for the DINA and had organized Letelier's assassination. Other targeted victims, who escaped assassination, included Christian-Democrat Bernardo Leighton, who escaped an assassination attempt in Rome in 1975 by the Italian terrorist Stefano delle Chiaie; Carlos Altamirano, the leader of the Chilean Socialist Party, targeted for murder in 1975 by Pinochet, along with Volodia Teitelboim, member of the Communist Party; Pascal Allende, the nephew of Salvador Allende and president of the MIR, who escaped an assassination attempt in Costa Rica in March 1976; US Congressman Edward Koch, who became aware in 2001 of relations between death threats and his denunciation of Operation Condor, etc. Furthermore, according to current investigations, Eduardo Frei Montalva, the Christian Democrat President of Chile from 1964 to 1970, may have been poisoned in 1982 by toxin produced by DINA biochemist Eugenio Berrios.Protests continued, however, during the 1980s, leading to several scandals. In March 1985, the murder of three Communist Party members led to the resignation of César Mendoza, head of the Carabineros and member of the junta since its formation. During a 1986 protest against Pinochet, 21-year-old American photographer Rodrigo Rojas DeNegri and 18-year-old student Carmen Gloria Quintana were burnt alive, with only Carmen surviving.\nIn August 1989, Marcelo Barrios Andres, a 21-year-old member of the FPMR (the armed wing of the PCC, created in 1983, which had attempted to assassinate Pinochet on 7 September 1986), was assassinated by a group of military personnel who were supposed to arrest him on orders of Valparaíso's public prosecutor. However, they simply executed him; this case was included in the Rettig Report. Among the killed and disappeared during the military junta were 440 MIR guerrillas. In December 2015, three former DINA agents were sentenced to ten years in prison for the murder of a 29-year-old theology student and activist, German Rodriguez Cortes, in 1978. That same month 62-year-old Guillermo Reyes Rammsy, a former Chilean soldier during the Pinochet years, was arrested and charged with murder for boasting of participating in 18 executions during a live phone-in to the Chilean radio show \"Chacotero Sentimental\".On 2 June 2017, Chilean judge Hernan Cristoso sentenced 106 former Chilean intelligence officials to between 541 days and 20 years in prison for their role in the kidnapping and murder of 16 left-wing activists in 1974 and 1975.\n\n\n=== Economic policy ===\nThe first country in the world to make that momentous break with the past—away from socialism and extreme state capitalism toward more market-oriented structures and policies—was not Deng Xiaoping's China or Margaret Thatcher's Britain in the late 1970s, Ronald Reagan's United States in 1981, or any other country in Latin America or elsewhere. It was Pinochet's Chile in 1975.\nIn 1973, the Chilean economy was deeply depressed for several reasons, Allende's government had expropriated many Chilean and foreign businesses, including all copper mines, had controlled prices, inflation reached 606%, income per capita had a contraction of -7.14% in 1973 only while in comparison to 1970 it had contracted by -30%, GDP contracted by -5% in 1973, and also public spending rose from 22.6% to 44.9% between 1970 and 1973 creating a deficit of 25% of the GDP, while some authors like Peter Kornbluh also argue that economic sanctions by the Nixon administration helped to create the economic crisis other authors like Paul Sigmund and Mark Falcoff argue there was no blockade because there was still (just less) aid and credit as well as not a real embargo on trade; the economic and political crisis had the armed forces taking power in September 1973 with Augusto Pinochet, José Toribio Merino Castro, Gustavo Leigh and César Mendoza as their leaders.\nBy mid-1975, after two years of Keynesianism, the government set forth an economic policy of free-market reforms that attempted to stop inflation and collapse. Pinochet declared that he wanted \"to make Chile not a nation of proletarians, but a nation of proprietors\". To formulate the economic rescue, the government relied on the so-called Chicago Boys and a text called El ladrillo, and although Chile grew very quickly between 1976 and 1981, it had a large amount of debt which made Chile the most affected nation by the Latin American debt crisis.\nIn sharp contrast to the privatization done in other areas, Chile's nationalized main copper mines remained in government hands, with the 1980 Constitution later declaring the mines \"inalienable\". In 1976, Codelco was established to exploit them but new mineral deposits were opened to private investment. In November 1980, the pension system was restructured from a PAYGO-system to a fully funded capitalization system run by private sector pension funds. Healthcare and education were likewise privatized. These mines would ultimately help them economically however they would fall partly in American hands.\nWages decreased by 8%. Family allowances in 1989 were 28% of what they had been in 1970 and the budgets for education, health and housing had dropped by over 20% on average. The junta relied on the middle class, the oligarchy, foreign corporations, and foreign loans to maintain itself. Businesses recovered most of their lost industrial and agricultural holdings, for the junta returned properties to original owners who had lost them during expropriations, and sold other industries expropriated by Allende's Popular Unity government to private buyers. This period saw the expansion of business and widespread speculation.\n\nFinancial conglomerates became major beneficiaries of the liberalized economy and the flood of foreign bank loans. Large foreign banks reinstated the credit cycle, as debt obligations, such as resuming payment of principal and interest installments, were honored. International lending organizations such as the World Bank, the International Monetary Fund, and the Inter-American Development Bank lent vast sums anew. Many foreign multinational corporations such as International Telephone and Telegraph (ITT), Dow Chemical, and Firestone, all expropriated by Allende, returned to Chile. Pinochet's policies eventually led to substantial GDP growth, in contrast to the negative growth seen in the early years of his administration, while public debt also was kept high mostly to finance public spending which even after the privatization of services was kept at high rates (though far less than before privatization), for example, in 1991 after one year of post-Pinochet democracy debt was still at 37.4% of the GDP.The Pinochet government implemented an economic model that had three main objectives: economic liberalization, privatization of state owned companies, and stabilization of inflation. In 1985, the government initiated a second round of privatization, revising previously introduced tariff increases and creating a greater supervisory role for the Central Bank. Pinochet's market liberalizations have continued after his death, led by Patricio Aylwin. According to a 2020 study in the Journal of Economic History, Pinochet sold firms at below-market prices to politically connected buyers.Critics argue the neoliberal economic policies of the Pinochet regime resulted in widening inequality and deepening poverty as they negatively impacted the wages, benefits and working conditions of Chile's working class. According to Chilean economist Alejandro Foxley, by the end of Pinochet's reign around 44% of Chilean families were living below the poverty line. According to The Shock Doctrine by Naomi Klein, by the late 1980s, the economy had stabilized and was growing, but around 45% of the population had fallen into poverty while the wealthiest 10% saw their incomes rise by 83%. But others disagree, Chilean economist José Piñera argues that 2 years after Pinochet took power, poverty was still at 50% and the liberal reforms reduced it to 7.8% in 2013 as well as income per capita rising from US$4.000 in 1975 to US$25.000 in 2015, supporters of the reforms also argue that when Pinochet left power in 1990 poverty had fallen to 38% and some claim that since the consolidation of the neoliberal system inequality has been reducing. However, protests erupted in late 2019 in response to growing inequality in the country which can be traced back to the neoliberal policies of the Pinochet dictatorship.American scholar, Nancy MacLean, wrote that the concentration of money in the hands of the very rich and the perversion of democracy through the privatization of government was always the goal. The architect of this economic model known as \"public choice\", James M. Buchanan, traveled to Chile and worked closely with the Pinochet regime. MacLean's account, however, has come under scrutiny. Economist Andrew Farrant examined the Chilean constitutional clauses that MacLean attributes to Buchanan, and discovered that they pre-dated his visit. He concludes that \"evidence suggests that Buchanan's May 1980 visit did not particularly influence the subsequent drafting of the Chilean Constitution\" and \"there is no evidence to suggest that Buchanan had any kind of audience with Pinochet or corresponded with the Chilean dictator.\"\n\n\n=== 1988 referendum, attempt to stay in power and transition to democracy ===\n\nAccording to the transitional provisions of the 1980 Constitution, a referendum was scheduled for 5 October 1988, to vote on a new eight-year presidential term for Pinochet. Confronted with increasing opposition, notably at the international level, Pinochet legalized political parties in 1987 and called for a vote to determine whether or not he would remain in power until 1997. If the \"YES\" won, Pinochet would have to implement the dispositions of the 1980 Constitution, mainly the call for general elections, while he would himself remain in power as president. If the \"NO\" won, Pinochet would remain President for another year, and a joint Presidential and legislative election would be held.\nAnother reason for Pinochet's decision to call for elections was the April 1987 visit of Pope John Paul II to Chile. According to the US Catholic author George Weigel, he held a meeting with Pinochet during which they discussed a return to democracy. John Paul II allegedly pushed Pinochet to accept a democratic opening of his government, and even called for his resignation.\n\nPolitical advertising was legalized on 5 September 1987, as a necessary element for the campaign for the \"NO\" to the referendum, which countered the official campaign, which presaged a return to a Popular Unity government in case of a defeat of Pinochet. The Opposition, gathered into the Concertación de Partidos por el NO (\"Coalition of Parties for NO\"), organized a colorful and cheerful campaign under the slogan La alegría ya viene (\"Joy is coming\"). It was formed by the Christian Democracy, the Socialist Party and the Radical Party, gathered in the Alianza Democrática (Democratic Alliance). In 1988, several more parties, including the Humanist Party, the Ecologist Party, the Social Democrats, and several Socialist Party splinter groups added their support.\nOn 5 October 1988, the \"NO\" option won with 55.99% of the votes, against 44.01% of \"YES\" votes.In the wake of his electoral defeat, Pinochet convened a meeting of his junta at La Moneda, in which he requested that they give him extraordinary powers to have the military seize the capital. Air Force General Fernando Matthei refused, saying that he would not agree to such a thing under any circumstances, and the rest of the junta followed this stance, on grounds that Pinochet already had his turn and lost. Matthei would later become the first member of the junta to publicly admit that Pinochet had lost the plebiscite. Without any support from the junta, Pinochet was forced to accept the result. The ensuing Constitutional process led to presidential and legislative elections the following year.\nThe Coalition changed its name to Concertación de Partidos por la Democracia (Coalition of Parties for Democracy) and put forward Patricio Aylwin, a Christian Democrat who had opposed Allende, as presidential candidate, and also proposed a list of candidates for the parliamentary elections. The opposition and the Pinochet government made several negotiations to amend the Constitution and agreed to 54 modifications. These amendments changed the way the Constitution would be modified in the future, added restrictions to state of emergency dispositions, the affirmation of political pluralism, and enhanced constitutional rights as well as the democratic principle and participation to political life. In July 1989, a referendum on the proposed changes took place, supported by all the parties except the right-wing Southern Party and the Chilean Socialist Party. The Constitutional changes were approved by 91.25% of the voters.\nThereafter, Aylwin won the December 1989 presidential election with 55% of the votes, against less than 30% for the right-wing candidate, Hernán Büchi, who had been Pinochet's Minister of Finances since 1985 (there was also a third-party candidate, Francisco Javier Errázuriz, a wealthy aristocrat representing the extreme economic right, who garnered the remaining 15%). Pinochet thus left the presidency on 11 March 1990 and transferred power to the new democratically elected president.\nThe Concertación also won the majority of votes for the Parliament. However, due to the \"binomial\" representation system included in the constitution, the elected senators did not achieve a complete majority in Parliament, a situation that would last for over 15 years. This forced them to negotiate all law projects with the Alliance for Chile (originally called \"Democracy and Progress\" and then \"Union for Chile\"), a center-right coalition involving the Unión Demócrata Independiente (UDI) and Renovación Nacional (RN), parties composed mainly of Pinochet's supporters.\nDue to the transitional provisions of the constitution, Pinochet remained as Commander-in-Chief of the Army until March 1998. He was then sworn in as a senator-for-life, a privilege granted by the 1980 constitution to former presidents with at least six years in office. His senatorship and consequent immunity from prosecution protected him from legal action. These were possible in Chile only after Pinochet was arrested in 1998 in the United Kingdom, on an extradition request issued by Spanish judge Baltasar Garzón. Allegations of abuses had been made numerous times before his arrest, but never acted upon. The extradition attempt was dramatised in the 2006 BBC television docudrama Pinochet in Suburbia, with Pinochet played by Derek Jacobi. Shortly before giving up power, on September 15, 1989, Pinochet prohibited all forms of abortion, previously authorized in case of rape or risk to the life of the mother. Pinochet argued that due to advances in medicine, abortion was \"no longer justifiable\".\n\n\n=== Relationship with the United Kingdom ===\nChile was officially neutral during the Falklands War, but Chile's Westinghouse long-range radar that was deployed in the south of the country gave the British task force early warning of Argentinian air attacks. This allowed British ships and troops in the war zone to take defensive action. Margaret Thatcher, the British prime minister at the time of the war, said that the day the radar was taken out of service for overdue maintenance was the day Argentinian fighter-bombers bombed the troopships Sir Galahad and Sir Tristram, leaving 53 dead and many injured. According to Chilean Junta member and former Air Force commander, General Fernando Matthei, Chilean support included military intelligence gathering, radar surveillance, allowing British aircraft to operate with Chilean colours, and facilitating the safe return of British special forces, among other forms of assistance.In April and May 1982, a squadron of mothballed British Hawker Hunter fighter-bombers departed for Chile, arriving on 22 May and allowing the Chilean Air Force to reform the No. 9 \"Las Panteras Negras\" Squadron. A further consignment of three frontier surveillance and shipping reconnaissance Canberras left for Chile in October. Some authors have speculated that Argentina might have won the war had the military felt able to employ the elite VIth and VIIIth Mountain Brigades, which remained sitting in the Andes guarding against possible Chilean incursions. Pinochet subsequently visited the UK on more than one occasion. Pinochet's controversial relationship with Thatcher led Labour Prime Minister Tony Blair to mock Thatcher's Conservatives as \"the party of Pinochet\" in 1999.\n\n\n=== Human rights violations ===\n\nPinochet's regime was responsible for many human rights abuses during its reign, including forced disappearances, murder, and torture of political opponents. According to a government commission report that included testimony from more than 30,000 people, Pinochet's government killed at least 3,197 people and tortured about 29,000. Two-thirds of the cases listed in the report happened in 1973.\n\nProfessor Clive Foss, in The Tyrants: 2500 Years of Absolute Power and Corruption (Quercus Publishing 2006), estimates that 1,500–2,000 Chileans were killed or \"disappeared\" during the Pinochet regime. In October 1979, The New York Times reported that Amnesty International had documented the disappearance of approximately 1,500 Chileans since 1973. Among the killed and disappeared during the military regime were at least 663 Marxist MIR guerrillas. The Manuel Rodríguez Patriotic Front, however, has stated that only 49 FPMR guerrillas were killed but hundreds detained and tortured. According to a study in Latin American Perspectives, at least 200,000 Chileans (about 2% of Chile's 1973 population) were forced to go into exile. Additionally, hundreds of thousands left the country in the wake of the economic crises that followed the military coup during the 1970s and 1980s. Some of the key individuals who fled because of political persecution were followed in their exile by the DINA secret police, in the framework of Operation Condor, which linked South American military dictatorships together against political opponents.\nAccording to John Dinges, author of The Condor Years (The New Press 2003), documents released in 2015 revealed a CIA report dated 28 April 1978 that showed the agency by then had knowledge that Pinochet ordered the assassination of Orlando Letelier, a leading political opponent living in exile in the United States.According to Peter Kornbluh in The Pinochet File, \"routine sadism was taken to extremes\" in the prison camps. The rape of women was common, including sexual torture such as the insertion of rats into genitals and \"unnatural acts involving dogs\". Detainees were forcibly immersed in vats of urine and excrement, and were occasionally forced to ingest it. Beatings with gun butts, fists and chains were routine; one technique known as \"the telephone\" involved the torturer slamming \"his open hands hard and rhythmically against the ears of the victim\", leaving the person deaf. At Villa Grimaldi, prisoners were dragged into the parking lot and had the bones in their legs crushed as they were run over with trucks. Some died from torture; prisoners were beaten with chains and left to die from internal injuries.  Following abuse and execution, corpses were interred in secret graves, dropped into rivers or the ocean, or just dumped on urban streets in the night. The body of the renowned Chilean singer, theatre director and academic Víctor Jara was found in a dirty canal \"with his hands and face extremely disfigured\" and with \"forty-four bullet holes\".The practice of murdering political opponents via \"death flights\", employed by the juntas of Argentina and Chile, has sometimes been the subject of numerous alt-right and other right-wing extremist groups internet memes, with the suggestion that political enemies and leftists be given \"free helicopter rides\". In 2001, Chilean President Ricardo Lagos informed the nation that during Pinochet's reign, 120 bodies had been tossed from helicopters into \"the ocean, the lakes and the rivers of Chile\". In a final assessment of his legacy during his funeral, Belisario Velasco, Chile's interior minister at the time remarked that \"Pinochet was a classic right-wing dictator who badly violated human rights and who became rich.\"\n\n\n== Ideology and public image ==\nPinochet himself expressed his project in government as a national rebirth inspired by Diego Portales, a figure of the early republic:\n[Democracy] will be born again purified from the vices and bad habits that ended up destroying our institutions.... [W]e are inspired in the Portalian spirit which has fused together the nation...\nLawyer Jaime Guzmán participated in the design of important speeches of Pinochet, and provided frequent political and doctrinal advice and consultancy.Jacobo Timerman has called the Chilean army under Pinochet \"the last Prussian army in the world\", suggesting a pre-Fascist origin to the model of Pinochet's military government.\nHistorian Alfredo Jocelyn-Holt has referred to Pinochet's figure as \"totemic\", and added that it serves as a scapegoat which attracts \"all hate\". Gabriel Salazar, also a historian, has lamented the lack of an international condemnation of Pinochet in court, since, according to Salazar, that would have damaged his image \"irreparably\" and that of the judicial system of Chile [for the good] too.In 1989 indigenous Mapuche groups representing the \"Consejos Regionales\" bestowed Pinochet the title Ulmen Füta Lonko or Great Authority.According to Pinochet, who was aware of his ancestry, he was taught the French language by an uncle, although he later forgot most of it. Pinochet admired Napoleon as the greatest among French and had a framed picture of him. Another French ruler he admired was Louis XIV.Pinochet's reputation led Peruvians in the 1990s to call Alberto Fujimori \"chinochet\" instead of his ordinary nickname \"chino\". Chadian dictator Hissène Habré, a Cold War ally of the West, has been characterized as \"Africa's Pinochet\" for ordering the torture and mass killing of political opponents during his reign, and for the decades long campaign to see him convicted of crimes against humanity. Images of Pinochet have been used in several Internet memes with the caption \"Pinochet's Free Helicopter Rides\", referencing death flights which saw political dissidents being thrown from helicopters over the Pacific or the Andes during Pinochet's rule. Variations of the internet meme have seen increased popularity with the rise of far-right and alt-right politics.\n\n\n=== Accusations of fascism ===\n\nPinochet and his government have been characterised as fascist. For example, journalist and author Samuel Chavkin, in his book Storm Over Chile: The Junta Under Siege, repeatedly characterizes both Pinochet himself and the military dictatorship as fascist.However, he and his government are generally excluded from academic typologies of fascism. Roger Griffin included Pinochet in a group of pseudo-populist despots distinct from fascism, which included the likes of Saddam Hussein, Suharto, and Ferdinand Marcos. He argues that such regimes may be considered populist ultra-nationalism but lack the rhetoric of national rebirth, or palingenesis, necessary to make them conform to the model of palingenetic ultranationalism. Robert Paxton meanwhile compared Pinochet's regime to that of Mobutu Sese Seko in the former Zaire (now Democratic Republic of the Congo), arguing that both were merely client states that lacked popular acclaim and the ability to expand. He further argued that had Pinochet attempted to build true fascism, the regime would likely have been toppled or at least been forced to alter its relationship to the United States. Anna Cento Bull also excluded Pinochet from fascism, although she has argued that his regime belongs to a strand of Cold War anti-communism that was happy to accommodate neo-fascist elements within its activity.World Fascism: a Historical Encyclopedia notes that \"Although he was authoritarian and ruled dictatorially, Pinochet's support of neoliberal economic policies and his unwillingness to support national businesses distinguished him from classical fascists.\"Historian Gabriel Salazar stated that high visibility of Pinochet and neglect of co-workers was reminiscent of fascist leadership:\n\nIt is notable that in all the declarations of Pinochet's men, nobody has mentioned the creators of the new Chilean society and state, I haven't heard anybody mention Jaime Guzmán, Carlos Cáceres Contreras, Hernán Büchi, Sergio de Castro. There is no mention of the true brains, or that the whole of the armed forces were involved in this, in dirty and symbolic tasks. Everything is embodied in Pinochet, it's very curious that figures of the stature of Büchi are immolated before the figure of Pinochet, in what is to me a fascist rite, give everything to the Führer, \"I did it, but ultimately it was him\".\n\n\n=== Intellectual life and academic work ===\n \nPinochet was publicly known as a man with a lack of culture and this image was reinforced by the fact that he also portrayed himself as a common man with simple ideas. He was also known for being reserved, sharing little about his opinions or feelings. Before wresting power from Allende, Pinochet had written two books, Geopolítica (1968) and Campaña de Tarapacá (1972), which established him as a major figure in Chile's military literature. In Geopolítica Pinochet plagiarized his mentor general Gregorio Rodríguez Tascón by using paragraphs from a 1949 conference presentation of Rodríguez without attributing them to him.\nRodríguez had previously lectured Pinochet and René Schneider and Carlos Prats in geography and geopolitics. In contrast to the two latter Pinochet was not an outstanding student but his persistence and interest in geopolitics made Rodríguez assume the role as his academic mentor. Rodríguez granted Pinochet a slot as assistant lecturer in geopolitics and in geography. According to Rodríguez, Pinochet would have been particularly impressed by his lectures on The Art of War. Pinochet would later succeed Rodríguez in the geopolitics and geography chair.Investigative journalist Juan Cristóbal Peña has put forward the thesis that Pinochet felt intellectual envy of Carlos Prats and that the latter's assassination in 1974 was a relief for Pinochet.During his lifetime, Pinochet amassed more than 55,000 books in his private library, worth an estimated 2,840,000 US dollars (2006–07). The extent of his library was revealed to the public only after a police inspection in January 2006. Pinochet bought books at several small bookshops in the old centre of Santiago and was later supplied with books from abroad by military attachés who bought texts Pinochet was searching after. As ruler of Chile he used discretionary funds for these purchases. The library included many rare books including a first edition (1646) Historica relacion del Reyno de Chile and an original letter of Bernardo O'Higgins. A significant part of the books and documents of the library of José Manuel Balmaceda was found in Pinochet's library in 2006. Pinochet's library contained almost no poetry or fiction works.\n\n\n=== Nicknames ===\nSupporters sometimes refer to Pinochet as mi general (the military salutation for a general) while opponents call him pinocho (Spanish for \"Pinocchio\", from the children's story). A common nickname used by both younger generations is el tata (Chilean Spanish equivalent of \"the grandpa\"). Since the Riggs Bank scandal he has been referred to sarcastically as Daniel Lopez, one of the fake identities he used to deposit money in the bank.\n\n\n== Post-dictatorship life ==\n\n\n=== Arrest and court cases in the United Kingdom ===\n\nThe indictment and arrest of Pinochet was the first time that a former government head was arrested on the principle of universal jurisdiction.After having been placed under house arrest on the grounds of the Wentworth Club in Britain in October 1998 and initiating a judicial and public relations battle, the latter run by Thatcherite political operative Patrick Robertson, he was released in March 2000 on medical grounds by the Home Secretary Jack Straw without facing trial. Straw had overruled a House of Lords decision to extradite Pinochet to face trial in Spain.\n\n\n=== Return to Chile ===\nPinochet returned to Chile on 3 March 2000. So as to avoid any potential disruption his flight back to Chile from the UK departed from RAF Waddington, evading those protesting against his release.\nHis first act when landing in Santiago's airport was to triumphantly get up from his wheelchair to the acclaim of his supporters. He was greeted by his successor as head of the Chilean armed forces, General Ricardo Izurieta. President-elect Ricardo Lagos said the retired general's televised arrival had damaged the image of Chile, while thousands demonstrated against him.In March 2000, Congress approved a constitutional amendment creating the status of \"ex-president\", which granted its holder immunity from prosecution and a financial allowance; this replaced Pinochet's senatorship-for-life. 111 legislators voted for, and 29 against.The Supreme Court ruled in favor of judge Juan Guzmán's request in August 2000, and Pinochet was indicted on 1 December 2000 for the kidnapping of 75 opponents in the Caravan of Death case. Guzmán advanced the charge of kidnapping as the 75 were officially \"disappeared\": even though they were all most likely dead, the absence of their corpses made any charge of \"homicide\" difficult.\nIn July 2002, the Supreme Court dismissed Pinochet's indictment in the various human rights abuse cases, for medical reasons (vascular dementia). The debate concerned Pinochet's mental faculties, his legal team claiming that he was senile and could not remember, while others (including several physicians) claimed that he was affected only physically but retained all control of his faculties. The same year, the prosecuting attorney Hugo Guttierez, in charge of the Caravan of Death case, declared, \"Our country has the degree of justice that the political transition permits us to have.\"Pinochet resigned from his senatorial seat shortly after the Supreme Court's July 2002 ruling. In May 2004, the Supreme Court overturned its precedent decision, and ruled that he was capable of standing trial. In arguing their case, the prosecution presented a recent TV interview Pinochet had given to journalist Maria Elvira Salazar for a Miami-based television network, which raised doubts about his alleged mental incapacity. In December 2004, he was charged with several crimes, including the 1974 assassination of General Prats and the Operation Colombo case in which 119 died, and was again placed under house arrest. He suffered a stroke on 18 December 2004. Questioned by his judges in order to know if, as president, he was the direct head of DINA, he answered: \"I don't remember, but it's not true. And if it were true, I don't remember.\"In January 2005, the Chilean Army accepted institutional responsibility for past human rights abuses. In 2006, Pinochet was indicted for kidnappings and torture at the Villa Grimaldi detention center by judge Alejandro Madrid (Guzmán's successor), as well as for the 1995 assassination of the DINA biochemist Eugenio Berrios, himself involved in the Letelier case. Berrios, who had worked with Michael Townley, had produced sarin gas, anthrax and botulism in the Bacteriological War Army Laboratory for Pinochet; these materials were used against political opponents. The DINA biochemist was also alleged to have created black cocaine, which Pinochet then sold in Europe and the United States. The money for the drug trade was allegedly deposited into Pinochet's bank accounts. Pinochet's son Marco Antonio, who had been accused of participating in the drug trade, in 2006 denied claims of drug trafficking in his father's administration and said that he would sue Manuel Contreras, who had said that Pinochet sold cocaine.On 25 November 2006, Pinochet marked his 91st birthday by having his wife read a statement he had written to admirers present for his birthday: \"I assume the political responsibility for all that has been done.\" Two days later, he was again sentenced to house arrest for the kidnapping and murder of two bodyguards of Salvador Allende who were arrested the day of the 1973 coup and executed by firing squad during the Caravan of Death.Pinochet died a few days later, on 10 December 2006, without having been convicted of any of the crimes of which he was accused.\n\n\n=== Scandals: secret bank accounts, tax evasion, and arms deal ===\n\nIn 2004, a United States Senate money laundering investigation led by Senators Carl Levin (D-MI) and Norm Coleman (R-MN)—ordered in the wake of the 11 September 2001 attacks—uncovered a network of over 125 securities and bank accounts at Riggs Bank and other U.S. financial institutions used by Pinochet and his associates for twenty-five years to secretly move millions of dollars.\nThough the subcommittee was charged only with investigating compliance of financial institutions under the USA PATRIOT Act, and not the Pinochet regime, Senator Coleman noted:\n\nThis is a sad, sordid tale of money laundering involving Pinochet accounts at multiple financial institutions using alias names, offshore accounts, and close associates. As a former General and President of Chile, Pinochet was a well-known human rights violator and violent dictator.\nOver several months in 2005, Chilean judge Sergio Muñoz indicted Augusto Pinochet's wife, Lucia Hiriart; four of his children – Marco Antonio, Jacqueline, Veronica and Lucia Pinochet; his personal secretary, Monica Ananias; and his former aide Oscar Aitken on tax evasion and falsification charges stemming from the Riggs Bank investigation. In January 2006, daughter Lucia Pinochet was detained at Washington DC-Dulles airport and subsequently deported while attempting to evade the tax charges in Chile. In January 2007, the Santiago Court of Appeals revoked most of the indictment from Judge Carlos Cerda against the Pinochet family. But Pinochet's five children, his wife and 17 other persons (including two generals, one of his former lawyer and former secretary) were arrested in October 2007 on charges of embezzlement and use of false passports. They are accused of having illegally transferred $27m (£13.2m) to foreign bank accounts during Pinochet's rule.In September 2005, a joint investigation by The Guardian and La Tercera revealed that the British arms firm BAE Systems had been identified as paying more than £1m to Pinochet, through a front company in the British Virgin Islands, which BAE has used to channel commission on arms deals. The payments began in 1997 and lasted until 2004.In 2007, fifteen years of investigation led to the conclusion that the 1992 assassination of DINA Colonel Gerardo Huber was most probably related to various illegal arms traffic carried out, after Pinochet's resignation from power, by military circles very close to himself. Huber had been assassinated a short time before he was due to testify in the case concerning the 1991 illegal export of weapons to the Croatian army. The deal involved 370 tons of weapons, sold to Croatia by Chile on 7 December 1991, when the former country was under a United Nations' embargo because of the support for Croatia war in Yugoslavia. In January 1992, the judge Hernán Correa de la Cerda wanted to hear Gerardo Huber in this case, but the latter may have been silenced to avoid implicating Pinochet in this new case—although the latter was no longer President, he remained at the time Commander-in-Chief of the Army. Pinochet was at the center of this illegal arms trade, receiving money through various offshores and front companies, including the Banco Coutts International in Miami.Pinochet was stripped of his parliamentary immunity in August 2000 by the Supreme Court, and indicted by judge Juan Guzmán Tapia. Guzmán had ordered in 1999 the arrest of five militarists, including General Pedro Espinoza Bravo of the DINA, for their role in the Caravan of Death following the coup on 11 September. Arguing that the bodies of the \"disappeared\" were still missing, he made jurisprudence, which had as effect to lift any prescription on the crimes committed by the military. Pinochet's trial continued until his death on 10 December 2006, with an alternation of indictments for specific cases, lifting of immunities by the Supreme Court or to the contrary immunity from prosecution, with his health a main argument for, or against, his prosecution.\nThe Supreme Court affirmed, in March 2005, Pinochet's immunity concerning the 1974 assassination of General Carlos Prats in Buenos Aires, which had taken place in the frame of Operation Condor. However, he was deemed fit to stand trial for Operation Colombo, during which 119 political opponents were \"disappeared\" in Argentina. The Chilean justice also lifted his immunity on the Villa Grimaldi case, a detention and torture center in the outskirts of Santiago. Pinochet, who still benefited from a reputation of righteousness from his supporters, lost legitimacy when he was put under house arrest on tax fraud and passport forgery, following the publication by the US Senate Permanent Subcommittee on Investigations of a report concerning the Riggs Bank in July 2004. The report was a consequence of investigations on financial funding of the 11 September 2001 attacks in the US. The bank controlled between US$4 million and $8 million of the assets of Pinochet, who lived in Santiago in a modest house, dissimulating his wealth. According to the report, Riggs participated in money laundering for Pinochet, setting up offshore shell corporations (referring to Pinochet as only \"a former public official\"), and hiding his accounts from regulatory agencies. Related to Pinochet's and his family secret bank accounts in United States and in Caribbean islands, this tax fraud filing for an amount of 27 million dollars shocked the conservative sectors who still supported him. Ninety percent of these funds would have been raised between 1990 and 1998, when Pinochet was chief of the Chilean armies, and would essentially have come from weapons traffic (when purchasing French 'Mirage' fighter aircraft in 1994, Dutch 'Leopard 2' tanks, Swiss 'MOWAG' armored vehicles or by illegal sales of weapons to Croatia, during the Balkans war.) His wife, Lucía Hiriart, and his son, Marco Antonio Pinochet, were also sued for complicity. For the fourth time in seven years, Pinochet was indicted by the Chilean justice.\n\n\n== Death ==\n\nPinochet suffered a heart attack on the morning of 3 December 2006 and was given the last rites the same day. On 4 December 2006, the Chilean Court of Appeals ordered the suspension of his house arrest. On 10 December 2006 at 13:30 local time (16:30 UTC) he was taken to the intensive care unit. He died of congestive heart failure and pulmonary edema, surrounded by family members, at the Military Hospital at 14:15 local time (17:15 UTC).Massive spontaneous street demonstrations broke out throughout the country upon the news of his death. In Santiago, opponents celebrated his death in Alameda Avenue, while supporters grieved outside the Military Hospital. Pinochet's remains lay in repose on 11 December 2006 at the Military Academy in Las Condes. During this ceremony, Francisco Cuadrado Prats—the grandson of Carlos Prats (a former Commander-in-Chief of the Army in the Allende government who was murdered by Pinochet's secret police)—spat on the coffin, and was quickly surrounded by supporters of Pinochet, who kicked and insulted him. Pinochet's funeral took place the following day at the same venue before a gathering of 60,000 supporters.In a government decision, he was not granted a state funeral (an honor normally bestowed upon past presidents of Chile) but a military funeral as former commander-in-chief of the Army appointed by Allende. The government also refused to declare an official national day of mourning, but it did authorize flags at military barracks to be flown at half staff, and for the Chilean flag to be draped on Pinochet's coffin. Socialist President Michelle Bachelet, whose father Alberto was temporarily imprisoned and tortured after the 1973 coup and died shortly afterwards from heart complications, said that it would be \"a violation of [her] conscience\" to attend a state funeral for Pinochet. The only government authority present at the public funeral was the Defense Minister, Vivianne Blanlot.In Spain, supporters of late dictator Francisco Franco paid homage to Pinochet. Antonio Tejero, who led the failed coup of 1981, attended a memorial service in Madrid.\nPinochet's body was cremated in Parque del Mar Cemetery, Concón on 12 December 2006, on his request to \"avoid vandalism of his tomb\", according to his son Marco Antonio. His ashes were delivered to his family later that day, and are deposited in Los Boldos, Santo Domingo, Valparaiso, Chile; one of his personal residences. The armed forces refused to allow his ashes to be deposited on military property.\n\n\n== See also ==\n\n1970 Chilean presidential election\nUnited States intervention in Chile\nBook burnings in Chile\nHistory of Chile\nColonia, a film about two West Germans caught up in the aftermath of the Pinochet coup who end up in the Colonia Dignidad cult\nMissing, a film based on the life of U.S. journalist Charles Horman, who disappeared in the aftermath of the Pinochet coup\nNo, an Academy Award-nominated film presenting a dramatized account of the 1988 national plebiscite campaign on Pinochet's rule\nDavid H. Popper, US ambassador to Chile (1974–1977)\nUnited States involvement in regime change\n\n\n== Notes ==\n\n\n== References ==\n\n\n== Further reading ==\n\n\n== External links ==\n\nExtensive bio by Fundación CIDOB (in Spanish)\nAugusto Pinochet (1915–2006) – A Biography\nFrance 24 coverage – Augusto Pinochet's Necrology on France 24\nBBC coverage (special report)\nDocumentary Film on Chilean Concentration Camp from Pinochet's Regime: Chacabuco\nCIA Acknowledges Ties to Pinochet's Repression from The National Security Archive\nChile under Allende and Pinochet\nHuman rights violation under Pinochet\nThe Times obituary\nAnalysis of economic policy under Pinochet by economist Jim Cypher in Dollars & Sense magazine\nChile: The Price of Democracy New English Review\nWhat Pinochet Did for Chile Hoover Digest (2007 No. 1)\nWhen US-Backed Pinochet Forces Took Power in Chile – video report by Democracy Now!"