"Augusto José Ramón Pinochet Ugarte (, also US: , UK: , Spanish: [awˈɣusto pinoˈ(t)ʃe(t)]; 25 November 1915 – 10 December 2006) was a Chilean Army General, politician and military dictator who ruled Chile from 1973 to 1990, first as the leader of the Military Junta of Chile from 1973 to 1981, being self-declared President of the Republic by the junta in 1974 and becoming the de facto dictator of Chile, and after from 1981 to 1990 as de jure President after a new Constitution, which confirmed him in the office, was approved by a referendum in 1980.Augusto Pinochet rose through the ranks of the Chilean Army to become General Chief of Staff in early 1972 before being appointed its Commander-in-Chief on 23 August 1973 by President Salvador Allende. On 11 September 1973, \nPinochet seized power in Chile in a coup d'état, with the support of the U.S., that toppled Allende's democratically elected Unidad Popular government and ended civilian rule. In December 1974, the ruling military junta appointed Pinochet Supreme Head of the nation by joint decree, although without the support of one of the coup's instigators, Air Force General Gustavo Leigh. After his rise to power, Pinochet persecuted leftists, socialists, and political critics, resulting in the executions of from 1,200 to 3,200 people, the internment of as many as 80,000 people, and the torture of tens of thousands. According to the Chilean government, the number of executions and forced disappearances was 3,095. Operation Condor was founded at the behest of the Pinochet regime in late November 1975, his 60th birthday.Under the influence of the free market-oriented \"Chicago Boys\", Pinochet's military government implemented economic liberalization, including currency stabilization, removed tariff protections for local industry, banned trade unions, and privatized social security and hundreds of state-owned enterprises. Some of the government properties were sold below market price to politically connected buyers, including Pinochet's own son-in-law. The regime used censorship of entertainment as a way to reward supporters of the regime and punish opponents. These policies produced high economic growth, but critics state that economic inequality dramatically increased and attribute the devastating effects of the 1982 monetary crisis on the Chilean economy to these policies. For most of the 1990s, Chile was the best-performing economy in Latin America, though the legacy of Pinochet's reforms continues to be in dispute. His fortune grew considerably during his years in power through dozens of bank accounts secretly held abroad and a fortune in real estate. He was later prosecuted for embezzlement, tax fraud, and for possible commissions levied on arms deals.Pinochet's 17-year rule was given a legal framework through a controversial 1980 plebiscite, which approved a new constitution drafted by a government-appointed commission. In a 1988 plebiscite, 56% voted against Pinochet's continuing as president, which led to democratic elections for the presidency and Congress. After stepping down in 1990, Pinochet continued to serve as Commander-in-Chief of the Chilean Army until 10 March 1998, when he retired and became a senator-for-life in accordance with his 1980 Constitution. However, Pinochet was arrested under an international arrest warrant on a visit to London on 10 October 1998 in connection with numerous human rights violations. Following a legal battle, he was released on grounds of ill-health and returned to Chile on 3 March 2000. In 2004, Chilean Judge Juan Guzmán Tapia ruled that Pinochet was medically fit to stand trial and placed him under house arrest. By the time of his death on 10 December 2006, about 300 criminal charges were still pending against him in Chile for numerous human rights violations during his 17-year rule, as well as tax evasion and embezzlement during and after his rule. He was also accused of having corruptly amassed at least US$28 million."