"Oedipus (UK: , also US: ; Greek: Οἰδίπους \"swollen foot\") was a mythical Greek king of Thebes. A tragic hero in Greek mythology, Oedipus accidentally fulfilled a prophecy that he would end up killing his father and marrying his mother, thereby bringing disaster to his city and family.\nThe story of Oedipus is the subject of Sophocles' tragedy Oedipus Rex, which is followed in the narrative sequence by Oedipus at Colonus and then Antigone. Together, these plays make up Sophocles' three Theban plays. Oedipus represents two enduring themes of Greek myth and drama: the flawed nature of humanity and an individual's role in the course of destiny in a harsh universe.\nIn the best known version of the myth, Oedipus was born to King Laius and Queen Jocasta of Thebes. Laius wished to thwart the prophecy, so he sent a shepherd-servant to leave Oedipus to die on a mountainside. However, the shepherd took pity on the baby and passed him to another shepherd who gave Oedipus to King Polybus and Queen Merope to raise as their own. Oedipus learned from the oracle at Delphi of the prophecy that he would end up killing his father and marrying his mother but, unaware of his true parentage, believed he was fated to murder Polybus and marry Merope, so left for Thebes. On his way he met an older man and killed him in a quarrel. Continuing on to Thebes, he found that the king of the city (Laius) had been recently killed, and that the city was at the mercy of the Sphinx. Oedipus answered the monster's riddle correctly, defeating it and winning the throne of the dead king – and the hand in marriage of the king's widow, who was also (unbeknownst to him) his mother Jocasta.\nYears later, to end a plague on Thebes, Oedipus searched to find who had killed Laius, and discovered that he himself was responsible.  Jocasta, upon realizing that she had married her own son, hanged herself. Oedipus then seized two pins from her dress and blinded himself with them.\nThe legend of Oedipus has been retold in many versions, and was used by Sigmund Freud to name and give mythic precedent to the Oedipus complex."