"Scylletium or Scolacium was an ancient seaside city in Calabria, southern Italy. Its ruins can be found at the frazione of Roccelletta, in the comune of Borgia, near Catanzaro, facing the Gulf of Squillace.\n\n\n== History ==\nScylletium was situated on the east coast of Calabria (ancient Bruttium), on the shores of an extensive bay, to which it gave the name of Scylleticus Sinus. It is this bay, still known as the Gulf of Squillace (Italian: Golfo di Squillace), which indents the coast of Calabria on the east as deeply as that of Hipponium or Terina (the Gulf of Saint Euphemia, Italian: Golfo di Sant'Eufemia) does on the west, so that they leave but a comparatively narrow isthmus between them. According to a tradition generally received in ancient times, Scylletium (Ancient Greek: Σκυλλήτιον) was founded by an Athenian colony, a part of the followers who had accompanied Menestheus to the Trojan War. Solinus also mention that the Scylaceum was established by Athenians.\nAnother tradition was, however, extant, which ascribed its foundation to Ulysses. \nBut no historical value can be attached to such statements, and there is no trace in historical times of Scylletium having been a Greek colony, still less an Athenian one. Its name is not mentioned either by Scylax or Scymnus Chius in enumerating the Greek cities in this part of Italy, nor is there any allusion to its Athenian origin in Thucydides at the time of the Athenian expedition to Sicily. We learn from Diodorus that it certainly did not display any friendly feeling towards the Athenians. It appears, indeed, during the historical period of the Greek colonies to have been a place of inferior consideration, and a mere dependency of Crotona, to which city it continued subject until it was wrested from its power by the elder Dionysius, who assigned it with its territory to the Loerians. It is evident that it was still a small and unimportant place at the time of the Second Punic War, as no mention is found of its name during the operations of Hannibal in Bruttium, though he appears to have for some time had his headquarters in its immediate neighborhood, and the place called Castra Hannibalis must have been very near to Scylletium.\nIn 124 BC the Romans, at the instigation of C. Gracchus, sent a colony to Scylletium, which appears to have assumed the name of Minervium or Colonia Minervia. The name is written by Velleius Scolatium; and the form Scolacium is found also in an inscription of the reign of Antoninus Pius, from which it appears that the place must have received a fresh colony under Nerva. Scylletium appears to have become a considerable town after it received the Roman colony, and continued such throughout the Roman Empire. Towards the close of this period it was distinguished as the birthplace of the Roman statesman Cassiodorus, founder of the Vivarium, a monastery dedicated to the coexistence of coenobitic monks and hermits, who has left us a detailed but rhetorical description of the beauty of its situation, and fertility of its territory. Cassiodorus' writings also make mention of production of highly priced terra cotta.\n\n\n== Sculpture ==\nIn 2006 a sculpture with the title Time Horizon was set up in the park by the English sculptor Antony Gormley.\n\n\n== Literature ==\nAntony Gormley: Time Horizon Intersecione, Intersecione 2 al Parco Archeologico di Scolacium, 2006 ISBN 88-370-4583-2\n\n\n== Notes ==\n\n\n== References ==\n This article incorporates text from a publication now in the public domain: Smith, William, ed. (1854–1857). Dictionary of Greek and Roman Geography. London: John Murray. \nRichard Talbert, Barrington Atlas of the Greek and Roman World, (ISBN 0-691-03169-X), Map 46."