"Chan (simplified Chinese: 禅; traditional Chinese: 禪; pinyin: Chán; abbr. of Chinese: 禪那; pinyin: chánnà), from Sanskrit dhyāna (meaning \"meditation\" or \"meditative state\"), is a Chinese school of Mahāyāna Buddhism. It developed in China from the 6th century CE onwards, becoming dominant during the Tang and Song dynasties. After the Yuan dynasty, Chan more or less fused with Pure Land Buddhism.\nChan is the originating tradition of Zen Buddhism (the Japanese pronunciation of the same character, which is the most commonly used name for the school in English). Chan Buddhism spread from China south to Vietnam as Thiền and north to Korea as Seon, and, in the 13th century, east to Japan as Japanese Zen.\n\n\n== History ==\n\nThe historical records required for a complete, accurate account of early Chan history no longer exist.\n\n\n=== Periodisation ===\nThe history of Chán in China can be divided into several periods. Zen as we know it today is the result of a long history, with many changes and contingent factors. Each period had different types of Zen, some of which remained influential while others vanished.Ferguson distinguishes three periods from the 5th century into the 13th century:\n\nThe Legendary period, from Bodhidharma in the late 5th century to the An Lushan Rebellion around 765 CE, in the middle of the Tang Dynasty. Little written information is left from this period. It is the time of the Six Patriarchs, including Bodhidharma and Huineng, and the legendary \"split\" between the Northern and the Southern School of Chán.\nThe Classical period, from the end of the An Lushan Rebellion around 765 CE to the beginning of the Song Dynasty around 950 CE. This is the time of the great masters of Chán, such as Mazu Daoyi and Linji Yixuan, and the creation of the yü-lü genre, the recordings of the sayings and teachings of these great masters.\nThe Literary period, from around 950 to 1250, which spans the era of the Song Dynasty (960–1279). In this time the gongan-collections were compiled, collections of sayings and deeds by the famous masters, appended with poetry and commentary. This genre reflects the influence of literati on the development of Chán. This period idealized the previous period as the \"golden age\" of Chán, producing the literature in which the spontaneity of the celebrated masters was portrayed.Although McRae has reservations about the division of Chán-history in phases or periods, he nevertheless distinguishes four phases in the history of Chán:\nProto-Chán (c. 500–600) (Southern and Northern Dynasties (420 to 589) and Sui Dynasty (589–618 CE)). In this phase, Chán developed in multiple locations in northern China. It was based on the practice of dhyana and is connected to the figures of Bodhidharma and Huike. Its principal text is the Two Entrances and Four Practices, attributed to Bodhidharma.\nEarly Chán (c. 600–900) (Tang Dynasty (618–907 CE)). In this phase Chán took its first clear contours. Prime figures are the fifth patriarch Daman Hongren (601–674), his dharma-heir Yuquan Shenxiu (606?–706), the sixth patriarch Huineng (638–713), protagonist of the quintessential Platform Sutra, and Shenhui (670–762), whose propaganda elevated Huineng to the status of sixth patriarch. Prime factions are the Northern School, Southern School and Oxhead School.\nMiddle Chán (c. 750–1000) (from An Lushan Rebellion (755–763) till Five Dynasties and Ten Kingdoms period  (907–960/979)). In this phase developed the well-known Chán of the iconoclastic zen-masters. Prime figures are Mazu Daoyi (709–788), Shitou Xiqian (710–790), Linji Yixuan (died 867), and Xuefeng Yicun (822–908). Prime factions are the Hongzhou school and the Hubei faction. An important text is the Anthology of the Patriarchal Hall (952), which gives a great amount of \"encounter-stories\", and the well-known genealogy of the Chán-school.\nSong Dynasty Chán (c. 950–1300). In this phase Chán took its definitive shape including the picture of the \"golden age\" of the Chán of the Tang-Dynasty, and the use of koans for individual study and meditation. Prime figures are Dahui Zonggao (1089–1163) who introduced the Hua Tou practice and Hongzhi Zhengjue (1091–1157) who emphasized Shikantaza. Prime factions are the Linji school and the Caodong school. The classic koan-collections, such as the Blue Cliff Record were assembled in this period, which reflect the influence of the \"literati\" on the development of Chán. In this phase Chán is transported to Japan, and exerts a great influence on Korean Seon via Jinul.Neither Ferguson nor McRae give a periodisation for Chinese Chán following the Song-dynasty, though McRae mentions \n\n[5.] \"at least a postclassical phase or perhaps multiple phases\".\n\n\n=== Introduction of Buddhism in China (c. 200–500) ===\n\n\n==== Sinification of Buddhism and Taoist influences ====\nWhen Buddhism came to China, it was adapted to the Chinese culture and understanding. Theories about the influence of other schools in the evolution of Chan vary widely and are heavily reliant upon speculative correlation rather than on written records or histories. Some scholars have argued that Chan developed from the interaction between Mahāyāna Buddhism and Taoism, while others insist that Chan has roots in yogic practices, specifically kammaṭṭhāna, the consideration of objects, and kasiṇa, total fixation of the mind. A number of other conflicting theories exist.\nBuddhist meditation was practiced in China centuries before the rise of Chán, by people such as An Shigao (c. 148–180 CE) and his school, who translated various Dhyāna sutras (Chán-jing, 禪経, \"meditation treatises\"), which were influential early meditation texts mostly based on the Yogacara meditation teachings of the Sarvāstivāda school of Kashmir circa 1st-4th centuries CE. The five main types of meditation in the Dyana sutras are anapanasati (mindfulness of breathing); paṭikūlamanasikāra meditation, mindfulness of the impurities of the body; loving-kindness maitrī meditation; the contemplation on the twelve links of pratītyasamutpāda; and the contemplation on the Buddha's thirty-two Characteristics. Other important translators of meditation texts were Kumārajīva (334–413 CE), who translated The Sutra on the Concentration of Sitting Meditation, amongst many other texts; and Buddhabhadra. These Chinese translations of mostly Indian Sarvāstivāda Yogacara meditation manuals were the basis for the meditation techniques of Chinese Chan.Buddhism was exposed to Confucian and Taoist influences when it came to China. Goddard quotes D.T. Suzuki, calling Chan a \"natural evolution of Buddhism under Taoist conditions\". Buddhism was first identified to be \"a barbarian variant of Taoism\", and Taoist terminology was used to express Buddhist doctrines in the oldest translations of Buddhist texts, a practice termed ko-i, \"matching the concepts\".\nJudging from the reception by the Han of the Hinayana works and from the early commentaries, it appears that Buddhism was being perceived and digested through the medium of religious Daoism (Taoism). Buddha was seen as a foreign immortal who had achieved some form of Daoist nondeath. The Buddhists' mindfulness of the breath was regarded as an extension of Daoist breathing exercises.\nThe first Buddhist recruits in China were Taoists. They developed high esteem for the newly introduced Buddhist meditational techniques, and blended them with Taoist meditation. Representatives of early Chinese Buddhism like Sengzhao and Tao Sheng were deeply influenced by the Taoist keystone works of Laozi and Zhuangzi. Against this background, especially the Taoist concept of naturalness was inherited by the early Chan disciples: they equated – to some extent – the ineffable Tao and Buddha-nature, and thus, rather than feeling bound to the abstract \"wisdom of the sūtras\", emphasized Buddha-nature to be found in \"everyday\" human life, just as the Tao.Neo-Daoist concepts were taken over in Chinese Buddhism as well. Concepts such as T'i-yung (體用 Essence and Function) and Li-shih (理事 Noumenon and Phenomenon, or Principle and Practice) were first taken over by Hua-yen Buddhism, which consequently influenced Chan deeply. On the other hand, Taoists at first misunderstood sunyata to be akin to the Taoist non-being.The emerging Chinese Buddhism nevertheless had to compete with Taoism and Confucianism:\nBecause Buddhism was a foreign influence, however, and everything \"barbarian\" was suspect, certain Chinese critics were jolted out of complacency by the spread of the dharma [...] In the first four centuries of the Christian Era, this barbarian influence was infiltrating China just when it was least politically stable and more vulnerable to sedition. As the philosophy and practice infiltrated society, many traditionalists banded together to stop the foreign influence, not so much out of intolerance (an attitude flatly rejected by both Taoism and Confucianism), but because they felt that the Chinese world view was being turned upside down.One point of confusion for this new emerging Chinese Buddhism was the two truths doctrine. Chinese thinking took this to refer to two ontological truths: reality exists on two levels, a relative level and an absolute level. Taoists at first misunderstood sunyata to be akin to the Taoist non-being. In Indian Madhyamaka philosophy the two truths are two epistemological truths: two different ways to look at reality. Based on their understanding of the Mahayana Mahaparinirvana Sutra the Chinese supposed that the teaching of the Buddha-nature was, as stated by that sutra, the final Buddhist teaching, and that there is an essential truth above sunyata and the two truths.\n\n\n==== Divisions of training ====\nWhen Buddhism came to China, there were three divisions of training:\n\nThe training in virtue and discipline in the precepts (Skt. śīla),\nThe training in mind through meditation (Skt. dhyāna) to attain a luminous and non-reactive state of mind, and\nThe training in the recorded teachings (Skt. Dharma).It was in this context that Buddhism entered into Chinese culture. Three types of teachers with expertise in each training practice developed:\n\nVinaya masters specialized in all the rules of discipline for monks and nuns,\nDhyāna masters specialized in the practice of meditation, and\nDharma masters specialized in mastery of the Buddhist texts.Monasteries and practice centers were created that tended to focus on either the Vinaya and training of monks or the teachings focused on one scripture or a small group of texts. Dhyāna (Chan) masters tended to practice in solitary hermitages, or to be associated with vinaya training monasteries or the dharma teaching centers. The later naming of the Zen school has its origins in this view of the threefold division of training.\nMcRae goes so far as to say:\n\n... one important feature must not be overlooked: Chan was not nearly as separate from these other types of Buddhist activities as one might think [...] [T]he monasteries of which Chan monks became abbots were comprehensive institutions, \"public monasteries\" that supported various types of Buddhist activities other than Chan-style meditation. The reader should bear this point in mind: In contrast to the independent denominations of Soto and Rinzai that emerged (largely by government fiat) in seventeenth-century Japan, there was never any such thing as an institutionally separate Chan \"school\" at any time in Chinese Buddhist history (emphasis McRae).\n\n\n=== Legendary or Proto-Chan (c. 500–600) ===\n\n\n==== Mahākāśyapa and the Flower Sermon ====\nThe Chan tradition ascribes the origins of Chan in India to the Flower Sermon, the earliest source for which comes from the 14th century. It is said that Gautama Buddha gathered his disciples one day for a Dharma talk. When they gathered together, the Buddha was completely silent and some speculated that perhaps the Buddha was tired or ill. The Buddha silently held up and twirled a flower and his eyes twinkled; several of his disciples tried to interpret what this meant, though none of them were correct. One of the Buddha's disciples, Mahākāśyapa, gazed at the flower and smiled. The Buddha then acknowledged Mahākāśyapa's insight by saying the following:\nI possess the true Dharma eye, the marvelous mind of Nirvāṇa, the true form of the formless, the subtle Dharma gate that does not rest on words or letters but is a special transmission outside of the scriptures. This I entrust to Mahākāśyapa.\n\n\n==== First six patriarchs (c. 500 – early 8th century) ====\n\nTraditionally the origin of Chán in China is credited to Bodhidharma, an Iranian language speaking Central Asian monk or an Indian monk.The story of his life, and of the Six Patriarchs, was constructed during the Tang Dynasty to lend credibility to the growing Chán-school. Only scarce historical information is available about him, but his hagiography developed when the Chan tradition grew stronger and gained prominence in the early 8th century. By this time a lineage of the six ancestral founders of Chan in China was developed.The actual origins of Chán may lie in ascetic practitioners of Buddhism, who found refuge in forests and mountains. Huike, \"a dhuta (extreme ascetic) who schooled others\" and used the Srimala Sutra, one of the Tathāgatagarbha sūtras , figures in the stories about Bodhidharma. Huike is regarded as the second Chán patriarch, appointed by Bodhidharma to succeed him. One of Huike's students, Sengcan, to whom is ascribed the Xinxin Ming, is regarded as the third patriarch.\nBy the late 8th century, under the influence of Huineng's student Shenhui, the traditional list of patriarchs of the Chan lineage had been established:\nBodhidharma (達摩) c. 440 – c. 528\nDazu Huike (慧可) 487–593\nSengcan (僧燦) ?–606\nDayi Daoxin (道信) 580–651\nDaman Hongren (弘忍) 601–674\nHuineng (惠能) 638–713In later writings this lineage was extended to include 28 Indian patriarchs. In the Song of Enlightenment (證道歌 Zhèngdào gē) of Yongjia Xuanjue (永嘉玄覺, 665–713), one of the chief disciples of Huìnéng, it is written that Bodhidharma was the 28th patriarch in a line of descent from Mahākāśyapa, a disciple of Śākyamuni Buddha, and the first patriarch of Chan Buddhism.\n\n\n==== Lankavatara Sutra ====\nIn its beginnings in China, Chan primarily referred to the Mahāyāna sūtras and especially to the Laṅkāvatāra Sūtra. As a result, early masters of the Chan tradition were referred to as \"Laṅkāvatāra masters\". As the Laṅkāvatāra Sūtra teaches the doctrine of the Ekayāna \"One Vehicle\", the early Chan school was sometimes referred to as the \"One Vehicle School\". In other early texts, the school that would later become known as Chan is sometimes even referred to as simply the \"Laṅkāvatāra school\" (Ch. 楞伽宗, Léngqié Zōng). Accounts recording the history of this early period are to be found in the Records of the Laṅkāvatāra Masters (Chinese: 楞伽師資記).\n\n\n==== Bodhidharma ====\n\nBodhidharma is recorded as having come into China during the time of Southern and Northern Dynasties to teach a \"special transmission outside scriptures\" which \"did not stand upon words\". Throughout Buddhist art, Bodhidharma is depicted as a rather ill-tempered, profusely bearded and wide-eyed barbarian. He is referred as \"The Blue-Eyed Barbarian\" (碧眼胡:Bìyǎn hú) in Chinese Chan texts. Only scarce historical information is available about him but his hagiography developed when the Chan tradition grew stronger and gained prominence in the early 8th century. By this time a lineage of the six ancestral founders of Chán in China was developed.Little contemporary biographical information on Bodhidharma is extant, and subsequent accounts became layered with legend. There are three principal sources for Bodhidharma's biography: The Record of the Buddhist Monasteries of Luoyang by Yáng Xuànzhī's (楊衒之, 547), Tan Lin's preface to the Long Scroll of the Treatise on the Two Entrances and Four Practices (6th century CE), and Dayi Daoxin's Further Biographies of Eminent Monks (7th century CE).\nThese sources vary in their account of Bodhidharma being either \"from Persia\" (547 CE), \"a Brahman monk from South India\" (645 CE), \"the third son of a Brahman king of South India\" (c. 715 CE). Some traditions specifically describe Bodhidharma to be the third son of a Pallava king from Kanchipuram.The Long Scroll of the Treatise on the Two Entrances and Four Practices written by Tan Lin (曇林; 506–574), contains teachings which are attributed to Bodhidharma. The text is known from the Dunhuang manuscripts. The two entrances to enlightenment are the entrance of principle and the entrance of practice:\n\nThe entrance of principle is to become enlightened to the Truth on the basis of the teaching. One must have a profound faith in the fact that one and the same True Nature is possessed by all sentient beings, both ordinary and enlightened, and that this True Nature is only covered up and made imperceptible [in the case of ordinary people] by false sense impressions\".\nThe entrance of practice includes the following four increments:\nPractice of the retribution of enmity: to accept all suffering as the fruition of past transgressions, without enmity or complaint\nPractice of the acceptance of circumstances: to remain unmoved even by good fortune, recognizing it as evanescent\nPractice of the absence of craving: to be without craving, which is the source of all suffering\nPractice of accordance with the Dharma: to eradicate wrong thoughts and practice the six perfections, without having any \"practice\".\nThis text was used and studied by Huike and his students. The True Nature refers to the Buddha-nature.\n\n\n==== Huike ====\nBodhidharma settled in Northern Wei China. Shortly before his death, Bodhidharma appointed his disciple Dazu Huike to succeed him, making Huike the first Chinese-born ancestral founder and the second ancestral founder of Chan in China. Bodhidharma is said to have passed three items to Huike as a sign of transmission of the Dharma: a robe, a bowl, and a copy of the Laṅkāvatāra Sūtra. The transmission then passed to the second ancestral founder Dazu Huike, the third Sengcan, the fourth ancestral founder Dayi Daoxin, and the fifth ancestral founder Daman Hongren.\n\n\n=== Early Chan in Tang China (c. 600–900) ===\n\n\n==== East Mountain Teachings ====\nWith the fourth patriarch, Daoxin (道信 580–651), Chán began to take shape as a distinct school. The link between Huike and Sengcan, and the fourth patriarch Daoxin \"is far from clear and remains tenuous\". With Daoxin and his successor, the fifth patriarch Hongren (弘忍 601–674), there emerged a new style of teaching, which was inspired by the Chinese text Awakening of Faith in the Mahayana. According to John R. McRae the \"first explicit statement of the sudden and direct approach that was to become the hallmark of Ch'an religious practice\" is associated with the East Mountain School. It is a method named \"Maintaining the one without wavering\" (shou-i pu i, 守一不移), the one being the nature of mind, which is equated with Buddha-nature. In this practice, one turns the attention from the objects of experience, to the perceiving subject itself. According to McRae, this type of meditation resembles the methods of \"virtually all schools of Mahayana Buddhism,\" but differs in that \"no preparatory requirements, no moral prerequisites or preliminary exercises are given,\" and is \"without steps or gradations. One concentrates, understands, and is enlightened, all in one undifferentiated practice.\" Sharf notes that the notion of \"Mind\" came to be criticised by radical subitists, and was replaced by \"No Mind,\" to avoid any reifications.A large group of students gathered at a permanent residence, and extreme ascetism became outdated. The period of Daoxin and Hongren came to be called the East Mountain Teaching, due to the location of the residence of Hongren at Huangmei. The term was used by Yuquan Shenxiu (神秀 606?–706), the most important successor to Hongren. By this time the group had grown into a matured congregation which became significant enough to be reckoned with by the ruling forces. The East Mountain community was a specialized meditation training centre. Hongren was a plain meditation teacher, who taught students of \"various religious interests\", including \"practitioners of the Lotus Sutra, students of Madhyamaka philosophy, or specialists in the monastic regulations of Buddhist Vinaya\". The school was typified by a \"loose practice,\" aiming to make meditation accessible to a larger audience. Shenxiu used short formulas extracted from various sutras to package the teachings, a style which is also used in the Platform Sutra. The establishment of a community in one location was a change from the wandering lives of Bodhiharma and Huike and their followers. It fitted better into the Chinese society, which highly valued community-oriented behaviour, instead of solitary practice.In 701 Shenxiu was invited to the Imperial Court by Zhou Empress Wu Zetian, who paid him due imperial reverence. The first lineage documents were produced in this period:\n\n[T]he genealogical presentation of the Chan transmission was first recorded on paper in the early years of metropolitan Chan activity. The earliest recorded instance of this was in the epitaph for a certain Faru, a student of Hongren's who died in 689, and by the second decade of the 8th century, the later followers of Hongren had produced two separate texts describing the transmission from Bodhidharma to Shenxiu.\nThe transition from the East Mountain to the two capitals changed the character of Chan:\n\n[I]t was only when Hongren's successors moved into the environment of the two capitals, with its literate society and incomparably larger urban scale, that well-written texts were required for disseminating the teaching.Members of the \"East Mountain Teaching\" shifted the alleged scriptural basis, realizing that the Awakening of Faith is not a sutra but a sastra, commentary, and fabricated a lineage of Lankavatara Sutra masters, as being the sutra that preluded the Awakening of Faith.\n\n\n==== Southern School – Huineng and Shenhui ====\n\nAccording to tradition, the sixth and last ancestral founder, Huineng (惠能; 638–713), was one of the giants of Chan history, and all surviving schools regard him as their ancestor. The dramatic story of Huineng's life tells that there was a controversy over his claim to the title of patriarch. After being chosen by Hongren, the fifth ancestral founder, Huineng had to flee by night to Nanhua Temple in the south to avoid the wrath of Hongren's jealous senior disciples.\nModern scholarship, however, has questioned this narrative. Historic research reveals that this story was created around the middle of the 8th century, as part of a campaign to win influence at the Imperial Court in 731 by a successor to Huineng called Shenhui. He claimed Huineng to be the successor of Hongren instead of Shenxiu, the recognized successor. A dramatic story of Huineng's life was created, as narrated in the Platform Sutra, which tells that there was a contest for the transmission of the title of patriarch. After being chosen by Hongren, the fifth patriarch, Huineng had to flee by night to Nanhua Temple in the south to avoid the wrath of Hongren's jealous senior disciples. Shenhui succeeded in his campaign, and Huineng eventually came to be regarded as the Sixth Patriarch. In 745 Shenhui was invited to take up residence in the Heze Temple in the capital, Dongdu (modern Luoyang) In 753, he fell out of grace and had to leave Dongdu to go into exile.\nThe most prominent of the successors of Shenhui's lineage was Guifeng Zongmi. According to Zongmi, Shenhui's approach was officially sanctioned in 796, when \"an imperial commission determined that the Southern line of Ch'an represented the orthodox transmission and established Shen-hui as the seventh patriarch, placing an inscription to that effect in the Shen-lung temple\".Doctrinally, Shenhui's \"Southern School\" is associated with the teaching that enlightenment is sudden while the \"Northern\" or East Mountain school is associated with the teaching that enlightenment is gradual. This was a polemical exaggeration since both schools were derived from the same tradition, and the so-called Southern School incorporated many teachings of the more influential Northern School. Eventually both schools died out, but the influence of Shenhui was so immense that all later Chan schools traced their origin to Huineng, and \"sudden enlightenment\" became a standard doctrine of Chan.Shenhui's influence is traceable in the Platform Sutra, which gives a popular account of the story of Huineng but also reconciles the antagonism created by Shenhui. Salient is that Shenhui himself does not figure in the Platform Sutra; he was effectively written out of Chan history. The Platform Sutra also reflects the growing popularity of the Diamond Sūtra (Vajracchedikā Prajñāpāramitā Sūtra) in 8th-century Chinese Buddhism. Thereafter, the essential texts of the Chan school were often considered to be both the Laṅkāvatāra Sūtra and the Diamond Sūtra. The Laṅkāvatāra Sūtra, which endorses the Buddha-nature, emphasized purity of mind, which can be attained in gradations. The Diamond-sutra emphasizes sunyata, which \"must be realized totally or not at all\". David Kalupahana associates the later Caodong school (Japanese Sōtō, gradual) and Linji school (Japanese Rinzai school, sudden) schools with the Yogacara and Madhyamaka philosophies respectively. The same comparison has been made by McRae. The Madhyamaka school elaborated on the theme of śūnyatā, which was set forth in the prajnaparamita sutras, to which the Diamond Sutra also belongs. The shift from the Laṅkāvatāra Sūtra to the Diamond Sutra also signifies a tension between Buddha-nature teachings, which imply a transcendental reality, versus śūnyatā, which denies such a transcendental reality.\n\n\n=== Tibetan Chan ===\nChinese Chan Buddhist teachers such as Moheyan first went to Tibet in the eighth century during the height of the Tibetan Empire. There seems to have been disputes between them and Indian Buddhists, as exemplified by the Samye debate. Many Tibetan Chan texts have been recovered from the caves at Dunhuang, where Chan and Tantric Buddhists lived side by side and this led to religious syncretism in some cases. Chan Buddhism survived in Tibet for several centuries, but had mostly been replaced by the 10th century developments in Tibetan Buddhism. According to Sam Van Schaik:\n\nAfter the 'dark period', all visible influences of Chan were eliminated from Tibetan Buddhism, and Mahayoga and Chan were carefully distinguished from each other. This trend\ncan already be observed in the tenth-century Lamp for the Eyes in Contemplation by the great central Tibetan scholar Gnubs chen Sangs rgyas ye shes. This influential work represented a crucial step in the codification of Chan, Mahayoga and the Great Perfection as distinct vehicles to enlightenment. In comparison, our group of [Dunhuang] manuscripts exhibits a remarkable freedom, blurring the lines between meditation systems which were elsewhere kept quite distinct. The system of practice set out in these manuscripts did not survive into the later Tibetan tradition. Indeed, this creative integration of meditation practices derived from both Indic and Chinese traditions could only have been possible during the earliest years of Tibetan Buddhism, when doctrinal categories were still forming, and in this sense it represents an important stage in the Tibetan assimilation of Buddhism.\n\n\n=== Classical or Middle Chan – Tang dynasty (c. 750–1000) ===\nDaoxin, Hongren, Shenxiu, Huineng and Shenhui all lived during the early Tang. The later period of the Tang Dynasty is traditionally regarded as the \"golden age\" of Chan. This proliferation is described in a famous saying:\nLook at the territory of the house of Tang —The whole of it is the realm of the Chan school.\n\n\n==== An Lu-shan rebellion ====\nThe An Lushan Rebellion (755–763) led to a loss of control by the Tang dynasty, and changed the Chan scene again. Metropolitan Chan began to lose its status, while \"other schools were arising in outlying areas controlled by warlords. These are the forerunners of the Chan we know today. Their origins are obscure; the power of Shen-hui's preaching is shown by the fact that they all trace themselves to Hui-neng.\"\n\n\n==== Hung-chou School ====\n\nThe most important of these schools is the Hongzhou school (洪州宗) of Mazu, to which also belong Shitou, Baizhang Huaihai, Huangbo and Linji (Rinzai). Linji is also regarded as the founder of one of the Five Houses.\nThis school developed \"shock techniques such as shouting, beating, and using irrational retorts to startle their students into realization\". Some of these are common today, while others are found mostly in anecdotes. It is common in many Chan traditions today for Chan teachers to have a stick with them during formal ceremonies which is a symbol of authority and which can be also used to strike on the table during a talk.\nThese shock techniques became part of the traditional and still popular image of Chan masters displaying irrational and strange behaviour to aid their students. Part of this image was due to later misinterpretations and translation errors, such as the loud belly shout known as katsu. \"Katsu\" means \"to shout\", which has traditionally been translated as \"yelled 'katsu'\" – which should mean \"yelled a yell\".A well-known story depicts Mazu practicing dhyana, but being rebuked by his teacher Nanyue Huairang, comparing seated meditation with polishing a tile. According to Faure, the criticism is not about dhyana as such, but \"the idea of \"becoming a Buddha\" by means of any practice, lowered to the standing of a \"means\" to achieve an \"end\"\". The criticism of seated dhyana reflects a change in the role and position of monks in Tang society, who \"undertook only pious works, reciting sacred texts and remaining seated in dhyana\". Nevertheless, seated dhyana remained an important part of the Chan tradition, also due to the influence of Guifeng Zongmi, who tried to balance dhyana and insight.The Hung-chou school has been criticised for its radical subitism. Guifeng Zongmi (圭峰 宗密) (780–841), an influential teacher-scholar and patriarch of both the Chan and the Huayan school, claimed that the Hongzhou school teaching led to a radical nondualism that denies the need for spiritual cultivation and moral discipline. While Zongmi acknowledged that the essence of Buddha-nature and its functioning in the day-to-day reality are but difference aspects of the same reality, he insisted that there is a difference.\n\n\n==== Shitou Xiqian ====\nTraditionally Shítóu Xīqiān (Ch. 石頭希遷, c. 700 – c.790) is seen as the other great figure of this period. In the Chan lineages he is regarded as the predecessor of the Caodong (Sōtō) school. He is also regarded as the author of the Sandokai, a poem which formed the basis for the Song of the Precious Mirror Samadhi of Dongshan Liangjie (Jp. Tōzan Ryōkan) and the teaching of the Five Ranks.\n\n\n==== The Great Persecution ====\nDuring 845–846 Emperor Wuzong persecuted the Buddhist schools in China:\n\nIt was a desperate attempt on the part of the hard-pressed central government, which had been in disarray since the An Lu-shan rebellion of 756, to gain some measure of political, economic, and military relief by preying on the Buddhist temples with their immense wealth and extensive lands.\nThis persecution was devastating for metropolitan Chan, but the Chan school of Ma-tsu and his likes survived, and took a leading role in the Chan of the later Tang.\n\n\n==== Five Dynasties and Ten Kingdoms Period (907–960/979) ====\n\nAfter the fall of the Tang Dynasty, China was without effective central control during the Five Dynasties and Ten Kingdoms Period. China was divided into several autonomous regions. Support for Buddhism was limited to a few areas. The Hua-yen and T'ient-tai schools suffered from the changing circumstances, since they had depended on imperial support. The collapse of T'ang society also deprived the aristocratic classes of wealth and influence, which meant a further drawback for Buddhism. Shenxiu's Northern School and Henshui's Southern School didn't survive the changing circumstances. Nevertheless, Chan emerged as the dominant stream within Chinese Buddhism, but with various schools developing various emphasises in their teachings, due to the regional orientation of the period. The Fayan school, named after Fa-yen Wen-i (885–958) became the dominant school in the southern kingdoms of Nan-T'ang (Jiangxi, Chiang-hsi) and Wuyue (Che-chiang).\n\n\n=== Literary Chan – Song dynasty (c. 960–1300) ===\n\nThe Five Dynasties and Ten Kingdoms Period was followed by the Song Dynasty, which established a strong central government. During the Song Dynasty, Chan (禪) was used by the government to strengthen its control over the country, and Chan grew to become the largest sect in Chinese Buddhism. An ideal picture of the Chan of the Tang period was produced, which served the legacy of this newly acquired status:\n\nIn the Song dynasty (960–1279), Chinese Chan Buddhism reached something of a climax paradigm. By \"climax paradigm\", I mean a conceptual configuration by which Chan was described in written texts, practiced by its adherents, and by extension understood as a religious entity by the Chinese population as a whole ... Previous events in Chan were interpreted through the lens of the Song dynasty configuration, and subsequent developments in China, Korea, Japan, and Vietnam were evaluated, even as they occurred, against what was known of the standards established during the Song. Thus the romanticized image of the great Tang dynasty masters – Mazu and his students, Caoshan, Dongshan, and their students, and of course Linji – was generated by Song dynasty authors and functioned within Song dynasty texts. Similarly, even where subsequent figures throughout East Asia – Hakuin Ekaku (1685–1769), the famous reviver of Japanese Rinzai, is the best example – evoke the examples of Bodhidharma, the Sixth Patriarch Huineng, Mazu, and the others, they do so through the conceptual filter of Song-dynasty Chan.\n\n\n==== Five Houses of Chan ====\n\nDuring the Song the Five Houses (Ch. 五家) of Chan, or five \"schools\", were recognized. These were not originally regarded as \"schools\" or \"sects\", but based on the various Chan-genealogies. Historically they have come to be understood as \"schools\".\nThe Five Houses of Chan are:\nGuiyang school (潙仰宗), named after masters Guishan Lingyou (771–854) and Yangshan Huiji (813–890), dharma-descendants of Mazu Daoyi;\nLinji school (臨濟宗), named after master Linji Yixuan (died 866), whose lineage came to be traced to Mazu, establishing him as the archetypal iconoclastic Chan-master;\nCaodong school (曹洞宗), named after masters Dongshan Liangjie (807–869) and Caoshan Benji (840–901);\nYunmen school (雲門宗), named after master Yunmen Wenyan (died 949), a student of Xuefeng Yicun (822–908), whose lineage was traced to Shitou Xiqian:\nFayan school (法眼宗), named after master Fayan Wenyi (885–958), a \"grand-student\" of Xuefeng Yicun.\n\n\n==== Rise of the Linji-school ====\n\nThe Linji-school became the dominant school within Chan, due to support from literati and the court. Before the Song Dynasty, the Linji-school is rather obscure, and very little is known about its early history. The first mention of Linji is in the Zutang ji, compiled in 952, 86 years after Linji's death. But the Zutang ji pictures the Xuefeng Yicun lineage as heir to the legacy of Mazu and the Hongzhou-school.According to Welter, the real founder of the Linji-school was Shoushan (or Baoying) Shengnian (首山省念) (926–993), a fourth generation dharma-heir of Linji. The Tiansheng Guangdeng lu (天聖廣燈錄), \"Tiansheng Era Expanded Lamp Record\", compiled by the official Li Zunxu (李遵勗) (988–1038) confirms the status of Shoushan Shengnian, but also pictures Linji as a major Chan patriarch and heir to the Mazu, displacing the prominence of the Fayan-lineage. It also established the slogan of \"a special transmission outside the teaching\", supporting the Linji-school claim of \"Chan as separate from and superior to all other Buddhist teachings\".\n\n\n==== Dahui Zonggao ====\nOver the course of Song Dynasty (960–1279), the Guiyang, Fayan, and Yunmen schools were gradually absorbed into the Linji. Song Chan was dominated by the Linji school of Dahui Zonggao, which in turn became strongly affiliated to the Imperial Court:\n\n... the Ta-hui school of Sung Chan had become closely associated with the Sung court, high officials, and the literati [...] With the establishment of the Wu-shan (Gozan) system during the Southern Sung the school of Ta-hui took precedence. The Chinese bureaucratic system entered into Chan temples throughout the country, and a highly organized system of temple rank and administration developed.\nThe Gozan system was a system of state-controlled temples, which were established by the Song government in all provinces.\n\n\n==== Koan-system ====\nThe teaching styles and words of the classical masters were recorded in the so-called \"encounter dialogues\". Snippets of these encounter dialogues were collected in texts as the Blue Cliff Record (1125) of Yuanwu, The Gateless Gate (1228) of Wumen, both of the Linji lineage, and the Book of Equanimity (1223) by Wansong Xingxiu of the Caodong lineage.\nThese texts became classic gōng'àn cases, together with verse and prose commentaries, which crystallized into the systematized gōng'àn (koan) practice. According to Miura and Sasaki, \"[I]t was during the lifetime of Yüan-wu's successor, Dahui Zonggao (大慧宗杲; 1089–1163) that Koan Chan entered its determinative stage.\"\nGōng'àn practice was prevalent in the Linji school, to which Yuanwu and Dahui belonged, but it was also employed on a more limited basis by the Caodong school.\nThe recorded encounter dialogues, and the koan collections which derived from this genre, mark a shift from solitary practice to interaction between master and student:\n\nThe essence of enlightenment came to be identified with the interaction between masters and students. Whatever insight dhyana might bring, its verification was always interpersonal. In effect, enlightenment came to be understood not so much as an insight, but as a way of acting in the world with other people\nThis mutual enquiry of the meaning of the encounters of masters and students of the past gave students a role model:\n\nOne looked at the enlightened activities of one's lineal forebears in order to understand one's own identity [...] taking the role of the participants and engaging in their dialogues instead\nKoan practice was a literary practice, styling snippets of encounter-dialogue into well-edited stories. It arose in interaction with \"educated literati\". There were dangers involved in such a literary approach, such as fixing specific meanings to the cases. Dahui Zonggao is even said to have burned the woodblocks of the Blue Cliff Record, for the hindrance it had become to study of Chan by his students\n\n\n==== Silent illumination ====\nThe Caodong was the other school to survive into the Song period. Its main protagonist was Hung-chih Cheng-chueh, a contemporary of Dahui Zonggao. It put emphasis on \"silent illumination\", or \"just sitting\". This approach was attacked by Dahui as being mere passivity, and lacking emphasis on gaining insight into one's true nature. Cheng-chueh in his turn criticized the emphasis on koan study.\n\n\n=== Post-classical Chan (c. 1300–present) ===\n\n\n==== Yuan Dynasty (1279–1368) ====\nThe Yuan dynasty was the empire established by Kublai Khan, the leader of the Borjigin clan, after the Mongol Empire conquered the Jin dynasty (1115–1234) and the Southern Song Dynasty. Chan began to be mixed with Pure Land Buddhism as in the teachings of Zhongfeng Mingben (1263–1323).\n\n\n==== Ming dynasty (1368–1644) ====\nChan Buddhism enjoyed something of a revival in the Ming dynasty, with teachers such as Hanshan Deqing (憨山德清), who wrote and taught extensively on both Chan and Pure Land Buddhism; Miyun Yuanwu (密雲圓悟), who came to be seen posthumously as the first patriarch of the Ōbaku school of Zen; and as Yunqi Zhuhong (雲棲祩宏) and Ouyi Zhixu (蕅益智旭).\nChan was taught alongside Pure Land Buddhism in many monasteries. In time much of the distinction between them was lost, and many masters taught both Chan and Pure Land.With the downfall of the Ming, several Chan masters fled to Japan, founding the Ōbaku school.\n\n\n==== Qing Dynasty (1644–1912) ====\nIn the beginning of the Qing dynasty, Chan was \"reinvented\", by the \"revival of beating and shouting practices\" by Miyun Yuanwu (1566–1642), and the publication of the Wudeng yantong (\"The strict transmission of the five Chan schools\") by Feiyin Tongrong's (1593–1662), a dharma heir of Miyun Yuanwu. The book placed self-proclaimed Chan monks without proper Dharma transmission in the category of \"lineage unknown\" (sifa weixiang), thereby excluding several prominent Caodong monks.\n\n\n=== Modernisation ===\n\n\n==== 19th century (late Qing Dynasty) ====\nAround 1900, Buddhists from other Asian countries showed a growing interest in Chinese Buddhism. Anagarika Dharmapala visited Shaghai in 1893, intending \"to make a tour of China, to arouse the Chinese Buddhists to send missionaries to India to restore Buddhism there, and then to start a propaganda throughout the whole world\", but eventually limiting his stay to Shanghai. Japanese Buddhist missionaries were active in China in the beginning of the 20th century.\n\n\n==== Republic of China (1912–1949) – First Buddhist Revival ====\n\nThe modernisation of China led to the end of the Chinese Empire, and the installation of the Republic of China, which lasted on the mainland until the Communist Revolution and the installation of the People's Republic of China in 1949.\nAfter further centuries of decline during the Qing, Chan was revived again in the early 20th century by Hsu Yun (虛雲), a well-known figure of 20th-century Chinese Buddhism. Many Chan teachers today trace their lineage to Hsu Yun, including Sheng Yen (聖嚴) and Hsuan Hua (宣化), who have propagated Chan in the West where it has grown steadily through the 20th and 21st century.\nThe Buddhist reformist Taixu propagated a Chan-influenced humanistic Buddhism, which is endorsed by Jing Hui, former abbott of Bailin Monastery.Until 1949, monasteries were built in the Southeast Asian countries, for example by monks of Guanghua Monastery, to spread Chinese Buddhism. Presently, Guanghua Monastery has seven branches in the Malay Peninsula and Indonesia.\n\n\n==== People's Republic of China (1949–present) – Second Buddhist Revival ====\n\nChan was repressed in China during the recent modern era in the early periods of the People's Republic, but subsequently had been re-asserting itself on the mainland, and has a significant following in Taiwan and Hong Kong as well as among Overseas Chinese.\nSince the Chinese economic reform of the 1970s, a new revival of Chinese Buddhism is going on. Ancient Buddhist temples, such as Bailin Monastery and Guanghua Monastery have been refurbished.\nBailin Monastery was ruined long before 1949. In 1988, Jing Hui was persuaded to take over the Hebei Buddhist Association, and start rebuilding the Monastery. Jing Hui is a student and dharma successor of Hsu Yun, but has also adopted the Humanistic Buddhism of Taixu.Guanghua Monastery was restored beginning in 1979, when a six-year restoration program began under the supervision of then 70-year-old Venerable Master Yuanzhou (圆拙老法师). In 1983 the temple became one of the Chinese Buddhism Regional Temples (汉族地区全国重点寺院) whilst 36-year-old Master Yiran (毅然法師) became abbot. The same year, Venerable Master Yuanzhou funded the establishment of the new Fujian Buddhism Academy (福建佛学院) on the site.\n\n\n==== Taiwan ====\n\nSeveral Chinese Buddhist teachers left China during the Communist Revolution, and settled in Hong Kong and Taiwan.\nSheng Yen (1930–2009) was the founder of the Dharma Drum Mountain, a Buddhist organization based in Taiwan. During his time in Taiwan, Sheng Yen was well known as one of the progressive Buddhist teachers who sought to teach Buddhism in a modern and Western-influenced world. As such, Sheng yen published over 30 Chan texts in English.Wei Chueh (1928–2016) was born in Sichuan, China, and ordained in Taiwan. In 1982, he founded Lin Quan Temple in Taipei County and became known for his teaching on Ch'an practices by offering many lectures and seven-day Ch'an retreats. His order is called Chung Tai Shan.\nTwo additional traditions emerged in the 1960s, based their teaching on Ch'an practices.\nCheng Yen (born 1937), a Buddhist nun, founded the Tzu Chi Foundation as a charity organization with Buddhist origins on 14 May 1966 in Hualien, Taiwan. She was inspired by her master and mentor, the late Venerable Master Yin Shun (印順導師, Yìn Shùn dǎoshī) a proponent of Humanistic Buddhism, who exhorted her to \"work for Buddhism and for all sentient beings\". The organisation began with a motto of \"instructing the rich and saving the poor\" as a group of thirty housewives who donated a small amount of money each day to care for needy families.Hsing Yun (born 1927), founded the Fo Guang Shan an international Chinese Buddhist new religious movement based in Taiwan in 1967. The order promotes Humanistic Buddhism. Fo Guang Shan also calls itself the International Buddhist Progress Society.  The headquarters of Fo Guang Shan, located in Dashu District, Kaohsiung, is the largest Buddhist monastery in Taiwan. Hsing Yun's stated position within Fo Guang Shan is that it is an \"amalgam of all Eight Schools of Chinese Buddhism\" (八宗兼弘), including Chan. Fo Guang Shan is the most comprehensive of the major Buddhist organizations of Taiwan, focusing extensively on both social works and religious engagement.In Taiwan, these four masters are popularly referred to as the \"Four Heavenly Kings\" of Taiwanese Buddhism, with their respective organizations Dharma Drum Mountain, Chung Tai Shan, Tzu Chi, and Fo Guang Shan being referred to as the \"Four Great Mountains\".\n\n\n== Spread of Chan Buddhism in Asia ==\n\n\n=== Thiền in Vietnam ===\n\nAccording to traditional accounts of Vietnam, in 580 an Indian monk named Vinītaruci (Vietnamese: Tì-ni-đa-lưu-chi) travelled to Vietnam after completing his studies with Sengcan, the third patriarch of Chinese Chan. This, then, would be the first appearance of Thiền Buddhism. Other early Thiền schools included that of Wu Yantong (Chinese: 無言通; Vietnamese: Vô Ngôn Thông), which was associated with the teachings of Mazu Daoyi, and the Thảo Đường (Caodong), which incorporated nianfo chanting techniques; both were founded by Chinese monks.\n\n\n=== Seon in Korea ===\n\nSeon was gradually transmitted into Korea during the late Silla period (7th through 9th centuries) as Korean monks of predominantly Hwaeom (Korean: 화엄종; Hanja: 華嚴宗) and East Asian Yogācāra (Korean: 유식종; Hanja: 唯識宗) background began to travel to China to learn the newly developing tradition. Seon received its most significant impetus and consolidation from the Goryeo monk Jinul (知訥) (1158–1210), who established a reform movement and introduced kōan practice to Korea. Jinul established the Songgwangsa (松廣寺) as a new center of pure practice.\n\n\n=== Zen in Japan ===\n\nZen was not introduced as a separate school in Japan until the 12th century when Eisai traveled to China and returned to establish a Linji lineage, which is known in Japan as the Rinzai. In 1215, Dōgen, a younger contemporary of Eisai's, journeyed to China himself, where he became a disciple of the Caodong master Rujing. After his return, Dōgen established the Sōtō school, the Japanese branch of Caodong.\nThe schools of Zen that currently exist in Japan are the Sōtō, Rinzai and Ōbaku. Of these, Sōtō is the largest and Ōbaku the smallest. Rinzai is itself divided into several subschools based on temple affiliation, including Myōshin-ji, Nanzen-ji, Tenryū-ji, Daitoku-ji, and Tōfuku-ji.\n\n\n=== Chan in Indonesia ===\n\nIn the 20th century, during the First Buddhist revival, missionaries were sent to Indonesia and Malaysia. Ashin Jinarakkhita, who played a central role in the revival of Indonesian Buddhism, received ordination as a Chan śrāmaṇera on July 29, 1953 and received the name Ti Zheng (Te Cheng) from bhikṣu Ben Qing.\n\n\n== Chan in the Western world ==\n\nChan has become especially popular in its Japanese form. Although it is difficult to trace when the West first became aware of Chan as a distinct form of Buddhism, the visit of Soyen Shaku, a Japanese Zen monk, to Chicago during the 1893 Parliament of the World's Religions is often pointed to as an event that enhanced its profile in the Western world. It was during the late 1950s and the early 1960s that the number of Westerners pursuing a serious interest in Zen, other than the descendants of Asian immigrants, reached a significant level.\n\n\n=== Western Chan lineages ===\n\nThe first Chinese master to teach Westerners in North America was Hsuan Hua, who taught Chan and other traditions of Chinese Buddhism in San Francisco during the early 1960s. He went on to found the City Of Ten Thousand Buddhas, a monastery and retreat center located on a 237-acre (959,000 m²) property near Ukiah, California, founding the Dharma Realm Buddhist Association. Another Chinese Chan teacher with a Western following was Sheng Yen, a master trained in both the Caodong and Linji schools. He first visited the United States in 1978 under the sponsorship of the Buddhist Association of the United States, and subsequently founded the CMC Chan Meditation Center in Queens, New York and the Dharma Drum Retreat Center in Pine Bush, New York.\n\n\n== Doctrinal background ==\n\nThough Zen-narrative states that it is a \"special transmission outside scriptures\" which \"did not stand upon words\", Zen does have a rich doctrinal background.\n\n\n=== Polarities ===\nClassical Chinese Chan is characterised by a set of polarities: absolute-relative, Buddha-nature – sunyata, sudden and gradual enlightenment, esoteric and exoteric transmission.\n\n\n==== Absolute-relative ====\nThe Prajnaparamita sutras and Madhyamaka emphasize the non-duality of form and emptiness: \"form is emptiness, emptiness is form\", as the Heart sutra says. This was understood to mean that ultimate reality is not a transcendental realm, but equal to the daily world of relative reality. This idea fitted into the Chinese culture, which emphasized the mundane world and society. But this does not fully explain how the absolute is present in the relative world. This question is answered in such schemata as the Five Ranks of Tozan, the Ten Bulls (\"the Oxherding Pictures\"), and Hakuin's Four ways of knowing.The Madhyamaka two truths doctrine and the Yogacara three natures and Trikaya doctrines also give depictions of the interplay between the absolute and the relative.\n\n\n==== Buddha-nature and śūnyatā ====\nWhen Buddhism was introduced in China it was understood in native terms. Various sects struggled to attain an understanding of the Indian texts. The Tathāgatagarbha sūtras and the idea of the Buddha-nature were endorsed because of the perceived similarities with the Tao, which was understood as a transcendental reality underlying the world of appearances. Śūnyatā at first was understood as pointing to the Taoist wu.The doctrine of the Buddha-nature asserts that all sentient beings have Buddha-nature (Skt. Buddhadhātu, \"Buddha Element\", \"Buddha-Principle\"), the element from which awakening springs. The Tathāgatagarbha sutras state that every living being has the potential to realize awakening. Hence Buddhism offers salvation to every-one, not only to monks or those who have freed themselves almost completely from karma in previous lives. The Yogacara theory of the Eight Consciousnesses explains how sensory input and the mind create the world we experience, and obscure the alaya-jnana, which is equated to the Buddha-nature.When this potential is realized, and the defilements have been eliminated, the Buddha-nature manifests as the Dharmakaya, the absolute reality which pervades everything in the world. In this way, it is also the primordial reality from which phenomenal reality springs. When this understanding is idealized, it becomes a transcendental reality beneath the world of appearances.Sunyata points to the \"emptiness\" or no-\"thing\"-ness of all \"things\". Though we perceive a world of concrete and discrete objects, designated by names, on close analysis the \"thingness\" dissolves, leaving them \"empty\" of inherent existence. The Heart sutra, a text from the prajñaparamita sutras, articulates this in the following saying in which the five skandhas are said to be \"empty\":\nYogacara explains this \"emptiness\" in an analysis of the way we perceive \"things\". Everything we conceive of is the result of the working of the five skandhas—results of perception, feeling, volition, and discrimination. The five skandhas together compose consciousness. The \"things\" we are conscious of are \"mere concepts\", not noumenon.It took Chinese Buddhism several centuries to recognize that śūnyatā is not identical to \"wu\", nor does Buddhism postulate a permanent soul. The influence of those various doctrinal and textual backgrounds is still discernible in Zen. Zen teachers still refer to Buddha-nature, but the Zen tradition also emphasizes that Buddha-nature is śūnyatā, the absence of an independent and substantial self.\n\n\n==== Sudden and gradual enlightenment ====\n\nIn Zen Buddhism two main views on the way to enlightenment are discernible, namely sudden and gradual enlightenment.\nEarly Chan recognized the \"transcendence of the body and mind\", followed by \"non-defilement [of] knowledge and perception\", or sudden insight into the true nature (jiànxìng) followed by gradual purification of intentions.In the 8th century Chan history was effectively refashioned by Shenhui, who created a dichotomy between the so-called East Mountain Teaching or \"Northern School\", led by Yuquan Shenxiu, and his own line of teaching, which he called the \"Southern school\". Shenhui placed Huineng into prominence as the sixth Chan-patriarch, and emphasized sudden enlightenment, as opposed to the concurrent Northern School's alleged gradual enlightenment. According to the sudden enlightenment propagated by Shenhui, insight into true nature is sudden; thereafter there can be no misunderstanding anymore about this true nature.\nIn the Platform Sutra, the dichotomy between sudden and gradual is reconciled. Guifeng Zongmi, fifth-generation successor to Shenhui, also softened the edge between sudden and gradual. In his analysis, sudden awakening points to seeing into one's true nature, but is to be followed by a gradual cultivation to attain Buddhahood.This gradual cultivation is also recognized by Dongshan Liangjie (Japanese Tōzan), who described the five ranks of enlightenment.\n\n\n==== Esoteric and exoteric transmission ====\nAccording to Borup the emphasis on 'mind to mind transmission' is a form of esoteric transmission, in which \"the tradition and the enlightened mind is transmitted face to face\". Metaphorically this can be described as the transmission from a flame from one candle to another candle, or the transmission from one vein to another. In exoteric transmission requires \"direct access to the teaching through a personal discovery of one's self. This type of transmission and identification is symbolized by the discovery of a shining lantern, or a mirror.\"\n\n\n=== Chan scripture ===\n\nChan is deeply rooted in the teachings and doctrines of Mahāyāna Buddhism. What the Chan tradition emphasizes is that enlightenment of the Buddha came not through intellectual reasoning, but rather through self-realization in Dharma practice and meditation. Therefore, it is held that it is primarily through Dharma practice and meditation that others may attain enlightenment and become Buddhas as well.\nA review of the early historical documents and literature of early Chan masters clearly reveals that they were all well versed in numerous Mahāyāna Buddhist sūtras. For example, in the Platform Sūtra of the Sixth Patriarch, Huineng cites and explains the Diamond Sūtra, the Lotus Sūtra (Saddharma Puṇḍarīka Sūtra), the Vimalakīrti Nirdeśa Sūtra, the Śūraṅgama Sūtra, and the Laṅkāvatāra Sūtra.\nThe Chan school had to develop a doctrinal tradition of its own to establish its position. Subsequently, the Chan tradition produced a rich corpus of written literature which has become a part of its practice and teaching. Among the earliest and most widely studied of the specifically Chan texts, dating to at least the 9th century CE, is the Platform Sūtra of the Sixth Patriarch, attributed to Huineng. The most important Chan texts belong to the \"encounter dialogue\" genre, which developed into various collections of kōans.\n\n\n== Teaching and practice ==\nSee also Zen practice\n\n\n=== Bodhisattva ideal ===\nAs a school of Mahāyāna Buddhism, Chan draws many of its basic driving concepts from that tradition, such as the Bodhisattva ideal. Karuṇā is the counterpart of prajna. Avalokiteśvara embodies the striving for Karuna, compassion.Central to Chan practice is dhyana or meditation. In the Lin-ji (Rinzai) school this is supplemented with koan study.\n\n\n=== Chan meditation ===\nIn meditation practice, the Chan tradition holds that the very notions of doctrine and teachings create various other notions and appearances (Skt. saṃjñā; Ch. 相, xiāng) that obscure the transcendent wisdom of each being's Buddha-nature. Thus, Chan encourages its practitioners to distrust the very scripture or text being taught to them. The process of rediscovery goes under various terms such as \"introspection\", \"a backward step\", \"turning-about\" or \"turning the eye inward\".\n\n\n==== Sitting meditation ====\n\nSitting meditation is called zuòchán (坐禅), zazen in Japanese, both simply meaning \"sitting dhyāna\". During this sitting meditation, practitioners usually assume a position such as the lotus position, half-lotus, Burmese, or seiza postures. To regulate the mind, awareness is directed towards counting or watching the breath, or put in the energy center below the navel (see also anapanasati). Often, a square or round cushion placed on a padded mat is used to sit on; in some other cases, a chair may be used.\nAt the beginning of the Song Dynasty, practice with the koan method became popular, whereas others practiced \"silent illumination.\" This became the source of some differences in practice between the Linji and Caodong traditions.\n\n\n=== Koan practice ===\n\nA koan (literally \"public case\") is a story or dialogue, generally related to Chan or other Buddhist history; the most typical form is an anecdote involving early Chinese Chan masters. These anecdotes involving famous Chan teachers are a practical demonstration of their wisdom, and can be used to test a student's progress in Chan practice. Koans often appear to be paradoxical or linguistically meaningless dialogues or questions. But to Chan Buddhists the koan is \"the place and the time and the event where truth reveals itself\" unobstructed by the oppositions and differentiations of language. Answering a koan requires a student to let go of conceptual thinking and of the logical way we order the world, so that, like creativity in art, the appropriate insight and response arises naturally and spontaneously in the mind.\n\n\n== Chan monasticism ==\nChan developed a distinct monastic system.\n\n\n=== Emphasizing daily life ===\nAs the Chan school grew in China, the monastic discipline also became distinct, focusing on practice through all aspects of life. Temples began emphasizing labor and humility, expanding the training of Chan to include the mundane tasks of daily life. D.T. Suzuki wrote that aspects of this life are: a life of humility; a life of labor; a life of service; a life of prayer and gratitude; and a life of meditation. The Chinese Chan master Baizhang (720–814 CE) left behind a famous saying which had been the guiding principle of his life, \"A day without work is a day without food\".\n\n\n=== Sinification of Buddhism in China ===\nIt was scholar D.T. Suzuki's contention that a spiritual awakening was always the goal of Chan's training, but that part of what distinguished the tradition as it developed through the centuries in China was a way of life radically different from that of Indian Buddhists. In Indian Buddhism, the tradition of the mendicant prevailed, but Suzuki explained that in China social circumstances led to the development of a temple and training-center system in which the abbot and the monks all performed mundane tasks. These included food gardening or farming, carpentry, architecture, housekeeping, administration (or community direction), and the practice of Traditional Chinese medicine. Consequently, the enlightenment sought in Chan had to stand up well to the demands and potential frustrations of everyday life.\n\n\n== See also ==\nBuddhism\nOutline of Buddhism\nTimeline of Buddhism\nList of Buddhists\nChinese Buddhism\nJapanese Zen\nYiduan\n\n\n== Notes ==\n\n\n== References ==\n\n\n== Sources ==\n\n\n=== Printed sources ===\n\n\n=== Web-sources ===\n\n\n== Further reading ==\nModern classics\n\nD.T. Suzuki, Essays in Zen Buddhism, 3 vols\nThomas Cleary, Zen Mind, Buddha Mind\nJ. C. Cleary, Swampland Flowers: The Letters and Lectures of Zen Master Ta HuiClassic history\n\nDumoulin, Heinrich (2005), Zen Buddhism: A History. Volume 1: India and China. World Wisdom Books. ISBN 978-0-941532-89-1\nDumoulin, Heinrich (2005), Zen Buddhism: A History. Volume 2: Japan. World Wisdom Books. ISBN 978-0-941532-90-7Critical Zen-studies\n\nJeffrey Broughton, Zongmi on Chan.\nSung Bae Park, Buddhist Faith and Sudden Enlightenment.\n\n\n== External links ==\nOversight\n\nZen Buddhism WWW Virtual Library\nThe Zen SiteOverview of Chan centers\n\nZen Centers at Curlie\nZen centers of the world\nZen centersSpecific Chan centers\n\nWestern Ch'an Fellowship Official Website\nDharma Drum Retreat Center (New York) Official Website. Established by Chan Master Sheng Yen.Texts\n\nSacred-text.com's collection of Zen texts\nBuddhanet's collection of Zen texts\nShambhala Sun Zen Articles\nBooklets from Fo Guang ShanHistory\n\nBuddhism and Confucianism in Chan Sudden Approach: A Cunning Cultural Paradigm\nHistory of Zen Buddhism\nZen history\nZen Quick FactsCritical Chan Research\n\nSteven Heine (2007), A Critical Survey of Works on Zen since Yampolsky\nHomepage of Robert H. Sharf\nZhi, Chuan (2019). Exploring Chán: An Introduction to the Religious and Mystical Tradition of Chinese Buddhism. Songlark Publishing. p. 472. ISBN 978-1-73331-430-5."