"Paraphilic infantilism, also known as autonepiophilia, psychosexual infantilism and adult baby syndrome, is a sexual fetish that involves role-playing a regression to an infant-like state. Behaviors may include drinking from a bottle or wearing diapers (diaper fetishism). Individuals may engage in gentle and nurturing experiences (an adult who engages only in infantile play is known as an adult baby) or be attracted to masochistic, coercive, punishing or humiliating experiences. Diaper fetishism involves \"diaper lovers\" wearing diapers for sexual or erotic reasons but may not involve infant-like behavior. Individuals who experience both of these things are referred to as adult baby/diaper lovers (AB/DL). When wearing diapers, infantilists may urinate and/or defecate in them.There is no recognized etiology for infantilism and there is little research done on the subject. It has been linked to masochism and a variety of other paraphilias. Although it is commonly confused with pedophilia, the two conditions are distinct and infantilists do not seek children as sexual partners. A variety of causes have been proposed, including altered lovemaps, imprinting gone wrong and errors in erotic targets, though there is no consensus. A variety of organizations exist to discuss infantilism or meet with other practitioners throughout the world.\n\n\n== Characteristics and behaviors ==\nThe infantilist community is described by one practitioner as made up of two main types - adult babies (adults who role play infants) and sissy babies (men who tend to wear typically feminine clothing, and use female pronouns). There are also individuals who wear diapers but do not act as infants, either diaper lovers who eroticize diaper wearing, or sadomasochists who use diapers as a way of enforcing dominance and submission. Though the categories are discrete, in practice the behaviors found in each group often overlap.  Adult babies roleplaying as a baby or young child for erotic stimulation is considered the signature expression of paraphilic infantilism.  This may involve the use of adult-sized diapers and baby clothes or toys and furniture such as a crib to lend reality to the infantilist fantasy, crawling on the floor, and some individuals may urinate or defecate in their diapers.  If a partner is willing, adult babies may engage in parent-baby roleplay including being bathed, powdered and changed into diapers by one's partner, before being put to bed with a baby bottle.  Some may also simulate lactation with a willing partner. Thereafter the adult baby may be comforted  by their partner in the role of the parent and their diapers might be changed if wet or dirty.  For some infantilists, the ritual might instead involve being scolded, spanked or chastised for having wet or dirtied their diapers.  In this latter instance the mode of arousal is masochistic.  Others may desire only gentle or nurturing treatment, based on the desire to be cared for or to \"surrender the responsibilities of adult life\".  Some infantilists may involve masturbation and ejaculation while others may choose not to engage in sex since it is not babylike.  The erotic pleasure derived from either of these forms of infantilism may replace the need for sexual intercourse in reaching orgasm.In one study of AB/DL website participants, 93% of the sample was male (excluding transgender individuals). 58% of the men and 34% of the women were heterosexual. Males on average first became interested in AB/DL at age 11, and started practicing it at 13, compared to 12 and 16 for females, respectively. The most frequent activities were wearing diapers, wetting, and using other baby items. 87% of the men and 91% of the women reported that their AB/DL had not caused any significant problems or distress.\n\n\n== Prevalence ==\nMeaningful information on the incidence or prevalence of any of the paraphilias are lacking due to the often clandestine nature of such practices. Similarly, it has been observed that infantilism is a closeted activity and it is not well documented in the medical literature. One study reported that 9% of Yahoo groups devoted to \"fetishes\" dealt with paraphilic infantilism, which was high in relation to other fetishes. If exceptional behaviors do not cause functional impairment, personal distress or distress to others, or have legal implications they can escape the purview of psychiatric awareness and knowledge. Additionally, infantilists may not consider themselves as suffering from a medical condition and may not want to change their behavior, a common occurrence among individuals with paraphilias. Individuals with paraphilic infantilism may seek therapy only for other issues, or be encouraged or coerced to seek treatment if discovered by others. Given these issues the potential of anonymous internet surveys for data collection on infantilist communities has been noted.One study members of the ABDL online community, however, noted that males became interested in paraphilic infantilism earlier than females, at age 11 rather than 12, and also began to act on their interests earlier, at 13 rather than 16. The same study found that while most males interested in paraphilic infantilism were primarily straight (58%), most females were primarily bisexual (43%). 34% of women were primarily straight. Although both men and women varied in terms of education, only 66% of men and 39% of women earned more than $25,000 a year.\n\n\n== Relation to other conditions ==\nInfantilism is a diffuse phenomenon and different authorities have taken varied approaches to the question of its medical and sexological classification.\n\n\n=== Definitions ===\nThe conventional definition of infantilism means the persistence of childlike traits in adults and medically the failure to attain sexual maturity, and \"sexual infantilism\" is also used medically as a synonym for delayed puberty.  The term \"psychosexual infantilism\" was used in Sigmund Freud's theory of psychosexual development to refer to individuals who had not matured through its hypothetical stages into heterosexuality.  Psychologist Wilhelm Stekel used \"psychosexual infantilism\" as a category similar to paraphilia, including paraphilic infantilism and other paraphilias and sexual orientations.\n\n\n=== Masochism ===\n\nThe Diagnostic and Statistical Manual of Mental Disorders (DSM) states that along with other behaviors, sexual masochists \"...may have a desire to be treated as a helpless infant and clothed in diapers ('infantilism')\" and this association is repeated by others. Masochism appears to be particularly important for female infantilists.Psychologists D. Richard Laws and William O'Donohue state that \"Although infantilism is classified as a sexual masochism in the DSM-IV and DSM-IV-TR, it is questionable whether the criteria for sexual masochism are always met.  For example, if the infantile role playing does not involve feelings of humiliation and suffering, then the diagnosis of sexual masochism would not be appropriate and a diagnosis of infantilism as a paraphilia [not otherwise specified] is warranted.\"  Sexologist John Money, in his book Lovemaps describes paraphilic infantilism as a possible \"...adjunctive to masochistic discipline and humiliation.\"  Sexologist William B. Arndt considers paraphilic infantilism to combine forms of fetishism, transvestism and masochism.  Wilhelm Stekel considered sado-masochistic practices to be variant behavior arising from psychosexual infantilism.A potential connection between paraphilic infantilism and sadomasochism has been noted in the Polish publication, Przegląd Seksuologiczny. Research results within the publication indicated that 28% of those paraphilic infantilists surveyed reported an interest in BDSM.\n\n\n=== Pedophilia ===\n\nConfusing infantilism with pedophilia is a common misunderstanding but infantilism involves role-playing exclusively with other adults; infantilism is not related to pedophilia, or any form of child sexual abuse. Sexologist Gloria Brame states that \"...infantilists who recognize and accept their sexuality - and its possible roots in infantile trauma - tend to be acutely protective of real children.\"John Money used the term \"nepiophilia\" to describe attraction to diaper-wearing babies. He described infantilism as \"autonepiophilia,\" in which the individual desires to be and to impersonate a baby and does not desire an infant as a sexual partner.In 1993, sexologists Ray Blanchard and Kurt Freund published and discussed a series of case studies involving infantilists and noted a distinction between them and pedophiles.  While pedophiles were attracted to children (and objects related to childhood) due to the desire for a child sexual partner, infantilists imagined themselves as children and adopted the objects of childhood or infancy to increase the power difference between themselves and their preferred sexual partners of adult women, with whom they acted out masochistic fantasies.\n\n\n=== Other conditions ===\nIn the limited number of extant medical case reports some clinicians have attempted to explain the behaviors associated with infantilism in terms of obsessive compulsive disorder, as \"a concurrent cluster of symptoms found in a variety of psychiatric disorders.\"  Psychiatrist Jay Feierman considers infantilism a form of chronophilia in which the infantilist desires a sexual partner of the same biological age, but their own \"sexuoerotic age\" does not match his or her own biological age (i.e. the adult infantilist wishes an adult sexual partner who treats them as a baby).  A 2011 letter to the editor in the Archives of Sexual Behavior reviewed several case studies and noted a common history of sexual abuse.\n\n\n==== Diaper fetishism ====\nIndividuals with diaper fetishism typically do not imagine themselves as babies. Rather, they more often see themselves as adults who are drawn to wearing diapers.John Money distinguishes between infantilism or autonepiophilia and paraphilic diaper-wearing, stating that the latter is a paraphilic fetish that manifests as an erotic attraction to an article of clothing while the former is a non-fetishistic paraphilia directed at a change of status in terms of age identity.\n\n\n==== Cross-dressing ====\nInfantilists, usually male, may also engage in cross-dressing and wear clothes stereotypically associated with young girls.  This type of behavior is referred to as being a \"sissy baby\".  Masochistic infantilists may wish to be forcibly cross-dressed.\n\n\n== Causes ==\nTo date no broad-based scientific studies have been made on the cause, incidence and general impact of paraphilic infantilism on society at large. This may be due to both the relative rarity of the condition and because few paraphilic infantilists appear to seek professional mental health counseling, and that even fewer appear to require any type of pro-active mental health intervention. A 2002 case report by psychiatrists Jennifer Pate and Glen Goddard found little research on the topic, and they suggested the DSM lacked a category that captured their patient's disorder. Research on the etiology of paraphilias in general is minimal and as of 2008 had essentially come to a standstill; it is not clear whether the development of infantilism shares a common cause with other paraphilias. Criminologists Stephen and Ronald Holmes believe that while there is no simple answer to the origins of infantilism, the practices may involve an element of stress reduction similar to that of transvestism.\n\n\n=== Lovemap theory ===\nJohn Money developed the theory of a lovemap, \n\"a developmental representation or template in the mind and in the brain depicting the idealized lover and the idealized program of sexual and erotic activity projected in imagery or actually engaged in\".\n\nMoney thought that the lovemap was normally fully developed by the age of 8, serving as a kind of sexual template through to the end of one's adult life. Money believed all paraphilias were caused by the formation of abnormal lovemaps during the preadolescent years and that such abnormal lovemaps can be formed by any number of contributing factors or stressors during this developmental period. Money also coined the term \"autonepiophilia\" meaning a \"diaperism\" or diaper fetishism in 1984 to describe the condition. Nepon is Greek for infant.\n\n\n=== Imprinting ===\nIt has been hypothesized that, among other possible causes, sexual templates are established by a process akin to imprinting where lack of availability of female genitals during a critical period of development causes the imprinting mechanism to instead associate with the nearest visual or olfactory approximation. In the case of infantilism, the discipline of the mother or wearing diapers may create associations between pain, humiliation and sexuality.\n\n\n=== Erotic location target error ===\nAn additional theory is that infantilism is an erotic identity disorder where the erotic fantasy is centered on the self rather than on a sexual partner and results from an erotic targeting location error where the erotic target was children yet becomes inverted. According to this model, proposed by Ray Blanchard and Kurt Freund in 1993, infantilism is a sexual attraction to the idea of the self being a child.\n\n\n== History ==\nThe first public event for adult babies was \"Baby Week\", occurring in San Francisco in the early 1990s. Subsequently the internet became a major forum, with numerous websites offering books, magazines, audio and video tapes and related paraphernalia, as well as a 24-hour hotline.  Paraphilic infantilism has appeared as an alternative lifestyle in numerous Western countries including the United States, England, Germany and Australia.The organization \"Diaper Pail Friends\" was established in San Francisco, growing to approximately 3,000 members in 1995 through magazine articles, books, talk shows and the Internet.  The organization was studied in 1995 by a group of sexologists, though the results were not published.  In 2001, the New York organization \"Still in Diapers\" was founded for diaper fetishists. In 2008, the Diaper Pail Friends had expanded to a national organization and claimed a membership of 15,000.Tykables opened the first wholly dedicated paraphilic infantilism physical retail store, in Mount Prospect, Illinois in the Chicagoland area, in 2016 with controversy from the local community. The store owner believes it helps to break the stigma about the community.\n\n\n== See also ==\n\nBDSM\nErotic lactation\nAgeplay\n\n\n== Notes ==\n\n\n== References ==\nMoney, J (1986). Love Maps - Clinical Concepts of Sexual/Erotic Health and Pathology, Paraphilia, and Gender Transposition in Childhood, Adolescence, and Maturity. New York: Prometheus Books. ISBN 978-0-8290-1589-8.\nStekel, W (1952). Patterns of Psychosexual Infantilism. Washington Square Press. ISBN 978-0-87140-840-2.\n\n\n== Further reading ==\nLove, B (1992). Encyclopedia of Unusual Sex Practices. Barricade Books. ISBN 978-0-942637-64-9."