"HandMade Films is  a British film production and distribution company. Notable films from the studio include Monty Python's Life of Brian, Time Bandits and Withnail and I.\n\n\n== History ==\nHandMade Films was formed by former Beatle George Harrison and business partner Denis O'Brien in 1978 to finance the Monty Python film Life of Brian. Harrison had first been introduced to  O'Brien by actor Peter Sellers in 1973. Soon after, the two went into business together.When the original financiers of Brian, EMI Films, pulled out of the project less than a week before filming was to commence, the creators had to find other financing. Harrison, a friend and fan of the Pythons, mortgaged his home in order to finance the feature. Eric Idle of the Pythons later called it \"the most anybody's ever paid for a cinema ticket in history\". Life of Brian grossed $21 million at the box office in the US.Harrison explained: \"The name of the company came about as a bit of a joke. I'd been to Wookey Hole in Somerset ... [near] an old paper mill where they show you how to make old underpants into paper. So I bought a few rolls, and they had this watermark 'British Handmade Paper' ... So we said ... we'll call it Handmade Films.\" The first film distributed by HandMade Films was The Long Good Friday (1980), and the first they produced was Time Bandits (1981), a co-scripted project by Monty Python's Terry Gilliam and Michael Palin. The film featured a new song by Harrison, \"Dream Away\", in the closing credits. Time Bandits became one of HandMade's most successful and acclaimed efforts; with a budget of $5 million, it earned $35 million in the US within ten weeks of its release.Harrison served as executive producer for 23 films with HandMade, including Mona Lisa, Shanghai Surprise and Withnail and I. He made several cameo appearances in these films, including a role as a nightclub singer in Shanghai Surprise, for which he recorded five new songs. According to Ian Inglis, Harrison's \"executive role in HandMade Films helped to sustain British cinema at a time of crisis, producing some of the country's most memorable movies of the 1980s.\"\n\n\n=== Financial problems ===\nFollowing a series of box office bombs in the late 1980s and excessive debt incurred by O'Brien, which was guaranteed by Harrison, HandMade's financial situation became precarious. The company ceased operations in 1991 and was sold three years later to Paragon Entertainment, a Canadian corporation. Afterwards, Harrison sued O'Brien for $25 million for fraud and negligence, resulting in an $11.6 million judgment in 1996.\n\n\n== Subsequent history ==\nIn 1994, the company was acquired by Paragon Entertainment Corporation of Toronto, Canada, which restarted production under the HandMade name in 1996-1997. The company's most notable release of that era was Lock, Stock and Two Smoking Barrels (1998). In 1999  Patrick Meehan and Cartier Investments acquired HandMade from Paragon.In June 1999, The Equator Group plc became the exclusive distributor and manager of the HandMade Films library, and attempted to purchase the company from Cartier outright, but negotiations were unsuccessful until a reverse takeover agreement with Hand Made Holdings Ltd announced on 15 May 2006. The Equator Group reincorporated as HandMade Plc on 8 June 2006 and the new company was traded on the Alternative Investment Market (AIM) stock exchange (changing its ticker symbol from EQG to HMF). Trading of HandMade plc shares was suspended several times, notably June to October 2009, after the company failed to provide  2008 audit results to shareholders.One 29 April 2010, Almorah Services Ltd tendered a takeover bid, priced at £0.01 per share in cash and HMF was delisted from the AIM on 29 June 2010. HandMade plc was re-registered as HandMade Limited, a private company, on 2 February 2011. Handmade Limited entered administration on 11 July 2012, liquidation on 24 April 2013, and was dissolved on 22 February 2018.In 2016, Park Circus purchased distribution rights to the HandMade film library.In 2017, following an investigation by the Insolvency Service, three HandMade Limited directors were disqualified from acting as a director of a company: Patrick Anthony Meehan for 13 years, David Bernard Ravden for five and a half years, and Peter William Parkinson for four years. The directors misused funds to \"pay off relatives\" and \"on matters undisclosed to advisers, shareholder or potential investors\".As of March 2019, the company remains dormant.\n\n\n== Filmography ==\n\n\n== References ==\n\n\n== External links ==\nOfficial website\nHandMade Films at IMDb\nHANDMADE LIMITED (03270629) company overview (1996-2018) at Companies House\n1988 Interview with George Harrison at Film Comment"