"Experimental literature is a genre that is, according to Professor Warren Motte of the University of Colorado in his essay Experimental Writing, Experimental Reading, \"difficult to define with any sort of precision.\"  He says the \"writing is often invoked in an \"offhand manner\" and the focus is on \"form rather than content.\" It can be in written form of prose narrative or poetry, but the text may be set on the page  in differing configurations than that of normal prose paragraphs or in the classical stanza form of verse.  It may also be entwined with images of a real or abstract nature, with the use of art or photography. Furthermore, while experimental literature was handwritten on paper or vellum, the  digital age has seen an exponential leaning to the use of digital computer technologies.\n\n\n== Early history ==\nThe first text generally cited in this category is Laurence Sterne's The Life and Opinions of Tristram Shandy, Gentleman (1759). This text occurs so early in the standard history of the novel that one can't refer to its \"breaking\" conventions that had yet to solidify. But in its mockery of narrative, and its willingness to use such graphic elements as an all-black page to mourn the death of a character, Sterne's novel is considered a fundamental text for many post-World War II authors. However, Sterne's work was not without detractors even in its time; for instance, Samuel Johnson is quoted in Boswell as saying \"The merely odd does not last. Tristram Shandy did not last.\" Denis Diderot's Jacques the Fatalist and His Master, drew many elements from Tristam Shandy, a fact not concealed in the text, making it an early example of metafiction.\n\n\n== 20th-century history ==\nIn the 1910s, artistic experimentation became a prominent force, and various European and American writers began experimenting with the given forms. Tendencies that formed during this period later became parts of the modernist movement. The Cantos of Ezra Pound, the post-World War I work of T. S. Eliot, prose and plays by Gertrude Stein, were some of the most influential works of the time, though James Joyce's Ulysses is generally considered the most important work of the time. The novel ultimately influenced not only more experimental writers, such as Virginia Woolf, but also less experimental writers, such as Hemingway.\nThe historical avant-garde movements also contributed to the development of experimental literature in the early and middle 20th century. In the Dadaist movement, poet Tristan Tzara employed newspaper clippings and experimental typography in his manifestoes. The futurist author F.T. Marinetti espoused a theory of \"words in freedom\" across the page, exploding the boundaries of both conventional narrative and the layout of the book itself as shown in his \"novel\" Zang Tumb Tumb. The writers, poets, and artists associated with the surrealist movement employed a range of unusual techniques to evoke mystical and dream-like states in their poems, novels, and prose works. Examples include the collaboratively written texts Les Champs Magnétiques (by André Breton and Philippe Soupault) and Sorrow for Sorrow, a \"dream novel\" produced under hypnosis by Robert Desnos.\nBy the end of the 1930s, the political situation in Europe had made Modernism appear to be an inadequate, aestheticized, even irresponsible response to the dangers of worldwide fascism, and literary experimentalism faded from public view for a period, kept alive through the 1940s only by isolated visionaries like Kenneth Patchen. In the 1950s, the Beat writers can be seen as a reaction against the hidebound quality of both the poetry and prose of its time, and such hovering, near-mystical works as Jack Kerouac's novel Visions of Gerard represented a new formal approach to the standard narrative of that era. American novelists such as John Hawkes started publishing novels in the late 1940s that played with the conventions of narrative.\nThe spirit of the European avant-gardes would be carried through the post-war generation as well. The poet Isidore Isou formed the Lettrist group, and produced manifestoes, poems, and films that explored the boundaries of the written and spoken word. The OULIPO (in French, Ouvroir de littérature potentielle, or \"Workshop of Potential Literature\") brought together writers, artists, and mathematicians to explore innovative, combinatoric means of producing texts. Founded by the author Raymond Queneau and mathematician François Le Lionnais, the group included Italo Calvino and Georges Perec. Queneau's Cent Mille Millards de Poèmes uses the physical book itself to proliferate different sonnet combinations, while Perec's novel Life: A User's Manual is based on the Knight's Tour on a chessboard.\nThe 1960s brought a brief return of the glory days of modernism, and a first grounding of Post-modernism. Publicity owing to an obscenity trial against William S. Burroughs' Naked Lunch brought a wide awareness of and admiration for an extreme and uncensored freedom. Burroughs also pioneered a style known as cut-up, where newspapers or typed manuscripts were cut up and rearranged to achieve lines in the text. In the late 1960s, experimental movements became so prominent that even authors considered more conventional such as Bernard Malamud and Norman Mailer exhibited experimental tendencies. Metafiction was an important tendency in this period, exemplified most elaborately in the works of John Barth, Jonathan Bayliss, and Jorge Luis Borges. In 1967 Barth wrote the essay The Literature of Exhaustion, which is sometimes considered a manifesto of postmodernism. A major touchstone of this era was Thomas Pynchon's Gravity's Rainbow, which eventually became a bestseller. Important authors in the short story form included Donald Barthelme, and, in both short and long forms, Robert Coover and Ronald Sukenick. While in 1968 William H. Gass's novel Willie Masters Lonesome Wife added challenging dimensions to reading as some of the pages are in mirror writing where the text can only be read if a mirror is held in an angle against the page.\nSome later well-known experimental writers of the 1970s and 1980s were Italo Calvino, Michael Ondaatje, and Julio Cortázar. Calvino's most famous books are If on a winter's night a traveler, where some chapters depict the reader preparing to read a book titled If on a winter's night a traveler while others form the narrative and Invisible Cities, where Marco Polo explains his travels to Kubla Khan although they are merely accounts of the very city in which they are chatting. Ondaatje's The Collected Works of Billy the Kid uses a scrapbook style to tell its story while Cortázar's Hopscotch can be read with the chapters in any order.\nArgentine Julio Cortázar and the naturalized Brazilian writer Clarice Lispector, both Latin American writers who have created masterpieces in experimental literature of 20th and 21st century, mixing dreamscapes, journalism, and fiction; regional classics written in Spanish include the Mexican novel \"Pedro Paramo\" by Juan Rulfo, the Colombian family epic \"One Hundred Years of Solitude\" by Gabriel Garcia Marquez, the Peruvian political history \"The War of the End of the World\" by Mario Vargas Llosa, the Puerto Rican Spanglish dramatic dialogue \"Yo-Yo Boing!\" by Giannina Braschi, and the Cuban revolutionary novel \"Paradise\" by Lezama Lima.Contemporary American authors David Foster Wallace, Giannina Braschi, and Rick Moody, combine some of the experimental form-play of the 1960s writers with a more emotionally deflating, irony, and a greater tendency towards accessibility and humor. Wallace's Infinite Jest is a maximalist work describing life at a tennis academy and a rehab facility; digressions often become plotlines, and the book ultimately features over 100 pages of footnotes. Other writers like Nicholson Baker were noted for their minimalism in novels such as The Mezzanine, about a man who rides an escalator for 140 pages. American author Mark Danielewski combined elements of a horror novel with formal academic writing and typographic experimentation in his novel House of Leaves.\nGreek author Dimitris Lyacos in Z213: Exit combines, in a kind of a modern-day palimpsest, the diary entries of two narrators in a heavily fragmented text, interspersed with excerpts from the biblical Exodus, to recount a journey along which the distinct realities of inner self and outside world gradually merge.\n\n\n== 21st-century history ==\nIn the early 21st century, many examples of experimental literature reflect the emergence of computers and other digital technologies, some of them actually using the medium on which they are reflecting. Such writing has been variously referred to electronic literature, hypertext, and codework. Others have focused on exploring the plurality of narrative point of views, like the Uruguayan American writer Jorge Majfud in La reina de América and La ciudad de la luna.\n\n\n== See also ==\n\n\n== References ==\n\n\n== Bibliography ==\nBäckström, Per. Vårt brokigas ochellericke! Om experimentell poesi (Our Gaudy Andornot!. On Experimental Poetry), Lund: Ellerström, 2010.\n\n\n== External links =="