"Nefazodone, sold formerly under the brand names Serzone, Dutonin, and Nefadar among others, is an atypical antidepressant which was first marketed by Bristol-Myers Squibb in 1994 but has since largely been discontinued. BMS withdrew it from the market by 2004 due to decreasing sales due to the rare incidence of severe liver damage and the onset of generic competition. The incidence of severe liver damage is approximately 1 in every 250,000 to 300,000 patient-years. Generic versions were introduced in 2003.Nefazodone is a phenylpiperazine compound and is related to trazodone. It has been described as a serotonin antagonist and reuptake inhibitor (SARI) due to its combined actions as a potent serotonin 5-HT2A receptor and 5-HT2C receptor antagonist and weak serotonin–norepinephrine–dopamine reuptake inhibitor (SNDRI).\n\n\n== Medical uses ==\nNefazodone is used to treat major depressive disorder, aggressive behavior, and panic disorder.\n\n\n=== Available forms ===\nNefazodone is available as 50 mg, 100 mg, 150 mg, 200 mg, and 250 mg tablets for oral ingestion.\n\n\n== Contraindications ==\n\n\n== Side effects ==\nNefazodone can cause severe liver damage, leading to a need for liver transplant, and death. The incidence of severe liver damage is approximately 1 in every 250,000 to 300,000 patient-years.Common and mild side effects of nefazodone reported in clinical trials more often than placebo include dry mouth (25%), sleepiness (25%), nausea (22%), dizziness (17%), blurred vision (16%), weakness (11%), lightheadedness (10%), confusion (7%), and orthostatic hypotension (5%). Rare and serious adverse reactions may include allergic reactions, fainting, painful/prolonged erection, and jaundice.Nefazodone is not especially associated with increased appetite and weight gain.\n\n\n== Interactions ==\nNefazodone is a potent inhibitor of CYP3A4, and may interact adversely with many commonly used medications that are metabolized by CYP3A4.\n\n\n== Pharmacology ==\n\n\n=== Pharmacodynamics ===\nNefazodone acts primarily as a potent antagonist of the serotonin 5-HT2A receptor and to a lesser extent of the serotonin 5-HT2C receptor. It also has high affinity for the α1-adrenergic receptor and serotonin 5-HT1A receptor, and relatively lower affinity for the α2-adrenergic receptor and dopamine D2 receptor. Nefazodone has low but significant affinity for the serotonin, norepinephrine, and dopamine transporters as well, and therefore acts as a weak serotonin-norepinephrine-dopamine reuptake inhibitor (SNDRI). It has low but potentially significant affinity for the histamine H1 receptor, where it is an antagonist, and hence may have some antihistamine activity. Nefazodone has negligible activity at muscarinic acetylcholine receptors, and accordingly, has no anticholinergic effects.\n\n\n=== Pharmacokinetics ===\nThe bioavailability of nefazodone is low and variable, about 20%. Its plasma protein binding is approximately 99%, but it is bound loosely.Nefazodone is metabolized in the liver, with the main enzyme involved thought to be CYP3A4. The drug has at least four active metabolites, which include hydroxynefazodone, para-hydroxynefazodone, triazoledione, and meta-chlorophenylpiperazine. Nefazodone has a short elimination half-life of about 2 to 4 hours. Its metabolite hydroxynefazodone similarly has an elimination half-life of about 1.5 to 4 hours, whereas the elimination half-lives of triazoledione and mCPP are longer at around 18 hours and 4 to 8 hours, respectively. Due to its long elimination half-life, triazole is the major metabolite and predominates in the circulation during nefazodone treatment, with plasma levels that are 4 to 10 times higher than those of nefazodone itself. Conversely, hydroxynefazodone levels are about 40% of those of nefazodone at steady state. Plasma levels of mCPP are very low at about 7% of those of nefazodone; hence, mCPP is only a minor metabolite. mCPP is thought to be formed from nefazodone specifically by CYP2D6.The ratios of brain-to-plasma concentrations of mCPP to nefazodone are 47:1 in mice and 10:1 in rats, suggesting that brain exposure to mCPP may be much higher than plasma exposure. Conversely, hydroxynefazodone levels in the brain are 10% of those in plasma in rats. As such, in spite of its relatively low plasma concentrations, brain exposure to mCPP may be substantial, whereas that of hydroxynefazodone may be minimal.\n\n\n== Chemistry ==\nNefazodone is a phenylpiperazine; it is an alpha-phenoxyl derivative of etoperidone which in turn was a derivative of trazodone.\n\n\n== History ==\nNefazodone was discovered by scientists at Bristol-Myers Squibb (BMS) who were seeking to improve on trazodone by reducing its sedating qualities.BMS obtained marketing approvals worldwide for nefazodone in 1994. It was marketed in the US under the brand name Serzone and in Europe under the brand name Dutonin.In 2002 the FDA obligated BMS to add a black box warning about potential fatal liver toxicity to the drug label. Worldwide sales in 2002 were $409 million.In 2003 Public Citizen filed a citizen petition asking the FDA to withdraw the marketing authorization in the US, and in early 2004 the organization sued the FDA to attempt to force withdrawal of the drug. The FDA issued a response to the petition in June 2004 and filed a motion to dismiss, and Public Citizen withdrew the suit.Generic versions were introduced in the US in 2003 and Health Canada withdrew the marketing authorization that year.Sales of nefazodone were about $100 million in 2003. By that time it was also being marketed under the additional brand names Serzonil, Nefadar, and Rulivan.In April 2004, BMS announced that it was going discontinue the sale of Serzone in the US in June 2004 and said that this was due to declining sales. By that time BMS had already withdrawn the drug from the market in Europe, Australia, New Zealand and Canada.As of 2012 generic nefazodone was available in the US.\n\n\n== Society and culture ==\n\n\n=== Generic names ===\nNefazodone is the generic name of the drug and its INN and BAN, while néfazodone is its DCF and nefazodone hydrochloride is its USAN and USP.\n\n\n=== Brand names ===\nNefazodone has been marketed under a number of brand names including Dutonin (AT, ES, IE, UK), Menfazona (ES), Nefadar (CH, DE, NO, SE), Nefazodone BMS (AT), Nefazodone Hydrochloride Teva (US), Reseril (IT), Rulivan (ES), and Serzone (AU, CA, US). As of 2017, it remains available only on a limited basis as Nefazodone Hydrochloride Teva in the United States.\n\n\n== Research ==\nThe use of nefazodone to prevent migraine has been studied, due to its antagonistic effects on the 5-HT2A and 5-HT2C receptors.\n\n\n== References =="