"A geode (derived from the Greek \"γεώδης\", meaning \"Earth-like\") is a geological secondary formation within sedimentary and volcanic rocks. Geodes are hollow, vaguely spherical rocks, in which masses of mineral matter (which may include crystals) are secluded. The crystals are formed by the filling of vesicles in volcanic and sub-volcanic rocks by minerals deposited from hydrothermal fluids; or by the dissolution of syn-genetic concretions and partial filling by the same, or other, minerals precipitated from water, groundwater or hydrothermal fluids.\n\n\n== Formation ==\nGeodes can form in any cavity, but the term is usually reserved for more or less rounded formations in igneous and sedimentary rocks. They can form in gas bubbles in igneous rocks, such as vesicles in basaltic lava; or, as in the American Midwest, in rounded cavities in sedimentary formations. After rock around the cavity hardens, dissolved silicates and/or carbonates are deposited on the inside surface. Over time, this slow feed of mineral constituents from groundwater or hydrothermal solutions allows crystals to form inside the hollow chamber. Bedrock containing geodes eventually weathers and decomposes, leaving them present at the surface if they are composed of resistant material such as quartz.When cut in half, visible bands corresponding to varied stages of precipitation may at times show patterns that reveal points of fluid entry into the cavity and/or varied colors corresponding to changes in chemistry.\n\n\n== Coloration ==\n\nGeode banding and coloration is the result of variable impurities. Iron oxides will impart rust hues to siliceous solutions, such as the commonly observed iron-stained quartz. Most geodes contain clear quartz crystals, while others have purple amethyst crystals. Still others can have agate, chalcedony, or jasper banding or crystals such as calcite, dolomite, celestite, etc. There is no easy way of telling what the inside of a geode holds until it is cut open or broken apart. However, geodes from a particular area are usually similar in appearance.\nGeodes and geode slices are sometimes dyed with artificial colors. Samples of geodes with unusual colors or highly unlikely formations have usually been synthetically altered.\n\n\n== Prevalence ==\n\nGeodes are common in some formations in the United States (mainly in Indiana, Iowa, Missouri, western Illinois, Kentucky, and Utah). They also are common in Brazil, Namibia, and Mexico. Geodes are also abundant in the Mendip Hills in Somerset, England, where they are known locally as \"potato stones\".\n\n\n== Vugs and crystal caves ==\nIn 2000, a team of geologists discovered a cave filled with giant gypsum crystals in an abandoned silver mine near Almería, Spain. The cavity, which measured 8 by 1.8 by 1.7 metres (26.2 ft × 5.9 ft × 5.6 ft), at the time, being the largest crystal cave ever found. Following its discovery, the entrance to the cave was blocked by five tons of rock, with an additional police presence to prevent looters. Near the end of the summer of 2019 the cave was opened as a tourist attraction, allowing small groups (max 12 people) to visit the caves with a tour guide. According to geological models, the cave was formed during the Messinian salinity crisis 6 million years ago, when the Mediterranean sea evaporated and left thick layers of salt sediment.\nThe world's largest known crystal cave, or vug, is Crystal Cave, a celestine geode 35 feet (11 m) in diameter at its widest point, located near the village of Put-in-Bay, Ohio, on South Bass Island in Lake Erie.\n\n\n== See also ==\n\nBristol Diamonds\nCave of the Crystals\nCoso artifact\nLithophysa\nSeptarian nodule\nThunderegg\n\n\n== References ==\n\n\n== Further reading ==\nPough, Fredrick H. Rocks and Minerals, ISBN 0-395-91096-X\nMiddleton, Gerard V. (2003). Encyclopedia of Sediments and Sedimentary Rocks. Springer, ISBN 978-1-4020-0872-6, p. 221 (restricted online copy, p. 221, at Google Books)\nKeller, Walter David (1961). The Common Rocks and Minerals of Missouri. University of Missouri Press, ISBN 978-0-8262-0585-8, S. 67 (restricted online copy, p. 67, at Google Books)\nWitzke, Brian J. Geodes: A Look at Iowa's State Rock. Iowa Geological Survey\nGeodes Kentucky Geological Survey (University of Kentucky)\n\n\n== External links ==\nIndiana geode specimens, facts and stories\nVideo of a geode cracking using industrial soil pipe cutter\nAustralian Museum Fact sheet\nUtah Geode Beds\nIllinois State Geological Survey. \"Geodes—Small Treasure Vaults in Illinois\" (PDF). Archived from the original (PDF) on 2007-09-27."