"Adhocracy is a flexible, adaptable and informal form of organization that is defined by a lack of formal structure that employs specialized multidisciplinary teams grouped by functions. It operates in an opposite fashion to a bureaucracy. The term was coined by Warren Bennis in his 1968 book The Temporary Society, later popularized in 1970 by Alvin Toffler in Future Shock, and has since become often used in the theory of management of organizations (particularly online organizations). The concept has been further developed by academics such as Henry Mintzberg.\nAdhocracy is characterized by an adaptive, creative and flexible integrative behavior based on non-permanence and spontaneity. It is believed that these characteristics allow adhocracy to respond faster than traditional bureaucratic organizations while being more open to new ideas.\n\n\n== Overview ==\nRobert H. Waterman, Jr. defined adhocracy as \"any form of organization that cuts across normal bureaucratic lines to capture opportunities, solve problems, and get results\". For Henry Mintzberg, an adhocracy is a complex and dynamic organizational form.  It is different from bureaucracy; like Toffler, Mintzberg considers bureaucracy a thing of the past, and adhocracy one of the future. When done well, adhocracy can be very good at problem solving and innovations and thrives in a diverse environment. It requires sophisticated and often automated technical systems to develop and thrive.\n\n\n== Characteristics ==\nSome characteristics of Mintzberg's definition include:\n\nhighly organic structure\nlittle formalization of behavior\njob specialization not necessarily based on formal training\na tendency to group the specialists in functional units for housekeeping purposes but to deploy them in small, market-based project teams to do their work\na reliance on liaison devices to encourage mutual adjustment within and between these teams\nlow or no standardization of procedures\nroles not clearly defined\nselective decentralization\nwork organization rests on specialized teams\npower-shifts to specialized teams\nhorizontal job specialization\nhigh cost of communication\nculture based on non-bureaucratic workAll members of an organization have the authority within their areas of specialization, and in coordination with other members, to make decisions and to take actions affecting the future of the organization. There is an absence of hierarchy.\nAccording to  Robert H. Waterman, Jr., \"Teams should be big enough to represent all parts of the bureaucracy that will be affected by their work, yet small enough to get the job done efficiently.\"\n\n\n== Types ==\nadministrative – \"feature an autonomous operating core; usually in an institutionalized bureaucracy like a government department or standing agency\"\noperational – solves problems on behalf of its clientsAlvin Toffler claimed in his book Future Shock that adhocracies will get more common and are likely to replace bureaucracy. He also wrote that they will most often come in form of a temporary structure, formed to resolve a given problem and dissolved afterwards.\nAn example are cross-department task forces.\n\n\n== Issues ==\nDownsides of adhocracies can include \"half-baked actions\", personnel problems stemming from organization's temporary nature, extremism in suggested or undertaken actions, and threats to democracy and legality rising from adhocracy's often low-key profile. To address those problems, researchers in adhocracy suggest a model merging adhocracy and bureaucracy, the bureau-adhocracy.\n\n\n== Etymology ==\nThe word is a portmanteau of the Latin ad hoc, meaning \"for the purpose\", and the suffix -cracy, from the ancient Greek kratein (κρατεῖν), meaning \"to govern\", and is thus a heteroclite.\n\n\n== Use in fiction ==\nThe term is also used to describe the form of government used in the science fiction novels Voyage from Yesteryear by James P. Hogan and Down and Out in the Magic Kingdom, by Cory Doctorow.\nIn the radio play Das Unternehmen Der Wega (The Mission of the Vega) by Friedrich Dürrenmatt, the human inhabitants of Venus, all banished there from various regions of Earth for civil and political offenses, form and live under a peaceful adhocracy, to the frustration of delegates from an Earth faction who hope to gain their cooperation in a war brewing on Earth.\nIn the Metrozone series of novels by Simon Morden, The novel The Curve of the Earth features \"ad-hoc\" meetings conducted virtually, by which all decisions governing the Freezone collective are taken. The ad-hocs are administered by an artificial intelligence and polled from suitably qualified individuals who are judged by the AI to have sufficient experience. Failure to arrive at a decision results in the polling of a new ad-hoc, whose members are not told of previous ad-hocs before hearing the decision which must be made.The asura in the fictional world of Tyria within the Guild Wars universe present this form of government, although the term is only used in out-of-game lore writings.\n\n\n== See also ==\nAnarchy\nBureaucracy (considered the opposite of adhocracy)\nCrowdsourcing\nCommons-based peer production\nFree association\nHere Comes Everybody\nJugaad – Indian term describing a creative hack or kludge\nLibertarianism\nSelf-management\nSocial peer-to-peer processes\nSocialism\nSociocracy\nSpontaneous order\nWorkplace democracy\nThe Tyranny of Structurelessness\n\n\n== References ==\n\n\n== Sources =="