"Azaleas  are flowering  shrubs in the genus Rhododendron, particularly the former  sections Tsutsuji (evergreen) and Pentanthera (deciduous). Azaleas bloom in the spring (May and June in the temperate Northern Hemisphere, and December and January in the Southern Hemisphere), their flowers often lasting several weeks. Shade tolerant, they prefer living near or under trees. They are part of the family Ericaceae.\n\n\n== Cultivation ==\n\nPlant enthusiasts have selectively bred azaleas for hundreds of years. This human selection has produced over 10,000 different cultivars which are propagated by cuttings. Azalea seeds can also be collected and germinated.\nAzaleas are generally slow-growing and do best in well-drained acidic soil (4.5–6.0 pH). Fertilizer needs are low. Some species need regular pruning.\nAzaleas are native to several continents including Asia, Europe and North America. They are planted abundantly as ornamentals in the southeastern US, southern Asia, and parts of southwest Europe.\n\nAccording to azalea historian Fred Galle, in the United States, Azalea indica (in this case, the group of plants called Southern indicas) was first introduced to the outdoor landscape in the 1830s at the rice plantation Magnolia-on-the-Ashley in Charleston, South Carolina. From Philadelphia, where they were grown only in greenhouses, John Grimke Drayton (Magnolia's owner) imported the plants for use in his estate garden. With encouragement from Charles Sprague Sargent from Harvard's Arnold Arboretum, Magnolia Gardens was opened to the public in 1871, following the American Civil War. Magnolia is one of the oldest public gardens in America. Since the late 19th century, in late March and early April, thousands visit to see the azaleas bloom in their full glory.\n\n\n== Classification ==\n\n\n=== Native American azaleas ===\n\n\n== Disease ==\n\nAzalea leafy gall can be particularly destructive to azalea leaves during the early spring. Hand picking infected leaves is the recommended method of control.They can also be subject to phytophthora root rot in moist, hot conditions.\n\n\n== Cultural significance and symbolism ==\n\nIn Chinese culture, the azalea is known as \"thinking of home bush\" (sixiang shu), and is immortalized in the poetry of Du Fu.\nThe azalea is also one of the symbols of the city of São Paulo, Brazil.Azaleas and rhododendrons were once so infamous for their toxicity that to receive a bouquet of their flowers in a black vase was a well-known death threat.\n\n\n== Toxicity ==\nIn addition to being renowned for its beauty, the azalea is also highly toxic—it contains andromedotoxins in both its leaves and nectar, including honey from the nectar. Bees are deliberately fed on Azalea/Rhododendron nectar in some parts of Turkey, producing a mind-altering, potentially medicinal, and occasionally lethal honey known as \"mad honey\".\n\n\n== Azalea festivals ==\n\n\n=== Japan ===\nMotoyama, Kōchi also has a flower festival in which the blooming of Tsutsuji is celebrated and Tatebayashi, Gunma is famous for its Azalea Hill Park, Tsutsuji-ga-oka. \nNezu Shrine in Bunkyo, Tokyo, holds a Tsutsuji Matsuri from early April until early May.\nHigashi Village has hosted an azalea festival each year since 1976.  The village's 50,000 azalea plants draw an estimated 60,000 to 80,000 visitors each year.\n\n\n=== Korea ===\n\nSobaeksan, one of the 12 well-known Sobaek Mountains, lying on the border between Chungbuk Province and Gyeongbuk has a royal azalea (Rhododendron schlippenbachii) festival held on May every year. Sobaeksan has an azalea colony dotted around Biro mountaintop, Gukmang and Yonwha early in May. When royal azaleas have turned pink in the end of May, it looks like Sobaeksan wears a pink Jeogori (Korean traditional jacket).\n\n\n=== Hong Kong ===\nThe Ma On Shan Azalea Festival is held in Ma On Shan, where six native species (Rhododendron championae, Rhododendron farrerae, Rhododendron hongkongense, Rhododendron moulmainense, Rhododendron simiarum and Rhododendron simsii ) are found in the area. The festival has been held since 2034; it includes activities such as exhibitions, photo contests and carnivals.\n\n\n=== United States ===\n\nMany cities in the United States have festivals in the spring celebrating the blooms of the azalea, including Summerville, South Carolina; Hamilton, NJ; Mobile, Alabama; Jasper, Texas; Tyler, Texas; Norfolk, Virginia; Wilmington, North Carolina (North Carolina Azalea Festival); Valdosta, Georgia; Palatka, Florida (Florida Azalea Festival); Pickens, South Carolina; Muskogee, Oklahoma; Brookings, Oregon; and Nixa, Missouri.\nThe Azalea Trail is a designated path, planted with azaleas in private gardens, through Mobile, Alabama. The Azalea Trail Run is an annual road running event held there in late March. Mobile, Alabama is also home to the Azalea Trail Maids, fifty women chosen to serve as ambassadors of the city while wearing antebellum dresses, who originally participated in a three-day festival, but now operate throughout the year.The Azalea Society of America designated Houston, Texas, an \"azalea city\". The River Oaks Garden Club has conducted the Houston Azalea Trail every spring since 1935.Valdosta, Georgia is called the Azalea City, as the plant grows in profusion there. The city hosts an annual Azalea Festival in March.\n\n\n== See also ==\nList of Award of Garden Merit rhododendrons\nList of plants poisonous to equines\n\n\n== References ==\n\n\n== External links ==\n\"Azalea\" . Encyclopædia Britannica (11th ed.). 1911.\nAzalea Society of America\nAmerican Rhododendron Society: What is an Azalea?\nAzalea Collection of the U.S. National Arboretum\nAzalea Collection of Botany garten Pruhonice CZ"