"Culture jamming (sometimes guerrilla communication) is a protest used by many anti-consumerist social movements to disrupt or subvert media culture and its mainstream cultural institutions, including corporate advertising. It attempts to \"expose the methods of domination\" of a mass society.Culture jamming is a form of subvertising. Many culture jams are intended to expose questionable political assumptions behind commercial culture. Culture jamming makes use of the technique détournement, which uses the language and rhetoric of the mainstream paradigm or culture to subversively critique that paradigm or culture. Tactics include editing logos to critique the company, product or concept they represent, or wearing fashion statements that criticize the current fashion trends by deliberately clashing with them.  Culture jamming often entails using mass media to produce ironic or satirical commentary about itself, commonly using the original medium's communication method.\nCulture jamming is a reaction against social conformity. Prominent examples of culture jamming include the adulteration of billboard advertising by the Billboard Liberation Front and contemporary artists such as Ron English. Culture jamming may involve street parties and protests. While culture jamming usually focuses on subverting or critiquing political and advertising messages, some proponents focus on a different form which brings together artists, designers, scholars, and activists to create works that transcend the status quo rather than merely criticize it.\n\n\n== Origins of the term, etymology, and history ==\n\n\n=== 1984 coinage ===\nThe term was coined in 1984 by Don Joyce of the sound collage band Negativland, with the release of their album JamCon '84. The phrase \"culture jamming\" comes from the idea of radio jamming: that public frequencies can be pirated and subverted for independent communication, or to disrupt dominant frequencies. In one of the tracks of the album, they stated:\nAs awareness of how the media environment we occupy affects and directs our inner life grows, some resist. The skillfully reworked billboard... directs the public viewer to a consideration of the original corporate strategy. The studio for the cultural jammer is the world at large.\n\n\n=== Origins and preceding influences ===\nAccording to Vince Carducci, although the term was coined by Negativland, culture jamming can be traced as far back as the 1950s. One particularly influential group that was active in Europe was the Situationist International and was led by Guy Debord. The SI asserted that in the past humans dealt with life and the consumer market directly. They argued that this spontaneous way of life was slowly deteriorating as a direct result of the new \"modern\" way of life. Situationists saw everything from television to radio as a threat and argued that life in industrialized areas, driven by capitalist forces, had become monotonous, sterile, gloomy, linear, and productivity-driven. In particular, the SI argued humans had become passive recipients of the spectacle, a simulated reality that generates the desire to consume, and positions humans as obedient consumerist cogs within the efficient and exploitative productivity loop of capitalism. Through playful activity, individuals could create situations, the opposite of spectacles.  For the SI, these situations took the form of the dérive, or the active drift of the body through space in ways that broke routine and overcame boundaries, creating situations by exiting habit and entering new interactive possibilities.The cultural critic Mark Dery traces the origins of culture jamming to medieval carnival, which Mikhail Bakhtin interpreted, in Rabelais and his World, as an officially sanctioned subversion of the social hierarchy. Modern precursors might include: the media-savvy agit-prop of the anti-Nazi photomonteur John Heartfield, the sociopolitical street theater and staged media events of 1960s radicals such as Abbie Hoffman, Joey Skaggs, the German concept of Spaßguerilla, and in the Situationist International (SI) of the 1950s and 1960s. The SI first compared its own activities to radio jamming in 1968, when it proposed the use of guerrilla communication within mass media to sow confusion within the dominant culture. In 1985, the Guerrilla Girls formed to expose discrimination and corruption in the art world.Mark Dery's New York Times article on culture jamming, \"The Merry Pranksters And the Art of the Hoax\" was the first mention, in the mainstream media, of the phenomenon; Dery later expanded on this article in his 1993 Open Magazine pamphlet, Culture Jamming: Hacking, Slashing, and Sniping in the Empire of the Signs, a seminal essay that remains the most exhaustive historical, sociopolitical, and philosophical theorization of culture jamming to date. Adbusters, a Canadian publication espousing an environmentalist critique of consumerism and advertising, began promoting aspects of culture jamming after Dery introduced founder and editor Kalle Lasn to the term through a series of articles he wrote for the magazine. In her critique of consumerism, No Logo, the Canadian cultural commentator and political activist Naomi Klein examines culture jamming in a chapter that focuses on the work of Jorge Rodriguez-Gerada. Through an analysis of the Where the Hell is Matt viral videos, researchers Milstein and Pulos analyze how the power of the culture jam to disrupt the status quo is currently being threatened by increasing commercial incorporation. For example, T-Mobile utilized the Liverpool street underground station to host a flashmob to sell their mobile services.\n\n\n== Tactics ==\n\nCulture jamming is a form of disruption that plays on the emotions of viewers and bystanders. Jammers want to disrupt the unconscious thought process that takes place when most consumers view a popular advertising and bring about a détournement. Activists that utilize this tactic are counting on their meme to pull on the emotional strings of people and evoke some type of reaction. The reactions that most cultural jammers are hoping to evoke are behavioral change and political action. There are four emotions that activists often want viewers to feel. These emotions – shock, shame, fear, and anger – are believed to be the catalysts for social change.The basic unit in which a message is transmitted in culture jamming is the meme. Memes are condensed images that stimulate visual, verbal, musical, or behavioral associations that people can easily imitate and transmit to others. The term meme was coined and first popularized by geneticist Richard Dawkins, but later used by cultural critics such as Douglas Rushkoff, who claimed memes were a type of media virus. Memes are seen as genes that can jump from outlet to outlet and replicate themselves or mutate upon transmission just like a virus.Culture jammers will often use common symbols such as the McDonald's golden arches or Nike swoosh to engage people and force them to think about their eating habits or fashion sense. In one example, jammer Jonah Peretti used the Nike symbol to stir debate on sweatshop child labor and consumer freedom. Peretti made public exchanges between himself and Nike over a disagreement. Peretti had requested custom Nikes with the word \"sweatshop\" placed in the Nike symbol. Nike refused. Once this story was made public, it spread worldwide and contributed to the already robust conversation and dialogue about Nike's use of sweatshops, which had been ongoing for a decade prior to Peretti's 2001 stunt.\nJammers can also organize and participate in mass campaigns. Examples of cultural jamming like Perretti's are more along the lines of tactics that radical consumer social movements would use. These movements push people to question the taken-for-granted assumption that consuming is natural and good and aims to disrupt the naturalization of consumer culture; they also seek to create systems of production and consumption that are more humane and less dominated by global corporate late capitalism.Past mass events and ideas have included Buy Nothing Day, virtual sit-ins and protests over the Internet, producing ‘subvertisements' and placing them in public spaces, and creating and enacting ‘placejamming' projects where public spaces are reclaimed and nature is re-introduced into urban places.The most effective form of jamming is to use an already widely recognizable meme to transmit the message. Once viewers are forced to take a second look at the mimicked popular meme they are forced out of their comfort zone. Viewers are presented with another way to view the meme and are forced to think about the implications presented by the jammer. More often than not, when this is used as a tactic the jammer is going for shock value. For example, to make consumers aware of the negative body image that big-name fashion brands are frequently accused of causing, a subvertisement of Calvin Klein's 'Obsession' was created and played worldwide. It depicted a young woman with an eating disorder throwing up into a toilet.Another way that social consumer movements hope to utilize culture jamming effectively is by employing a metameme. A metameme is a two-level message that punctures a specific commercial image but does so in a way that challenges some larger aspect of the political culture of corporate domination. An example would be the \"true cost\" campaign set in motion by Adbusters. \"True cost\" forced consumers to compare the human labor cost and conditions and environmental drawbacks of products to the sales costs. Another example would be the \"Truth\" campaigns that exposed the deception tobacco companies used to sell their products.\nFollowing critical scholars like Paulo Freire, Culture jams are also being integrated into the university classroom \"setting in which students and teachers gain the opportunity not only to learn methods of informed public critique but also to collaboratively use participatory communication techniques to actively create new locations of meaning.\" For example, students disrupt public space to bring attention to community concerns or utilize subvertisements to engage with media literacy projects.\n\n\n=== Examples ===\n\nArtivist\nBillboard hacking\nBroadcast signal intrusion\nFlash mob\nHappening\nPractical joke topics\nSteal This BookGroupsGuerrilla Girls\nThe Yes Men\nBillboard Liberation Front\nCrimethinc\nMerry Pranksters\nOperation Mindfuck\nBillboard Utilising Graffitists Against Unhealthy Promotions\nmonochrom\n\n\n== Criticism ==\nCulture jamming is sometimes viewed as artistic appropriation or a form of vandalism. The intent of those participating in culture jamming sometimes differs from that of people whose intent is either artistic or merely destructive. While there are some clear differences, such as culture jamming usually being political while vandalism tends to aim for destruction, the lines are not always clear-cut; some activities, notably street art, may be deemed culture jamming, artistic appropriation, vandalism, or even all three.\nSome scholars and activists, such as Amory Starr and Joseph D. Rumbo, argue that culture jamming is easily co-opted and commodified by the market, which tends to \"defuse\" its potential for consumer resistance.Others claim that the culture jamming strategy of rhetorical sabotage, as used by Adbusters, can be incorporated and appropriated by clever advertising agencies, and thus is not a very powerful means of social change.Some practitioners have called for moving beyond the current sense of \"jamming\" to a newer understanding of the term that would encourage artists, scholars and activists to come together and create innovative, flexible, and practical mobile art pieces that communicate intellectual and political concepts and new strategies and actions.\n\n\n== See also ==\nAnti-corporate activism\nBanksy\nBrandalism\nCounterculture\nCritical theory\nDoppelgänger brand image\nMinority influence\nProtest art\nSubvertising\nTactical media\nThe Firesign Theatre\n\n\n== Notes ==\n\n\n== References ==\nBranwyn, Gareth (1996). Jamming the Media: A Citizen's Guide - Reclaiming the Tools of Communication. California: Chronicle Books ISBN 9780811817950\nDery, Mark (1993). Culture Jamming: Hacking, Slashing, and Sniping in the Empire of Signs. Open Magazine Pamphlet Series: NJ.\"Shovelware\". Markdery.com. Archived from the original on 2009-04-22. Retrieved 2009-07-23. ASIN B0006P19L8\nKing, Donovan (2004). University of Calgary. Optative Theatre: A Critical Theory for Challenging Oppression and Spectacle\nKlein, Naomi (2000). No Logo London: Flamingo. ISBN 9780312421434\nKyoto Journal: Culture Jammer's Guide to Enlightenment\nLasn, Kalle (1999) Culture Jam. New York: Eagle Brook. ISBN 978-0688178055\nLeVine, Mark (2005) Why They Don't Hate Us: Lifting the Veil on the Axis of Evil. Oxford, UK: Oneworld Publications. ISBN 978-1851683659\nLeVine, Mark (2017) \"Putting the 'Jamming' into Culture Jamming: Theory, Praxis and Cultural Production During the Arab Spring,\" in DeLaure, Marilyn; Fink, Moritz; eds. (2017). Culture Jamming: Activism and the Art of Cultural Resistance. New York University Press. ISBN 978-1-4798-0620-1\nPerini, Julie (2010). \"Art as Intervention: A Guide to Today's Radical Art Practices\".  In Team Colors Collective (ed.). Uses of a Whirlwind: Movement, Movements, and Contemporary Radical Currents in the United States. AK Press. ISBN 9781849350167.\nTietchen, T. Language out of Language: Excavating the Roots of Culture Jamming and Postmodern Activism from William S. Burroughs' Nova Trilogy Discourse: Berkeley Journal for Theoretical Studies in Media and Culture. 23, Part 3 (2001): 107–130. ISSN 1536-1810\n\"Culture Jamming\". helterskelter.in. 2 August 2010.\nMilstein, Tema & Pulos, Alexis (2015). \"Culture Jam Pedagogy and Practice: Relocating Culture by Staying on One's Toes\". Communication, Culture & Critique 8 (3): 393–413.\n\n\n== Further reading ==\nMcIntyre, I.; Hansen, A. (2013). How to Make Trouble and Influence People: Pranks, Protests, Graffiti & Political Mischief-Making from Across Australia. PM Press. ISBN 978-1-60486-880-7.\nDeLaure, Marilyn; Fink, Moritz; eds. (2017). Culture Jamming: Activism and the Art of Cultural Resistance. New York University Press. ISBN 978-1-4798-0620-1\n\n\n== External links ==\nCulture Jamming page from the Center for Communication and Civic Engagement"