"Maverick Hunter was the codename for a cancelled first-person shooter video game in the Mega Man franchise that would have been developed by Armature Studio and published by Capcom. It was intended to be a darker entry in the Mega Man X series. Mega Man artist and producer Keiji Inafune was responsible for establishing the western-designed game and Adi Granov was responsible for X's new design. It was intended to be the first of a trilogy of games, where players controlled its protagonist X in the first two games and then as Zero for the third. The game would have had similar platform elements found in earlier Mega Man X titles.\nIt had a lifespan of about six months in 2010 before it was ultimately cancelled, due to internal disagreements around the same time Inafune departed from Capcom, during which other Mega Man titles were also scrapped.\n\n\n== Concept and development ==\n\nMaverick Hunter was in development by Armature Studio and was to be published by Capcom for the Mega Man X series. The collaboration was established by Keiji Inafune, who had previously worked on the Mega Man series as an artist and producer. He had since rose in the ranks at Capcom to become a producer. The goal was to attract a new audience to the Mega Man series. Its development would have been overseen by former Capcom producer Ben Judd. The redesign for the Mega Man character was to be done by Adi Granov (the concept artist responsible for the Iron Man redesign found in the 2008 film of the same name). An initial concept design showed X with a red glowing 'X' on his face.Unlike other Mega Man X titles, Maverick Hunter was a first-person shooter. The genre was chosen in response to the rising interest in first-person shooter games in the west. The gameplay would have adhered to core Mega Man X concepts; the ability to take and utilize the powers of enemies, his dash, and his X-Buster were all to be redesigned. His weapon designs were made to be more realistic than earlier Mega Man X titles. Instead of his arm transforming into a cannon, his armor transforms to create a gun. Additionally, his charged attack would launch a missile instead of launching a larger energy blast. Melee attacks would cause the game to switch to a third-person perspective for the attack. X's ability to steal abilities from others would have been expanded to allow the combination of abilities and the use of temporary weapons, such as bombs or tank turrets, from fallen enemies. The stolen abilities could also be used to exploit weaknesses in certain enemies. Platform elements such as his wall jump from the Mega Man X games would have been \"re-imagined in new ways.\" The game was also planned to have branching paths and upgrades to find throughout.Maverick Hunter was going to build upon the mythology and feature characters from the original Mega Man X titles. Capcom Japan was responsible for the design of key story points and twists while the overall plot would be handled by Armature Studio. A source familiar with the game stated that the game would \"be like taking an 8-bit game that doesn't have a very deep story to it, and then building around it and keeping some of the key pieces intact.\" Both Mega Man X and Zero would be featured alongside a new human sidekick who is a \"Bruce Willis-like police officer.\" The inclusion of the human sidekick was part of the game's \"man versus machine contrast.\" It was to be the first of a trilogy of games; players would control X in the first two games while they would switch to Zero in the third game, who must destroy X (who had become \"incredibly powerful and infinitely intelligent over the course of two games\").\n\n\n=== Cancellation ===\nIt was ultimately cancelled before it was revealed to the public as one of several recent cancellations in the Mega Man series (including Mega Man Legends 3, Mega Man Universe, and Mega Man Online). Its lifespan lasted for about six months in 2010, and was prototyped and playable. Despite positive internal reception, Capcom deemed it a \"significant gamble\" and cancelled it. Its cancellation coincided with Inafune's departure from Capcom. The playable version of the game was intended to be a proof of concept more so than a real game. Capcom senior vice president Christian Svensson noted that the game was the subject of \"very polarized opinions internally.\" Granov expressed disappointment over the cancellation and stated that he was \"very happy\" with his design work. Inafune collaborated again with Armature on the 2016 game ReCore.\n\n\n== Reception ==\nThe response from critics and fans alike has been mixed. Despite the mixed fan reaction, a fan-led Facebook group and Change.org petition intended to revive the project was created called \"Operation Maverick Hunter\". Michael McWhertor and Wes Fenlon felt that - with the information available - the game seemed like a \"formula for success.\" They compared the direction to that of Metroid Prime by developer Retro Studios (which Armature Studio spun off from). Thomas Whitehead was also positive about it; he stated that it could have been a \"bold, exciting new direction for the franchise.\"Joystiq's JC Fletcher noted that while Mega Man X didn't need a \"gritty\" reboot, it is a better alternative than to have no Mega Man games. Tony Ponce compared the redesign of X to that of Bomberman in Bomberman: Act Zero. He also stated that it was a Mega Man X game \"in the very loosest sense.\" He felt that the cancellation was for the best and that a \"cold, gritty first-person shooter\" was not the ideal direction for the series. He compared it to Metroid Prime's design by noting that the art style did not change much while X's redesign was \"virtually unrecognizable.\" He later commented that an early concept design by Adi Granov was \"not that bad\" if it had no relation to the Mega Man X series. Chris Carter felt that while he didn't think the series needed a \"gritty reboot\", he would have enjoyed it if it was good. Clint Mize wrote an article for MTV.com's gaming section detailing why Maverick Hunter was a terrible idea. He felt that it could have turned off \"core fans\" of the Mega Man X series and that X required a \"solid core title to reintroduce the character\" rather than a \"dark reimagining\". He added that the decision to make it a first-person shooter made it feel like it was the product of an \"out of touch executive\". He also criticized it due to the risk involved in competing with big FPS games such as Call of Duty, Halo, and Battlefield. He noted that the perspective introduces other problems, such as reduced emphasis on platform segments. Its art design and gameplay have been compared to the video game Vanquish.\n\n\n== References =="