"Grenada ( (listen) grə-NAY-də; Grenadian Creole French: Gwenad) is an island country in the West Indies in the Caribbean Sea at the southern end of the Grenadines island chain. Grenada consists of the island of Grenada itself, two smaller islands, Carriacou and Petite Martinique, and several small islands which lie to the north of the main island and are a part of the Grenadines. It is located northwest of Trinidad and Tobago, northeast of Venezuela and southwest of Saint Vincent and the Grenadines. Its size is 348.5 square kilometres (134.6 sq mi), and it had an estimated population of 112,523 in July 2020. Its capital is St. George's. Grenada is also known as the \"Island of Spice\" due to its production of nutmeg and mace crops.\nBefore the arrival of Europeans in the Americas, Grenada was inhabited by the indigenous Arawaks and later by the Island Caribs. Christopher Columbus sighted Grenada in 1498 during his third voyage to the Americas.  Following several unsuccessful attempts by Europeans to colonise the island due to resistance from the Island Caribs, French settlement and colonisation began in 1650 and continued for the next century. On 10 February 1763, Grenada was ceded to the British under the Treaty of Paris. British rule continued until 1974 (except for a period of French rule between 1779 and 1783). From 1958 to 1962 Grenada was part of the Federation of the West Indies, a short-lived federation of British West Indian colonies. On 3 March 1967, it was granted full autonomy over its internal affairs as an associated state.\nIndependence was granted on 7 February 1974 under the leadership of Eric Gairy, who became the first Prime Minister of Grenada of the sovereign state. The new country became a member of the Commonwealth, with Queen Elizabeth as Head of State. In March 1979, the Marxist–Leninist New Jewel Movement overthrew Gairy's government in a bloodless coup d'état and established the People's Revolutionary Government (PRG), headed by Maurice Bishop as Prime Minister. Bishop was later arrested and executed by members of the People's Revolutionary Army, prompting a U.S.-led invasion in October 1983. Since then, the island has remained politically stable without any further seizures of power."