"The snare drum or side drum is a percussion instrument that produces a sharp staccato sound when the head is struck with a drum stick, due to the use of a series of stiff wires held under tension against the lower skin. Snare drums are often used in orchestras, concert bands, marching bands, parades, drumlines, drum corps, and more. It is one of the central pieces in a drum set, a collection of percussion instruments designed to be played by a seated drummer and used in many genres of music.\nSnare drums are usually played with drum sticks, but other beaters such as the brush or the rute can be used to achieve different tones. The snare drum is a versatile and expressive percussion instrument due to its sensitivity and responsiveness. The sensitivity of the snare drum allows it to respond audibly to the softest strokes, even with a wire brush; as well, it can be used for complex rhythmic patterns and engaging solos at moderate volumes. Its high dynamic range allows the player to produce powerful accents with vigorous strokes and a thundering crack (120+ dB) when rimshot strokes are used.\nThe snare drum originates from the tabor, a drum first used to accompany the flute. The tabor evolved into more modern versions, such as the kit snare, marching snare, tarol snare, and piccolo snare. Each type presents a different style of percussion and size. The snare drum that one might see in a popular music concert is usually used in a backbeat style to create rhythm. In marching bands, it can do the same but is used mostly for a front beat. In comparison with the marching snare, the kit snare is generally smaller in length, while the piccolo is the smallest of the three. The snare drum is easily recognizable by its loud cracking sound when struck firmly with a drumstick or mallet. The depth of the sound varies from snare to snare because of the different techniques and construction qualities of the drum. Some of these qualities are head material and tension, dimensions, and rim and drum shell materials and construction.\nThe snare drum is constructed of two heads—both usually made of Mylar plastic in modern drums but historically made from calf or goat skin—along with a rattle of metal, plastic, nylon, or gut wires on the bottom head called the snares. The wires can also be placed on the top, as in the tarol snare, or both heads as in the case of the Highland snare drum. The top head is typically called the batter head because that is where the drummer strikes it, while the bottom head is called the snare head because that is where the snares are located. The tension of each head is held constant by tension rods or ropes. Tension rod adjustment allows the pitch and tonal character of the drum to be customized by the player. The strainer is a lever that engages or disengages contact between the snares and the head, and allows snare tension adjustment. If the strainer is disengaged, the sound of the drum resembles a tom because the snares are inactive. The rim is the metal or wooden ring around the batter head that holds the head onto the drum and provides tension to the head, which can be used for a variety of things, although it is notably used to sound a piercing rimshot with the drumstick when the head and rim are struck together with a single stick."