"Aeolis (; Ancient Greek: Αἰολίς, Aiolís), or Aeolia (; Αἰολία, Aiolía), was an area that comprised the west and northwestern region of Asia Minor, mostly along the coast, and also several offshore islands (particularly Lesbos), where the Aeolian Greek city-states were located. Aeolis incorporated the southern parts of Mysia, and is bounded by it to the north, Ionia to the south, and Lydia to the east.\n\n\n== Geography ==\nAeolis was an ancient district on the western coast of Asia Minor. It extended along the Aegean Sea from the entrance of the Hellespont (now the Dardanelles) south to the Hermus River (now the Gediz River). It was named for the Aeolians, some of whom migrated there from Greece before 1000 BC. Aeolis was, however, an ethnological and linguistic enclave rather than a geographical unit. The district often was considered part of the larger northwest region of Mysia.\n\n\n== History ==\n\nAccording to Homer's Odyssey, Odysseus, after his stay with the Cyclopes, reached the floating island of Aeolia, where Aeolus son of Hippotas provided him with the west wind Zephyr.\n\nBy the 8th century BC the Aeolians' twelve most important cities were independent. They formed a league of twelve cities (a Dodecapolis): Cyme (also called Phriconis); Larissa; Neonteichos; Temnus; Cilla; Notion; Aegiroessa; Pitane; Aegae; Myrina; Gryneion; and Smyrna.The most celebrated of the cities was Smyrna (modern Izmir, Turkey), but in 699 BC, Smyrna became part of an Ionian confederacy. This league or confederation, known as the Ionian League, also called the Panionic League, was formed at the end of the Meliac War in the mid-7th century BC.Croesus, king of Lydia (reigned 560-546 BC), conquered the remaining cities. Later they were held successively by the Persians, Macedonians, Seleucids, and Pergamenes.Attalus III, the last king of Pergamum, bequeathed Aeolis to the Roman Republic in 133 BC. Shortly afterwards it became part of the Roman province of Asia. At the partition of the Roman Empire (395 AD), Aeolis was assigned to the East Roman (Byzantine) empire and remained largely under Byzantine rule until the early 15th century, when the Ottoman Turks occupied the area.\n\n\n== Notable people ==\nAutolycus of Pitane\nAndriscus\nElias Venezis\n\n\n== See also ==\nAncient regions of Anatolia\nRegions of ancient Greece\n\n\n== Notes ==\n\n\n== References ==\nPierluigi Bonanno, Aiolis. Storia e archeologia di una regione dell’Asia Minore alla fine del II millennio a.C., USA, 2006"