"The Day the Earth Stood Still (a.k.a. Farewell to the Master and Journey to the World) is a 1951 American science fiction film from 20th Century Fox, produced by Julian Blaustein and directed by Robert Wise. The film stars Michael Rennie, Patricia Neal, Hugh Marlowe, Sam Jaffe, Billy Gray, Frances Bavier and Lock Martin. The screenplay was written by Edmund H. North, based on the 1940 science fiction short story \"Farewell to the Master\" by Harry Bates, and the film score was composed by Bernard Herrmann.Set in the Cold War during the early stages of the nuclear arms race, the film's storyline involves a humanoid alien visitor who comes to Earth, accompanied by a powerful robot, to deliver an important message that will affect the entire human race.\nIn 1995, the film was selected for preservation in the United States National Film Registry as \"culturally, historically, or aesthetically significant\".\n\n\n== Plot ==\nWhen a flying saucer lands in Washington, D.C., the U.S. Army quickly surrounds it. A humanoid emerges and announces that he comes \"in peace and with good will\". When he unexpectedly opens a small device, he is shot and wounded by a nervous soldier. A tall robot emerges from the saucer and quickly disintegrates the Army's weapons. The alien orders the robot, Gort, to desist. He explains that the now-broken device was a gift for the President of the United States that would have enabled him \"to study life on the other planets\".\nThe alien, Klaatu, is taken to Walter Reed Army Hospital. After surgery, he uses a salve to quickly heal his wound. Meanwhile, the Army tries but is unable to enter the saucer; Gort stands outside, silent and unmoving.\nKlaatu tells the President's secretary, Mr. Harley, he has a message that must be delivered to all the world's leaders simultaneously. Harley tells him that in the current political climate this is impossible. Klaatu suggests that he be allowed to go among humans to better understand their \"unreasoning suspicions and attitudes\". Harley rejects the proposal, and Klaatu remains under guard.\nKlaatu escapes to a boarding house as \"Mr. Carpenter\", the name (\"Maj. Carpenter\") on the dry cleaner's tag on a suit he acquired. Among the residents are young widow Helen Benson and her son Bobby. \nWhen Helen and her boyfriend Tom Stevens go out, Klaatu babysits Bobby. The boy takes Klaatu on a tour of the city, including a visit to his father's grave in Arlington National Cemetery; Klaatu learns that most of the deceased are soldiers killed in wars. They also visit the Lincoln Memorial. \nKlaatu poses a question to Bobby, \"Who's the greatest living person?\" Bobby suggests Professor Barnhardt. Bobby takes Klaatu to Barnhardt's home, but the professor is out. Klaatu writes an equation on a blackboard to assist Barnhardt with a celestial mechanics problem; he leaves his contact information with the suspicious housekeeper.\nThat evening, a government agent accompanies Klaatu to Barnhardt. Klaatu explains that the people of other planets are concerned now that humanity has developed rockets and a rudimentary form of atomic power. Klaatu declares that if his message is ignored, Earth will be \"eliminated\". Barnhardt agrees to gather scientists from around the world at the saucer; he then suggests Klaatu give a harmless demonstration of his power. Klaatu returns to his spaceship, unaware Bobby has followed him. Bobby sees Gort render two soldiers unconscious and Klaatu enter the saucer.\nBobby tells Helen and Tom what he saw, but they do not believe him until Tom takes a diamond he found in Klaatu's room to a jeweler and learns it is \"unlike any other on Earth\". Klaatu finds Helen at her workplace, and they take an empty service elevator which stops precisely at noon. To demonstrate his power, Klaatu has temporarily neutralized all electricity everywhere on Earth, except for essential services such as hospitals and airplanes in flight. Klaatu reveals his true identity to Helen and asks for her help.\nHelen and Klaatu decide to visit Barnhardt. On the way, he tells her that should anything happen to him she must go to Gort and say, \"Klaatu barada nikto.\" Their taxi is spotted and hemmed in. Klaatu is shot dead, and Helen rushes to the saucer. Hearing Klaatu's words, Gort carries Helen inside, retrieves Klaatu's body, and revives him. Klaatu explains to Helen that his revival is only temporary.\nKlaatu addresses Barnhardt's assembled scientists: an interplanetary organization has created a police force of invincible robots like Gort. \"In matters of aggression, we have given them absolute power over us.\" Klaatu concludes, \"Your choice is simple: join us and live in peace, or pursue your present course and face obliteration. We shall be waiting for your answer.\" Klaatu and Gort depart in the saucer.\n\n\n== Cast ==\nMichael Rennie as Klaatu\nPatricia Neal as Helen Benson\nHugh Marlowe as Tom Stevens\nSam Jaffe as Professor Jacob Barnhardt\nBilly Gray as Bobby Benson\nFrances Bavier as Mrs. Barley\nLock Martin as GortUncredited (in order of appearance)Cast notes\nTop broadcast journalists of their time, Elmer Davis, H.V. Kaltenborn, Drew Pearson, and Gabriel Heatter, appeared and/or were heard as themselves in cameo roles. Spencer Tracy and Claude Rains originally were considered for the part of Klaatu.\n\n\n== Metaphors ==\nIn a 1995 interview, producer Julian Blaustein explained that Joseph Breen, the film censor installed by the Motion Picture Association of America at the Twentieth Century Fox studios, balked at the portrayal of Klaatu's resurrection and limitless power. At the behest of the MPAA, a line was written into the script; when Helen asks Klaatu whether Gort has unlimited power over life and death, Klaatu explains that Gort has only revived him temporarily: \"that power is reserved to the Almighty Spirit\". Of the elements that he added to Klaatu's character, screenwriter Edmund North said, \"It was my private little joke. I never discussed this angle with Blaustein or Wise because I didn't want it expressed. I had originally hoped that the Christ comparison would be subliminal\".That the question even came up in an interview is proof enough that such comparisons did not remain subliminal, but they are subtle enough so that it is not immediately obvious to all viewers that those elements were intended to compare Klaatu to Jesus Christ. When Klaatu escapes from the hospital, he steals the clothing of a Maj. Carpenter, carpentry being the profession the Bible says Jesus learned from Joseph, his father. He presents himself as John Carpenter, the same initials as Jesus Christ (and borrowing a given name from one of his disciples, John). His previous actions are misunderstood, and he eventually is killed by military authority. At the end of the film, Klaatu, having risen from the dead, ascends into the (night) sky. Other parallels include: his coming to Earth with a message for all mankind; his befriending of a child; possessing wisdom and specialized scientific knowledge beyond any human being; and people being given a sign of his power. At the very start of the film, one of the British radar technicians, upon observing the speed of Klaatu's spaceship, is heard to exclaim, \"Holy Christmas\"!\n\n\n== Production ==\n\n\n=== Development ===\nProducer Julian Blaustein originally set out to make a film under the working titles of Farewell to the Master and Journey to the World which illustrated the fear and suspicion that characterized the early Cold War and Atomic Age. He reviewed more than two hundred science fiction short stories and novels in search of a storyline that could be used because this film genre was well suited for a metaphorical discussion of such grave issues. Studio head Darryl F. Zanuck gave the go-ahead for this project, and Blaustein hired Edmund North to write the screenplay based on elements from Harry Bates's 1940 short story \"Farewell to the Master\". The revised final screenplay was completed on February 21, 1951. Science fiction writer Raymond F. Jones worked as an uncredited adviser.\n\n\n=== Pre-production ===\nThe set was designed by Thomas Little and Claude Carpenter. They collaborated with the architect Frank Lloyd Wright for the design of the spacecraft. Paul Laffoley has suggested that the futuristic interior was inspired by Wright's Johnson Wax Headquarters, completed in 1936. Laffoley quotes Wright and his attempt in designing the exterior: \"... to imitate an experimental substance that I have heard about which acts like living tissue. If cut, the rift would appear to heal like a wound, leaving a continuous surface with no scar.\"\n\n\n=== Filming ===\nPrincipal outdoor photography for The Day the Earth Stood Still was shot on the 20th Century Fox sound stages and on its studio back lot (now located in Century City, California), with a second unit shooting background and other scenes in Washington D.C. and at Fort George G. Meade in Maryland. The shooting schedule was from April 9 to May 23, 1951, and the primary actors never traveled to Washington to make the film. Director Robert Wise indicated in the DVD commentary that the United States Department of Defense refused participation in the film based on a reading of the script. The military equipment shown, however, came from the 3rd Armored Cavalry Regiment then stationed at Fort Meade which supplied the vehicles, equipment, and soldiers for the segments depicting Army operations. One of the film's tanks bears the \"Brave Rifles\" insignia of the 3rd Armored Cavalry Regiment.The robot Gort was played by Lock Martin, who worked as an usher at Grauman's Chinese Theatre and stood seven feet, seven inches tall. Not used to being in such a confining, heat-inducing costume, he worked carefully while wearing the two oversize, laced-up-the-front-or-back, foamed neoprene suits needed for creating the illusion on screen of a seamless metallic Gort. Wise decided Martin's on-screen shooting time would be limited to half-hour intervals, so Martin, with his generally weak constitution, would face no more than minor discomfort. These segments, in turn, were then edited together into the film's final print.In a commentary track on DVD, interviewed by fellow director Nicholas Meyer, Wise said he wanted the film to appear as realistic and believable as possible, in order to drive home the motion picture's core message against armed conflict in the real world. Also mentioned in the DVD's documentary interview was the original title for the film, \"The Day the World Stops\". Blaustein said his aim with the film was to promote a \"strong United Nations\".\n\n\n=== Herrmann's score ===\nThe music score was composed by Bernard Herrmann in August 1951, and was the first film score he composed after moving from New York to Hollywood. Herrmann chose unusual instrumentation for the film: violin, cello, and bass (all three electric), two theremin electronic instruments (played by Dr. Samuel Hoffman and Paul Shure), two Hammond organs, Fox studio's Wurlitzer organ, three vibraphones, two glockenspiels, marimba, tam-tam, two bass drums, three sets of timpani, two pianos, celesta, two harps, one horn, three trumpets, three trombones, and four tubas. Herrmann's advances in film scoring included Unison organs, tubas, piano, and bass drum, staggered tritone movement, and glissando in theremins, as well as exploitation of the dissonance between D and E-flat and experimentation with unusual overdubbing and tape-reversal techniques. In using the theremin, Herrmann made an early foray into electronic music, one year before Karlheinz Stockhausen and three years before Edgard Varèse.\n\n\n== Music and soundtrack ==\n\n20th Century Fox later reused the Bernard Herrmann title theme in the original pilot episode of Irwin Allen's 1965 TV series Lost in Space; the music was also used extensively in Allen's Voyage to the Bottom of the Sea TV series in various episodes. Danny Elfman noted The Day the Earth Stood Still's score inspired his interest in film composing, and made him a fan of Herrmann.\n\n\n== Reception ==\n\n\n=== Critical response ===\nVariety praised the documentary style of The Day the Earth Stood Still and its reviewer wrote that \"the yarn is told interestingly enough and imbued with sufficient science-fiction lures and suspense so that only seldom does its moralistic wordiness get in the way ... Cast, although secondary to the story, works well\". Harrison's Reports wrote: \"Very good! It is by far the best of the science-fiction pictures yet produced. It holds one's interest undiminished from start to finish and, although the theme is admittedly fantastic, one is made to feel as if he is seeing a real-life occurrence because of the expert handling of the subject matter and the extremely fine special effects work\". The Los Angeles Times praised the film's seriousness, though it also found \"certain subversive elements\". Bosley Crowther of The New York Times wrote a dismissive review, however, calling the film \"tepid entertainment\" and describing Gort as \"oddly unmenacing\".The Day the Earth Stood Still was moderately successful when released, accruing US$1,850,000 in distributors' domestic (U.S. and Canada) rentals, making it the year's 52nd biggest earner.The Day the Earth Stood Still earned more plaudits overseas: the Hollywood Foreign Press Association gave the filmmakers a special Golden Globe Award for \"promoting international understanding\". Bernard Herrmann's score also received a nomination at the Golden Globes. The French magazine Cahiers du cinéma was impressed, its contributor Pierre Kast called it \"almost literally stunning\" and praised its \"moral relativism\".\n\n\n== Legacy ==\nThe Day the Earth Stood Still received recognition from the American Film Institute and was selected for preservation in the United States Library of Congress' National Film Registry. In 2001, it was ranked number 82 on 100 Years ... 100 Thrills, a list of America's most heart-pounding films. It placed number 67 on a similar list 100 Years ... 100 Cheers, a list of America's most inspiring films. In June 2008, the American Film Institute revealed its \"10 Top 10\" – the best ten films in ten \"classic\" American film genres – after polling more than 1,500 people from the creative community. The Day the Earth Stood Still was acknowledged as the fifth best film in the science fiction genre. The film was also on the ballot for AFI's other lists including 100 Years ... 100 Movies, the tenth anniversary list, 100 Years ... 100 Heroes and Villains for Klaatu in the heroes category, 100 Years ... 100 Movie Quotes for the famous line \"Gort! Klaatu barada nikto\" and AFI's 100 Years of Film Scores. In 2004, the film was selected by The New York Times as one of The Best 1000 Movies Ever Made.Lou Cannon and Colin Powell believed the film inspired Ronald Reagan to discuss uniting against an alien invasion when meeting Mikhail Gorbachev in 1985. Two years later, Reagan told the United Nations, \"I occasionally think how quickly our differences worldwide would vanish if we were facing an alien threat from outside this world\".The Day the Earth Stood Still is now considered one of the best films released in 1951. The Day the Earth Stood Still is in Arthur C. Clarke's list of the 12 best science fiction films of all time. The 1951 film holds a 94% \"Certified Fresh\" rating at the review aggregator website Rotten Tomatoes based on 54 reviews, with an average rating of 8.1/10. Tony Magistrale describes the film as one of the best examples of early techno-horror.\n\n\n=== Klaatu barada nikto ===\n\nSince the release of the film, the phrase \"Klaatu barada nikto\" has appeared repeatedly in fiction and in popular culture. The Robot Hall of Fame described it as \"one of the most famous commands in science fiction\", while Frederick S. Clarke of Cinefantastique called it (in 1970) \"the most famous phrase ever spoken by an extraterrestrial\".Patricia Neal had a problem speaking the phrase, though she was proud of the film overall. \"I do think it's the best science fiction film ever made, although I admit that I sometimes had a difficult time keeping a straight face. Michael would patiently watch me bite my lips to avoid giggling and ask, with true British reserve, 'Is that the way you intend to play it?'\"\n\nEdmund H. North, who wrote The Day the Earth Stood Still, also created the alien language used in the film, including the iconic phrase \"Klaatu barada nikto\". The official spelling for the phrase comes directly from the script and provides insight as to its proper pronunciation. No translation was given in the film. Philosophy professor Aeon J. Skoble speculates the famous phrase is a \"safe-word\" which is part of a fail-safe feature used during diplomatic missions such as the one Klaatu and Gort make to Earth. With the use of the safe-word, Gort's deadly force can be deactivated in the event the robot is mistakenly triggered into a defensive posture. Skoble observes that the theme has evolved into a \"staple of science fiction that the machines charged with protecting us from ourselves will misuse or abuse their power\".Fantastic Films explored the meaning of \"Klaatu barada nikto\" in a 1978 article titled \"The Language of Klaatu\". The article, written by Tauna Le Marbe, who is listed as is \"alien linguistics editor\", attempts to translate all the alien words Klaatu used throughout the film. In the article, the literal translation for Klaatu barada nikto was \"Stop Barbarism (I have) death, bind\" and the free translation was \"I die, repair me, do not retaliate\".The documentary Decoding \"Klaatu Barada Nikto\": Science Fiction as Metaphor examined the phrase \"Klaatu barada nikto\" with some of the people involved in the production of The Day the Earth Stood Still. Robert Wise, the director of the film, conveyed an account of Edmund North telling him, \"Well, it's just something I kind of cooked up. I thought it sounded good\". Billy Gray, who played Bobby Benson in the film, said he believed the message was coming from Klaatu and that \"Barada Nikto must mean ... save Earth.\"Florence Blaustein, widow of the producer Julian Blaustein, said North had to pass a street called Baroda every day going to work and indicated \"I think that's how that was born.\" The film historian Steven Jay Rubin recalled an interview he had with North when he asked the question, \"What is the direct translation of Klaatu Barada Nikto, and Edmund North said to me 'There's hope for Earth, if the scientists can be reached'.\"\n\n\n== Adaptations ==\nThe film was dramatized as a radio play on January 4, 1954 for the Lux Radio Theatre; Michael Rennie reprised his lead role as Klaatu with actress Jean Peters as Helen Benson. This production was later re-broadcast on the Hollywood Radio Theater, the re-titled Lux Radio Theatre, which aired on the Armed Forces Radio Service.The film was remade in 2008. The director was Scott Derrickson and it stars Keanu Reeves as Klaatu. Rather than leaving to humans the chance to collaborate, the remake rests on Klaatu's decision whether to let humanity be destroyed or saved.\n\n\n== See also ==\n\n1951 in film\nCulture during the Cold War\nList of films featuring extraterrestrials\nList of science fiction films of the 1950s\n\n\n== References ==\n\n\n=== Notes ===\n\n\n=== Citations ===\n\n\n=== Bibliography ===\n\n\n== External links ==\nThe Day the Earth Stood Still at IMDb\nThe Day the Earth Stood Still at AllMovie\nThe Day the Earth Stood Still at the TCM Movie Database\nThe Day the Earth Stood Still at the American Film Institute Catalog\nThe Day the Earth Stood Still at Box Office Mojo\nThe Day the Earth Stood Still at Rotten Tomatoes\nThe Day the Earth Stood Still at the Internet Movie Script Database\nThe Day the Earth Stood Still on Lux Radio Theater: January 4, 1954\n\"The Day the Earth Stood Still II: The Evening of the Second Day\" film outline by Ray Bradbury\nThe Day the Earth Stood Still essay essay by Daniel Eagan in America's Film Legacy: The Authoritative Guide to the Landmark Movies in the National Film Registry, A&C Black, 2010 ISBN 0826429777, pages 446-448 [1]"