"Resource depletion is the consumption of a resource faster than it can be replenished. Natural resources are commonly divided between renewable resources and non-renewable resources (see also mineral resource classification). Use of either of these forms of resources beyond their rate of replacement is considered to be resource depletion. The value of a resource is a direct result of its availability in nature and the cost of extracting the resource, the more a resource is depleted the more the value of the resource increases. There are several types of resource depletion, the most known being: Aquifer depletion, deforestation, mining for fossil fuels and minerals, pollution or contamination of resources, slash-and-burn agricultural practices, soil erosion, and overconsumption, excessive or unnecessary use of resources.\nResource depletion is most commonly used in reference to farming, fishing, mining, water usage, and consumption of fossil fuels. Depletion of wildlife populations is called defaunation.\n\n\n== Depletion accounting ==\n\nIn an effort to offset the depletion of resources, theorists have come up with the concept of depletion accounting. Better known as 'green accounting,' depletion accounting aims to account for nature's value on an equal footing with the market economy. Resource depletion accounting uses data provided from countries to estimate the adjustments needed due to their use and depletion of the natural capital available to them. Natural capital are natural resources such as mineral deposits or timber stocks. Depletion accounting factors in several different influences such as the number of years until resource exhaustion, the cost of resource extraction and the demand of the resource. Resource extraction industries make up a large part of the economic activity in developing countries. This, in turn, leads to higher levels of resource depletion and environmental degradation in developing countries. Theorists argue that implementation of resource depletion accounting is necessary in developing countries. Depletion accounting also seeks to measure the social value of natural resources and ecosystems. Measurement of social value is sought through ecosystem services, which are defined as the benefits of nature to households, communities and economies.\n\n\n=== Importance ===\nThere are many different groups interested in depletion accounting. Environmentalists are interested in depletion accounting as a way to track the use of natural resources over time, hold governments accountable or compare their environmental conditions to those of another country. Economists want to measure resource depletion to understand how financially reliant countries or corporations are on non-renewable resources, whether this use can be sustained and the financial drawbacks of switching to renewable resources in light of the depleting resources.\n\n\n=== Issues ===\nDepletion accounting is complex to implement as nature is not as quantifiable as cars, houses, or bread. For depletion accounting to work, appropriate units of natural resources must be established so that natural resources can be viable in the market economy. The main issues that arise when trying to do so are, determining a suitable unit of account, deciding how to deal with the \"collective\" nature of a complete ecosystem, delineating the borderline of the ecosystem, and defining the extent of possible duplication when the resource interacts in more than one ecosystem. Some economists want to include measurement of the benefits arising from public goods provided by nature, but currently there are no market indicators of value. Globally, environmental economics has not been able to provide a consensus of measurement units of nature's services.\n\n\n== Minerals depletion ==\n\nMinerals are needed to provide food, clothing, and housing. A United States Geological Survey (USGS) study found a significant long-term trend over the 20th century for non-renewable resources such as minerals to supply a greater proportion of the raw material inputs to the non-fuel, non-food sector of the economy; an example is the greater consumption of crushed stone, sand, and gravel used in construction.Large-scale exploitation of minerals began in the Industrial Revolution around 1760 in England and has grown rapidly ever since. Technological improvements have allowed humans to dig deeper and access lower grades and different types of ore over that time. Virtually all basic industrial metals (copper, iron, bauxite, etc.), as well as rare earth minerals, face production output limitations from time to time, because supply involves large up-front investments and is therefore slow to respond to rapid increases in demand.Minerals projected by some to enter production decline during the next 20 years:\n\nOil conventional (2005)\nOil all liquides (2017). Old expectation: Gasoline (2023)\nCopper (2017). Old expectation: Copper (2024). Data from the United States Geological Survey (USGS) suggest that it is very unlikely that copper production will peak before 2040.\nCoal per KWh (2017). Old expectation per ton: (2060)\nZinc. Developments in hydrometallurgy have transformed non-sulfide zinc deposits (largely ignored until now) into large low cost reserves.Minerals projected by some to enter production decline during the present century:\n\nAluminium (2057)\nIron (2068)Such projections may change, as new discoveries are made and typically misinterpret available data on Mineral Resources and Mineral Reserves.\nPhosphor (2048). The last 80% of World reserves are only one mine.\n\n\n== Oil ==\n\nPeak oil is the period when the maximum rate of global petroleum extraction is reached, after which the rate of production will undergo a long-term decline. The 2005 Hirsch report concluded that the decreased supply combined with increasing demand will significantly increase the worldwide prices of petroleum derived products, and that most significant will be the availability and price of liquid fuel for transportation.\nThe Hirsch report, funded by United States Department of Energy, concluded that “The peaking of world oil production presents the U. S. and the world with an unprecedented risk management problem. As peaking is approached, liquid fuel prices and price volatility will increase dramatically, and, without timely mitigation, the social, economic and political costs will be unprecedented. Viable mitigation options exist on both the supply and demand sides, but to have substantial impact, they must be initiated more than a decade in advance of peaking.”\n\n\n== Deforestation ==\n\nDeforestation is the clearing of forests by cutting or burning of trees and plants in a forested area. As a result of deforestation, about one half of the forests that once covered Earth have been destroyed. It occurs for many different reasons, and it has several negative implications on the atmosphere and the quality of the land in and surrounding the forest.\n\n\n=== Causes ===\nOne of the main causes of deforestation is clearing forests for agricultural reasons. As the population of developing areas, especially near rainforests, increases, the need for land for farming becomes more and more important. For most people, a forest has no value when its resources are not being used, so the incentives to deforest these areas outweigh the incentives to preserve the forests. For this reason, the economic value of the forests is very important for the developing countries.\n\n\n=== Environmental impact ===\nBecause deforestation is so extensive, it has made several significant impacts on the environment, including:\n\nCarbon dioxide in the atmosphere\nChanging the water cycle\nAn increase in soil erosion\nA decrease in biodiversityDeforestation is often cited as a contributor to global warming. Because trees and plants remove carbon dioxide and emit oxygen into the atmosphere, the reduction of forests contribute to about 12% of anthropogenic carbon dioxide emissions. One of the most pressing issues that deforestation creates is soil erosion. The removal of trees causes higher rates of erosion, increasing risks of landslides, which is a direct threat to many people living close to deforested areas. As forests get destroyed, so does the habitat for millions of animals. It is estimated that 80% of the world's known biodiversity lives in the rainforests, and the destruction of these rainforests is accelerating extinction at an alarming rate.\n\n\n=== Controlling deforestation ===\nThe United Nations and the World Bank created programs such as Reducing Emissions from Deforestation and Forest Degradation (REDD), which works especially with developing countries to use subsidies or other incentives to encourage citizens to use the forest in a more sustainable way. In addition to making sure that emissions from deforestation are kept to a minimum, an effort to educate people on sustainability and helping them to focus on the long-term risks is key to the success of these programs. The New York Declaration on Forests and its associated actions promotes reforestation, which is being encouraged in many countries in an attempt to repair the damage that deforestation has done.\n\n\n== Wetlands ==\nWetlands are ecosystems that are often saturated by enough surface or groundwater to sustain vegetation that is usually adapted to saturated soil conditions, such as cattails, bulrushes, red maples, wild rice, blackberries, cranberries, and peat moss. Because some varieties of wetlands are rich in minerals and nutrients and provide many of the advantages of both land and water environments they contain diverse species and provide a distinct basis for the food chain. Wetland habitats contribute to environmental health and biodiversity. Wetlands are a nonrenewable resource on a human timescale and in some environments cannot ever be renewed. Recent studies indicate that global loss of wetlands could be as high as 87% since 1700 AD, with 64% of wetland loss occurring since 1900. Some loss of wetlands resulted from natural causes such as erosion, sedimentation, subsidence, and a rise in the sea level.Wetlands provide environmental services for:\n\nFood and habitat\nImproving water quality\nCommercial fishing\nFloodwater reduction\nShoreline stabilization\nRecreation\n\n\n=== Resource in wetland ===\nSome of the world's most successful agricultural areas are wetlands that have been drained and converted to farmland for large-scale agriculture. Large-scale draining of wetlands also occurs for real estate development and urbanization. In contrast, in some cases wetlands are also flooded to be converted to recreational lakes or hydropower generation. In some countries ranchers have also moved their property onto wetlands for grazing due to the nutrient rich vegetation. Wetlands in Southern America also prove a fruitful resource for poachers, as animals with valuable hides such a jaguars, maned wolves, caimans, and snakes are drawn to wetlands. The effect of the removal of large predators is still unknown in South African wetlands.Humans benefit from wetlands in indirect ways as well. Wetlands act as natural water filters, when runoff from either natural or man-made processes pass through, wetlands can have a neutralizing effect. If a wetland is in between an agricultural zone and a freshwater ecosystem, fertilizer runoff will be absorbed by the wetland and used to fuel the slow processes that occur happen, by the time the water reaches the freshwater ecosystem there won't be enough fertilizer to cause destructive algal blooms that poison freshwater ecosystems.\n\n\n=== Non-natural causes of wetland degradation ===\nHydrologic alteration drainage\ndredging\nstream channelization\nditching\nlevees\ndeposition of fill material\nstream diversion\ngroundwater drainage\nimpoundment\nUrbanization and urban development\nMarinas/boats\nIndustrialization and industrial development\nAgriculture\nSilviculture/Timber harvest\nMining\nAtmospheric deposition\nTo preserve the resources extracted from wetlands, current strategies are to rank wetlands and prioritize the conservation of wetlands with more environmental services, create more efficient irrigation for wetlands being used for agriculture and restricting access to wetlands by tourists.\n\n\n== Groundwater ==\n\nWater is an essential resource needed to survive everyday life. Historically, water has had a profound influence on a nation's prosperity and success around the world. Groundwater is water that is in saturated zones underground, the upper surface of the saturated zone is called the water table. Groundwater is held in the pores and fractures of underground materials like sand, gravel and other rock, these rock materials are called aquifers. Groundwater can either flow naturally out of rock materials or can be pumped out. Groundwater supplies wells and aquifers for private, agricultural, and public use and is used by more than a third of the world's population every day for their drinking water. Globally there is 22.6 million cubic kilometers of groundwater available and only .35 million of that is renewable.\n\n\n=== Groundwater as a non-renewable resource ===\nGroundwater is considered to be a non-renewable resource because less than six percent of the water around the world is replenished and renewed on a human timescale of 50 years. People are already using non-renewable water that is thousands of years old, in areas like Egypt they are using water that may have been renewed a million years ago which is not renewable on human timescales. Of the groundwater used for agriculture 16 to 33% is non-renewable. It is estimated that since the 1960s groundwater extraction has more than doubled, which has increased groundwater depletion. Due to this increase in depletion, in some of the most depleted areas use of groundwater for irrigation has become impossible or cost prohibitive.\n\n\n=== Environmental impacts ===\nOverusing groundwater, old or young, can lower subsurface water levels and dry up streams, which could have a huge effect on ecosystems on the surface. When the most easily recoverable fresh groundwater is removed this leaves a residual with inferior water quality. This is in part from induced leakage from the land surface, confining layers or adjacent aquifers that contain saline or contaminated water. Worldwide the magnitude of groundwater depletion from storage may be so large as to constitute a measurable contributor to sea-level rise.\n\n\n=== Mitigation ===\nCurrently, societies respond to water-resource depletion by shifting management objectives from location and developing new supplies to augmenting conserving and reallocation of existing supplies. There are two different perspectives to groundwater depletion, the first is that depletion is considered literally and simply as a reduction in the volume of water in the saturated zone, regardless of water quality considerations. A second perspective views depletion as a reduction in the usable volume of fresh groundwater in storage.Augmenting supplies can mean improving water quality or increasing water quantity. Depletion due to quality considerations can be overcome by treatment, whereas large volume metric depletion can only be alleviated by decreasing discharge or increasing recharge. Artificial recharge of storm flow and treated municipal wastewater, has successfully reversed groundwater declines. In the future improved infiltration and recharge technologies will be more widely used to maximize the capture of runoff and treated wastewater.\n\n\n== See also ==\n\n\n== References ==\n\n\n== Further reading ==\nGrandin, Greg, \"The Death Cult of Trumpism:  In his appeals to a racist and nationalist chauvinism, Trump leverages tribal resentment against an emerging manifest common destiny\", The Nation, 29 Jan./5 Feb. 2018, pp. 20–22.  \"[T]he ongoing effects of the ruinous 2003 war in Iraq and the 2007–8 financial meltdown are... two indicators that the promise of endless growth can no longer help organize people's aspirations...  We are entering the second 'lost decade' of what Larry Summers calls 'secular stagnation,' and soon we'll be in the third decade of a war that Senator Lindsey Graham... says will never end.  [T]here is a realization that the world is fragile and that we are trapped in an economic system that is well past sustainable or justifiable.... In a nation like the United States, founded on a mythical belief in a kind of species immunity—less an American exceptionalism than exemptionism, an insistence that the nation was exempt from nature, society, history, even death—the realization that it can't go on forever is traumatic.\" (p. 21.)"