"The Egyptian Crisis began with the Egyptian revolution of 2011, when hundreds of thousands of Egyptians took to the streets in an ideologically and socially diverse mass protest movement that ultimately forced longtime president Hosni Mubarak from office. A protracted political crisis ensued, with the Supreme Council of the Armed Forces taking control of the country until a series of popular elections brought the Muslim Brotherhood to power. However, disputes between elected Islamist president Mohamed Morsi and secularists continued until the anti-government protests in June 2013 that led to the overthrow of Morsi in 2013, in what has been variably described as a coup d'état or as an ending to the second revolution, or both. Abdel Fattah el-Sisi, who announced the overthrow of Morsi, then became the leader of Egypt the following year, winning election to the presidency in a landslide victory described by EU observers as free but not necessarily fair. Nonetheless, Sisi's election was widely recognized, and the political situation has largely stabilized since he officially took power; however, some protests have continued despite a government crackdown. The crisis has also worsened an ongoing insurgency led by Ansar Bait al-Maqdis in the Sinai Peninsula, which became increasingly intertwined with the regional conflict against the Islamic State of Iraq and the Levant later in 2014.\n\n\n== Background ==\nBefore Mubarak took command of the Egyptian government, the third President of Egypt, Anwar Sadat, had been in office since 1970. President Sadat had significantly changed the course of Egypt, reinstating a multi-party system and allowing for an increase in foreign investment, among other measures. Also, during Sadat's presidency Egypt both fought in the Yom Kippur War against Israel and, five years later, successfully negotiated the Camp David Accords; this allowed the country to regain sovereignty over the Sinai Peninsula that Israel had been in control of since 1967. Because of these negotiations and their outcome, both he and Israeli Prime Minister Menachem Begin were awarded the Nobel Peace Prize in 1978, which made Sadat the first Muslim Nobel laureate. On 6 October 1981, President Sadat was assassinated in Cairo during the annual celebrations of Operation Badr by members of Egyptian Islamic Jihad, an Islamist terrorist group. About a week after Sadat's assassination, then Vice-President Hosni Mubarak took office as president, an action that was approved through a referendum of the People's Assembly.\nDuring his presidency, Mubarak pursued policies similar to those of his predecessor, including a commitment to the Camp David Accords; these negotiations are thought to be one of the reasons Egyptian Islamic Jihad members decided to assassinate President Sadat. Additionally, Mubarak continued to work to ensure the gradual decrease in the military's influence and control over Egyptian politics, a decrease begun under Anwar Sadat, with Mubarak replacing many military elites with appointments from the Ministry of Interior instead, and less than 10% of ministerial appointments coming from the military by 2010. The significant economic liberalization of Egypt's economy under Mubarak also led to a drastic reduction in defense expenditures by 2010, compared to previous decades, thereby significantly reducing the military's role in the economy. This gradual reshuffling of power under the Sadat and Mubarak regimes led to tensions between Mubarak's government and the military. Another cause for discontent among Egyptian citizens was Mubarak's administration's disputed human rights record. In this context, and after nearly 30 years of Mubarak's rule, the President was ousted following 18 days of demonstrations in Tahrir Square during the Egyptian revolution of 2011.\n\n\n== Events ==\n\n\n=== Revolution ===\n\nUnhappiness among many Egyptians with the autocratic of 30-year of Dictatorship of President Hosni Mubarak boiled over in late January 2011 amid the Arab Spring, a series of popular protests and uprisings across the region. Hundreds of thousands of Egyptians occupied several public places across Egypt, including Cairo's Tahrir Square, holding out despite efforts by Mubarak loyalists and police to dislodge them, most notably during the infamous \"Battle of the Camel\". In the beginning, tensions were high between the police and protesters with violence breaking out in Suez and Alexandria. The government took a hard line, using riot-control tactics, and shutting down the internet and telecom networks. But by the 28th the protests were continuing and the police had retreated. Mubarak offered some concessions, such as appointing Omar Suleiman to the long-vacant office of vice president. He also announced that he would not seek re-election. None of these satisfied protesters, and under international pressure and lacking the support of Egypt's powerful military. On 10 February 2011 Mubarak handed over power to Suleiman and resigned as president the following day. According to a government fact-finding mission's report the 18-day uprising left at least 846 civilians killed and more than 6,400 injured .\n\n\n== Initiation of the protests ==\nThe Muslim Brotherhood's support of and participation in the Egyptian Revolution was no accident, but a planned and orchestrated attempt to support a regime change that would put them closer to achieving their goal of installing Islam at the center of the country's political agenda. Armbrust (834-864) suggested in his paper that the collapse of the Mubarak regime during the Egyptian Revolution of 2011 may not have been directly caused by the Muslim Brotherhood, but their participation was a calculated one, as evidenced by their opportunistic actions during the conflict. In another study that was published in the Middle East Report, El-Ghobashy (2-13) suggested that the Egyptian Revolution was supposed to be a political exercise that should have brought back the value of the people in real politics—to reaffirm their power in choosing their leader. However, as El-Ghobashy (2-13) noted, it did not turn out to be that way, because of the many opportunistic groups and forces that took advantage of the weakened government and revolutionary forces to further their interests and aspirations for Egypt and the region. This set of actions perfectly describe what the Muslim Brotherhood did during the Egyptian Revolution. The bottom line is that the outcome of the revolution should have benefited the Egyptian people more, had the Islamist groups not intervened. As the number of protesters increased, it overwhelmed the police. They were forced to retreat from several parts of Cairo, eventually losing their grip on the country. This was mostly due to the panic among police officers during the jailbreaks and the riots. Police brutality and the excessive use of force against demonstrators also contributed to the Interior Ministry's withdrawal. Simultaneously, the government deployed the army in response to increasing lawlessness that day. The military, however, decided to remain neutral during the uprising despite a heavy presence of troops on the streets, especially in Cairo and Suez.\n\n\n== Relevant history of the Brotherhood ==\nThe Muslim Brotherhood (MB) is a multinational organization that represents the Sunni Islamic community and its interests. MB was founded in Egypt by a person named Hassan Al-Banna in 1928. Al-Banna was a schoolteacher who devoted a large portion of his life as an Islamic scholar. What separated Al-Banna from other Islamic scholars was his idealism. This can be evidenced by how easy Al-Banna's teachings about Sunni Islamism and how it should be propagated and embraced beyond the jurisdiction of the country where it was founded, even after his death. It can be recalled that the Muslim Brotherhood was founded at a time when Egypt was under the colonial rule and control of the United Kingdom. In order to allow the organization to grow, its leaders painted it (both with words and actions) as a simple religious organization that supports civic and social causes. This explains why the MB has been involved in a numerous community and nation-building programs for a significant part of its history. More specific examples of said programs include, but may not be limited to, the establishment of hospitals, and initiating education and livelihood programs.\nIt became clear later on that one of the Muslim Brotherhood's ultimate goals was to put to an end the British influence over and control of Egypt. In hindsight, it is clear that the Muslim Brotherhood was, in fact, able to accomplish that objective, as evidenced by the establishment of the Republic of Egypt in 1952, following a coup de tat against the Egyptian monarchy, and which led to the elimination of all British military presence in the country. This is still a hotly debated issue, because the formal declaration of Egypt's independence from the British Empire occurred in 1922 (Migiro 1). The Muslim Brotherhood was established in 1928, and one of the reasons behind its formation was the continued influence of the British Empire on Egyptian politics, even after it has already declared its independence. This is something that the MB did not like.\nFollowing the real breakaway of Egypt from British colonialism in 1952 (a success for MB), the organization had to focus on a new political goal. That goal was the establishment of an Egyptian government ruled by Sharia law (Ghattas 1). In the wake of the Egyptian Revolution of 2011, the Muslim Brotherhood had been vocal about its support of the overthrow of then longtime president Hosni Mubarak, in favor of Islamist president Mohamed Morsi, which was eventually replaced by Abdel Fattah el-Sisi (Supreme Commander of the Egyptian Armed Forces). Considering the information that has been gathered about the Muslim Brotherhood's origins and its long-term goals in Egypt and in the region (Middle East and North African region), the idea that the Egyptian revolution was not a spontaneous civil demonstration but a well-planned and orchestrated move to change Egypt's political structure, in line of course of the Muslim Brotherhood's long-term plan to install a Sunni Islamist government in Egypt.\n\n\n=== SCAF regime ===\n\nAfter Hosni Mubarak's resignation on the night of 11 February 2011, the Supreme Council of the Armed Forces (SCAF) under Field Marshal Mohamed Hussein Tantawi assumed control of the country. This period was marked by major protests calling for the end of military rule and multiple tragedies, the worst being the Port Said stadium disaster. Despite the turbulence of the transitional period in Egypt, polls have shown that the SCAF has enjoyed wide legitimacy from the Egyptian people and general confidence in their ability to provide free elections. A poll in October 2011 showed that 91.7% of Egyptians have confidence in the SCAF to provide the conditions for free elections. The SCAF at that time had a general approval rating of 40.6%. The parliamentary elections were held in the end of 2011 and was accepted widely as one of the very rare free and fair elections in modern Egyptian history. The Muslim Brotherhood's Freedom and Justice Party (FJP) took 44% of the seats and the \"salafist\" Al-Noor Party took 25% of the seats, thus providing an \"islamist\" domination of more than 69% of the parliament.\n\n\n=== Presidency of Mohamed Morsi ===\n\nIn June 2012, presidential elections were held and Mohamed Morsi allegedly won 51.7% of the vote versus 48.3% for Ahmed Shafik. President Morsi, a leading member of the Muslim Brotherhood and the Freedom and Justice Party (FJP), resigned from both organizations and took office on 30 June 2012. This marked the end of the Supreme Council of the Armed Forces transition period. Of note is that on 14 June 2012, just 2 days before the second round of the presidential elections, the Supreme Constitutional Court of Egypt, who was not changed since appointment by the Mubarak regime, issued a judgement to dissolve the parliament that was elected after the revolution and ruled that the army-backed candidate could stay in the race, in what was widely seen as a double blow for the Muslim Brotherhood. The SCAF implemented this decision on 16 June 2012 and forbid members by force from entering the parliamentary building. The SCAF also produced a \"constitutional declaration\" that gave the army officials, who were also not changed since the Mubarak regime exclusive political powers.\nThese actions were denounced as a coup by opposition leaders of all kinds and many within the Brotherhood, who feared that they will lose much of the political ground they have gained since Hosni Mubarak was ousted 16 months before.\nOn 22 November 2012, after granting himself the powers to \"protect\" the constitution-writing committee from dissolution by the court, and the power to legislate without judicial oversight or review of his acts until a new parliament is elected, Mohamed Morsi followed his decrees by making an effort to push through a referendum on an Islamist-supported draft constitution, that was drafted by the constitution-writing committee that was elected by the post-revolution parliament.The move had been criticized by Mohamed ElBaradei who stated \"Morsi today usurped all state powers & appointed himself Egypt's new pharaoh\" on his Twitter feed. The move led to massive protests and violent action throughout the country.\n\n\n=== Mass protests and coup d'état ===\n\nA youth group known as Tamarod, claimed to have collected millions of signatures calling for Morsi to step down. By 30 June, on the first anniversary of the election of Morsi, thousands of protesters surrounding the presidential palace in the Heliopolis suburb demanding the resignation of Morsi. A military source claimed that the number of protestors reached as many as 33 million, however, independent observers have raised concerns about wild exaggeration of the number of actual anti-Morsi protestors with one crowd statistical expert study indicating that a total of a little more than 1 million people protested against Morsi across the whole country.On 3 July, the Egyptian Armed Forces, headed by Abdul Fatah al-Sisi, acted on its 48-hour ultimatum by carrying out a coup d'état ousting President Mohamed Morsi, suspending the constitution, appointing the head of the constitutional court as interim national leader, and calling for early elections.\n\n\n=== Post-coup unrest ===\n\nViolent clashes erupted in the aftermath of the coup d'état following the 3 July 2013 removal of President Mohamed Morsi by the military amid demonstrations for and against Morsi's rule. Prior to the anti-government protests, many pro-Morsi protesters amassed near the Rabia Al-Adawiya Mosque, originally to celebrate the one-year anniversary of Morsi's inauguration, but in the wake of the military coup, their message then changed to call for Morsi's return to power and condemn the military. Deadly clashes erupted on several days, including the killing of 61 protestors by the military at the Republican Guard headquarters on 8 July 2013 and a separate incident on 27 July 2013 in which over 100 protesters were killed by security forces. Both incidents were described by the Muslim Brotherhood as \"massacres perpetrated by security forces.\"On 14 August 2013, security forces raided the sit-ins at Rabaa and Nahda, resulting in a massacre of at least 904 pro-Morsi demonstrators. Human Rights Watch described the event as crimes against humanity and the military appointed interim government declared a month-long nighttime curfew which was extended a further two months.On 24 March 2014, an Egyptian court sentenced 529 suspected members of the Muslim Brotherhood to death accused of attacking a police station. By 2017, approximately 60,000 political prisoners, according to independent counts and human rights groups, have been imprisoned since the coup.\n\n\n== Egypt post-revolution ==\nIt is still debatable whether the toppling of Mubarak's regime was good for Egypt or not. What is clear, however, is that it has led to a beginning of a new chapter in the country's history, one that is marked by revolutionary restructuring of its political and social order (Sowners and Toensing 1-320). The Muslim Brotherhood's participation in the Egyptian Revolution of 2011 was instrumental, as it led to the resurgence of Islamism in Egyptian politics, and by extension, the Egyptian experience. It is worth mentioning that this outcome was all too predictable, because the Muslim Brotherhood had already been gaining a lot of influence not only as an organization but also as an ideological movement, even before the toppling of Mubarak's regime. In Guirguis' (187-226) paper, he also described how the Muslim Brotherhood took advantage of Mubarak's regime's collapse in order to further its goal of installing a new government based on the Sharia law. On the positive side, the post-Mubarak Egypt has led to positive developments, including but may not be limited to the rise of political parties—enabling the creation of further checks and balances against authoritarianism, trade and economic liberalization, and the establishment of independent social groups and unions, all of which lead to a more robust and dynamic democratic society (Joya 367-386). The market-friendly policies of the Muslim Brotherhood and its leaders made it very popular among the people of Egypt. The organization has long been known for their policies that support the development of free markets, and the liberalization of Egypt's rather obsolete trade and economic policies. The only problem that remains in Egypt's post-Mubarak era is who (or rather what organization) should be given the authority to control the government and lead its people towards prosperity and freedom. In Selim's (177-199) paper, he argued that there are currently three camps that are vying for that position, in what he refers to as the Triangle of Counter-Revolution. These three camps are represented by the Muslim Brotherhood, The Egyptian Supreme Council of the Armed Forces (SCAF), and the United States. Selim (177-199) suggested that these three camps are currently engaged in a counter-revolutionary conflict against each other in Egypt, a development that prevents the nation from moving on from the Egyptian Revolution.\n\n\n=== Election of Abdel Fattah el-Sisi ===\n\nGeneral Abdel Fattah el-Sisi who led the military coup against President Mohamed Morsi emerged as a popular figure by his supporters in Egypt, and he eventually declared his candidacy for president in the 2014 elections. According to results from the Egyptian elections authority, he won 96.9% of the vote, however these results were denounced by observers as being a sham election similar to numbers reported for Hosni Mubarak in periodic elections and referendums during his reign as president. Nonetheless, el-Sisi's election was widely recognized internationally.\n\n\n== Impact ==\n\n\n=== Sinai insurgency ===\n\nAn increase in militant activity by Islamists initiating as a fallout of the 2011 Egyptian revolution drew a harsh response from interim Egyptian government in mid-2011 known as Operation Eagle. However, attacks against government and foreign facilities in the area have continued by mid-2012, resulting in a massive crackdown by the new Egyptian government nicknamed Operation Sinai.\n\n\n=== Nationwide insurgency ===\n\nThere is a new wave of terrorism since the 2013 transition.\n\n\n=== Deaths ===\nAt least 7,000 people have died during the crisis covered by this article (2011 to 2014) and the ensuing still ongoing insurgencies.\n\n2011 revolution: 846\nTransition: 300+\nSinai insurgency: 1,627\n2012–2013 Egyptian protests: 127+\nPost-coup unrest in Egypt (2013–2014): 3,143+\nInsurgency in Egypt (2013–present): 570+\n\n\n=== Economy ===\nEgyptian economy is still suffering from a severe downturn following the 2011 revolution and the government faces numerous challenges as to how to restore growth, market and investor confidence. Political and institutional uncertainty, a perception of rising insecurity and sporadic unrest continue to negatively affect economic growth.Real GDP growth slowed to just 2.2 percent year on year in October–December 2012/13 and investments declined to 13 percent of GDP in July–December 2012. The economic slowdown contributed to a rise in unemployment, which stood at 13 percent at end-December 2012, with 3.5 million people out of work.\n\n\n== See also ==\nArab Spring\nHistory of republican Egypt\nUniversity on the Square: Documenting Egypt's 21st century Revolution\n\n\n== References ==\nArmbrust, Walter. \"The Trickster in Egypt's January 25th Revolution.\" Comparative Studies in Society and History (2013): Print. 834–864. June 2019.\nEl-Ghobashy, Mona. \"The Praxis of the Egyptian Revolution.\" Middle East Report (2011): Print. 2-13. June 2019.\nGhattas, Kim. \"Profile: Egypt's Muslim Brotherhood.\" BBC (2001): Web. Profile: Egypt's Muslim Brotherhood. June 2019.\nGuirguis, Max. \"Islamic resurgence and its consequences in the Egyptian experience.\" Mediterranean Studies (2012): Print. 187–226. June 2019.\nJoya, Angela. \"The Egyptian revolution: crisis of neoliberalism and the potential for democratic politics.\" Review of African Political Economy (2011): Print. 367–386. June 2019.\nMigiro, Geoffrey. \"When Did Egypt Become Independent.\" World Atlas (2018): Web. When Did Egypt Become Independent?. June 2019.\nSelim, Gamal. \"Egypt under SCAF and the Muslim Brotherhood: The triangle of counter-revolution.\" Arab Studies Quarterly (2015): Print. 177–199. June 2019.\nSowners, Jeannie and Chris Toensing. \"The journey to Tahrir: revolution, protest, and social change in Egypt.\" Verso Books (2012): Print. 1–320. June 2019."