"The anatomy of the cerebellum can be viewed at three levels.  At the level of gross anatomy, the cerebellum consists of a tightly folded and crumpled layer of cortex, with white matter underneath, several deep nuclei embedded in the white matter, and a fluid-filled ventricle in the middle. At the intermediate level, the cerebellum and its auxiliary structures can be broken down into several hundred or thousand independently functioning modules or compartments known as microzones.  At the microscopic level, each module consists of the same small set of neuronal elements, laid out with a highly stereotyped geometry.\n\n\n== Gross anatomy ==\nThe cerebellum is located at the base of the brain, with the large mass of the cerebral cortex above it and the portion of the brainstem called the pons in front of it. It is separated from the overlying cerebrum by a layer of tough dura mater; all of its connections with other parts of the brain travel through the pons.  Anatomists classify the cerebellum as part of the metencephalon, which also includes the pons; the metencephalon in turn is the upper part of the rhombencephalon or \"hindbrain\".  Like the cerebral cortex, the cerebellum is divided into two hemispheres; it also contains a narrow midline zone called the vermis.  A set of large folds are conventionally used to divide the overall structure into ten smaller lobules.\nBecause of its large number of tiny granule cells, the cerebellum contains more neurons than the rest of the brain put together, but it only takes up 10% of total brain volume. The cerebellum receives nearly 200 million input fibers; in contrast, the optic nerve is composed of a mere one million fibers.\nThe unusual surface appearance of the cerebellum conceals the fact that the bulk of the structure is made up of a very tightly folded layer of gray matter, the cerebellar cortex.  It has been estimated that if the human cerebellar cortex could be completely unfolded it would give rise to a layer of neural tissue about 1 meter long and 10 centimeters wide—a total surface area of 500-1000 square cm, all packed within a volume of 100-150 cubic cm.  Underneath the gray matter of the cortex lies white matter, made up largely of myelinated nerve fibers running to and from the cortex.  Embedded within the white matter—which is sometimes called the arbor vitae (Tree of Life) in the cerebellum because of its branched, tree-like appearance—are four deep cerebellar nuclei.\nThe cerebellum can be divided according to three different criteria: gross anatomical, phylogenetical, and functional.\n\n\n=== Gross anatomical divisions ===\nOn gross inspection, three lobes can be distinguished in the cerebellum: the flocculonodular lobe, the anterior lobe (rostral to the \"primary fissure\"), and the posterior lobe (dorsal to the \"primary fissure\"). The latter two can be further divided in a midline cerebellar vermis and lateral cerebellar hemispheres.\n\n\n=== Phylogenetic and functional divisions ===\nThe cerebellum can also be divided in three parts based on both phylogenetic criteria (the evolutionary age of each part) and on functional criteria (the incoming and outgoing connections each part has and the role played in normal cerebellar function). From the phylogenetically oldest to the newest, the three parts are:\n\nMuch of what is understood about the functions of the cerebellum stems from careful documentation of the effects of focal lesions in human patients who have suffered from injury or disease or through animal lesion research.\n\n\n=== Cellular anatomy ===\nAs explained in more detail in the Function section, the cerebellum differs from most other brain areas in that the flow of neural signals through it is almost entirely unidirectional:  there are virtually no backward connections between its neuronal elements.  Thus the most logical way to describe the cellular structure is to begin with the inputs and follow the sequence of connections through to the outputs.\n\n\n=== Deep nuclei ===\n\nThe four deep nuclei of the cerebellum are the  dentate, emboliform, globose, and fastigii nuclei and they act as the main centers of communication, sending and receiving information to and from specific parts of the brain. In addition, these nuclei receive both inhibitory and excitatory signals from other parts of the brain which in turn affect the nuclei's outgoing signals.(The globose and the emboliform nuclei make up the interposed nucleus).\n\n\n=== Cortical layers ===\n\nThe cytoarchitecture (cellular organization) of the cerebellum is highly uniform, with connections organized into a rough, three-dimensional array of perpendicular circuit elements. This organizational uniformity makes the nerve circuitry relatively easy to study.\nThere are three layers to the cerebellar cortex; from outer to inner layer, these are the molecular, Purkinje, and granular layers. The function of the cerebellar cortex is essentially to modulate information flowing through the deep nuclei. The microcircuitry of the cerebellum is schematized in Figure 5. Mossy and climbing fibers carry sensorimotor information into the deep nuclei, which in turn pass it on to various premotor areas, thus regulating the gain and timing of motor actions. Mossy and climbing fibers also feed this information into the cerebellar cortex, which performs various computations, resulting in the regulation of Purkinje cell firing. Purkinje neurons feed back into the deep nuclei via a potent inhibitory synapse. This synapse regulates the extent to which mossy and climbing fibers activate the deep nuclei, and thus control the ultimate effect of the cerebellum on motor function. The synaptic strength of almost every synapse in the cerebellar cortex has been shown to undergo synaptic plasticity. This allows the circuitry of the cerebellar cortex to continuously adjust and fine-tune the output of the cerebellum, forming the basis of some types of motor learning and coordination. Each layer in the cerebellar cortex contains the various cell types that comprise this circuitry.\n\n\n==== Molecular layer ====\nThis outermost layer of the cerebellar cortex contains two types of inhibitory interneurons: the stellate and basket cells. It also contains the dendritic arbors of Purkinje neurons and parallel fiber tracts from the granule cells. Both stellate and basket cells form GABAergic synapses onto Purkinje cell dendrites.\n\n\n==== Purkinje layer ====\nThe middle layer contains only one type of cell body—that of the large Purkinje cell. Purkinje cells are the primary integrative neurons of the cerebellar cortex and provide its sole output. Purkinje cell dendrites are large arbors with hundreds of spiny branches reaching up into the molecular layer (Fig. 6). These dendritic arbors are flat—nearly all of them lie in planes—with neighboring Purkinje arbors in parallel planes. Each parallel fiber from the granule cells runs orthogonally through these arbors, like a wire passing through many layers. Purkinje neurons are GABAergic—meaning they have inhibitory synapses—with the neurons of the deep cerebellar and vestibular nuclei in the brainstem. Each Purkinje cell receives excitatory input from 100,000 to 200,000 parallel fibers. Parallel fibers are said to be responsible for the simple (all or nothing, amplitude invariant) spiking of the Purkinje cell.\nPurkinje cells also receive input from the inferior olivary nucleus via climbing fibers. A good mnemonic for this interaction is the phrase \"climb the other olive tree\", given that climbing fibers originate from the contralateral inferior olive. In striking contrast to the 100,000-plus inputs from parallel fibers, each Purkinje cell receives input from exactly one climbing fiber; but this single fiber \"climbs\" the dendrites of the Purkinje cell, winding around them and making a large number of synapses as it goes. The net input is so strong that a single action potential from a climbing fiber is capable of producing a \"complex spike\" in the Purkinje cell:  a burst of several spikes in a row, with diminishing amplitude, followed by a pause during which simple spikes are suppressed.\nJust underneath the Purkinje layer are the Lugaro cells whose very long dendrites travel along the boundary between the Purkinje and the granular layers.\n\n\n==== Granular layer ====\nThe innermost layer contains the cell bodies of three types of cells: the numerous and tiny granule cells, the slightly larger unipolar brush cells and the much larger Golgi cells. Mossy fibers enter the granular layer from their main point of origin, the pontine nuclei. These fibers form excitatory synapses with the granule cells and the cells of the deep cerebellar nuclei. The granule cells send their T-shaped axons—known as parallel fibers—up into the superficial molecular layer, where they form hundreds of thousands of synapses with Purkinje cell dendrites. The human cerebellum contains on the order of 60 to 80 billion granule cells, making this single cell type by far the most numerous neuron in the brain (roughly 70% of all neurons in the brain and spinal cord, combined). Golgi cells provide inhibitory feedback to granule cells, forming a synapse with them and projecting an axon into the molecular layer.\n\n\n=== Relationship with cerebral cortex ===\nThe local field potentials of the neocortex and cerebellum oscillate coherently at (6–40 Hz)  in awake behaving animals. These appear to be under the control of output from the cerebral cortex. This output would be mediated by a pathway from layer 5/6 neurons in the neocortex through that project either to the pons or the inferior olive. If through the pons this would go to mossy fibers that synapse with granule and Golgi neurons with the granule cells then targeting Purkinje neurons via their excitatory parallel fibers. If the inferior olive it would go via excitatory climbing fiber inputs to Purkinje neurons. These return this output back to the cerebral cortex through the ventrolateral thalamus completing the loop.\nThe corticopontocerebellar pathway is the largest pathway associated with the cerebellum. Arising in the cerebral cortex these fibers first terminate ipsilaterally in the pontine nuclei. Then the fibers decussate and form the middle cerebellar peduncle, terminating in the cerebellar cortex as mossy fibers. This pathway transmits signals that inform the cerebellum about the movement in progress and the upcoming movement. This helps the continuous adjustment of motor activity.The initiation of the movement is relayed to cerebellum via the corticoreticulocerebellar pathway. Those synapse ipsilaterally in the reticular formation, then via the inferior and middle peduncles into the cerebellar vermis.The motor cortex and somatosensory cortex projects onto the ipsilateral inferior and accessory olivary nuclei, then forming the olivocerebellar tract. Cortico-olivary fibers synapse bilaterally in the inferior olivary nucleus. The order is preserved in the olivocerebellar tract projections onto the ‘body maps’ in the contralateral cerebellar cortex. Under resting conditions in animal experiments, groups of olivary neurons discharge synchronously at 5 to 10 Hz (impulses/s).  In the cerebellar cortex, the response of Purkinje cells takes the form of complex spikes.The cerebellum send its projections back to the cerebral cortex via the Cerebellothalamic tract.\nThe cerebellar lateral expansion, or the neocerebellum, may be associated with cognitive functions, and it is anatomically linked with the lateral prefrontal cortex. It shows greatest activity during speech, with a one-sided predominance consistent with a possible linkage (via the thalamus) with the motor speech area.When lesions occur in the association areas linked to the cerebellum by corticopontocerebellar fibres, the cognitive affective syndrome may occur. This results in cognitive defects in the form of diminished reasoning power, inattention, grammatical errors in speech, poor spatial sense, and patchy memory loss.\n\n\n=== Blood supply ===\n\nThree arteries supply blood to the cerebellum (Fig. 7): the superior cerebellar artery (SCA), anterior inferior cerebellar artery (AICA), and posterior inferior cerebellar artery (PICA).\nThe SCA branches off the lateral portion of the basilar artery, just inferior to its bifurcation into the posterior cerebral artery. Here, it wraps posteriorly around the pons (to which it also supplies blood) before reaching the cerebellum. The SCA supplies blood to most of the cerebellar cortex, the cerebellar nuclei, and the superior cerebellar peduncles.The AICA branches off the lateral portion of the basilar artery, just superior to the junction of the vertebral arteries. From its origin, it branches along the inferior portion of the pons at the cerebellopontine angle before reaching the cerebellum. This artery supplies blood to the anterior portion of the inferior cerebellum, the middle cerebellar peduncle, and to the facial (CN VII) and vestibulocochlear nerves (CN VIII). Obstruction of the AICA can cause paresis, paralysis, and loss of sensation in the face; it can also cause hearing impairment. Moreover, it could cause an infarct of the cerebellopontine angle. This could lead to hyperacusia (dysfunction of the stapedius muscle, innervated by CN VII) and vertigo (wrong interpretation from the vestibular semi-circular canal's endolymph acceleration caused by alteration of CN VIII).\nThe PICA branches off the lateral portion of the vertebral arteries just inferior to their junction with the basilar artery. Before reaching the inferior surface of the cerebellum, the PICA sends branches into the medulla, supplying blood to several cranial nerve nuclei. In the cerebellum, the PICA supplies blood to the posterior inferior portion of the cerebellum, the inferior cerebellar peduncle, the nucleus ambiguus, the vagus motor nucleus, the spinal trigeminal nucleus, the solitary nucleus, and the vestibulocochlear nuclei.\n\n\n=== Variations among vertebrates ===\nThere is considerable variation in the size and shape of the cerebellum in different vertebrate species. It is generally largest in cartilaginous and bony fish, birds, and mammals, but somewhat smaller in reptiles. The large paired and convoluted lobes found in humans are typical of mammals, but the cerebellum is generally a single median lobe in other groups, and is either smooth or only slightly grooved. In mammals, the neocerebellum is the major part of the cerebellum by mass, but in other vertebrates, it is typically the spinocerebellum.In amphibians, lampreys, and hagfish the cerebellum is little developed; in the latter two groups it is barely distinguishable from the brain-stem. Although the spinocerebellum is present in these groups, the primary structures are small paired nuclei corresponding to the vestibulocerebellum.\n\n\n== Peduncles ==\nThe cerebellum follows the general groups-of-three pattern found in anatomy, with three major input and output cerebellar peduncles (fiber bundles). These are the superior (brachium conjunctivum), middle (brachium pontis), and inferior (restiform and juxtarestiform bodies) cerebellar peduncles.\n\nThere are three sources of input to the cerebellum, in two categories consisting of mossy and climbing fibers, respectively. Mossy fibers can originate from the pontine nuclei, which are clusters of neurons located in the pons that carry information from the contralateral cerebral cortex. They may also arise within the spinocerebellar tract whose origin is located in the ipsilateral spinal cord. Most of the output from the cerebellum initially synapses onto the deep cerebellar nuclei before exiting via the three peduncles. The most notable exception is the direct inhibition of the vestibular nuclei by Purkinje cells.\n\n\n== Development ==\nDuring the early stages of embryonic development, the brain starts to form in three distinct segments: the prosencephalon, mesencephalon, and rhombencephalon. The rhombencephalon is the most caudal (toward the tail) segment of the embryonic brain; it is from this segment that the cerebellum develops. Along the embryonic rhombencephalic segment develop eight swellings, called rhombomeres. The cerebellum arises from two rhombomeres located in the alar plate of the neural tube, a structure that eventually forms the brain and spinal cord. The specific rhombomeres from which the cerebellum forms are rhombomere 1 (Rh.1) caudally (near the tail) and the \"isthmus\" rostrally (near the front).Two primary regions are thought to give rise to the neurons that make up the cerebellum. The first region is the ventricular zone in the roof of the fourth ventricle. This area produces Purkinje cells and deep cerebellar nuclear neurons. These cells are the primary output neurons of the cerebellar cortex and cerebellum. The second germinal zone (cellular birthplace) is known as the Rhombic lip, neurons then move by human embryonic week 27 to the external granular layer. This layer of cells—found on the exterior of the cerebellum—produces the granule neurons. The granule neurons migrate from this exterior layer to form an inner layer known as the internal granule layer. The external granular layer ceases to exist in the mature cerebellum, leaving only granule cells in the internal granule layer. The cerebellar white matter may be a third germinal zone in the cerebellum; however, its function as a germinal zone is controversial.\n\n\n== Additional images ==\n\n\t\t\n\t\t\n\t\t\n\n\n== References =="