"The stratum corneum (Latin for 'horny layer') is the outermost layer of the epidermis. The stratum corneum is the dead tissue that performs protective and adaptive physiological functions including mechanical shear, impact resistance, water flux and hydration regulation, microbial proliferation and invasion regulation, initiation of inflammation through cytokine activation and dendritic cell activity, and selective permeability to exclude toxins, irritants, and allergens.  This layer is composed of 15–20 layers of flattened cells with no nuclei and cell organelles. Their cytoplasm shows filamentous keratin.  These corneocytes are embedded in a lipid matrix composed of ceramides, cholesterol, and fatty acids.The stratum corneum functions to form a barrier to protect underlying tissue from infection, dehydration, chemicals and mechanical stress. Desquamation, the process of cell shedding from the surface of the stratum corneum, balances proliferating keratinocytes that form in the stratum basale. These cells migrate through the epidermis towards the surface in a journey that takes approximately fourteen days.\n\n\n== Function ==\nDuring cornification, the process whereby living keratinocytes are transformed into non-living corneocytes, the cell membrane is replaced by a layer of ceramides which become covalently linked to an envelope of structural proteins (the cornified envelope).\nThis complex surrounds cells in the stratum corneum and contributes to the skin's barrier function. Corneodesmosomes (modified desmosomes) facilitate cellular adhesion by linking adjacent cells within this epidermal layer. These complexes are degraded by proteases, eventually permitting cells to be shed at the surface. Desquamation and formation of the cornified envelope are both required for the maintenance of skin homeostasis. A failure to correctly regulate these processes leads to skin disorders developing.Cells of the stratum corneum contain a dense network of keratin, a protein that helps keep the skin hydrated by preventing water evaporation. These cells can also absorb water, further aiding in hydration. In addition, this layer is responsible for the \"spring back\" or stretchy properties of skin. A weak glutenous protein bond pulls the skin back to its natural shape.\nThe thickness of the stratum corneum varies throughout the body. In the palms of the hands and the soles of the feet (sometimes knees, elbows, knuckles,) this layer is stabilized and built by the stratum lucidum (clear phase) which allows the cells to concentrate keratin and toughen them before they rise into a typically thicker, more cohesive SC.  The mechanical stress of heavy structural strain causes this SL phase in these regions which require additional protection in order to grasp objects, resist abrasion or impact, and avoid injury. In general, the stratum corneum contains 15 to 20 layers of corneocytes. The stratum corneum has a thickness between 10 and 40 μm.\nIn reptiles, the stratum corneum is permanent, and is replaced only during times of rapid growth, in a process called ecdysis or moulting. This is conferred by the presence of beta-keratin, which provides a much more rigid skin layer.\nIn the human forearm, about 1300 cells per cm2 per hour are shed.\nStratum corneum protects the internal structures of the body from external injury and bacterial invasion.\n\n\n== Skin disease ==\nAn inability to correctly maintain the skin barrier function due to the dysregulation of epidermal components can lead to skin disorders. For example, a failure to modulate the activity of kallikreins via the disruption of the protease inhibitor LEKTI causes the debilitating disorder Netherton syndrome.\n\nHyperkeratosis is an increased thickness of the stratum corneum, and is an unspecific finding, seen in many skin conditions.\n\n\n== See also ==\nEpidermis (skin)\nStratum granulosum\nStratum spinosum\nstratum corneum tryptic enzyme, old name for KLK5\n\n\n== References ==\n\n\n== External links ==\nMedEd at Loyola medicine/dermatology/melton/skinlsn/stcorn.htm\nHistology image: 08422loa – Histology Learning System at Boston University - \"Integument: thick skin\""