"Invisible Cities (Italian: Le città invisibili) is a novel by Italian writer Italo Calvino. It was published in Italy in 1972 by Giulio Einaudi Editore.\n\n\n== Description ==\nThe book explores imagination and the imaginable through the descriptions of cities by an explorer, Marco Polo. The book is framed as a conversation between the elderly and busy emperor Kublai Khan, who constantly has merchants coming to describe the state of his expanding and vast empire, and Polo. The majority of the book consists of brief prose poems describing 55 fictitious cities that are narrated by Polo, many of which can be read as parables or meditations on culture, language, time, memory, death, or the general nature of human experience. \nShort dialogues between Kublai and Polo are interspersed every five to ten cities discussing these topics. These interludes between the two characters are no less poetically constructed than the cities, and form a framing device that plays with the natural complexity of language and stories. In one key exchange in the middle of the book, Kublai prods Polo to tell him of the one city he has never mentioned directly—his hometown. Polo's response: \"Every time I describe a city I am saying something about Venice.\"\n\n\n== Historical background ==\nInvisible Cities deconstructs an archetypal example of the travel literature genre, The Travels of Marco Polo, which depicts the journey of the famed Venetian merchant across Asia and in Yuan China (Mongol Empire). The original 13th-century travelogue shares with Calvino's novel the brief, often fantastic accounts of the cities Polo claimed to have visited, along with descriptions of the city's inhabitants, notable imports and exports, and whatever interesting tales Polo had heard about the region. \n\n\n== Structure ==\nOver the nine chapters, Marco describes a total of fifty-five cities, all women's names. The cities are divided into eleven thematic groups of five each:\n\nCities & Memory\nCities & Desire\nCities & Signs\nThin Cities\nTrading Cities\nCities & Eyes\nCities & Names\nCities & the Dead\nCities & the Sky\nContinuous Cities\nHidden CitiesHe moves back and forth between the groups, while moving down the list, in a rigorous mathematical structure. The table below lists the cities in order of appearance, along with the group they belong to:\n\nIn each of the nine chapters, there is an opening section and a closing section, narrating dialogues between the Khan and Marco. The descriptions of the cities lie between these two sections.\nThe matrix of eleven column themes and fifty-five subchapters (ten rows in chapters 1 and 9, five in all others) shows some interesting properties. Each column has five entries, rows only one, so there are fifty-five cities in all. The matrix of cities has a central element (Baucis). The pattern of cities is symmetric with respect to inversion about that center. Equivalently, it is symmetric against 180 degree rotations about Baucis.  Inner chapters (2-8 inclusive) have diagonal cascades of five cities (e.g. Maurila through Euphemia in chapter 2).  These five-city cascades are displaced by one theme column to the right as one proceeds to the next chapter. In order that the cascade sequence terminate (the book of cities is not infinite!) Calvino, in chapter 9, truncates the diagonal cascades in steps: Laudomia through Raissa is a cascade of four cities, followed by cascades of three, two, and one, necessitating ten cities in the final chapter.  The same pattern is used in reverse in chapter 1 as the diagonal cascade of cities is born. This strict adherence to a mathematical pattern is characteristic of the Oulipo literary group to which Calvino belonged.\n\n\n== Awards ==\nThe book was nominated for the Nebula Award for Best Novel in 1975.\n\n\n== Opera ==\nInvisible Cities (and in particular the chapters about Isidora, Armilla, and Adelma) is the basis for an opera by composer Christopher Cerrone, first produced by The Industry in October 2013 as an experimental production at Union Station in Los Angeles. In this site-specific production directed by Yuval Sharon, the performers, including eleven musicians, eight singers, and eight dancers, were located in (or moved through) different parts of the train station, while the station remained open and operating as usual. The performance could be heard by about 200 audience members, who wore wireless headphones and were allowed to move through the station at will.  An audio recording of the opera was released in November 2014. The opera was named a finalist for the 2014 Pulitzer Prize for Music.\n\n\n== See also ==\n\nRoland Barthes\nOulipo\nStructuralism\nSurrealism\nThe Decameron\n\n\n== References ==\n\n\n== External links ==\nthe Invisible Cities become visible\nExcerpts from Invisible Cities\nReview by Jeannette Winterson\nItalo Calvino sparks obsessions\nErasing the Invisible Cities - essay by John Welsh, University of Virginia\nFabulous Calvino by Gore Vidal in The New York Review of Books (Subscription Required)\nCalvino's Urban Allegories by Franco Ferrucci in The New York Times\nInvisible Cities Illustrated\nFällt - Invisible Cities - Portraits of the world's cities painted with sound\nSilvestri, Paolo, \"After-word. 'Invisible cities': which (good-bad) man? For which (good-bad) polity?\", in P. Heritier, P. Silvestri (eds.), Good government, Governance and Human Complexity. Luigi Einaudi’s Legacy and Contemporary Society, Leo Olschki, Firenze, 2012, pp. 313-332. https://ideas.repec.org/p/pra/mprapa/59535.html"