"Gershom Scholem (Hebrew: גֵרְשׁׂם שָׁלוֹם‎) (December 5, 1897 – February 21, 1982), was a German-born Israeli philosopher and historian. He is widely regarded as the founder of the modern, academic study of Kabbalah. He was  the first professor of Jewish Mysticism at Hebrew University of Jerusalem. His close friends included Theodore Adorno, Hannah Arendt, Walter Benjamin and Leo Strauss, and selected letters from his correspondence with those philosophers have been published. He was also friendly with the author Shai Agnon and the Talmudic scholar Saul Lieberman.\nScholem is best known for his collection of lectures, Major Trends in Jewish Mysticism (1941) and for his biography Sabbatai Zevi, the Mystical Messiah (1957). His collected speeches and essays, published as On Kabbalah and its Symbolism (1965), helped to spread knowledge of Jewish mysticism among both Jews and non-Jews.\n\n\n== Biography ==\n\nGerhard (Gershom) Scholem was born in Berlin to Arthur Scholem and Betty Hirsch Scholem. His  father was a printer. His older brother was the German Communist leader Werner Scholem. He studied Hebrew and Talmud with an Orthodox rabbi.\nScholem met Walter Benjamin in Munich in 1915, when the former was seventeen years old and the latter was twenty-three. They began a lifelong friendship that ended when Benjamin committed suicide in 1940 in the wake of Nazi persecution. Scholem dedicated his book Major Trends in Jewish Mysticism (Die jüdische Mystik in ihren Hauptströmungen), based on lectures 1938–1957, to  Benjamin. In 1915 Scholem enrolled at the Frederick William University in Berlin (today, Humboldt University), where he studied mathematics, philosophy, and Hebrew. There he met Martin Buber, Shmuel Yosef Agnon, Hayim Nahman Bialik, Ahad Ha'am, and Zalman Shazar.\nIn Berlin, Scholem befriended  Leo Strauss and corresponded with him throughout his life. He studied mathematical logic at the University of Jena under Gottlob Frege. He was in Bern in 1918 with Benjamin when he met Elsa (Escha) Burchhard, who became his first wife. Scholem returned to Germany in 1919, where he received a degree in Semitic languages at the Ludwig Maximilian University of Munich. Together with Benjamin he established a fictitious school - the  University of Muri.\nScholem wrote his doctoral thesis on the oldest known kabbalistic text, Sefer ha-Bahir. The following year it appeared in book form as \"Das Buch Bahir\", having been published by his father's publishing house.\nDrawn to Zionism and influenced by Buber, he immigrated in 1923 to the British Mandate of Palestine. He  became a librarian, heading the Department of Hebrew and Judaica at the National Library. In 1927 he revamped the Dewey Decimal System, making it appropriate for large Judaica collections. Scholem's brother Werner was a member of the ultra-left \"Fischer-Maslow Group\" and the youngest ever member of the Reichstag, representing the Communist Party (KPD) in the German parliament. He was expelled from the party and later murdered by the Nazis during the Third Reich. Gershom Scholem, unlike his brother, was vehemently opposed to both Communism and Marxism. In 1936, he married his second wife, Fania Freud. Fania, who had been his student and could read Polish, was helpful in his later research, particularly in regard to Jacob Frank.\nIn 1946 Scholem was sent by the Hebrew University to search for Jewish books that had been plundered by the Nazis and help return them to their rightful owners. He spent much of the year in Germany and Central Europe as part of this project, known as \"Otzrot HaGolah\".\nScholem died in Jerusalem, where he is buried next to his wife in the Sanhedria Cemetery. Jürgen Habermas delivered the eulogy.\n\n\n== Academic career ==\nHe became a lecturer at the Hebrew University of Jerusalem. Scholem taught the Kabbalah and mysticism from a scientific point of view and became the first professor of Jewish mysticism at the university in 1933, working in this post until his retirement in 1965, when he became an emeritus professor. \n\nScholem directly contrasted his historiographical approach on the study of Jewish mysticism with the approach of the 19th-century school of the Wissenschaft des Judentums (\"Science of Judaism\"), which sought to submit the study of Judaism to the discipline of subjects such as history, philology, and philosophy. According to Jeremy Adler, Scholem's thinking was \"both recognizably Jewish and deeply German,\" and \"changed the course of twentieth-century European thought.\"Jewish mysticism was seen as Judaism's weakest scholarly link. Scholem told the story of his early research when he was directed to a prominent rabbi who was an expert on Kabbalah. Seeing the rabbi's many books on the subject, Scholem asked about them, only to be told: \"This trash? Why would I waste my time reading nonsense like this?\" (Robinson 2000, p. 396)\nThe analysis of Judaism carried out by the Wissenschaft school was flawed in two ways, according to Scholem: It studied Judaism as a dead object rather than as a living organism; and it did not consider the proper foundations of Judaism, the non-rational force that, in Scholem's view, made the religion a living thing.\nIn Scholem's opinion, the mythical and mystical components were at least as important as the rational ones, and he thought that they, rather than the minutiae of Halakha, were the truly living core of Judaism. In particular, he disagreed with what he considered to be Martin Buber's personalization of Kabbalistic concepts as well as what he argued was an inadequate approach to Jewish history, Hebrew language, and the land of Israel.\nIn the Weltanschauung of Scholem, the research of Jewish mysticism could not be separated from its historical context. Starting from something similar to the Gegengeschichte of  Friedrich Nietzsche he ended up including less normative aspects of Judaism in the public history.\nSpecifically, Scholem thought that Jewish history could be divided into three periods:\n\nDuring the Biblical period, monotheism battles myth, without completely defeating it.\nDuring the Talmudic period, some of the institutions—for example, the notion of the magical power of the accomplishment of the Sacraments—are removed in favour of the purer concept of the divine transcendence.\nDuring the medieval period, the impossibility of reconciling the abstract concept of God of Greek philosophy with the personal God of the Bible, led Jewish thinkers, such as Maimonides, to try to eliminate the remaining myths and to modify the figure of the living God. After this time, mysticism, as an effort to find again the essence of the God of their fathers, became more widespread.The notion of the three periods, with its interactions between rational and irrational elements in Judaism, led Scholem to put forward some controversial arguments. He thought that the 17th century messianic movement, known as Sabbatianism, was developed from the Lurianic Kabbalah. In order to neutralize Sabbatianism, Hasidism had emerged as a Hegelian synthesis. Many of those who joined the Hasidic movement, because they had seen in it an Orthodox congregation, considered it scandalous that their community should be associated with a heretical movement.\nIn the same way, Scholem produced the hypothesis that the source of the 13th century Kabbalah was a Jewish gnosticism that preceded Christian gnosticism.\nThe historiographical approach of Scholem also involved a linguistic theory. In contrast to Buber, Scholem believed in the power of the language to invoke supernatural phenomena. In contrast to Walter Benjamin, he put the Hebrew language in a privileged position with respect to other languages, as the only language capable of revealing the divine truth. His special regard for the spiritual potency of the Hebrew language was expressed in his 1926 letter to Franz Rosenzweig  regarding his concerns over the \"secularization\" of Hebrew. Scholem considered the Kabbalists as interpreters of a pre-existent linguistic revelation.\n\n\n== Debate with Hannah Arendt ==\nIn the aftermath of the Eichmann trial in Jerusalem, Scholem sharply criticised Hannah Arendt's book, Eichmann in Jerusalem: A Report on the Banality of Evil and decried her lack of solidarity with the Jewish people (ahavath Yisrael). Arendt responded that she never loved any collective group, and that she does not love the Jewish people but was only part of them. The bitter fight, which was exchanged in various articles, made Scholem break off ties with Arendt and refuse to forgive her. Scholem wrote to Hans Paeschke that he \"knew Hannah Arendt when she was a socialist or half-communist and...when she was a Zionist. I am astounded by her ability to pronounce upon movements in which she was once so deeply engaged, in terms of a distance measured in light years and from such sovereign heights.\" Interestingly, whereas Arendt felt that Eichmann should be executed, Scholem was opposed, fearing that his execution would serve to alleviate the Germans' collective sense of guilt.\nVarious other Israeli and Jewish academics also broke off ties with Arendt, claiming that her lack of solidarity with the Jewish people in their time of need was appalling, along with her victimization of various Nazis. Before the Eichmann trial, Scholem also opposed Arendt's interpretation (in letters and the introduction to Illuminations) of Walter Benjamin as a Marxist thinker who predated the New Left. For Scholem, Benjamin had been an essentially religious thinker, whose turn to Marxism had been merely an unfortunate, but inessential and superficial, expedient.\n\n\n== Awards and recognition ==\nIn 1958, Scholem was awarded the Israel Prize in Jewish studies.\nIn 1968, he was elected president of the Israel Academy of Sciences and Humanities.\nIn 1969, he received the Yakir Yerushalayim (Worthy Citizen of Jerusalem) award.\nIn 1977, he was awarded the Bialik Prize for Jewish thought.\n\n\n== Literary influence ==\n\nVarious stories and essays of the Argentinian writer Jorge Luis Borges were inspired or influenced by Scholem's books. He has also influenced ideas of Umberto Eco, Jacques Derrida, Harold Bloom, Italian  philosopher Giorgio Agamben, and George Steiner. American author Michael Chabon cites Scholem's essay, The Idea of the Golem, as having assisted him in conceiving the Pulitzer-Prize winning book The Amazing Adventures of Kavalier and Clay.\n\n\n== Selected works in English ==\nMajor Trends in Jewish Mysticism, 1941\nJewish Gnosticism, Merkabah Mysticism, and the Talmudic Tradition, 1960\nArendt and Scholem, \"Eichmann in Jerusalem: Exchange of Letters between Gershom Scholem and Hannah Arendt\", in Encounter, 22/1, 1964\nThe Messianic Idea in Judaism and other Essays on Jewish Spirituality, trans. 1971\nSabbatai Sevi: The Mystical Messiah, 1973\nFrom Berlin to Jerusalem: Memories of My Youth, 1977; trans. Harry Zohn, 1980.\nKabbalah, Meridian 1974, Plume Books 1987 reissue: ISBN 0-452-01007-1\nWalter Benjamin: the Story of a Friendship, trans. Harry Zohn. New York: Schocken Books, 1981.\nOrigins of the Kabbalah, JPS, 1987 reissue: ISBN 0-691-02047-7\nOn the Mystical Shape of the Godhead: Basic Concepts in the Kabbalah, 1997\nThe Fullness of Time: Poems, trans. Richard Sieburth\nOn Jews and Judaism in Crisis: Selected Essays\nOn the Kabbalah and Its Symbolism\nZohar — The Book of Splendor: Basic Readings from the Kabbalah, ed.\nOn History and Philosophy of History, in \"Naharaim: Journal for German-Jewish Literature and Cultural History\", v, 1-2 (2011), pp. 1–7.\nOn Franz Rosenzweig and his Familiarity with Kabbala Literature, in \"Naharaim: Journal for German-Jewish Literature and Cultural History\", vi, 1 (2012), pp. 1–6.\n\n\n== See also ==\nMartin Buber\nAbraham Joshua Heschel\nJoseph Dan\nRachel Elior\nArthur Green\n\n\n== References ==\n\n\n== Further reading ==\nAvriel Bar-Levav, On the Absence of a Book from a Library: Gershom Scholem and the Shulhan Arukh. Zutot: Perspectives on Jewish Culture 6 (2009): 71-73\nEngel Amir, Gershom Scholem: An Intellectual Biography, University of Chicago Press, 2017.\nBiale, David. Gershom Scholem: Kabbalah and Counter-History, second ed., 1982.\nBloom, Harold, ed. Gershom Scholem, 1987.\nCampanini, Saverio, A Case for Sainte-Beuve. Some Remarks on Gershom Scholem's Autobiography, in P. Schäfer - R. Elior (edd.), Creation and Re-Creation in Jewish Thought. Festschrift in Honor of Joseph Dan on the Occasion of his 70th Birthday, Tübingen 2005, pp. 363–400.\nCampanini, Saverio, Some Notes on Gershom Scholem and Christian Kabbalah, in Joseph Dan (ed.), Gershom Scholem in Memoriam, Jerusalem Studies in Jewish Thought, 21 (2007), pp. 13–33.\nF. Dal Bo, Between sand and stars: Scholem and his translation of Zohar 22a-26b [Ita.], in \"Materia Giudaica\", VIII, 2, 2003, pp. 297–309 –  Analysis of Scholem's translation of Zohar I, 22a-26b\nJacobson, Eric, Metaphysics of the Profane - The Political Theology of Walter Benjamin and Gershom Scholem, (Columbia University Press, NY, 2003).\nLucca, Enrico, Between History and Philosophy of History. Comments on an unpublished Document by Gershom Scholem, in \"Naharaim\", v, 1-2 (2011), pp. 8–16.\nLucca, Enrico, Gershom Scholem on Franz Rosenzweig and the Kabbalah. Introduction to the Text, in \"Naharaim\", vi, 1 (2012), pp. 7–19.\nMirsky, Yehudah, \"Gershom Scholem, 30 Years On\", (Jewish Ideas Daily, 2012).\nHeller Wilensky, Sarah, See the letters from Joseph Weiss to Sarah Heller Wilensky in \"Joseph Weiss, Letters to Ora\" in A. Raoport-Albert (Ed.) Hasidism reappraised. London: Littman Press, 1977.\nRobinson, G. Essential Judaism, Pocket Books, 2000.\n\n\n== External links ==\nAudio of Gershom Scholem lecturing on Kabbalah in 1975\nBiography at the Jewish Virtual Library\n\"Gershom Scholem & the Study of Mysticism\", MyJewishLearning.com\nBiographical page created by Sharon Naveh\nOrthodoxy and the Scholem Moment, by Zvi Leshem"