"Social anarchism is the branch of anarchism that sees individual freedom as interrelated with mutual aid. Social anarchist thought emphasizes community and social equality as complementary to autonomy and personal freedom. It attempts to accomplish this balance through freedom of speech, which is maintained in a decentralized federalism, with freedom of interaction in thought and subsidiarity. Subsidiarity is best defined as \"that one should not withdraw from individuals and commit to the community what they can accomplish by their own enterprise and industry\" and that \"[f]or every social activity ought of its very nature to furnish help to the members of the body social, and never destroy and absorb them\", or the slogan \"Do not take tools out of people's hands\".Social anarchism has been the dominant form of anarchism. As a label or term, social anarchism is used in contrast to individualist anarchism to describe the theory that places an emphasis on the communitarian and cooperative aspects in anarchist theory while also opposing authoritarian forms of communitarianism associated with groupthink and collective conformity, favoring a reconciliation between individuality and sociality. Self-determination, worker's self-management, education and empowerment are all emphasized in social anarchism, while illegitimate authority is removed through inspection and vigilance. A do-it-yourself mentality is combined with educational efforts within the social realm. Social anarchism advocates the conversion and use of a portion of present-day and future productive private property to be made into social property that can be used as an alternative to capitalist production and exploitative wage labor. Social anarchist thought advocates social property to offer individual empowerment through easier access to tools and a sharing of the commons while retaining respect for personal property.Social anarchism is considered an umbrella term that mainly refers to the post-capitalist economic models of anarcho-communism, collectivist anarchism and sometimes mutualism. It can also include non-state controlled federated guild socialist, dual power industrial democracy and economic democracy, or federated worker cooperatives and workers' and consumers' councils replacing much of the present state system whilst retaining basic rights. In addition, it includes the trade union approach of anarcho-syndicalism, the social struggle strategies of platformism and specifism and the environmental philosophy of social ecology. As a term, social anarchism overlaps with libertarianism, libertarian socialism and left-libertarianism, emerging in the late 19th century as a distinction from individualist anarchism after anarcho-communism replaced collectivist anarchism as the dominant tendency.Social anarchism has been described as the collectivist or socialist wing of anarchism as well as representing socialist-aligned forms of anarchism, being contrasted with the liberal-socialist wing represented by individualist anarchism. Nonetheless, several of those collectivist or communist anarchists have supported their theories on radical individualist grounds, seeing collectivism or communism as the best social system for the realization of individual freedom. The very idea of an individualist–socialist divide is also contested as individualist anarchism is largely socialistic and influenced each other. Carl Landauer summarized the difference between individualist and social anarchists by stating that \"the communist anarchists also do not acknowledge any right to society to force the individual. They differ from the anarchistic individualists in their belief that men, if freed from coercion, will enter into voluntary associations of a communistic type, while the other wing believes that the free person will prefer a high degree of isolation\".\n\n\n== Overview ==\nAnarchist socialism, anarcho-socialism and socialist anarchism are terms used to refer to social anarchism, but this is rejected by most anarchists since they generally consider themselves socialists of the libertarian tradition and are seen as unnecessary and confusing when not used as synonymous for libertarian or stateless socialism vis-à-vis authoritarian or state socialism. Anarchism has been historically identified with the socialist and anti-capitalist movement, with the main divide being between anti-market anarchists who support some form of decentralized economic planning and pro-market anarchists who support anti-capitalist market socialism. Those terms are mainly used by anarcho-capitalism theorists and scholars who recognize anarcho-capitalism to differentiate between the two. For similar reasons, anarchists also reject categorizations such as left anarchism and right anarchism (anarcho-capitalism), seeing anarchism as a radical left-wing or far-left ideology.While some anarcho-capitalist theorists and scholars divide anarchism into the mutually exclusive individualist anarchism (capitalism) and social anarchism (socialism), anarchist theorists and scholars reject this. Anarchists do not see such a struggle between individualist anarchism and social anarchism which are seen as complementary rather than mutually exclusive, with their differences mainly being based on the means to attain anarchy rather than on their ends. Several anarchists argued that the struggle within anarchism is not between socialists and capitalists, but rather between anarchists and non-anarchists.Anti-capitalism is considered a necessary element of anarchism by most anarchists. Arguing against some anarcho-capitalist theorists and scholars who see individualist anarchism as pro-capitalist, anarchists and scholars have put it in the socialist camp, meaning anti-statist and libertarian socialism. In addition, anarcho-communists regard themselves as radical individualists, seeing anarcho-communism as the best social system for the realization of individual freedom. Anarchism is an individualist philosophy that oppose all forms of authoritarian collectivism, but one which does see the individual and the community as complementary rather than mutually exclusive, with anarcho-communism and social anarchism in particular most rejecting the individualist–collectivist dichotomy. Notwithstanding the name, collectivist anarchism is seen as a blend of individualism and collectivism. In the United States, social anarchism may refer to Murray Bookchin's circle and its omonymous journal.To differentiate it from individualist anarchism, anarchists prefer using social anarchism, a term used to characterize certain strides of anarchism vis-à-vis individualist anarchism, rather than seeing the two categories as mutually exclusive or as socialist vis-à-vis capitalism. The former focuses on the social aspect and tends to be more organisational as well as supporting decentralised economic planning while the latter focuses on the individual aspect and tends to be more anti-organisational as well as supporting free-market forms of socialism or no specific forms of anarchist economics. This led to anarchism without adjectives. The mutualist theory of Pierre-Joseph Proudhon is seen as the middle or third category between social anarchism and individualist anarchism, although it is often considered part of social anarchism and sometimes part of individualist anarchism. Proudhon spoke of social individualism and described the mutualism and the freedom it pursued as the synthesis between communism and property.Social anarchism sees \"individual freedom as conceptually connected with social equality and emphasize community and mutual aid\". It rejects private property, seeing it as a source of social inequality, positing instead a future society in which private property does not exist and is replaced by reciprocity and egalitarian society. As a term, social anarchism is used to describe tendencies within anarchism that have an emphasis on the communitarian and cooperative aspects of anarchist theory and practice, aiming for the \"free association of people living together and cooperating in free communities\". Bookchin identifies social anarchism with the left, by which he refers to the \"great tradition of human solidarity and a belief in the potentiality for humanness, [...] the internationalism and confederalism, the democratic spirit, antimilitarism, and the rational secularism\".\n\n\n== Historical currents ==\n\nSocial anarchism emphasizes mutual aid, social ownership and workers' self-management. Social anarchism has been the dominant form of classical anarchism and includes the major collectivist, communist and syndicalist schools of anarchist thought. Mutualism is also sometimes included within this social anarchism tradition, although it is mainly advocated by individualist anarchists.\nThe social ownership advocated by social anarchists can come through collective ownership as with Bakuninists and collectivist anarchists; common ownership as with communist anarchists; and cooperative ownership as with mutualist and syndicalist anarchists.\nIt has come in both peaceful and insurrectionary as well as anti-organizationalist and platformist tendencies. It operates heavily within labour syndicates, trade unions and workers' movements, emphasizing the liberation of workers through class struggle.\n\n\n=== Mutualism ===\n\nMutualism emerged from early 19th century socialism and is generally considered a market-oriented strand within the libertarian socialist tradition. Originally developed by Pierre-Joseph Proudhon, mutualism typically accepts property rights, but with brief abandonment time periods. In a community in which mutuality property rules were upheld, a landowner would need to make continuous use of the land. If failing to do so, the ownership rights would be extinguished and the land could be homesteaded by someone else. A mutualist property regime is often described as one rooted in possession, occupancy-and-use, or usufruct.Already in 1840, with the publication of What Is Property?, Proudhon supported industrial democracy, preaching \"emancipation to the proletaires; association to the labourers\" and that leaders within industry \"must be chosen from the labourers by the labourers themselves\". In his manifesto for the 1848 French Constituent Assembly election, Proudhon called for \"democratically organised workers' associations\" to run large-scale industry.Mutualism is also associated with the economic views of 19th century American individualist anarchists such as Benjamin Tucker and William Batchelder Greene. For American anarchist historian Eunice Minette Schuster, \"[i]t is apparent [...] that Proudhonian Anarchism was to be found in the United States at least as early as 1848 and that it was not conscious of its affinity to the Individualist Anarchism of Josiah Warren and Stephen Pearl Andrews. [...] William B. Greene presented this Proudhonian Mutualism in its purest and most systematic form\". Today, Kevin Carson is a contemporary mutualist and author of Studies in Mutualist Political Economy who describes this work as \"an attempt to revive individualist anarchist political economy, to incorporate the useful developments of the last hundred years, and to make it relevant to the problems of the twenty-first century\".Murray Bookchin, a prominent social anarchist, has held different views regarding Proudhon and mutualism, ranging from describing Proudhon as an \"artisanal socialist\" to excluding him from the socialist camp. According to Bookchin, \"Proudhon envisions a free society as one in which small craftsmen, peasants, and collectively owned industrial enterprises negotiate and contract with each other to satisfy their material needs. Exploitation is brought to an end. [...] Although these views involve a break with capitalism, by no means can they be regarded as communist ideas\". According to the authors of An Anarchist FAQ, \"[i]t is significant that the first work to call itself anarchist opposed property along with the state, exploitation along with oppression and supported self-management against hierarchical relationships within production\". Iain McKay reports that Proudhon's socialism was a form of \"'artisanal socialism' (as Marx and Engels recongised). Indeed, [Bookchin] notes that Proudhon was its 'most famous advocate' and that 'nearly all so-called 'utopian' socialists, even [Robert] Owen — the most labour-orientated — as well as Proudhon — essentially sought the equitable distribution of property'\".In the second volume of The Third Revolution, Bookchin argued that \"'Proudhon was no socialist' simply because he favoured 'private property.' [...] However, he does note the 'one moral provision [that] distinguished the Proudhonist contract from the capitalist contract' namely 'it abjured profit and exploitation'\". The writers of An Anarchist FAQ argue that Bookchin was wrong in excluding Proudhon and mutualism from the socialist and social anarchist camp, concluding that \"[g]iven Proudhon's opposition to wage labour and capitalist property and his support for industrial democracy as an alternative, Bookchin's position is untenable — he confuses socialism with communism, rejecting as socialist all views which are not communism (a position he shares with right-libertarians)\".\n\n\n=== Collectivist anarchism ===\n\nCollectivist anarchism is a revolutionary form of anarchism commonly associated with Mikhail Bakunin and James Guillaume. It is a specific tendency, not to be confused with the broad category sometimes called collectivist or communitarian anarchism.The tendency emerged from the most radical wing of mutualism during the late 1860s. Unlike mutualists, collectivist anarchists oppose all private ownership of the means of production, instead advocating that ownership be collectivized, being made the joint property of the commune (municipality). This was to be achieved through violent revolution, first starting with a small cohesive group through acts of armed insurrection, or propaganda by the deed, which would inspire the workers and peasants as a whole to revolt and forcibly collectivize the means of production.Collectivization was not to be extended to the distribution of income as workers would be paid according to time worked, rather than receiving goods being distributed \"according to need\" as in anarcho-communism. This position was criticised by later anarcho-communists as effectively \"uphold[ing] the wages system\". While individualist anarchists advocate free-markets and mutualist property rights, seeing state interventions as distorting free competition, collectivist anarchists see such interventions as \"merely prop up\" for a \"system of class exploitation\", giving capitalism \"a human face\".Anarcho-communist and collectivist ideas were not mutually exclusive. Although the collectivist anarchists advocated compensation for labor, some held out the possibility of a post-revolutionary transition to a communist system of distribution according to need, claiming that this would become more feasible once technology and productivity had evolved to a point where \"production outstrips consumption\" in a relative sense. Collectivist anarchism arose contemporaneously with Marxism, but it opposed the Marxist dictatorship of the proletariat despite the stated Marxist goal of a collectivist stateless society.\n\n\n=== Anarcho-communism ===\n\nAnarcho-communism is a theory of anarchism that advocates the abolition of the state, markets, money, capitalism and private property. Politically, anarcho-communists advocate replacing the nation-state and representative government with a voluntary confederation of free communes (self-governing municipalities), with the commune replacing the nation as the core unit of social-political administration. Economically, anarcho-communists believe in converting private property into the commons or public goods while retaining respect for personal property. In practice, this means common ownership of the means of production, direct democracy with production organised through a horizontal network of voluntary associations and consumption based on the guiding principle: \"From each according to his ability, to each according to his needs\". Some forms of anarcho-communism such as insurrectionary anarchism are strongly influenced by egoism and radical individualism, believing anarcho-communism is the best social system for the realization of individual freedom. Most anarcho-communists view anarcho-communism as a way of reconciling the opposition between the individual and society.The ideas associated with anarcho-communism developed out of radical socialist currents after the French Revolution, but it was first formulated as such in the Italian section of the First International. The theoretical work of Peter Kropotkin, who believed that in anarchy workers would spontaneously self-organize to produce goods for all of society, took importance later as it expanded and developed pro-organizationalist and insurrectionary anti-organizationalist sections. In terms of its vision for a post-capitalist economy, it differs from anarcho-syndicalism in seeing the centre of political-economic organisation as the commune, rather than the workplace, with economic issues being administered primarily on a communal (territorial), rather than unionist (industrial), basis. Although most anarcho-syndicalists agree with the communist method of distribution—\"From each according to his ability, to each according to his needs\"—they disagree with the commune-based method of organising production and structuring society, making them communists in one sense, but not the other. To date, the best known examples of an anarcho-communist society (i.e. established around the ideas as they exist today and achieving worldwide attention and knowledge in the historical canon) are the Free Territory during the Russian Revolution, the Korean People's Association in Manchuria and the anarchist territories during the Spanish RevolutionDuring the Russian Revolution, anarchists such as Nestor Makhno worked through the Revolutionary Insurrectionary Army of Ukraine to create and defend anarcho-communism in the Free Territory of Ukraine from 1919 before being conquered by the Bolsheviks in 1921 during the Russian and Ukrainian civil wars. In 1929, anarcho-communism was achieved in Korea by the Korean Anarchist Federation in Manchuria (KAFM) and the Korean Anarcho-Communist Federation (KACF), with help from anarchist general and independence activist Kim Chwa-chin, lasting until 1931, when Imperial Japan assassinated Kim and invaded from the south while the Chinese Nationalists invaded from the north, resulting in the creation of Manchukuo, a puppet state of the Empire of Japan. Through the efforts and influence of the Spanish anarchists during the Spanish Revolution within the Spanish Civil War starting in 1936, anarcho-communism existed in most of Aragon, parts of Andalusia and the Levante and Andalusia as well as in the stronghold of anarchist Catalonia before being crushed by the combined forces of the regime that won the war, Adolf Hitler and Benito Mussolini as well as Spanish Communist Party repression backed by the Soviet Union and economic and armaments blockades from the capitalist countries and the Spanish Republic itself.\n\n\n=== Anarcho-syndicalism ===\n\nIn the late 19th and early 20th century, revolutionary syndicalism emerged as a form of radical trade union activism, sharing a close relationship with social anarchists of both the collectivist and communist tendencies. In the early 1920s, anarcho-syndicalism arose as a distinct school of thought within anarchism.With greater focus on the labour movement than previous forms of anarchism, syndicalism posits radical trade unions as a potential force for revolutionary social change, replacing capitalism and the state with a new society, democratically self-managed by the workers. Like anarcho-communists, anarcho-syndicalists seek to abolish the wage system and private ownership of the means of production, which they believe lead to class divisions. Important principles include workers' solidarity, direct action (such as general strikes and workplace recuperations) and workers' self-management of enterprises and the economy as a whole.\nIn terms of post-capitalist vision, anarcho-syndicalists most often subscribe to communist or collectivist anarchist economic systems on the issue of distributing goods. The aim is to use a radical trade union movement to achieve either a collectivist or communist (moneyless) mode of distribution; or first the former and then the latter, once a certain degree of technical-productive capacity has enabled production to outstrip consumption, making a moneyless economy more viable. However, anarcho-syndicalists differ from anarcho-communists on wanting federations of (trade-based) workers' syndicates as the locus of organising the economy, rather than confederations of (territory-based) free communes. Its advocates propose labour organization as a means to create the foundations of a trade union centered anarchist society within the current system and bring about social revolution. An early leading anarcho-syndicalist thinker was Rudolf Rocker, whose 1938 pamphlet Anarcho-Syndicalism outlined a view of the movement's origin, aims and importance to the future of labour.Although more often associated with labor struggles of the early 20th century (particularly in France and Spain), many syndicalist organizations are active today, united across national borders by membership in the International Workers' Association, including the Central Organisation of the Workers of Sweden in Sweden, the Italian Syndicalist Union in Italy, the National Confederation of Labour and the General Confederation of Labour in Spain, the Workers Solidarity Movement of Ireland and the Industrial Workers of the World in the United States.\n\n\n=== Platformism and specifism ===\n\nPlatformism is a tendency or organized school of thought within the anarcho-communist movement which stresses the need for tightly organized anarchist organizations that are able to influence working class and peasant movements to achieve anarcho-communism. It is in many ways identical to specifism (especifismo) and has an antecedent in the work of Mikhail Bakunin, advocating a strategy of \"organisational dualism\" which entails: (1) building specifically anarchist organisations with a general agreement on ideas and practices; and (2) anarchists working within broader popular organisations and movements that aren't specifically anarchist, hoping to maintain theoretical consistency as well as pushing popular movements in a more anarchistic direction from within.\nPlatformist/specifist groups reject the model of Leninist vanguardism. They instead aim to \"make anarchist ideas the leading ideas within the class struggle\" while also opposing the anarcho-syndicalist tendency of seeing the class struggle and anarchist struggle as synonymous; holding that non-union political organisations are a necessary part of achieving anarchist ends. According to the Organisational Platform for a General Union of Anarchists, the four main principles by which an anarchist-communist organisation should operate are the following:\n\nIdeological unity: a general agreement on anarchist theoretical issues.\nTactical unity: a general agreement on strategy and tactics for achieving anarchist ends.\nCollective responsibility: a coherence between actions of members and actions of the organisation.\nFederalism: the autonomy of individual chapters within the organisation.In general, these groups aim to win the widest possible influence for anarcho-communist ideas and methods in the working class and peasantry (the popular classes), oriented towards \"ordinary\" people, rather than to the extreme left milieu. This usually entails a willingness to work in single-issue campaigns, trade unionism and community groups and to fight for immediate reforms while linking this to a project of building popular consciousness and organisation. They therefore reject approaches that they believe will prevent this, such as insurrectionist anarchism, as well as \"views that dismiss activity in the unions\" or that dismiss anti-imperialist movements.The name platformist derives from the 1926 Organisational Platform of the General Union of Anarchists (Draft). It was published by the Group of Russian Anarchists Abroad in their journal Dielo Truda (Workers' Cause). This group, consisting of exiled Russian anarchist veterans of the October Revolution of 1917 (notably Nestor Makhno who played a leading role in the anarchist revolution in the Ukraine of 1918–1921), based the Platform on their experiences of the revolution and the eventual victory of the Bolsheviks over the anarchists and other groups. The Platform attempted to address and explain the anarchist movement's failures during the Russian Revolution outside of the Ukraine.\nThe document drew both praise and criticism from anarchists worldwide and sparked a major debate within the anarchist movement. Today, platformism is an important current in international anarchism. Around thirty platformist and specifist organisations are linked together in the Anarkismo.net project, including groups from Africa, Latin America, North America and Europe. Further theoretical developments of platformism/specifism include the Manifesto of Libertarian Communism (1953) by Georges Fontenis and Social Anarchism and Organisation (2008) by FARJ (Anarchist Federation of Rio de Janeiro).\n\n\n== Contemporary currents ==\nMore recent political tendencies which emerged from social anarchism are the post-capitalist economic models of inclusive democracy and participatory economics (both of which could be regarded as updated forms of the collectivist anarchism of Bakunin) as well as the environmental philosophy of social ecology and its associated politics of post-scarcity anarchism and Communalism.\n\n\n=== Inclusive Democracy ===\n\nInclusive Democracy is a political theory and political project that aim for direct democracy, economic democracy in a stateless, moneyless and marketless economy, self-management (democracy in the social realm) and ecological democracy. The theoretical project of Inclusive Democracy (ID; as distinguished from the political project that is part of the democratic and autonomy traditions) emerged from the work of political philosopher, former academic and activist Takis Fotopoulos in Towards An Inclusive Democracy and was further developed by him and other writers in the journal Democracy & Nature and its successor The International Journal of Inclusive Democracy, an electronic journal freely available and published by the International Network for Inclusive Democracy.\nAccording to Arran Gare, Towards an Inclusive Democracy \"offers a powerful new interpretation of the history and destructive dynamics of the market and provides an inspiring new vision of the future in place of both neo-liberalism and existing forms of socialism\". As David Freeman points out, although Fotopoulos' approach \"is not openly anarchism, yet anarchism seems the formal category within which he works, given his commitment to direct democracy, municipalism and abolition of state, money and market economy\".\n\n\n=== Participism ===\n\nParticipism is a 21st-century form of libertarian socialism which comprises two related economic and political systems called participatory economics or parecon and participatory politics or parpolity.\nParecon is an economic system proposed primarily by activist and political theorist Michael Albert and radical economist Robin Hahnel, among others. It uses participatory decision making as an economic mechanism to guide the production, consumption and allocation of resources in a given society. Proposed as an alternative to contemporary capitalist market economies and also an alternative to centrally planned socialism or coordinatorism, it is described as \"an anarchistic economic vision\" and it could be considered a form of socialism as under parecon, the means of production are owned by the workers. The underlying values that Parecon seeks to implement are equity, solidarity, diversity, workers' self-management and efficiency (efficiency here means accomplishing goals without wasting valued assets). It proposes to attain these ends mainly through the following principles and institutions: workers' and consumers' councils utilizing self-managerial methods for decision making, balanced job complexes, remuneration according to effort and sacrifice and participatory planning. Under parecon, the current monetary system would be replaced with a system of non-transferable credit which would cease to exist upon purchase of a commodity.\nParpolity is a theoretical political system proposed by Stephen R. Shalom. It was developed as a political vision to accompany Parecon. The values on which parpolity is based are freedom, self-management, justice, solidarity and tolerance. According to Shalom, the goal is to create a political system that will allow people to participate as much as possible in a face to face manner. Participism as a whole is critical of aspects of modern representative democracies and capitalism arguing that the level of political control by the people is not sufficient. To address this problem, parpolity suggests a system of nested councils which would include every adult member of a given society. With five levels of nested councils it is thought, could represent the population of the United States.\nUnder participism, the state as such would dissolve into a mere coordinating body made up of delegates, who would be recallable at any time by the nested council below them.\n\n\n=== Social ecology and communalism ===\n\nSocial ecology is closely related to the work and ideas of Murray Bookchin and influenced by anarchist Peter Kropotkin. Social ecologists assert that the present ecological crisis has its roots in human social problems and that the domination of human-over-nature stems from the domination of human-over-human.Bookchin later developed a political philosophy to complement social ecology that he called communalism. While originally conceived as a form of social anarchism, he later developed communalism into a separate ideology that incorporates what he saw as the most beneficial elements of anarchism, Marxism, syndicalism and radical ecology.\nPolitically, communalists advocate a network of directly democratic citizens' assemblies in individual communities/cities organized in a confederal fashion. This method used to achieve this is called libertarian municipalism which involves the establishment of face-to-face democratic institutions that are to grow and expand confederally with the goal of eventually replacing the nation state. Unlike anarchists, communalists are not opposed to taking part in parliamentary politics—especially municipal elections—as long as candidates are libertarian socialist and anti-statist in outlook.\nEconomically, communalism favours the abolition of markets and money and the transition to an economy similar to libertarian communism and according to the principle \"From each according to his ability, to each according to needs\".\n\n\n== See also ==\nSocial anarchists (category)\n\n\n== References ==\n\n\n== Bibliography ==\nAdams, Matthew S.; Levy, Carl, eds. (2018). The Palgrave Handbook of Anarchism. London: Palgrave Macmillan. ISBN 9783319756196.\n\n\n== External links ==\n Media related to Social anarchism at Wikimedia Commons"