"Social anarchism is the branch of anarchism that sees individual freedom as interrelated with mutual aid. Social anarchist thought emphasizes community and social equality as complementary to autonomy and personal freedom. It attempts to accomplish this balance through freedom of speech, which is maintained in a decentralized federalism, with freedom of interaction in thought and subsidiarity. Subsidiarity is best defined as \"that one should not withdraw from individuals and commit to the community what they can accomplish by their own enterprise and industry\" and that \"[f]or every social activity ought of its very nature to furnish help to the members of the body social, and never destroy and absorb them\", or the slogan \"Do not take tools out of people's hands\".Social anarchism has been the dominant form of anarchism. As a label or term, social anarchism is used in contrast to individualist anarchism to describe the theory that places an emphasis on the communitarian and cooperative aspects in anarchist theory while also opposing authoritarian forms of communitarianism associated with groupthink and collective conformity, favoring a reconciliation between individuality and sociality. Self-determination, worker's self-management, education and empowerment are all emphasized in social anarchism, while illegitimate authority is removed through inspection and vigilance. A do-it-yourself mentality is combined with educational efforts within the social realm. Social anarchism advocates the conversion and use of a portion of present-day and future productive private property to be made into social property that can be used as an alternative to capitalist production and exploitative wage labor. Social anarchist thought advocates social property to offer individual empowerment through easier access to tools and a sharing of the commons while retaining respect for personal property.Social anarchism is considered an umbrella term that mainly refers to the post-capitalist economic models of anarcho-communism, collectivist anarchism and sometimes mutualism. It can also include non-state controlled federated guild socialist, dual power industrial democracy and economic democracy, or federated worker cooperatives and workers' and consumers' councils replacing much of the present state system whilst retaining basic rights. In addition, it includes the trade union approach of anarcho-syndicalism, the social struggle strategies of platformism and specifism and the environmental philosophy of social ecology. As a term, social anarchism overlaps with libertarianism, libertarian socialism and left-libertarianism, emerging in the late 19th century as a distinction from individualist anarchism after anarcho-communism replaced collectivist anarchism as the dominant tendency.Social anarchism has been described as the collectivist or socialist wing of anarchism as well as representing socialist-aligned forms of anarchism, being contrasted with the liberal-socialist wing represented by individualist anarchism. Nonetheless, several of those collectivist or communist anarchists have supported their theories on radical individualist grounds, seeing collectivism or communism as the best social system for the realization of individual freedom. The very idea of an individualist–socialist divide is also contested as individualist anarchism is largely socialistic and influenced each other. Carl Landauer summarized the difference between individualist and social anarchists by stating that \"the communist anarchists also do not acknowledge any right to society to force the individual. They differ from the anarchistic individualists in their belief that men, if freed from coercion, will enter into voluntary associations of a communistic type, while the other wing believes that the free person will prefer a high degree of isolation\"."