"Operation Warp Speed (OWS) was a public–private partnership initiated by the United States government to facilitate and accelerate the development, manufacturing, and distribution of COVID-19 vaccines, therapeutics, and diagnostics. The first news report of Operation Warp Speed was on April 29, 2020, and the program was officially announced on May 15, 2020. It was headed by Moncef Slaoui from May 2020 to January 2021 and by David A. Kessler from January to February 2021. At the end of February 2021, Operation Warp Speed was transferred into the responsibilities of the White House COVID-19 Response Team.The program promoted mass production of multiple vaccines, and different types of vaccine technologies, based on preliminary evidence, allowing for faster distribution if clinical trials confirm one of the vaccines is safe and effective. The plan anticipated that some of these vaccines will not prove safe or effective, making the program more costly than typical vaccine development, but potentially leading to the availability of a viable vaccine several months earlier than typical timelines.Operation Warp Speed, initially funded with about $10 billion from the CARES Act (Coronavirus Aid, Relief, and Economic Security) passed by the United States Congress on March 27, was an interagency program that includes components of the Department of Health and Human Services, including the Centers for Disease Control and Prevention, Food and Drug Administration, the National Institutes of Health, and the Biomedical Advanced Research and Development Authority (BARDA); the Department of Defense; private firms; and other federal agencies, including the Department of Agriculture, the Department of Energy, and the Department of Veterans Affairs.\n\n\n== History ==\n\nOn May 15, 2020, President Donald Trump officially announced the public-private partnership. The purpose of Operation Warp Speed was to coordinate Health and Human Services-wide efforts, including the NIH ACTIV partnership for vaccine and therapeutic development, the NIH RADx initiative for diagnostic development, and work by BARDA.Operation Warp Speed was formed to encourage private and public partnerships to enable faster approval and production of vaccines during the COVID-19 pandemic. The name was inspired by terminology for faster-than-light travel used in the Star Trek fictional universe, evoking a sense of rapid progress.The Food and Drug Administration announced on 30 June 2020 that a vaccine would need to be at least 50% effective for diminishing the severity of COVID-19 symptoms to obtain regulatory and marketing approval.In January 2021, White House press secretary Jen Psaki announced that the program was expected to undergo a restructure and renaming under the Biden administration. Also in January 2021, Dr. Moncef Slaoui, former Operation Warp Speed lead, was told not to use the name Operation Warp Speed anymore. At the end of February 2021, responsibilities of Operation Warp Speed were transferred into the White House COVID-19 Response Team.\n\n\n== Goals ==\nAccording to the Department of Health and Human Services' fact sheet, the main stated goal of Operation Warp Speed was to \"produce and deliver 300 million doses of safe and effective vaccines with the initial doses available by January 2021, as part of a broader strategy to accelerate the development, manufacturing, and distribution of COVID-19 vaccines, therapeutics, and diagnostics\".Specific targets, as outlined in various media, included:\n\nsupport pharmaceutical companies for R&D of seven different vaccine candidates simultaneously and certain therapeutic compounds\nsupport several vaccine manufacturers for rapid scale-up of manufacturing capacity\nsupport organization and facilitate simultaneous FDA review of Phase I-III clinical trials on several of the most promising vaccine candidates\nfacilitate manufacturing vaccine candidates while they remain pre-approved during prefinal clinical research to prepare for rapid deployment, if proven to be safe and effective\ncoordinate with the Department of Defense for vaccine supply, production, and deployment around the United States, and track every vaccine vial and the injection schedule for each American receiving a vaccinationWhile coordination was expected with the FDA on technical matters, Commissioner Stephen Hahn noted that the FDA would \"provide technical and development assistance to Operation Warp Speed, but the manufacturers decide if they're going to go forward or not\" and clarified that the agency had \"drawn a very bright line at FDA between us and Operation Warp Speed because we're the independent regulator\".\n\n\n== Budget and leadership ==\nOperation Warp Speed used BARDA as the financial interface between the U.S. federal government and the biomedical industry. The program was initially being funded with $10 billion, with additional funds allocated through BARDA. Funding was increased to about $18 billion by October 2020.Rick Bright, the BARDA director, was reassigned on or about April 22 following his resistance to (as he phrased it) \"efforts to fund potentially dangerous drugs promoted by those with political connections\". In May, new leadership was announced. Moncef Slaoui was named Operation Warp Speed's chief adviser. Slaoui is a vaccine researcher and, formerly, Chairman of Global Research and Development and Chairman of Global Vaccines at GlaxoSmithKline, where he led the development of five vaccines. General Gustave F. Perna, who served as commanding general of Army Materiel Command, was named Operation Warp Speed chief operating officer. Retired Lieutenant General Paul A. Ostrowski, who previously served as director of the Army Acquisition Corps, is the director of supply, production, and distribution.\n\n\n== Companies receiving research funding ==\n\nAs of August 2020, eight companies were chosen for funding of some $11 billion to expedite development and preparation for manufacturing their respective vaccine candidates.The vaccine developers, different vaccine technologies, and treatments receiving government research funding were:\n\nIndirectly-funded companies include:\n\nVaxart (in collaboration with Emergent BioSolutions)\nInovioAs of October 2020, Operation Warp Speed had spent less than $1 billion to support the development and manufacturing of three monoclonal antibody treatments, versus almost $10 billion on six vaccines.\nRegeneron was to receive $450 million to develop and supply a monoclonal antibody drug, according to a government announcement on July 7, 2020.\n\n\n== Companies not receiving research funding ==\n\n\n=== Pfizer–BioNTech ===\nThe BioNtech project to develop a novel mRNA technology for a COVID-19 vaccine was called \"Project Lightspeed\", which started in mid-January 2020 at BioNTech's laboratories in Mainz, Germany, just days after the SARS-Cov-2 genetic sequence was first made public. In September 2020, BioNTech received €375 million (US$445 million) from the government of Germany to accelerate the development and production capacity of the Pfizer–BioNTech COVID-19 vaccine.Pfizer CEO Albert Bourla said that the company decided against taking Warp Speed funding for the development of the vaccine out of a desire \"to liberate our scientists [from] any bureaucracy that comes with having to give reports and agree how we are going to spend the money in parallel or together\".On July 22, Operation Warp Speed placed an advance-purchase order of $2 billion with Pfizer to manufacture 100 million doses of a COVID-19 vaccine for use in the United States when the vaccine was shown to be safe, effective, licensed, and authorized by the Food and Drug Administration (FDA). Because it is a two-dose vaccine, this would be enough to vaccinate fifty million Americans. (Pfizer contracted to sell twice that amount of vaccine to the European Union.) On November 9, the Pfizer–BioNTech partnership announced positive early results from its Phase III trial of the BNT162b2 vaccine candidate, and on December 11, the FDA provided emergency use authorization, initiating the distribution of the vaccine.Pfizer initially said it was not a participant in Operation Warp Speed because it did not accept taxpayer funds for research and development, but the White House said the government's advance-order purchase for a hundred million doses of vaccine made Pfizer a participant. Company representatives said in November that \"the company is part of Operation Warp Speed as a supplier of a potential coronavirus vaccine,\" and that \"Pfizer is proud to be one of various vaccine manufacturers participating in Operation Warp Speed as a supplier of a potential COVID-19 vaccine.\" A spokesperson for Pfizer, however, clarified that they had \"not taken federal money for R&D\", but rather its partner, BioNTech, had received substantial funding for accelerated vaccine development and manufacturing from the German government.The United Kingdom was the first country to authorize the vaccine on an emergency basis on December 2, 2020. Emergency use authorization in the United States was issued December 11, 2020.\n\n\n== Distribution ==\nVaccine doses purchased by Operation Warp Speed were sent from manufacturers via UPS and FedEx to locations specified by state governments. The Federal Pharmacy Partnership delivers doses to CVS and Walgreens locations, which then send pharmacists for mass vaccinations at care facilities like nursing homes.\nIn October 2020, Alex Azar predicted a hundred million available doses by the end of the year. The Trump administration later reduced the goal to twenty million doses. As of January 6, 2021, the CDC was reporting 17,288,950 doses distributed, but only 5,306,797 actually administered to a person. Of those, 3,416,875 were distributed and 511,635 administered through the Federal Pharmacy Partnership. (General Gustave Perna said reporting delays cause the administration numbers to lag by 72 to 96 hours.)\nThe distribution effort was criticized for lack of coordination between federal and state governments, and lack of timely federal funding for mass vaccination campaigns. Other reasons cited included the Christmas holiday, employees declining to be vaccinated, a longer than typical time spent on paperwork or answering patient questions, the required observation time, and shortage of trained staff.\n\n\n== Reception ==\n\n\n=== Cost ===\nAlthough initially budgeted by Congress for about $10 billion in May 2020, Operation Warp Speed had spent $12.4 billion by mid-December on vaccine developers for the combined costs of R&D and pre-approval manufacturing for millions of vaccine doses.Operation Warp Speed anticipated that some of these vaccines would not prove safe or effective, making the program more costly than typical vaccine development, but potentially leading to the availability of a viable vaccine several months earlier than typical timelines. The low prices of coronavirus vaccines were attributed to the high amount of research funding provided by Operation Warp Speed: despite preliminary data suggesting that the COVID-19 vaccines subsidized by the plan had higher effectiveness than flu vaccines, vaccine developers set initial pricing in line with those of the annual influenza vaccine.\n\n\n=== Timeline ===\nThe goals of the project – to develop, manufacture, and distribute hundreds of millions of COVID-19 vaccine doses by the end of 2020 – were initially criticized as being unrealistic, based on decades of experience in developing viral infection vaccines which normally require years or decades for assuring the chosen vaccine will not be toxic and have adequate efficacy.Most viral infections do not have vaccines because the vaccine technology failed in early-stage clinical trials. Because many vaccines cause side effects, such as pain at the injection site, headaches, and influenza symptoms, safety testing requires years of observation in thousands of clinical trial participants. Similarly, sufficient time – a year or multiple years – is usually needed to be certain a vaccine has durable efficacy while the virus remains pandemic. Despite extensive previous research attempts to produce safe, effective vaccines against coronaviruses, such as SARS and MERS, all vaccine candidates for coronavirus infections have failed during clinical research, and no vaccine existed to prevent any coronavirus infection. To prepare for manufacturing and distribution, Operation Warp Speed expended resources and financing before the safety and efficacy results of vaccine candidates were known.\nIn the case of Operation Warp Speed, effective vaccines made by BioNTech in Germany and Pfizer (a partnership not funded by Operation Warp Speed) and Moderna were given an emergency use authorization by the FDA in December 2020, established an exceptionally fast development and approval timeline for vaccines granted emergency marketing.\n\n\n=== Competition ===\nThere was potential that the Warp Speed project would expend effort and funding in direct competition with publicly-traded American vaccine companies already fully engaged and financed for development. There was also the possibility that a billion dollars or more of U.S. taxpayer money would be expended on only American efforts or a narrow alternate choice, such as investing in one other vaccine platform – the University of Oxford-AstraZeneca candidate for which the U.S. already paid US$1 billion in May 2020 to receive 300 million doses for American use, when the AstraZeneca vaccine was successful in advancing to proof of safety and efficacy beyond its status as an early-stage Phase I–II trial in May.Warp Speed did not partner with Chinese vaccine development organizations, or with the World Health Organization (WHO), the Coalition for Epidemic Preparedness Innovations, or the European Commission, which are coordinating and financing international programs for multiple vaccine development, having raised $8 billion together from international partners on May 4 for a Coronavirus Global Response. The U.S. government chose not to include Operation Warp Speed as part of the international Solidarity trial on vaccine development, organized by the WHO.\n\nOn December 8, 2020, President Trump signed an executive order mandating that companies sell vaccine to the US before selling to any other countries (even if they already had contracts with other countries).\n\n\n=== Concern for equitable access ===\nThe focus of Operation Warp Speed to deploy approved COVID-19 vaccines first for the American people raised ethical and logistical concerns that access to vaccines outside of the United States may be restricted during 2021, leaving low-to-middle-income countries with no or minimal supply. Concerns were elevated when the Trump administration withdrew its financial support for the WHO and COVAX, and whether the program would participate in international vaccination practices, optimization, and education against vaccine hesitancy and misinformation. In February 2021 after Operation Warp Speed was transitioned to the White House COVID-19 Response Team, the United States pledged to donate any vaccine surplus out of concern for vaccine-poor regions, such as Africa.\n\n\n=== Vaccine hesitancy ===\nThere was concern that the name and intended shortened timeline of Operation Warp Speed could encourage vaccine hesitancy, with one expert stating that \"some of the language coming out of the White House is very damaging\" because one argument of anti-vaccinators is that products are rushed to market without adequate testing. Failure of the public to have confidence in a new vaccine and refuse vaccination is a global health concern, which increases the risk of further viral spreading that could lead to ongoing COVID-19 outbreaks during 2020–21. A September 2020 survey found that half of American adults surveyed said they would not accept a vaccination if it was available at that time, and three-quarters expressed concerns about the pace of the process and fears that a vaccine might be confirmed before its safety and effectiveness are fully understood.\n\n\n=== Leader neutrality ===\nThe leader of the Operation Warp Speed project, Moncef Slaoui, had been a board member of the U.S. vaccine developer, Moderna, and divested his shares in Moderna stock, at a potential personal gain of $10 million, raising questions of his neutrality in judging vaccine candidates. Although Slaoui resigned from the Moderna board when named to head Warp Speed, his share value in Moderna stock increased by $3 million in one day when Moderna announced an advance in vaccine clinical research. At the request of the incoming Biden administration, Slaoui resigned from the project in early January 2021.\n\n\n=== Lawsuits and insider trading ===\nShareholders sued biotech firm Inovio, claiming the company misled the public when it reported how quickly it had designed the blueprint for its vaccine candidate. A class action lawsuit was filed in August 2020 against Vaxart in Northern California U.S. District Court for alleged securities fraud, a concern related to Vaxart executives enriching themselves by selling shares timed to positive news on vaccine development during mid-2020. Executives, board members, and investment firms holding shares in vaccine and therapeutic companies, including Moderna, Novavax, and Regeneron, took profits worth some US$1 billion (about €830 million) on positive news during 2020.\n\n\n== References =="