"Ballistite is a smokeless propellant made from two high explosives, nitrocellulose and nitroglycerine. It was developed and patented by Alfred Nobel in the late 19th century.\n\n\n== Military adoption ==\nAlfred Nobel patented Ballistite in 1887 while he was living in Paris.  His formulation was composed of 10% camphor and equal parts nitroglycerine and collodion. The camphor reacted with any acidic products of the chemical breakdown of the two explosives. This both stabilized the explosive against further decomposition and prevented spontaneous explosions. However, camphor tends to evaporate over time, leaving a potentially unstable mixture.Nobel's patent specified that the nitrocellulose should be \"of the well-known soluble kind\". He offered to sell the rights of the new explosive to the French government, but they declined, largely because they had just adopted Poudre B for military use. He subsequently licensed the rights to the Italian government, who entered into a contract, on 1 August 1889, to obtain 300,000 kilograms of Ballistite; and Nobel opened a factory at Avigliana, Turin.The Italian Army swiftly replaced their M1870 and M1870/87 rifles, which used black powder cartridges, to a new model, the M1890 Vetterli, which used a cartridge loaded with ballistite.\nAs Italy was a competing great power to France, this was not received well by the French press and the public. The newspapers accused Nobel of industrial espionage, by spying on Paul Vieille (the inventor of Poudre B), and \"high treason against France\". Following a police investigation, he was refused permission to conduct any more research, or to manufacture explosives in France. He therefore moved to San Remo in Italy, in 1891, where he spent the last five years of his life.Ballistite is still manufactured as a solid fuel rocket propellant, although the less volatile but chemically similar diphenylamine is used instead of camphor.\n\n\n== Development of cordite and unsuccessful claim by Nobel of patent infringement ==\nMeanwhile, a government committee in Great Britain, called the \"Explosives Committee\" and chaired by Sir Frederick Abel, monitored foreign developments in explosives. Abel and Sir James Dewar, who was also on the committee, jointly patented a modified form of ballistite in 1889. This consisted of 58% nitroglycerin by weight, 37% guncotton and 5% petroleum jelly. Using acetone as a solvent, it was extruded as spaghetti-like rods initially called \"cord powder\" or \"the committee's modification of ballistite\", but this was soon abbreviated to cordite.\nAfter unsuccessful negotiations, in 1893, Nobel sued Abel and Dewar over patent infringement and lost the case. It then went to the Court of Appeal and the House of Lords in 1895 where he also lost the two appeals and the Nobel's Explosives Company had to pay the costs. The claim was lost because the words \"of the well-known soluble kind\" in his patent were taken to mean soluble collodion, and to specifically exclude the ether-alcohol-insoluble guncotton.\n\n\n== References ==\nNotes\nSources"