"Henry VIII (28 June 1491 – 28 January 1547) was King of England from 1509 until his death in 1547. Henry is best known for his six marriages, and, in particular, his efforts to have his first marriage (to Catherine of Aragon) annulled. His disagreement with Pope Clement VII about such an annulment led Henry to initiate the English Reformation, separating the Church of England from papal authority. He appointed himself Supreme Head of the Church of England and dissolved convents and monasteries, for which he was excommunicated. Henry is also known as \"the father of the Royal Navy,\" as he invested heavily in the navy, increasing its size from a few to more than 50 ships, and established the Navy Board.Domestically, Henry is known for his radical changes to the English Constitution, ushering in the theory of the divine right of kings. He also greatly expanded royal power during his reign. He frequently used charges of treason and heresy to quell dissent, and those accused were often executed without a formal trial by means of bills of attainder. He achieved many of his political aims through the work of his chief ministers, some of whom were banished or executed when they fell out of his favour. Thomas Wolsey, Thomas More, Thomas Cromwell, Richard Rich, and Thomas Cranmer all figured prominently in his administration.\nHenry was an extravagant spender, using the proceeds from the dissolution of the monasteries and acts of the Reformation Parliament. He also converted the money that was formerly paid to Rome into royal revenue. Despite the money from these sources, he was continually on the verge of financial ruin due to his personal extravagance, as well as his numerous costly and largely unsuccessful wars, particularly with King Francis I of France, Holy Roman Emperor Charles V, King James V of Scotland and the Scottish regency under the Earl of Arran and Mary of Guise. At home, he oversaw the legal union of England and Wales with the Laws in Wales Acts 1535 and 1542, and he was the first English monarch to rule as King of Ireland following the Crown of Ireland Act 1542.\nHenry's contemporaries considered him an attractive, educated, and accomplished king. He has been described as \"one of the most charismatic rulers to sit on the English throne\" and his reign has been described as the \"most important\" in English history. He was an author and composer. As he aged, he became severely overweight and his health suffered. He is frequently characterised in his later life as a lustful, egotistical, paranoid and tyrannical monarch. He was succeeded by his son Edward VI."