"Ophelia Lucy Lovibond (born 19 February 1986) is an English actress. She is known for her roles as Carina in the film Guardians of the Galaxy, Izzy Gould in the BBC's W1A, and Kitty Winter in CBS's Elementary.\n\n\n== Early life ==\nOphelia Lovibond grew up in Shepherd's Bush, London, in a single-parent family. Her mother worked as a Chartered Psychologist at Wormwood Scrubs Prison. She has a brother and a sister. Lovibond attended Latymer Upper School on a scholarship. She also attended the Young Blood theatre company, a youth drama club, in Hammersmith. She studied English at the University of Sussex, graduating in 2008.\n\n\n== Career ==\n\n\n=== Television ===\nLovibond's first television appearance was at the age of 12 in the Channel 4 sitcom The Wilsons.  She said she lied about her age to win the role.She acted in the television series FM. In the BBC satire W1A she appears as the character of Izzy Gould.\nShe appeared in Season 17 Ep 2 of Heartbeat.\nLovibond was also a regular in season 3 of Elementary, as Sherlock's new apprentice, Kitty Winter. She recurred in episodes 15 and 16 of season 5, as well as in season 7.  \nIn 2016, she played the role of Lady Alexandra Lindo-Parker in Sky1 series Hooten & The Lady.\nShe appeared in a guest role in the 2019 series Whiskey Cavalier as a British agent.\n\n\n=== Film ===\nLovibond made her film debut in Roman Polanski's Oliver Twist in 2005. She had a part in the John Lennon biopic Nowhere Boy.  She played a leading role in the film 4.3.2.1, and had roles in the 2011 films London Boulevard, No Strings Attached and Mr. Popper's Penguins. Lovibond played Carina, The Collector's slave, in the 2014 film Guardians of the Galaxy.\n\n\n=== Theatre ===\nIn 2016 she appeared as Elizabeth Barry in Stephen Jeffreys' The Libertine at London's Theatre Royal Haymarket.\n\n\n=== Others ===\nLovibond appeared in Gabrielle Aplin's February 2013 music video \"Please Don't Say You Love Me\".\n\n\n== Filmography ==\n\n\n=== Film ===\n\n\n=== Television ===\n\n\n=== Music videos ===\n\n\n=== Theatre ===\n\n\n== References ==\n\n\n== External links ==\nOphelia Lovibond at IMDb"