"Partzufim/Partsufim (Hebrew: פרצופים‎, singular partzuf, Hebrew: פרצוף‎), meaning Divine \"Personae/Visages/Faces/Forms/Configurations\", are particular reconfigured arrangements of the ten sephirot (Divine attributes/emanations of Kabbalah). Each partzuf is thus a configuration of disparate entities into a harmonious unit. The names of the partzufim are derived from the Zohar, the foundational text of Kabbalah. There, they  are synonymous terms for the sefirot. Their full doctrinal significance emerged in 16th century Lurianic Kabbalah with reference to the cosmic processes of Shevirah-\"Shattering\" and Tikun-\"Rectification.\"\nMedieval Kabbalah described the ten sefirot as divine channels that emanate from their source and descend in a linear progression. Moshe Cordovero systemised the different Medieval interpretations of the Zohar. Later, Isaac Luria recast Kabbalah into its second articulation. \"Lurianic Partzufim\" describe the dynamic relationships between personae, which interact with each other. The higher partzufim enclothe themselves within the lower ones, as a soul is enclothed in a body.\nAccording to the Lurianic system, the linear scheme of sefirot precipitates the \"shattering\" of Tohu- \"the World of Chaos.\" Their reformation as partzufim in the World of Atzilut, or Rectification, begins cosmic repair.\nAs a result of the collapse of the World of Chaos, sparks of holiness were lost, or exiled, in the three lower Worlds. Man, whose soul reflects the harmonised order of partzufim, rectifies the mundane world by redeeming the exiled sparks of holiness through Torah study and performance of mitzvot.\n\n\n== Description ==\n\nIn Lurianic Kabbalah, the four realms of our created existence are arranged in a stable form, through the reconfiguration of the original sephirot into partzufim. The first realm to exhibit this new arrangement is the mature form of Atzilut (the World of \"Emanation\"), therefore also called the \"World of Tikun\" (Rectification). This follows on from the Shevirah (\"Shattering\") of the sefirot vessels in the \"World of Tohu\" (Chaos), the initial, unstable form of Atzilut. In Tikun, the Sefirot evolve into the harmonised partzufim new arrangements, where they can unite. The realm of Tohu is characterised by abundant light (Ohr) and weak vessels, as the 10 sefirot act independently as absolute forces, causing it to collapse. Tikkun is characterised by lower lights in strong vessels, as through the partzufim the sefirot inter-relate to absorb the illumination from Tohu.\nInstead of each sefirah merely including a full subset of 10 sefirot as latent potential forces, the first stage of their evolution in the Lurianic scheme, in the partzufim the sefirot become full autonomous arrangements where all 10 sefirot are active forces of intellectual and emotional powers arranged around one of their number, analogous to the Yosher (\"Upright\") human-like configuration of the sephirot in three columns. They can now interact with the other partzufim, becoming enclothed within them in dynamic interaction. For example, Arich Anpin, the Partzuf of Keter-Will means the \"Long/Extended Face\" as it acts as the foundational Divine Will within Creation, extending down through subsequent partzufim, sefirot and Worlds, though in successively more concealed mode. The task of man becomes the rectification of the fallen sparks of Tohu, the concealed sublime origins of lower Creation, latently active in their exiled state. The messianic goal is the union of the original great illumination of Tohu within mature vessels of Tikun, revealing the ultimate divine essence of both.\n\n\n=== Anthropomorphism of the partzufim ===\n\nAs Medieval Kabbalists never tire of stressing the unity and non-plurality in the concept of the sefirot, so Luria stressed the metaphorical nature of the partzufim. They are Divine \"faces\", manifestations of the Godhead, alternative aspects through which God manifests Himself, and do not imply any plurality in God. As Rabbi Shimon bar Yochai recounts in the Zohar:\n\nWhatever I said of the Atika Kadisha, Holy Ancient-One, and whatever I said of the Zeir Anpin, is all One; everything is absolutely One. There is no division in Him, blessed be He and blessed be His Name forever. The sum of all this is: the Ancient of the Ancient and the Zeir Anpin are absolutely One. All is, was, and shall be; He will not change, He is unchanging, and he has not changed...Should you ask, what then is the difference between one and the other? It is all One, but from above His paths divide and from below judgement is found; from our perspective they differ one from another.\n\n\n== Primary and Secondary partzufim ==\nThe 10 sephirot develop into 5/6 primary partzufim, which further develop into pairs of Male and Female secondary partzufim. The male principle in Kabbalah metaphorically denotes outward/emanator/giver, and the female principle denotes inward/receiver/nurturer, similar to the female process of pregnancy to nurture subsequent emanation. The terminology and system of partzufim describes detailed and specific aspects of Divinity, their nature and function discussed in Kabbalah.\n\n\n=== Primary partzufim ===\nThe fundamental primary partzufim and the sefirot they develop from are:\n\nAtik Yomin-\"Ancient of Days\", supreme \"earliest/oldest\" inner dimension of Keter Will from Ein Sof)\nArich Anpin-\"Long Face/Extending Patience\", infinitely extending downwards source of divine compassion in Keter Will\nAbba-\"Father\", Chokhmah illumination of Wisdom insight, root of intellect on the \"right\" of the sefirot (Revelation)\nImma-\"Mother\", Binah intellectual Understanding nurturing pregnant emotions, on the \"left\" side of the sefirot (Internalisation)\nZeir Anpin-\"Small Face/Short Patience\", Son, 6 sefirot emotions that shattered, born from Imma on \"left\" side (Judgement)\nNukvah-\"Female\" of Zeir Anpin, Daughter, Malkuth reign in Feminine Shekhinah, born from Zeir Anpin on \"left\", man reunites\n\n\n=== Full array of partzufim ===\nThe full array of primary partzufim and the secondary partzufim that develop from them:\n\nBoth of the secondary, male and female partzufim of Atik Yomin and Arich Anpin exist within the same configuration. There are therefore only 10 distinct secondary partzufim, and consequently the secondary partzufim of Keter do not have particular names, unlike the secondary partzufim of the other sefirot.\n\n\n== Manifestations ==\nThe 6 primary and 12 secondary partzufim are the basic harmonised Divine manifestations in the Four Worlds of created existence. More specifically however, within their interaction are numerous more particular aspects of Divinity, each denoting a differentiated expression. In the Idrot narratives of the Zohar, Rabbi Shimon bar Yochai discusses profound manifestations of the partzufim. The Idra Zuta, traditionally ascribed to his day of passing from this world, his Yom Hillula \"wedding day\", is considered the deepest teachings of the Zohar.\n\n\n== Image gallery ==\n\n\n== See also ==\nAnthropomorphism in Kabbalah\nIdra\nIsaac Luria\nSephirot\nTohu and Tikun\n\n\n== Notes ==\n\n\n== External links ==\nGlossary of Kabbalah and Chassidut Letter P\nThe Stages of the Creative Process from God's Infinite Light to Our Physical World from www.inner.org. Includes detailed descriptions of particular partzuf manifestations\nThe Partzufim - The Sefirotic Faces By Rabbi Ariel Bar Tzadok (Originally published in Panu Derekh #13)\nTrue Monotheism Kabbalistic understanding of the absolute Unity of Divine Manifestations, from inner.org"