"Aarogya Setu (translation from Sanskrit: the bridge to liberation from disease) is an Indian COVID–19 \"contact tracing, syndromic mapping and self-assessment\" digital service, primarily a mobile app, developed by the National Informatics Centre under the Ministry of Electronics and Information Technology (MeitY).\nThe app reached more than 100 million installs in 40 days. On 26 May, amid growing privacy and security concerns, the source code of the app was made public.The World Health Organization lauded the Aarogya Setu mobile application for helping health departments to identify COVID-19 clusters.\n\n\n== Full view ==\nThe stated purpose of this app is to spread awareness of COVID–19 and to connect essential COVID–19-related health services to the people of India. This app augments the initiatives of the Department of Health to contain COVID–19 and shares best practices and advisories. It is a tracking app which uses the smartphone's GPS and Bluetooth features to track the coronavirus infection. The app is available for Android and iOS mobile operating systems. With Bluetooth, it tries to determine the risk if one has been near (within six feet of) a COVID–19-infected person, by scanning through a database of known cases across India. Using location information, it determines whether the location one is in belongs to one of the infected areas based on the data available.This app is an updated version of an earlier app called Corona Kavach (now discontinued) which was released earlier by the Government of India.\n\n\n== Features and tools ==\nAarogya Setu has four sections:\n\nUser Status (tells the risk of getting COVID-19 for the user)\nSelf Assess (helps the users identify COVID-19 symptoms and their risk profile)\nCOVID-19 Updates (gives updates on local and national COVID-19 cases)\nE-pass integration (if applied for E-pass, it will be available)\nSee Recent Contacts option (allows the users to assess the risk level of their Bluetooth contacts)It tells how many COVID-19 positive cases are likely in a radius of 500 m, 1 km, 2 km, 5 km and 10 km from the user.The app is built on a platform that can provide an application programming interface (API) so that other computer programs, mobile applications, and web services can make use of the features and data available in Aarogya Setu.\n\n\n== Response ==\nAarogya Setu crossed five million downloads within three days of its launch, making it one of the most popular government apps in India. It became the world's fastest-growing mobile app, beating Pokémon Go, with more than 50 million installs 13 days after launching in India on 2 April 2020. It reached 100 million installs by 13 May 2020, that is in 40 days since its launch.In an order on 29 April 2020 the central government made it mandatory for all employees to download the app and use it – \"Before starting for office, they must review their status on Aarogya Setu and commute only when the app shows safe or low risk\". The Union Home Ministry also said that the application is mandatory for all living in the COVID-19 containment zone. The government gave the announcement along with the nationwide lockdown extension by two weeks from the 4 May with certain relaxations.\nOn 21 May 2020, the Airport Authority of India issued a Standard Operating Procedure (SOP) stating that all departing passengers must compulsorily be registered with the Aarogya Setu app. It added that the app would not be mandatory for children below 14 years. However, the next day, Civil Aviation Minister Hardeep Singh Puri clarified that the app would not be mandatory for any passengers.\n\n\n== Effectiveness ==\nNITI Aayog CEO revealed that \"the app has been able to identify more than 3,000 hotspots in 3–17 days ahead of time.\"\n\n\n== Reception ==\nRahul Gandhi, leader of the Congress party, termed the Aarogya Setu application a \"sophisticated surveillance system\" after the government announced that downloading the app would be mandatory for both government and private employees. Following this, others raised the same concerns about the Aarogya Setu app. The Ministry of Electronics and Information Technology (MeitY) responded to these concerns by asserting that Gandhi's claims were false, and that the app was being appreciated internationally.\nOn 5 May, French ethical hacker Robert Baptiste, who goes by the name Elliot Alderson on Twitter, claimed that there were security issues with the app. The Indian government, as well as the app developers, responded to this claim by thanking the hacker for his attention, but dismissed his concerns. The developers of the app stated that the fetching of location data is a documented feature of the app, rather than a flaw, since the app is designed to track the distribution of the virus-infected population. They also asserted that no personal information of any user has been proven to be at risk.On 6 May, Robert Baptiste tweeted that security vulnerabilities in Aarogya Setu allowed hackers to \"know who is infected, unwell, [or] made a self assessment in the area of his choice\". He also gave details of how many people were unwell and infected at the Prime Minister's Office, the Indian Parliament and the Home Office. The Economic Times pointed out that a clause in the app's Terms and Conditions stated that the user \"agrees and acknowledges that the Government of India will not be liable for … any unauthorised access to your information or modification thereof\". In response, several software developers called for the source code to be made public,On 12 May, former Supreme Court Judge Justice B.N. Srikrishna termed the government's push mandating the use of Aarogya Setu app \"utterly illegal\". He said so far it is not backed by any law and questioned \"under what law, government is mandating it on anyone\".MIT Technology Review gave 2 out of 5 stars to Aarogya Setu app after analyzing the COVID contact tracing apps launched in 25 countries. The app got stars only for the policy which suggests that data collected is deleted after a period of time and that the data collection, as far as user inputs go, is minimal. It also highlighted that India is the only democracy making its app mandatory for millions of people. The rating was further downgraded from 2 to 1 for collecting more information than the app needs to function.Following this, the MeitY made the source code of the Android app public on GitHub on 26 May, which will be followed by iOS and API documentation. Further, the Government has also launched a \"bug bounty program\". This was done to \"promote transparency and ensure security and integrity of the app\". However, experts stated that the server-side code had not yet been publicly released, which meant that public opinion on security and privacy was yet to be completely assuaged. Following this, ZDNet noted that the source code seemed to confirm the government's claim that user location data, if collected, would be anonymised and would be deleted after 45 days, or 60 days for high-risk individuals.\n\n\n== See also ==\nCOVID-19 apps\n\n\n== References ==\n\n\n== External links ==\nOfficial website"