"Jack Staff is a British superhero created by comic book writer/artist Paul Grist.  Billed as \"Britain's Greatest Hero\", it is known for being in the style of an anthology title and for its multi-linear plotlines.\nHe first saw print in comics published by Paul Grist's Dancing Elephant Press, and is now published by Image Comics. Comics International began exclusive publication of a monthly four-page strip featuring the supporting character Ben Kulmer (the Claw); this started in #185 of the magazine and was set to run for twelve episodes.  These strips have since been reprinted by Image Comics in a special.\n\n\n== Publication history ==\nGrist created Jack Staff based on a story he had written to make use of Marvel's Union Jack character, only to be rejected.  He reworked the story to make it more of an original, self-contained comic which Grist then published through his own imprint, Dancing Elephant Press.  After twelve issues in black and white, Grist restarted the title with Image Comics, now with colour provided by Phil Elliott. This ran for 20 issues, then was ended.  It was restarted as the Weird World of Jack Staff that has had 6 issues.  Nothing new has been done since 2011.\nA crossover was planned between this title and Invincible, with Grist drawing and Robert Kirkman writing, but their schedules have not yet allowed it. Jack Staff himself has already appeared in a cameo in an earlier issue of the title, at the memorial service for the slain Guardians of the Globe, and later appeared helping to defend the Earth from an army of other-dimensional Invincible doubles during the globe-spanning Invincible #60. A crossover with Savage Dragon was also planned, in which Dragon would have visited Castletown as part of a storyline in which he searched the world for his missing wife.\n\n\n== Fictional character biography ==\nJack Staff, Britain's Greatest Hero, has been active since at least World War II.  While he has revealed he has been around since the Victorian Age and gained his powers there, it is unknown if he was active as a superhero or similar adventurer.  In his civilian identity, he works as a builder by the name of John Smith and has done since the 19th century.\nDuring World War II, he was active with the Freedom Fighters, a group of American and British superheroes: Sgt. States, Blazing Glory, and Tommy Twister.  During the war they defeated a vampire, Templar Richard, but not before Sgt. States also became a vampire (unknown to the rest of the team at the time). They also battled villains such as Kapitan Krieg and Brain Head.\nAfter the war, Jack continued as a superhero in the UK.  By the 1960s, he was helping a group called Unit D fight several menaces. After working to stop a British weapon of mass destruction, the Hurricane, in the early 1980s, Jack quit being a superhero. It has only been recently that Jack has come back as a superhero, fighting alongside Q, Commander Hawkes of the now defunct Unit D, Tom Tom the Robot Man, Becky Burdock: Vampire Reporter, and others.\nJack Staff was also an ally of the mysterious Mister Green, an entity working for/leading a cosmic force called \"the Green\", but severed his ties after the Hurricane incident. A slow-building subplot concerns an upcoming war, with \"the Green\" on one side and \"the Red\" on the other, and several of the comic's cast being recruited for it. Green has previously recruited Jack, and was recently revealed to have recruited Helen Morgan as well (and possibly more of Q through her) and taken Becky Burdock's old toy rabbit — or perhaps, in so doing, chosen Becky herself — to serve as a champion; a figure called the Man of Shadow is trying to recruit Becky. It's been hinted the Shadow and similar forces want to keep Becky & Jack apart. In The Weird World of Jack Staff #4, it was revealed Becky was indeed the prophesied champion who would save the world, and that Jack Staff's destined role was to keep her alive until then.\nIt has been noted by various characters (such as in Jack Staff Special #1) that Jack's record of success is a bit iffy; he often gets battered by supervillains and ends up in embarrassing or dangerous situations, such as being set up to be arrested by the Spider. In the future visions shown in Weird World, in the final battle he will be battered by the adversary; when the seers Professor Fate and Morlan the Mystic watch this battle, Morlan notes that Jack is incapable of defeating such a foe \"but he's going to try anyway\" (#3).\n\n\n== Powers and abilities ==\nAgile and acrobatic, the closest Jack Staff gets to a clearly defined power is his ability to move energy.  This has been shown by his moving energy into his staff to break through solid walls, or move the anger from Hurricane. This ability is never clearly defined with regard to where the energy is moved from, or what kind of energy is involved.\nJack appears to be either immortal or very long lived.  He reveals that he has been around since the at least the Victorian era.  He was active as Jack Staff during World War II up until the 1980s when he retired after the Hurricane incident.  He looks no different today then he did during World War II.  No further background on him has yet to be revealed, although in the twelfth issue of the second Image volume, there were hints of a connection with the \"Eternal Warrior\".\nHe has had dreams of some future threat, most recently in Jack Staff Special #1 — Becky Burdock is plagued by the same thing, though more frequently.\n\n\n== Collected editions ==\nThe comics have been collected into trade paperbacks:\n\nYesterday's Heroes (collects Jack Staff (vol. 1) #1-4, Dancing Elephant Press, April 2002, ISBN 0-9542264-0-2)Image Comics has also collected the comics:\n\nVolume 1: Everything Used to be Black and White (collects Jack Staff (vol. 1) #1-12, 352 pages, March 2004, ISBN 1-58240-335-X)\nVolume 2: Soldiers (collects Jack Staff (vol. 2) #1-5, 160 pages, November 2005, ISBN 1-58240-392-9)\nVolume 3: Echoes of Tomorrow (collects Jack Staff (vol. 2) #6-12, 200 pages, January 2007, ISBN 1-58240-719-3)\nVolume 4: Rocky Realities (collects Jack Staff (vol. 2) #13-20 and one-shot Special, March 2010, ISBN 1-60706-148-1)There is a one-shot collection of shorter stories:\n\n\"The Weird World of Jack Staff King Size Special\" (collects Jack Staff strips from Comics International #185-191, 193–199, one-shot, Image Comics, July 2007)\n\n\n== Awards ==\n2001: Won \"Favourite British Small Press Title\" Eagle Award\n2002: Nominated for \"Best Self-Published/Independent\" National Comics Award\n2003:\nWon \"Best Self-Published/Independent\" National Comics Award\nNominated for \"Best New Comic\" National Comics Award\n2004: Nominated for \"Favourite British Small Press Title\" Eagle Award\n2007: Nominated for \"Favourite Colour Comicbook (American)\" Eagle Award\n\n\n== See also ==\nSupporting cast in Jack Staff\n\n\n== Notes ==\n\n\n== References ==\n\n\n== External links ==\nJack Staff at Paul Grist Comics Index\nJack Staff discussion forum at Image comics\nFull issue: Jack Staff (vol. 1) #1, Image Comics\nFull issue: Jack Staff (vol. 2) #1, Image Comics"