"An apron is a garment that is worn over other clothing and covers mainly the front of the body.\nThe word comes from old French napron meaning a small piece of cloth, however over time \"a napron\" became \"an apron\", a process in linguistics called rebracketing. It may have several different purposes and is today perhaps most known as a functional accessory that protects one's clothes and skin from stains and marks. However, various types of aprons may also be worn as a decoration, for hygienic reasons, as part of a uniform, or as protection from certain dangers such as acid, allergens or excessive heat. It can also be used in work stations to hold extra tools and pieces or protecting from dust and unwanted products.\nAs a top layer that covers the front body, the apron is also worn as a uniform, adornment, ceremonial garb (most notably the Masonic apron) or fashion statement. Apron styles can be practical, fashionable, and sentimental.\n\n\n== Apron styles ==\nThere are many different apron forms depending on the purpose of the apron. A basic distinction is between waist aprons, which cover the body from the waist down, and bib aprons, which also cover the upper part of the body.\nAn apron is usually held in place by two ribbon-like strips of cloth that are tied at the back. A bib apron may either have a strap around the neck (perhaps the most widespread use today), or shoulder straps that criss-cross at the back and attach to the waistband. The advantage of the former design is that it makes it especially simple to put on the bib apron. The advantage of the shoulder strap design is that it makes the apron more comfortable to wear; a neck strap can slightly impair ease of movement.\nSome modern-day aprons have humorous expressions, designs or corporate logos.\n\n\n=== Bib apron ===\nThe bib apron (also known as the \"French chefs apron\" or a \"barbecue apron\") has been worn for centuries. The bib apron's humble beginnings began when people used scraps of fabric to make a bib-like covering that slipped over the neck and tied at the back. The bib apron's intuitive design and full coverage have made it a popular apron for tradesmen and people in low-economic classes since the 1880s—and maybe even earlier. In the 1960s—when women no longer wanted an apron that symbolized domestic ideals—the bib apron became the most-used apron and is now offered in a multitude of variations, colors, detailing and fabrications.\n\n\n=== Pinafore ===\n\nPinafores may be worn by girls and women as a decorative garment or as a protective apron. A related term is pinafore dress (American English: jumper dress); it is a sleeveless dress intended to be worn over a top or blouse.\nA pinafore is a full apron with two holes for the arms that is tied or buttoned in the back, usually just below the neck. Pinafores have complete front shaped over shoulder while aprons usually have no bib, or only a smaller one. A child's garment to wear at school or for play would be a pinafore.\n\n\n=== Tabard ===\n\nA tabard (British English; cobbler apron in U.S. English) is a type of apron that covers both the front and back of the body. It is fastened with side ties or with waistbands that tie in the back. It covers most of the upper part of the body and is used in many occupations, like bakeries, hospitals, and large retail stores. The original cobbler's apron was typically made of leather.\nAn alternative version uses snaps instead of ties and closes at the front. Such an apron is in effect like a vest and is more commonly sold for domestic rather than occupational use.\n\n\n=== Bungalow apron ===\nA bungalow apron is an item of women's at-home clothing. Most bungalow aprons were extremely simple garments, often with kimono sleeves (sleeves cut in one piece with the body of the dress), little or no trim, and the fewest possible fasteners. Most date from the first half of the 20th century (roughly 1910 into the 1940s), when they evolved into or were replaced by the \"patio dress\" or Lounger available today.\nIn contrast to most aprons, they were intended to be worn as a stand-alone garment, not over another dress. They probably developed from the full-coverage wraparound or pullover aprons of the early years of the 20th century.\nBungalow aprons fell roughly between nightgowns or house coats and house-dresses; they were appropriate for morning in-home wear but would not have been worn outside of the house, as opposed to a true morning or house-dress, which might have been worn to the grocery store or in other informal situations.\n\n\n=== Clerical garment ===\nThe term apron also refers to an item of clerical clothing, now largely obsolete, worn by Anglican bishops and archdeacons. The clerical apron resembles a short cassock reaching just above the knee, and is colored black for archdeacons and purple for bishops. The apron is worn with black breeches, reaching to just below the knee, and knee-length gaiters. The history behind the vesture is that it symbolically represents the mobility of bishops and archdeacons, who at one time would ride horses to visit various parts of a diocese or archdeaconry. In this sense, the apparel was much more practical than a clerical cassock would be. In latter years, this vesture was more symbolic than practical, and since the mid-twentieth century it has fallen out of favor.\n\n\n== Aprons in the home ==\nThe apron was traditionally viewed as an essential garment for anyone doing housework. Cheaper clothes and washing machines made aprons less common beginning in the mid-1960s in some countries such as the United States. However, the practice of wearing aprons remains strong in many places.\nToday, the apron has enjoyed a minor renaissance in terms of both women and men now wearing them when performing household chores. For instance, an article in The Wall Street Journal claimed in 2005 that the apron is \"enjoying a renaissance as a retro-chic fashion accessory\" in the United States. However, it still is not as prevalent as it was prior to the 1960s.\nAprons are nowadays considered equally appropriate for both women and men by most people. However, prevailing social norms ensure that women frequently wear more delicate clothing, and may therefore be more likely to want the protection an apron offers. This can also be because the apron is the traditional clothing for cooking and washing dishes, which was usually done by women.\nWhen domestic workers are supplied a uniform by their employers, an apron is often included. The aprons are worn for hygienic as well as for identification purposes.\n\n\n== Protective and fashionable aprons throughout history ==\nSince fabric was precious in the medieval and Renaissance eras, aprons then were little more than scraps of material tied around the waist with the intent of protecting the valuable clothing underneath.\n\nIn Europe during the Middle Ages, aprons were worn by blacksmiths, armor and weapon makers, gardeners, carvers, furniture makers, leather smiths, cobblers, tailors, jewelers, metal forgers, fishmongers, clock makers, homemakers, tradesmen, artisans and masons. Tradesmen in general were called \"apron men,\" as aprons were so common that distinguishing styles emerged between the various trades. For example, English barbers were known as \"checkered apron men.\" Cobblers wore black to protect garments from the black wax used on shoes. Butchers wore blue stripes. Butlers wore green aprons. Blue was commonly worn by weavers, spinners, and gardeners. Stonemasons wore white aprons as protection against the dust of their trade, and even in the twenty-first century, aprons survive as part of Masonic ceremonial attire. These aprons were long, coming down to below the knees, with a flap or bib to protect the chest. The Union of the Grand Lodge of England between the Ancient and Modern branches of English Freemasonry in 1813 brought into many effect many changes in dress and ritual which still prevail to this day. In respect to the Masonic apron it was felt necessary to have these standardised and the resulting effort are the aprons we have in use today. The Dutch worn aprons bordered with black and with a skull and crossbones on the flap. Scottish lodges each have their individual right to choose the design, colour and shape of their aprons; some employ a tartan, while many others have a circular rather than a triangular flap. Soldiers of the French Foreign Legion wore leather aprons as part of their ceremonial dress as early as the 18th century.From these utiliarian beginnings, the modern apron got more stylish over time. During the Renaissance, more fanciful aprons crafted from finer fabrics began to appear—usually without bibs and often embroidered. Well-to-do women favored long dresses often with detachable sleeves, and to keep their expensive gowns clean, they wore washable aprons or overdresses in a range of embellishments and materials.\n\nAprons became a fashion statement in the 1500s, when women started adorning them with expensive lace and embroidery.\nPolitics ruled women's fashion in 1650s England when Oliver Cromwell decreed that women and girls should dress properly. This sparked the Puritan look of a white apron covering a long black dress that reached from a woman's neck to her toes.At the height of the industrial revolution in Victorian England, the market was flooded with different types of aprons. The boom of factories and sewing machines meant that consumers had options: one could choose a full-body apron, a linen apron, a linen apron with ruffles or ruching or lace, a grosgrain apron with embroidery, or an apron with a flounce. Aprons were a way of indicating the difference in status between the employer and the employee, and the uniform of the staff was strictly regulated. For example, a housemaid might wear a print dress during the day and then change into a black dress and dress apron for the evening service.In contemporary South Africa, young women wear beaded aprons to celebrate their coming of age.\n\n\n=== Ancient ceremonial aprons ===\nExamples of ancient gods wearing aprons can be found worldwide. Fertility goddess figurines may be the earliest depiction of women wearing aprons. These ancient snake goddess figurines excavated in Crete depicted how Minoan women may have dressed in 1600 BCE: a tight bodice, bare breasts, and an embroidered or woven apron covering a long dress. Monuments and wall paintings in Ancient Egypt depict a triangular-shaped apron with the point upward when the wearer is taking part in some kind of ceremony of initiation. In China, some of the ancient figures of the gods wear semi-circular aprons. In Central America the ancient gods are consistently sculpted wearing aprons. Tepoxtecatl (the preserver) is depicted wearing an apron with a triangular flap. Priests wore similar aprons as a sign of their allegiance to the 'gods' and as a badge of their authority.\n\n\n== Aprons in the United States ==\nAprons have been used in North America throughout its recorded history by both the Native Americans and later peoples. The kitchen apron fell somewhat out of favor in the 1960s after its rise to celebrity in the 1950s when it became the post-war symbol for family and domesticity. People started doing their work without an apron entirely or they choose to wear a bib apron (its unisex, simple, boxy design represented the opposite of the 1950s housewife). The bib apron, also known as the \"French chef's apron\" or \"barbecue apron\", remains the dominate apron on the American market and is offered in a multitude of variations in colors, detailing and fabrics.\n\n\n=== Early American aprons ===\nNative American wore aprons for both practical and ceremonial purposes. Early female settlers wore plain, long white aprons. Later, Quaker women wore long and colorful silk aprons.As cities in New England grew, more elaborate options began to appear. Upscale American women in the 18th century wore embroidered aprons that sometimes dipped at the front of the waist (so as to not obscure the bodice of a gown).\n\n\n=== Aprons: 1800s ===\nIn England and the United States in the 1800s, both maids and wealthy women wore aprons. Servant aprons were traditionally white and were supposed to be \"clean, neat and appropriate.\" The maid's clothing was meant to follow the fashion trends of the time while also representing her employer's class status and wealth. Some aprons had lace, embroidery or pleating work on them to add a bit of sophistication if they were servants who regularly appeared in front of house guests.Wealthy housewives of the time were also expected to show off their family's status in society and their commitment to the domestic life. They did this by also wearing aprons, though the aprons were far more elegant and expensive than the maid's white cotton apron. Popular materials included black lace, satin with chenille borders, shot silk, and satin. An apron of this caliber was necessary with a morning dress during the early nineteenth century for a woman of status. During this time, \"never was there a greater rage than for aprons (of satin and shot silk) for morning or afternoon.\" The elegant and colorful apron was also a symbol that a woman had the funds to be swindled by travelling merchants into purchasing \"a gaudy ribbon or shining pair scissors.\"Another symbol which the extravagant apron represented was of the \"fig leaf,\" as worn by Eve in the Garden of Eden. Women termed their ornamental aprons \"fig leaves,\" thus drawing attention to their \"sexual region.\" Small decorated aprons were one example of \"suggestive fashion.\" According to at least one private journal entry, men of the time were reputed to loudly exclaim, \"Oh my!\" upon spotting a woman in a \"fig leaf\" apron, sometimes blushing profusely and fainting on the spot.Aprons for both maids and housewives were not just worn in the home, but out on the town as well. The painting \"Scene in Frankfurt Fair, April 1835. Part of the Line of Stalls Extending Along the River Mayn\" by Mary Ellen Best shows a mother in a highly decorated and colorful apron and her daughter in a green pinafore apron. They are out shopping in a market and through the appearance of their stylish aprons, they are exhibiting their upper-middle class status as well as their ties to female domesticity.\n\n\n=== Aprons: 1920s ===\nFrom 1900 through the 1920s, well-heeled women wore ornate, heavily embroidered aprons. Aprons of the 1920s mirror the style of the times: loose and long. Often closed with a button and adorned with needlework, many aprons styles emerged during this era and stores began selling patterns and kits to make and adorn aprons at home.\nAprons of this period followed the silhouette of dapper fashions—long, with no waist line.\n\n\n=== Aprons: 1930s – 1940s ===\nThe “Hooverette” or “Hoover apron” emerged in the 1930s, named after the man in charge of the U.S. Food Administration at the time, Herbert H. Hoover. Women working outside the home wore whatever protective garments their jobs required, including coveralls, smocks, or aprons. At home, they worked in full-length aprons with hefty pockets and a cinched waistline that were often decorated with buttons, pockets and contrasting colors.Aprons became plain during the Great Depression. Since fabric was scarce, women would make aprons out of flour and animal-feed sacks to protect their clothing. Pinafore aprons, or \"pinnies\" as they were affectionately called, began to gain popularity. Dorothy famously wore a blue and white gingham pinafore in The Wizard of Oz.\n\n\n=== Aprons: 1950s ===\n\nPost-war family values made the apron the symbol of home, family, mother and wife. As sewing machines and cloth became available, aprons—both commercial and homemade—became the uniform of the professional housewife. Magazines from the 1940s and 50s feature apron-adorned women in nearly every advertisement that is related to housework or cooking, including those for irons, kitchen appliances, and food products. The 1950s brought out the half-aprons of highly starched cotton, feedsack, and for special occasions sheer fabric trimmed with lace. Two-piece aprons and short smocks of bright cotton prints for every day use were also popular.\nThe postwar archetypal housewife was practical and creative. She made aprons out of remnants, extra kitchen curtains, dish towels, handkerchiefs, and flour sacks. When she made her aprons, she considered design as well as function. Many 1950s aprons were decorated with sewing, cleaning, cooking, and \"mom\" themes.\nHusbands in the 1950s often sported bib aprons for barbecues on the weekends, often with written statements about Dad's grilling talents.\n\n\n=== Aprons: 1960s – 1970s ===\nAprons fell out of favor as women began looking again beyond the home and family for fulfillment as the feminist movement of the latter half of the 20th century began. In response, people chose to wear no apron when they did their work, or they wore bib aprons that were less stereotypically feminine, sometimes with ironic or sarcastic statements written on them.\nAprons remained a staple of the workplace as a means of protecting garments. Aprons were also worn as a work uniform and by people who worked in the food trades—butchers, waitresses and chefs as well as hairdressers and barbers.\n\n\n=== Aprons: 1980s – 2010s ===\nMany home cooks chose not to wear an apron in the 1980s. Those that did often wore bib aprons or vintage/retro DIY aprons. However, more recently the apron has again enjoyed increasing popularity. Employees in the service industry continue to wear aprons for work, often a bib apron with company logos.\n\n\n=== Aprons today ===\nThe apron is enjoying a resurgence thanks to a few modern cultural factors. The slow food and foodie movements have inspired people to cook for pleasure and not as an act of servitude; the maker movements glorify the process of creating and the behind the scenes making of things; cooking shows use aprons as a professional accessory; and (unlike in past centuries) dirty work is no longer reserved for the underclasses. Today there is no negative social stigma associated with doing ones own chores (such as cooking and cleaning) or pursuing messy hobbies or careers (such as styling, gardening or painting).\n\n\n== See also ==\nTabard\nGymslip\nJumper (dress)\nRomper suit\n\n\n== References ==\n\n\n== External links ==\nHistory of Aprons"