"Robert Schumann (German: [ˈʃuːman]; 8 June 1810 – 29 July 1856) was a German composer, pianist, and influential music critic. He is widely regarded as one of the greatest composers of the Romantic era. Schumann left the study of law, intending to pursue a career as a virtuoso pianist. His teacher, Friedrich Wieck, a German pianist, had assured him that he could become the finest pianist in Europe, but a hand injury ended this dream. Schumann then focused his musical energies on composing.\nIn 1840, Schumann married Clara Wieck, after a long and acrimonious legal battle with her father, Friedrich, who opposed the marriage. A lifelong partnership in music began, as Clara herself was an established pianist and music prodigy. Clara and Robert also maintained a close relationship with German composer Johannes Brahms.\nUntil 1840, Schumann wrote exclusively for the piano. Later, he composed piano and orchestral works, and many Lieder (songs for voice and piano). He composed four symphonies, one opera, and other orchestral, choral, and chamber works. His best-known works include Carnaval, Symphonic Studies, Kinderszenen, Kreisleriana, and the Fantasie in C. Schumann was known for infusing his music with characters through motifs, as well as references to works of literature. These characters bled into his editorial writing in the Neue Zeitschrift für Musik (New Journal for Music), a Leipzig-based publication that he co-founded.\nSchumann suffered from a mental disorder that first manifested in 1833 as a severe melancholic depressive episode—which recurred several times alternating with phases of \"exaltation\" and increasingly also delusional ideas of being poisoned or threatened with metallic items. What is now thought to have been a combination of bipolar disorder and perhaps mercury poisoning led to \"manic\" and \"depressive\" periods in Schumann's compositional productivity. After a suicide attempt in 1854, Schumann was admitted at his own request to a mental asylum in Endenich near Bonn. Diagnosed with psychotic melancholia, he died of pneumonia two years later at the age of 46, without recovering from his mental illness.\n\n\n== Biography ==\n\n\n=== Early life ===\n\nSchumann was born in Zwickau, in the Kingdom of Saxony (today Central Germany), the fifth and last child of Johanna Christiane (née Schnabel) and August Schumann. Schumann began to compose before the age of seven, but his boyhood was spent in the cultivation of literature as much as music—undoubtedly influenced by his father, a bookseller, publisher, and novelist.At age seven, Schumann began studying general music and piano with Johann Gottfried Kuntzsch, a teacher at the Zwickau high school. The boy immediately developed a love of music, and worked on his own compositions, without the aid of Kuntzsch. Even though he often disregarded the principles of musical composition, he created works regarded as admirable for his age. The Universal Journal of Music 1850 supplement included a biographical sketch of Schumann that noted, \"It has been related that Schumann, as a child, possessed rare taste and talent for portraying feelings and characteristic traits in melody,—ay, he could sketch the different dispositions of his intimate friends by certain figures and passages on the piano so exactly and comically that everyone burst into loud laughter at the similitude of the portrait.\"At age 14, Schumann wrote an essay on the aesthetics of music and also contributed to a volume, edited by his father, titled Portraits of Famous Men. While still at school in Zwickau, he read the works of the German poet-philosophers Schiller and Goethe, as well as Byron and the Greek tragedians. His most powerful and permanent literary inspiration was Jean Paul, a German writer whose influence is seen in Schumann's youthful novels Juniusabende, completed in 1826, and Selene.\nSchumann's interest in music was sparked by attending a performance of Ignaz Moscheles playing at Karlsbad, and he later developed an interest in the works of Beethoven, Schubert, and Mendelssohn. His father, who had encouraged his musical aspirations, died in 1826 when Schumann was 16. Thereafter, neither his mother nor his guardian encouraged him to pursue a music career. In 1828, Schumann left high school, and after a trip during which he met the poet Heinrich Heine in Munich, he left to study law at the University of Leipzig under family pressure. But in Leipzig Schumann instead focused on improvisation, song composition, and writing novels. He also began to seriously study piano with Friedrick Wieck, a well-known piano teacher. In 1829, he continued his law studies in Heidelberg, where he became a lifelong member of Corps Saxo-Borussia Heidelberg.\n\n\n=== 1830–1834 ===\n\nDuring Eastertide 1830, he heard the Italian violinist, violist, guitarist, and composer Niccolò Paganini play in Frankfurt. In July he wrote to his mother, \"My whole life has been a struggle between Poetry and Prose, or call it Music and Law.\" With her permission, by Christmas he was back in Leipzig, at age 20 taking piano lessons from his old master Friedrich Wieck, who assured him that he would be a successful concert pianist after a few years' study with him. During his studies with Wieck, some stories claim that Schumann permanently injured a finger on his right hand. Wieck claimed that Schumann damaged his finger by using a mechanical device that held back one finger while he exercised the others—which was supposed to strengthen the weakest fingers. Clara Schumann discredited the story, saying the disability was not due to a mechanical device, and Robert Schumann himself referred to it as \"an affliction of the whole hand.\" Some argue that, as the disability appeared to have been chronic and have affected the hand, and not just a finger, it was not likely caused by a finger strengthening device. In 2012, neurologists discussed Schumann's symptoms at a conference called \"Musicians With Dystonia.\"Schumann abandoned the idea of a concert career and devoted himself instead to composition. To this end he began a study of music theory under Heinrich Dorn, a German composer six years his senior and, at that time, conductor of the Leipzig Opera.\n\n\n==== Papillons ====\nSchumann's fusion of literary ideas with musical ones—known as program music—may have first taken shape in Papillons, Op. 2 (Butterflies), a musical portrayal of events in Jean Paul's novel Flegeljahre. In a letter from Leipzig dated April 1832, Schumann bids his brothers, \"Read the last scene in Jean Paul's Flegeljahre as soon as possible, because the Papillons are intended as a musical representation of that masquerade.\" This inspiration is foreshadowed to some extent in his first written criticism—an 1831 essay on Frédéric Chopin's variations on a theme from Mozart's Don Giovanni, published in the Allgemeine musikalische Zeitung. In it, Schumann creates imaginary characters who discuss Chopin's work: Florestan (the embodiment of Schumann's passionate, voluble side) and Eusebius (his dreamy, introspective side)—the counterparts of Vult and Walt in Flegeljahre. They call on a third, Meister Raro, for his opinion. Raro may represent either the composer himself, Wieck's daughter Clara, or the combination of the two (Clara + Robert).\nIn the winter of 1832, at age 22, Schumann visited relatives in Zwickau and Schneeberg, where he performed the first movement of his Symphony in G minor (without opus number, known as the \"Zwickauer\"). In Zwickau, the music was performed at a concert given by Clara Wieck, who was then just 13 years old. On this occasion Clara played bravura Variations by Henri Herz, a composer whom Schumann was already deriding as a philistine. Schumann's mother said to Clara, \"You must marry my Robert one day.\" The Symphony in G minor was not published during Schumann's lifetime but has been played and recorded in recent times.\nThe 1833 deaths of Schumann's brother Julius and his sister-in-law Rosalie in the worldwide cholera pandemic brought on a severe depressive episode.\n\n\n==== Neue Zeitschrift für Musik ====\nBy spring 1834, Schumann had sufficiently recovered to inaugurate Die Neue Zeitschrift für Musik (\"New Journal for Music\"), first published on 3 April 1834. In his writings, Schumann created a fictional music society based on people in his life, called the Davidsbündler, named after the biblical King David who fought against the Philistines. Schumann published most of his critical writings in the journal, and often lambasted the popular taste for flashy technical displays from figures whom Schumann perceived as inferior composers, or \"philistines\". Schumann campaigned to revive interest in major composers of the past, including Mozart, Beethoven, and Weber. He also promoted the work of some contemporary composers, including Chopin (about whom Schumann famously wrote, \"Hats off, Gentlemen! A genius!\") and Hector Berlioz, whom he praised for creating music of substance. On the other hand, Schumann disparaged the school of Franz Liszt and Richard Wagner. Among Schumann's associates at this time were composers Norbert Burgmüller and Ludwig Schuncke (to whom Schumann dedicated his Toccata in C).\n\n\n==== Carnaval ====\nCarnaval, Op. 9 (1834) is one of Schumann's most characteristic piano works. Schumann begins nearly every section of Carnaval with a musical cryptogram, the musical notes signified in German by the letters that spell Asch (A, E-flat, C, and B, or alternatively A-flat, C, and B; in German these are A, Es, C and H, and As, C and H respectively), the Bohemian town in which Ernestine was born, and the notes are also the musical letters in Schumann's own name. Eusebius and Florestan, the imaginary figures appearing so often in his critical writings, also appear, alongside brilliant imitations of Chopin and Paganini. To each of these characters he devotes a section of Carnaval. The work comes to a close with a march of the Davidsbündler—the league of King David's men against the Philistines—in which may be heard the clear accents of truth in contest with the dull clamour of falsehood embodied in a quotation from the seventeenth century Grandfather's Dance. The march, a step nearly always in duple meter, is here in 3/4 time (triple meter). The work ends in joy and a degree of mock-triumph. In Carnaval, Schumann went further than in Papillons, by conceiving the story as well as the musical representation (and also displaying a maturation of compositional resource).\n\n\n==== Relationships ====\nDuring the summer of 1834 Schumann became engaged to 16-year-old Ernestine von Fricken, the adopted daughter of a rich Bohemian-born noble. In August 1835, he learned that Ernestine was born illegitimate, which meant that she would have no dowry. Fearful that her limited means would force him to earn his living like a \"day-labourer,\" Schumann completely broke with her toward the end of the year. He felt a growing attraction to 15-year-old Clara Wieck. They made mutual declarations of love in December in Zwickau, where Clara appeared in concert. His budding romance with Clara was disrupted when her father learned of their trysts during the Christmas holidays. He summarily forbade them further meetings, and ordered all their correspondence burnt.\n\n\n=== 1835–1839 ===\nOn 3 October 1835, Schumann met Felix Mendelssohn at Wieck's house in Leipzig, and his enthusiastic appreciation of that artist was shown with the same generous freedom that distinguished his acknowledgement of the greatness of Chopin and other colleagues, and later prompted him to publicly pronounce the then-unknown Johannes Brahms a genius.\n\nIn 1837 Schumann published his Symphonic Studies, a complex set of étude-like variations written in 1834–1835, which demanded a finished piano technique. These variations were based on a theme by the adoptive father of Ernestine von Fricken. The work—described as \"one of the peaks of the piano literature, lofty in conception and faultless in workmanship\" [Hutcheson]—was dedicated to the young English composer William Sterndale Bennett, for whom Schumann had had a high regard when they worked together in Leipzig.The Davidsbündlertänze, Op. 6, (also published in 1837 despite the low opus number) literally \"Dances of the League of David\", is an embodiment of the struggle between enlightened Romanticism and musical philistinism. Schumann credited the two sides of his character with the composition of the work (the more passionate numbers are signed F. (Florestan) and the more dreamy signed E. (Eusebius)). The work begins with the \"motto of C. W.\" (Clara Wieck) denoting her support for the ideals of the Davidsbund. The Bund was a music society of Schumann's imagination, members of which were kindred spirits (as he saw them) such as Chopin, Paganini and Clara, as well as the personalized Florestan and Eusebius.Kinderszenen, Op. 15, completed in 1838 and a favourite of Schumann's piano works, depicts the innocence and playfulness of childhood. The \"Träumerei\" in F major, No. 7 of the set, is one of the most famous piano pieces ever written, and has been performed in myriad forms and transcriptions. It has been the favourite encore of several great pianists, including Vladimir Horowitz. Melodic and deceptively simple, the piece is \"complex\" in its harmonic structure.\nKreisleriana, Op. 16 (1838), considered one of Schumann's greatest works, carried his fantasy and emotional range deeper. Johannes Kreisler was a fictional musician created by poet E. T. A. Hoffmann, and characterized as a \"romantic brought into contact with reality.\" Schumann used the figure to express \"fantastic and mad\" emotional states. According to Hutcheson (\"The Literature of the Piano\"), this work is \"among the finest efforts of Schumann's genius. He never surpassed the searching beauty of the slow movements (Nos. 2, 4, 6) or the urgent passion of others (Nos. 1, 3, 5, 7) […] To appreciate it a high level of aesthetic intelligence is required […] This is no facile music, there is severity alike in its beauty and its passion.\"\nThe Fantasie in C, Op. 17, composed in the summer of 1836, is a work of passion and deep pathos, imbued with the spirit of the late Beethoven. Schumann intended to use proceeds from sales of the work toward the construction of a monument to Beethoven, who had died in 1827. The first movement of the Fantasie contains a musical quote from Beethoven's song cycle, An die ferne Geliebte, Op. 98 (at the Adagio coda, taken from the last song of the cycle). The original titles of the movements were Ruins, Triumphal Arch, and The Starry Crown. According to Franz Liszt, who played the work for Schumann and to whom it was dedicated, the Fantasie was apt to be played too heavily, and should have a dreamier (träumerisch) character than vigorous German pianists tended to impart. Liszt also said: \"It is a noble work, worthy of Beethoven, whose career, by the way, it is supposed to represent\". Again, according to Hutcheson: \"No words can describe the Phantasie, no quotations set forth the majesty of its genius. It must suffice to say that it is Schumann's greatest work in large form for piano solo.\"\nAfter a visit to Vienna, during which he discovered Franz Schubert's previously unknown Symphony No. 9 in C, in 1839 Schumann wrote the Faschingsschwank aus Wien (Carnival Prank from Vienna). Most of the joke is in the central section of the first movement, which makes a thinly veiled reference to La Marseillaise. (Vienna had banned the song due to harsh memories of Napoleon's invasion.) The festive mood does not preclude moments of melancholic introspection in the Intermezzo.\n\n\n=== 1840–1849 ===\nFrom 1832 to 1839, Schumann wrote almost exclusively for piano, but in 1840 alone he wrote at least 138 songs. Indeed, 1840 (the Liederjahr or year of song) is highly significant in Schumann's musical legacy, despite his earlier deriding of works for piano and voice as inferior.\n\nAfter a long and acrimonious legal battle with her father, Schumann married Clara Wieck in the Gedächtniskirche Schönefeld in Leipzig-Schönefeld, on 12 September 1840, the day before her 21st birthday. Had they waited another day, they would no longer have required her father's consent. Their marriage supported a remarkable business partnership, with Clara  acting as an inspiration, critic, and confidante to her husband. Despite her delicate appearance, she was an extremely strong-willed and energetic woman, who kept up a demanding schedule of concert tours in between bearing several children. Two years after their marriage, Friedrich Wieck at last reconciled himself with the couple, eager to see his grandchildren.\nPrior to the legal case and subsequent marriage, the lovers exchanged love letters and rendezvoused in secret. Robert often waited for hours in a cafe in a nearby city just to see Clara for a few minutes after one of her concerts. The strain of this long courtship and its consummation may have led to this great outpouring of Lieder (vocal songs with piano accompaniment). This is evident in Widmung, for example, where he uses the melody from Schubert's Ave Maria in the postlude in homage to Clara. Schumann's biographers attribute the sweetness, doubt, and despair of these songs to the emotions aroused by his love for Clara and the uncertainties of their future together.\nRobert and Clara had eight children, Emil (1846–1847), who died at 1 year; Marie (1841–1929); Elise (1843–1928); Julie (1845–1872); Ludwig (1848–1899); Ferdinand (1849–1891); Eugenie (1851–1938); and Felix (1854–1879).\n\nHis chief song-cycles in this period were settings of the Liederkreis of Joseph von Eichendorff, Op. 39 (depicting a series of moods relating to or inspired by nature); the Frauenliebe und -leben of Chamisso, Op. 42 (relating the tale of a woman's marriage, childbirth and widowhood); the Dichterliebe of Heine, Op. 48 (depicting a lover rejected, but coming to terms with his painful loss through renunciation and forgiveness); and Myrthen, a collection of songs, including poems by Goethe, Rückert, Heine, Byron, Burns and Moore. The songs Belsatzar, Op. 57 and Die beiden Grenadiere, Op. 49, both to Heine's words, show Schumann at his best as a ballad writer, although the dramatic ballad is less congenial to him than the introspective lyric. The Op. 35, 40 and 98a sets (words by Justinus Kerner, Chamisso and Goethe respectively), although less well known, also contain songs of lyric and dramatic quality.\n\nIn 1841 he wrote two of his four symphonies, No. 1 in B-flat, Op. 38, Spring and No. 4 in D minor (the latter a pioneering work in \"cyclic form\", was performed that year but published only much later after revision and extensive re-orchestration as Op. 120). He devoted 1842 to composing chamber music, including the Piano Quintet in E-flat, Op. 44, now one of his best known and most admired works; the Piano Quartet and three string quartets. In 1843 he wrote Paradise and the Peri, his first attempt at concerted vocal music, an oratorio style work based on Lalla-Rookh by Thomas Moore. The main role of Peri in the world premiere was performed by Schumann's family friend, soprano Livia Frege. After this, his compositions were not confined to any one form during any particular period.\nThe stage in his life when he was deeply engaged in setting Goethe's Faust to music (1844–53) was a turbulent one for his health. He spent the first half of 1844 with Clara on tour in Russia, and his depression grew worse as he felt inferior to Clara as a musician. On returning to Germany, he abandoned his editorial work and left Leipzig for Dresden, where he suffered from persistent \"nervous prostration\". As soon as he began to work, he was seized with fits of shivering and an apprehension of death, experiencing an abhorrence of high places, all metal instruments (even keys), and drugs. Schumann's diaries also state that he suffered perpetually from imagining that he had the note A5 sounding in his ears.His state of unease and neurasthenia is reflected in his Symphony in C, numbered second but third in order of composition, in which the composer explores states of exhaustion, obsession, and depression, culminating in Beethovenian spiritual triumph. Also published in 1845 was his Piano Concerto in A minor, Op. 54, originally conceived and performed as a one-movement Fantasy for Piano and Orchestra in 1841. It is one of the most popular and oft-recorded of all piano concertos; according to Hutcheson \"Schumann achieved a masterly work and we inherited the finest piano concerto since Mozart and Beethoven\".\n\nIn 1846, he felt he had recovered. In the winter, the Schumanns revisited Vienna, traveling to Prague and Berlin in the spring of 1847 and in the summer to Zwickau, where he was received with enthusiasm. This pleased him, since until that time he was famous in only Dresden and Leipzig.\nHis only opera, Genoveva, Op. 81, premiered in Spring 1850. In it, Schumann attempted to abolish recitative, which he regarded as an interruption to the musical flow (an influence on Richard Wagner; Schumann's consistently flowing melody can be seen as a forerunner to Wagner's Melos). The subject of Genoveva—based on Ludwig Tieck and Christian Friedrich Hebbel's plays—was not seen an ideal choice. The text is often considered to lack dramatic qualities; the work has not remained in the repertoire. As early as 1842 the possibilities of German opera had been keenly realized by Schumann, who wrote, \"Do you know my prayer as an artist, night and morning? It is called 'German Opera.' Here is a real field for enterprise ... something simple, profound, German\". And in his notebook of suggestions for the text of operas are found amongst others: Nibelungen, Lohengrin and Till Eulenspiegel.\nThe music to Byron's Manfred was written in 1849, the overture of which is one of Schumann's most frequently performed orchestral works. The insurrection of Dresden caused Schumann to move to Kreischa, a little village a few miles outside the city. In August 1849, on the occasion of the centenary of Goethe's birth, completed scenes of Schumann's Scenes from Goethe's Faust were performed in Dresden, Leipzig and Weimar. Liszt gave him assistance and encouragement. The rest of the work was written later in 1849, and the overture (which Schumann described as \"one of the sturdiest of [his] creations\") in 1853.\n\n\n=== After 1850 ===\n\nFrom 1850 to 1854, Schumann composed in a wide variety of genres. Critics have disputed the quality of his work at this time; a widely held view has been that his music showed signs of mental breakdown and creative decay. More recently, critics have suggested that the changes in style may be explained by \"lucid experimentation\".In 1850, Schumann succeeded Ferdinand Hiller as musical director at Düsseldorf, but he was a poor conductor and quickly aroused the opposition of the musicians. According to Harold C. Schonberg, in his 1967 The Great Conductors: \"The great composer was impossible on the platform ... There is something heartrending about poor Schumann's epochal inefficiency as a conductor.\" His contract was eventually terminated. By the end of that year he completed his Symphony No. 3, \"Rhenish\" (a work containing five movements and whose 4th movement is apparently intended to represent an episcopal coronation ceremony). In 1851 he revised what would be published as his fourth symphony. From 1851 to 1853 he visited Switzerland, Belgium and Leipzig.\nOn 30 September 1853, the 20-year-old composer Johannes Brahms arrived unannounced at the door of the Schumanns carrying a letter of introduction from violinist Joseph Joachim. (Schumann was not at home, and would not meet Brahms until the next day.) Brahms amazed Clara and Robert with his music, stayed with them for several weeks, and became a close family friend. (He later worked closely with Clara to popularize Schumann's compositions during her long widowhood.)\nDuring this time Schumann, Brahms and Schumann's pupil Albert Dietrich collaborated on the composition of the F-A-E Sonata for Joachim; Schumann also published an article, \"Neue Bahnen\" (\"New Paths\") in the Neue Zeitschrift (his first article in many years), hailing the unknown young Brahms from Hamburg, a man who had published nothing, as \"the Chosen One\" who \"was destined to give ideal expression to the times.\" It was an extraordinary way to present Brahms to the musical world, setting up great expectations that he did not fulfill for many years. In January 1854, Schumann went to Hanover, where he heard a performance of his Paradise and the Peri organized by Joachim and Brahms. Two years later at Schumann's request, the work received its first English performance conducted by William Sterndale Bennett.\n\nSchumann returned to Düsseldorf and began to edit his complete works and make an anthology on the subject of music. He suffered a renewal of the symptoms that had threatened him earlier. Besides the single note sounding in his ear (possibly evidence of tinnitus,) he imagined that voices sounded in his ear and he heard angelic music. One night he suddenly left his bed, having dreamt or imagined that a ghost (purportedly the spirit of either Schubert or Mendelssohn) had dictated a \"spirit theme\" to him. The theme was one he had used several times before: in his Second String Quartet, again in his Lieder-Album für die Jugend, and finally in the slow movement of his Violin Concerto. In the days leading up to his suicide attempt, Schumann wrote five variations on this theme for the piano, his last completed work, today known as the Geistervariationen (Ghost Variations). Brahms published it in a supplementary volume to the complete edition of Schumann's piano music. In 1861 Brahms published his Variations for Piano Four Hands, Op. 23, based on this theme.\n\n\n=== Final illness and death ===\nIn late February 1854, Schumann's symptoms increased, the angelic visions sometimes being replaced by demonic ones. He warned Clara that he feared he might do her harm. On 27 February, he attempted suicide by throwing himself from a bridge into the Rhine River (his elder sister Emilie had committed suicide in 1825, possibly by drowning herself). Rescued by boatmen and taken home, he asked to be taken to an asylum for the insane. He entered Dr. Franz Richarz's sanatorium in Endenich, a quarter of Bonn, and remained there until he died on 29 July 1856 at the age of 46. During his confinement, he was not allowed to see Clara, although Brahms was free to visit him. Clara finally visited him two days before his death. He appeared to recognize her, but was able to speak only a few words.Given his reported symptoms, one modern view is that he died from syphilis, which he could have contracted during his student days, and which could have remained latent during most of his marriage. According to studies by the musicologist and literary scholar Eric Sams, Schumann's symptoms during his terminal illness and death appear consistent with those of mercury poisoning; mercury was a common treatment for syphilis and other conditions. Another possibility is that his neurological problems were a result of an intracranial mass. A report by Janisch and Nauhaus on Schumann's autopsy indicates that he had a \"gelatinous\" tumor at the base of the brain; it may have represented a colloid cyst, a craniopharyngioma, a chordoma, or a chordoid meningioma. In particular, meningiomas are known to produce musical auditory hallucinations such as Schumann reported. It has also been hypothesised that he suffered from schizophrenia, or schizoaffective disorder; bipolar type, or bipolar disorder and bipolar II disorder. His medical records from this illness were released in 1991, and suggest a \"progressive paralysis\", a term used for neurosyphilis at the time, although a diagnostic test for Treponema pallidum did not become available till 1906.Schumann heard a persistent A-note at the end of his life. It was a form of tinnitus, or perhaps an auditory hallucination related to his major depressive episode. At times, he had musical hallucinations that were longer than just the single A, but his diaries include comments about hearing that annoying single note.After Robert's death, Clara continued her career as a concert pianist, which supported the family. From mid-career on, she mainly performed music by leading composers. A hired cook and housekeeper tended to the children while she traveled. In 1856, she first visited England. The critics received Robert's music coolly, with Henry Fothergill Chorley being particularly harsh. She returned to London in 1865 and made regular appearances there in later years, often performing chamber music with the violinist Joseph Joachim and others. She became the authoritative editor of her husband's works for Breitkopf & Härtel. It was rumoured that she and Brahms destroyed many of Schumann's later works, which they thought were tainted by his madness, but only the Five Pieces for Cello and Piano are known to have been destroyed. Most of Schumann's late works, particularly the Violin Concerto, the Fantasy for Violin and Orchestra and the Violin Sonata No. 3, all from 1853, have entered the repertoire.\n\n\n== Legacy ==\n\nSchumann had considerable influence in the nineteenth century and beyond, despite his adoption of more conservative modes of composition after his marriage. He left an array of acclaimed music in virtually all the forms then known. Partly through his protégé Brahms, Schumann's ideals and musical vocabulary became widely disseminated. Composer Sir Edward Elgar called Schumann \"my ideal.\"\nSchumann has often been confused with Austrian composer Franz Schubert; one well-known example occurred in 1956, when East Germany issued a pair of postage stamps featuring Schumann's picture against an open score that featured Schubert's music. The stamps were soon replaced by a pair featuring music written by Schumann.\n\n\n== Instruments ==\nOne of the best known instruments that Robert Schumann played on was the grand piano by Conrad Graf, a present from Graf on the occasion of Robert and Clara’s marriage in 1839. This instrument stood in Schumann’s workroom in Düsseldorf and was later given by Clara Schumann to Johannes Brahms. After changing a few lodgings, it was received by the Gesellschaft der Musikfreunde and can be seen at the Kunsthistorisches Museum in Vienna.\n\n\n== Compositions ==\nList of compositions by Robert Schumann\nCategory:Compositions by Robert Schumann\n\n\n== Media portrayals ==\nDreaming (1944) is a UFA movie starring Mathias Wieman as Schumann, Hilde Krahl as Clara Wieck, Ullrich Haupt as Johannes Brahms, and Emil Lohkamp as Franz Liszt.\nSong of Love (1947) is an MGM film starring Paul Henreid as Schumann, Katharine Hepburn as Clara Wieck, Robert Walker as Johannes Brahms, and Henry Daniell as Franz Liszt.\nPeter Schamoni's 1983 movie Frühlingssinfonie (Spring Symphony) tells the story of Schumann and Wieck's romance, against her father's opposition. Robert was played by Herbert Grönemeyer, Clara by Nastassja Kinski, and Clara's father by Rolf Hoppe. The role of Niccolò Paganini was played by the violinist Gidon Kremer. The score was written by Grönemeyer and conducted by Wolfgang Sawallisch.\nThe Andrew Crumey novel Mobius Dick has a chapter depicting Schumann at Endenich.\nSeinfeld: Robert Schumann is mentioned in a 1991 episode of Seinfeld called \"The Jacket\".\nFrasier: The troubled Dresden premiere of the Second Symphony is mentioned in a 1998 episode of Frasier \"Frasier's Curse\".\nGeliebte Clara (\"Beloved Clara\") was a 2008 Franco-German-Hungarian film about the lives of Clara and Robert.\nLonging is a 2000 biographical novel by American author J. D. Landis.\n\n\n== Notes ==\n\n\n== References ==\n\n\n== Bibliography ==\n\n\n== External links ==\n\n\n=== Life and works ===\nMusical Rules at Home and in Life – text by Robert Schumann\n\"Discovering Schumann\". BBC Radio 3.\nTroubadisc – Robert Schumann\nSächsische Akademie der Wissenschaften zu Leipzig – edition of letters written by Robert and Clara Schumann\nTexts and translations of Schumann's Lieder\nThe city of Robert Schumann\nRobert and Clara Schumann and their teacher, Johann Sebastian Bach\nWorks by or about Robert Schumann at Internet Archive (texts)\n\n\n=== Sheet music ===\nFree scores by Robert Schumann at the International Music Score Library Project (IMSLP)\nFree scores by Robert Schumann in the Choral Public Domain Library (ChoralWiki)\nFree digital scores by Robert Schumann in the OpenScore Lieder Corpus\nRobert Schumann at the Mutopia Project\nWorks by Robert Schumann at Project Gutenberg\n\n\n=== Recordings and MIDI ===\nSchumann cylinder recordings, from the Cylinder Preservation and Digitization Project at the University of California, Santa Barbara Library.\nWorks by or about Robert Schumann at Internet Archive (audio and video)\nRecording of Kinderszenen (Scenes from Childhood)\nSelected Lieder (MIDI)\nKunst der Fuge Robert Schumann – MIDI files\nHerbert von Karajan / Vienna Symphony Orchestra rehearse the 4th Symphony on YouTube"