"In music, function (also referred to as harmonic function) is a term used to denote the relationship of a chord or a scale degree to a tonal centre. Two main theories of tonal functions exist today:\n\nThe German theory created by Hugo Riemann in his Vereinfachte Harmonielehre of 1893, which soon became an international success (English and Russian translations in 1896, French translation in 1899), and which is the theory of functions properly speaking. Riemann described three abstract tonal \"functions\", tonic, dominant and subdominant, denoted by the letters T, D and S respectively, each of which could take on a more or less modified appearance in any chord of the scale. This theory, in several revised forms, remains much in use for the pedagogy of harmony and analysis in German-speaking countries and in North- and East-European countries.\nThe Viennese theory, characterized by the use of Roman numerals to denote the chords of the tonal scale, as developed by Simon Sechter, Arnold Schoenberg, Heinrich Schenker and others, practiced today in Western Europe and the United States. This theory in origin was not explicitly about tonal functions. It considers the relation of the chords to their tonic in the context of harmonic progressions, often following the cycle of fifths. That this actually describes what could be termed the \"function\" of the chords becomes quite evident in Schoenberg's Structural Functions of Harmony of 1954, a short treatise dealing mainly with harmonic progressions in the context of a general \"monotonality\".Both theories find part of their inspiration in the theories of Jean-Philippe Rameau, starting with his Traité d'harmonie of 1722. Even if the concept of harmonic function was not so named before 1893, it could be shown to exist, explicitly or implicitly, in many theories of harmony before that date. Early usages of the term in music (not necessarily in the sense implied here, or only vaguely so) include those by Fétis (Traité complet de la théorie et de la pratique de l'harmonie, 1844), Durutte (Esthétique musicale, 1855), Loquin (Notions élémentaires d'harmonie moderne, 1862), etc.The idea of function has been extended further and is sometimes used to translate Antique concepts, such as dynamis in Ancient Greece, or qualitas in medieval Latin.\n\n\n== Origins of the concept ==\nThe concept of harmonic function originates in theories about just intonation. It was realized that three perfect major triads, distant from each other by a perfect fifth, produced the seven degrees of the major scale in one of the possible forms of just intonation: for instance, the triads F–A–C, C–E–G and G–B–D (subdominant, tonic, and dominant respectively) produce the seven notes of the major scale. These three triads were soon considered the most important chords of the major tonality, with the tonic in the center, the dominant above and the subdominant under.\nThis symmetric construction may have been one of the reasons why the fourth degree of the scale, and the chord built on it, were named \"subdominant\", i.e. the \"dominant under [the tonic]\". It also is one of the origins of the dualist theories which described not only the scale in just intonation as a symmetric construction, but also the minor tonality as an inversion of the major one. Dualist theories are documented from the 16th century onwards.\n\n\n== German functional theory ==\nThe term 'functional harmony' derives from Hugo Riemann and, more particularly, from his Harmony Simplified. Riemann's direct inspiration was Moritz Hauptmann's dialectic description of tonality. Riemann described three abstract functions: the tonic, the dominant (its upper fifth), and the subdominant (its lower fifth). He also considered the minor scale to be the inversion of the major scale, so that the dominant was the fifth above the tonic in major, but below the tonic in minor; the subdominant, similarly, was the fifth below the tonic (or the fourth above) in major, and the reverse in minor.\nDespite the complexity of his theory, Riemann's ideas had huge impact, especially where German influence was strong. A good example in this regard are the textbooks by Hermann Grabner. More recent German theorists have abandoned the most complex aspect of Riemann's theory, the dualist conception of major and minor, and consider that the dominant is the fifth degree above the tonic, the subdominant the fourth degree, both in minor and in major.\n\nIn Diether de la Motte's version of the theory, the three tonal functions are denoted by the letters T, D and S, for Tonic, Dominant and Subdominant respectively; the letters are uppercase for functions in major (T, D, S), lowercase for functions in minor (t, d, s). Each of these functions can in principle be fulfilled by three chords: not only the main chord corresponding to the function, but also the chords a third lower or a third higher, as indicated by additional letters. An additional letter P or p indicates that the function is fulfilled by the relative (German Parallel) of its main triad: for instance Tp for the minor relative of the major tonic (e.g., A minor for C major), tP for the major relative of the minor tonic (e.g. E♭ major for c minor), etc. The other triad a third apart from the main one may be denoted by an additional G or g for Gegenparallelklang or Gegenklang (\"counterrelative\"), for instance tG for the major counterrelative of the minor tonic (e.g. A♭ major for C minor). \nThe relation between triads a third apart resides in the fact that they differ from each other by one note only, the two other notes being common notes. In addition, within the diatonic scale, triads a third apart necessarily are of opposite mode. In the simplified theory where the functions in major and minor are on the same degrees of the scale, the possible functions of triads on degrees I to VII of the scale could be summarized as in the table below (degrees II in minor and VII in major, diminished fifths in the diatonic scale, are considered as chords without fundamental). Chords on III and VI may exert the same function as those a third above or a third below, but one of these two is less frequent than the other, as indicated by parentheses in the table.\n\nIn each case, the mode of the chord is denoted by the final letter: for instance, Sp for II in major indicates that II is the minor relative (p) of the major subdominant (S). The major VIth degree in minor is the only one where both functions, sP (major relative of the minor subdominant) and tG (major counterparallel of the minor tonic), are equally plausible. Other signs (not discussed here) are used to denote altered chords, chords without fundamental, applied dominants, etc. Degree VII in harmonic sequence (e.g. I–IV–VII–III–VI–II–V–I) may at times be denoted by its roman numeral; in major, the sequence would then be denoted by T–S–VII–Dp–Tp–Sp–D–T.\nAs summarized by d'Indy (1903), who shared the conception of Riemann:\n\nThere is only one chord, a perfect chord; it alone is consonant because it alone generates a feeling of repose and balance;\nthis chord has two different forms, major and minor, depending whether the chord is composed of a minor third over a major third, or a major third over a minor;\nthis chord is able to take on three different tonal functions, tonic, dominant, or subdominant.\n\n\n== Viennese theory of the degrees ==\n\nThe Viennese theory on the other hand, the \"Theory of the degrees\" (Stufentheorie), represented by Simon Sechter, Heinrich Schenker and Arnold Schoenberg among others, considers that each degree has its own function and refers to the tonal center through the cycle of fifths; it stresses harmonic progressions above chord quality. In music theory as it is commonly taught in the US, there are six or seven different functions, depending on whether degree VII is considered to possess an independent function.\n\nStufentheorie stresses the individuality and independence of the seven harmonic degrees. Moreover, unlike Funktionstheorie, where the primary harmonic model is the I–IV–V–I progression, Stufentheorie leans heavily on the cycle of descending fifths I–IV–VII–III–VI–II–V–I\".\n\n\n== Comparison of the terminologies ==\nThe table below compares the English and German terminologies for the major scale. In English, the names of the scale degrees are also the names of their function, and they remain the same in major and in minor.\n\nNote that ii, iii, and vi are lowercase: this indicates that they are minor chords; vii° indicates that this chord is a diminished triad.\n\nSome may at first be put off by the overt theorizing apparent in German harmony, wishing perhaps that a choice be made once and for all between Riemann's Funktionstheorie and the older Stufentheorie, or possibly believing that so-called linear theories have settled all earlier disputes. Yet this ongoing conflict between antithetical theories, with its attendant uncertainties and complexities, has special merits. In particular, whereas an English-speaking student may falsely believe that he or she is learning harmony \"as it really is,\" the German student encounters what are obviously theoretical constructs and must deal with them accordingly.\nReviewing usage of harmonic theory in American publications, William Caplin writes:\nMost North American textbooks identify individual harmonies in terms of the scale degrees of their roots. ... Many theorists understand, however, that the Roman numerals do not necessarily define seven fully distinct harmonies, and they instead propose a classification of harmonies into three main groups of harmonic functions: tonic, dominant, and pre-dominant.\nTonic harmonies include the I and VI chords in their various positions.\nDominant harmonies include the V and VII chords in their various positions. III can function as a dominant substitute in some contexts (as in the progression V–III–VI).\nPre-dominant harmonies include a wide variety of chords: IV, II, ♭II, secondary (applied) dominants of the dominant (such as VII7/V), and the various \"augmented-sixth\" chords. ... The modern North American adaptation of the function theory retains Riemann’s category of tonic and dominant functions but usually reconceptualizes his \"subdominant\" function into a more all-embracing pre-dominant function.\nCaplin further explains that there are two main types of pre-dominant harmonies, \"those built above the fourth degree of the scale () in the bass voice and those derived from the dominant of the dominant (V/V)\" (p. 10). The first type includes IV, II6 or ♭II6, but also other positions of these, such as IV6 or ♭II. The second type groups harmonies which feature the raised-fourth scale degree (♯) functioning as the leading tone of the dominant: VII7/V, V6V, or the three varieties of augmented sixth chords.\n\n\n== See also ==\nCommon practice period\nConstant structure\nDiatonic and chromatic\nNondominant seventh chord\nSecondary dominant\nSubsidiary chord\nRoman numeral analysis\n\n\n== References ==\n\n\n== Further reading ==\nImig, Renate (1970). System der Funktionsbezeichnung in den Harmonielehren seit Hugo Riemann. Düsseldorf: Gesellschaft zur Förderung der systematischen Musikwissenschaft. [German]\nRehding, Alexander: Hugo Riemann and the Birth of Modern Musical Thought (New Perspectives in Music History and Criticism). Cambridge University Press (2003). ISBN 978-0-521-82073-8.\nRiemann, Hugo: Vereinfachte Harmonielehre, oder die Lehre von den tonalen Funktionen der Akkorde (1893). ASIN: B0017UOATO.\nSchoenberg, Arnold: Structural Functions of Harmony. W.W.Norton & Co. (1954, 1969) ISBN 978-0-393-00478-6, ISBN 978-0-393-02089-2.\n\n\n== External links ==\nUnlocking the Mysteries of Diatonic Harmony www.artofcomposing.com\nExample of Music theory course description from Juilliard: \"Principles of harmony\" (Archive from 24 November 2010, accessed 28 May 2013)."