"In music, function (also referred to as harmonic function) is a term used to denote the relationship of a chord or a scale degree to a tonal centre. Two main theories of tonal functions exist today:\n\nThe German theory created by Hugo Riemann in his Vereinfachte Harmonielehre of 1893, which soon became an international success (English and Russian translations in 1896, French translation in 1899), and which is the theory of functions properly speaking. Riemann described three abstract tonal \"functions\", tonic, dominant and subdominant, denoted by the letters T, D and S respectively, each of which could take on a more or less modified appearance in any chord of the scale. This theory, in several revised forms, remains much in use for the pedagogy of harmony and analysis in German-speaking countries and in North- and East-European countries.\nThe Viennese theory, characterized by the use of Roman numerals to denote the chords of the tonal scale, as developed by Simon Sechter, Arnold Schoenberg, Heinrich Schenker and others, practiced today in Western Europe and the United States. This theory in origin was not explicitly about tonal functions. It considers the relation of the chords to their tonic in the context of harmonic progressions, often following the cycle of fifths. That this actually describes what could be termed the \"function\" of the chords becomes quite evident in Schoenberg's Structural Functions of Harmony of 1954, a short treatise dealing mainly with harmonic progressions in the context of a general \"monotonality\".Both theories find part of their inspiration in the theories of Jean-Philippe Rameau, starting with his Traité d'harmonie of 1722. Even if the concept of harmonic function was not so named before 1893, it could be shown to exist, explicitly or implicitly, in many theories of harmony before that date. Early usages of the term in music (not necessarily in the sense implied here, or only vaguely so) include those by Fétis (Traité complet de la théorie et de la pratique de l'harmonie, 1844), Durutte (Esthétique musicale, 1855), Loquin (Notions élémentaires d'harmonie moderne, 1862), etc.The idea of function has been extended further and is sometimes used to translate Antique concepts, such as dynamis in Ancient Greece, or qualitas in medieval Latin."