"The Hebrew term Abaddon (Hebrew: אֲבַדּוֹן‎ Avaddon, meaning \"destruction\", \"doom\"), and its Greek equivalent Apollyon (Koinē Greek: Ἀπολλύων, Apollúōn meaning \"Destroyer\") appear in the Bible as both a place of destruction and an archangel of the abyss. In the Hebrew Bible, abaddon is used with reference to a bottomless pit, often appearing alongside the place Sheol (שְׁאוֹל Šəʾōl), meaning the realm of the dead.\nIn the Book of Revelation of the New Testament, an angel called Abaddon is described as the king of an army of locusts; his name is first transcribed in Koine Greek (Revelation 9:11—\"whose name in Hebrew is Abaddon,\") as Ἀβαδδών, and then translated Ἀπολλύων, Apollyon. The Vulgate and the Douay–Rheims Bible have additional notes not present in the Greek text, \"in Latin Exterminans\", exterminans being the Latin word for \"destroyer\".\n\n\n== Etymology ==\nAccording to the Brown–Driver–Briggs lexicon, the Hebrew Hebrew: אבדון‎ ’ăḇaddōn is an intensive form of the Semitic root and verb stem אָבַד ’ăḇāḏ  \"perish\", transitive \"destroy\", which occurs 184 times in the Hebrew Bible. The Septuagint, an early Greek translation of the Hebrew Bible, renders \"Abaddon\" as \"ἀπώλεια\", while the Greek Apollýon is the active participle of ἀπόλλυμι apóllymi, \"to destroy\".\n\n\n== Judaism ==\n\n\n=== Hebrew Bible ===\nThe term abaddon appears six times in the Masoretic text of the Hebrew Bible; abaddon means destruction or \"place of destruction\", or the realm of the dead, and is accompanied by Sheol. \n\nJob 26:6: the grave (Sheol) is naked before Him, and destruction (Abaddon) has no covering.\nJob 28:22: destruction (Abaddon) and death say.\nJob 31:12: it is a fire that consumes to destruction (Abaddon).\nPsalm 88:11: Shall thy loving kindness be declared in the grave (Sheol) or thy faithfulness in destruction (Abaddon)?\nProverbs 15:11: Hell (Sheol) and Destruction (Abaddon) are before the LORD, how much more the hearts of the children of men?\nProverbs 27:20: Hell (Sheol) and Destruction (Abaddon) are never full; so the eyes of man are never satisfied. (KJV, 1611)\n\n\n=== Second Temple era texts ===\nThe text of the Thanksgiving Hymns—which was found in the Dead Sea Scrolls—tells of \"the Sheol of Abaddon\" and of the \"torrents of Belial [that] burst into Abaddon\". The Biblical Antiquities (misattributed to Philo) mentions Abaddon as a place (destruction) rather than an individual. Abaddon is also one of the compartments of Gehenna. By extension, it can mean an underworld abode of lost souls, or Gehenna.\n\n\n=== Rabbinical literature ===\nIn some legends, Abaddon is identified as a realm where the damned lie in fire and snow, one of the places in Gehenna that Moses visited.\n\n\n== Christianity ==\n\n\n=== New Testament ===\nThe New Testament contains the first known depiction of Abaddon as an individual entity instead of a place.\n\nA king, the angel of the bottomless pit; whose name in Hebrew is Abaddon, and in Greek Apollyon; in Latin Exterminans.\nIn Revelation 9:11, Abaddon is described as \"Destroyer\", the angel of the Abyss, and as the king of a plague of locusts resembling horses with crowned human faces, women's hair, lions' teeth, wings, iron breast-plates, and a tail with a scorpion's stinger that torments for five months anyone who does not have the seal of God on their foreheads.The symbolism of Revelation 9:11 leaves the identity of Abaddon open to interpretation. Protestant commentator Matthew Henry (1708) believed Abaddon to be the Antichrist, whereas the Jamieson-Fausset-Brown Bible Commentary (1871) and Henry Hampton Halley (1922) identified the angel as Satan.In contrast, the Methodist publication The Interpreter's Bible states, \"Abaddon, however, is an angel not of Satan but of God, performing his work of destruction at God's bidding\", citing the context at Revelation chapter 20, verses 1 through 3. Jehovah's Witnesses also cite Revelation 20:1-3 where the angel having \"the key of the abyss\" is actually shown to be a representative of God, concluding that \"Abaddon\" is another name for Jesus after his resurrection.\n\n\n== Apocryphal texts ==\nIn the gnostic 3rd century Acts of Thomas, Abaddon is the name of a demon, or the devil himself.\nAbaddon is given particularly important roles in two sources, a homily entitled \"The Enthronement of Abaddon\" by pseudo-Timothy of Alexandria, and the Book of the Resurrection of Jesus Christ, by Bartholomew the Apostle. In the homily by Timothy, Abaddon was first named Muriel, and had been given the task by God of collecting the earth that would be used in the creation of Adam. Upon completion of this task, the angel was appointed as a guardian. Everyone, including the angels, demons, and corporeal entities feared him. Abaddon was promised that any who venerated him in life could be saved. Abaddon is also said to have a prominent role in the Last Judgment, as the one who will take the souls to the Valley of Josaphat. He is described in the Book of the Resurrection of Jesus Christ as being present in the Tomb of Jesus at the moment of the resurrection of Jesus.\n\n\n== See also ==\nAbaddon in popular culture\nHades\n\n\n== Citations ==\n\n\n== General bibliography ==\nHalley, Henry H. (2000).  James E. Ruark (ed.). Halley's Bible Handbook. Grand Rapids, MI: Zondervan Publishing House. ISBN 0-310-22479-9.\nMacDonald, William (1995).  Art Farstad (ed.). Believer's Bible Commentary. Nashville, TN: Thomas Nelson Publishers. ISBN 0-8407-1972-8.\nMetzeger, Bruce M.; Michael D. Coogan, eds. (1993). The Oxford Companion to the Bible. Oxford, UK: Oxford University Press. ISBN 0-19-504645-5.\n\n\n== External links ==\n Media related to Abaddon at Wikimedia Commons\nChisholm, Hugh, ed. (1911). \"Abaddon\". Encyclopædia Britannica. 1 (11th ed.). Cambridge University Press. p. 6."