"Oregon ( (listen)) is a state in the Pacific Northwest region of the Western United States. The Columbia River delineates much of Oregon's northern boundary with Washington, while the Snake River delineates much of its eastern boundary with Idaho. The 42° north parallel delineates the southern boundary with California and Nevada.\nOregon has been home to many indigenous nations for thousands of years. The first European traders, explorers, and settlers began exploring what is now Oregon's Pacific coast in the early-mid 1500s. As early as 1565, the Spanish began sending vessels northeast from the Philippines, riding the Kuroshio Current in a sweeping circular route across the northern part of the Pacific. In 1592, Juan de Fuca undertook detailed mapping and studies of ocean currents in the Pacific Northwest, including the Oregon coast as well as the strait now bearing his name. Spanish ships – 250 in as many years – would typically not land before reaching Cape Mendocino in California, but some landed or wrecked in what is now Oregon. Nehalem tales recount strangers and the discovery of items like chunks of beeswax and a lidded silver vase, likely connected to the 1707 wreck of the San Francisco Xavier.In 1843, an autonomous government was formed in the Oregon Country, and the Oregon Territory was created in 1848. Oregon became the 33rd state of the U.S. on February 14, 1859. Today, with 4 million people over 98,000 square miles (250,000 km2), Oregon is the ninth largest and 27th most populous U.S. state. The capital, Salem, is the second-most populous city in Oregon, with 169,798 residents. Portland, with 647,805, ranks as the 26th among U.S. cities. The Portland metropolitan area, which also includes the city of Vancouver, Washington, to the north, ranks the 25th largest metro area in the nation, with a population of 2,453,168.\nOregon is one of the most geographically diverse states in the U.S., marked by volcanoes, abundant bodies of water, dense evergreen and mixed forests, as well as high deserts and semi-arid shrublands. At 11,249 feet (3,429 m), Mount Hood, a stratovolcano, is the state's highest point. Oregon's only national park, Crater Lake National Park, comprises the caldera surrounding Crater Lake, the deepest lake in the United States. The state is also home to the single largest organism in the world, Armillaria ostoyae, a fungus that runs beneath 2,200 acres (8.9 km2) of the Malheur National Forest.Because of its diverse landscapes and waterways, Oregon's economy is largely powered by various forms of agriculture, fishing, and hydroelectric power. Oregon is also the top lumber producer of the contiguous United States, with the lumber industry dominating the state's economy during the 20th century. Technology is another one of Oregon's major economic forces, beginning in the 1970s with the establishment of the Silicon Forest and the expansion of Tektronix and Intel. Sportswear company Nike, Inc., headquartered in Beaverton, is the state's largest public corporation with an annual revenue of $30.6 billion."