"Thomas Campbell (27 July 1777 – 15 June 1844) was a Scottish poet. He was a founder and the first President of the Clarence Club and a co-founder of the Literary Association of the Friends of Poland; he was also one of the initiators of a plan to found what became University College London. In 1799 he wrote \"The Pleasures of Hope\", a traditional 18th-century didactic poem in heroic couplets. He also produced several patriotic war songs—\"Ye Mariners of England\", \"The Soldier's Dream\", \"Hohenlinden\" and, in 1801, \"The Battle of the Baltic\".\n\n\n== Early life ==\nBorn on High Street, Glasgow in 1777, he was the youngest of the eleven children of Alexander Campbell (1710–1801), son of the 6th and last Laird of Kirnan, Argyll, descended from the MacIver-Campbells. His mother, Margaret (born 1736), was the daughter of John Campbell of Craignish and Mary, daughter of Robert Simpson, \"a celebrated Royal Armourer\".In about 1737, his father went to Falmouth, Virginia as a merchant in business with his wife's brother Daniel Campbell, becoming a Tobacco Lord trading between there and Glasgow. They enjoyed a long period of prosperity until he lost his property and their old and respectable firm collapsed in consequence of the American Revolutionary War. Having personally lost nearly £20,000, Campbell's father was nearly ruined. Several of Thomas' brothers remained in Virginia, one of whom married a daughter of Patrick Henry.Both his parents were intellectually inclined, his father being a close friend of Thomas Reid (for whom Campbell was named) while his mother was known for her refined taste and love of literature and music. Thomas Campbell was educated at the High School of Glasgow and the University of Glasgow, where he won prizes for classics and verse-writing. He spent the holidays as a tutor in the western Highlands and his poems Glenara and the Ballad of Lord Ullin's Daughter were written during this time while visiting the Isle of Mull.In 1797, Campbell travelled to Edinburgh to attend lectures on law. He continued to support himself as a tutor and through his writing, aided by Robert Anderson, the editor of the British Poets. Among his contemporaries in Edinburgh were Sir Walter Scott, Henry Brougham, Francis Jeffrey, Thomas Brown, John Leyden and James Grahame. These early days in Edinburgh influenced such works as The Wounded Hussar, The Dirge of Wallace and the Epistle to Three Ladies.\n\n\n== Career ==\nIn 1799, six months after the publication of the Lyrical Ballads of Wordsworth and Coleridge, \"The Pleasures of Hope\" was published. It is a rhetorical and didactic poem in the taste of his time, and owed much to the fact that it dealt with topics near to men's hearts, with the French Revolution, the partition of Poland and with negro slavery. Its success was instantaneous, but Campbell was deficient in energy and perseverance and did not follow it up. He went abroad in June 1800 without any very definite aim, visited Gottlieb Friedrich Klopstock at Hamburg, and made his way to Regensburg, which was taken by the French three days after his arrival. He found refuge in a Scottish monastery. Some of his best lyrics, \"Hohenlinden\", \"Ye Mariners of England\" and \"The Soldier's Dream\" (which was later set by Beethoven), belong to his German tour. He spent the winter in Altona, where he met an Irish exile, Anthony McCann, whose history suggested The Exile of Erin.He had at that time the intention of writing an epic on Edinburgh to be entitled \"The Queen of the North\". On the outbreak of war between Denmark and England he hurried home, the \"Battle of the Baltic\" being drafted soon after. At Edinburgh he was introduced to the first Lord Minto, who took him in the next year to London as occasional secretary. In June 1803 appeared a new edition of the \"Pleasures of Hope\", to which some lyrics were added.In 1803 Campbell married his second cousin, Matilda Sinclair, and settled in London. He was well received in Whig society, especially at Holland House. His prospects, however, were slight when in 1805 he received a government pension of £200. In that year the Campbells removed to Sydenham. Campbell was at this time regularly employed on the Star newspaper, for which he translated the foreign news. In 1809 he published a narrative poem in the Spenserian stanza, Gertrude of Wyoming – referring to the Wyoming Valley of Pennsylvania and the Wyoming Valley Massacre – with which were printed some of his best lyrics. He was slow and fastidious in composition, and the poem suffered from overelaboration. Francis Jeffrey wrote to the author:\n\n\"Your timidity or fastidiousness, or some other knavish quality, will not let you give your conceptions glowing, and bold, and powerful, as they present themselves; but you must chasten, and refine, and soften them, forsooth, till half their nature and grandeur is chiselled away from them. Believe me, the world will never know how truly you are a great and original poet till you venture to cast before it some of the rough pearls of your fancy.\"\n\nIn 1812 he delivered a series of lectures on poetry in London at the Royal Institution; and he was urged by Sir Walter Scott to become a candidate for the chair of literature at Edinburgh University. In 1814 he went to Paris, making there the acquaintance of the elder Schlegel, of Baron Cuvier and others. His pecuniary anxieties were relieved in 1815 by a legacy of £4000. He continued to occupy himself with his Specimens of the British Poets, the design of which had been projected years before. The work was published in 1819. It contains a selection with short lives of the poets, and prefixed to it a critical essay on poetry. In 1820 he accepted the editorship of the New Monthly Magazine, and in the same year made another tour in Germany. Four years later appeared his \"Theodric\", a not very successful poem of domestic life.\n\n\n== Later life ==\n\nCampbell took an active share in the foundation of University College London (originally known as London University), visiting Berlin to inquire into the German system of education, and making recommendations which were adopted by Lord Brougham. He was elected Lord Rector of Glasgow University (1826–1829) in competition against Sir Walter Scott. Campbell retired from the editorship of the New Monthly Magazine in 1830, and a year later made an unsuccessful venture with The Metropolitan Magazine. He had championed the cause of the Poles in \"The Pleasures of Hope\", and the news of the capture of Warsaw by the Russians in 1831 affected him as if it had been the deepest of personal calamities. \"Poland preys on my heart night and day,\" he wrote in one of his letters, and his sympathy found a practical expression in the foundation in London of the Literary Association of the Friends of Poland. In 1834 he travelled to Paris and Algiers, where he wrote his Letters from the South (printed 1837).His wife died in 1828. Of his two sons, one died in infancy and the other became insane. His own health suffered, and he gradually withdrew from public life. He died at Boulogne on 15 June 1844 and was buried on 3 July 1844 Westminster Abbey at Poet's Corner.Campbell's other works include a Life of Mrs Siddons (1834), and a narrative poem, \"The Pilgrim of Glencoe\" (1842). See The Life and Letters of Thomas Campbell (3 vols., 1849), edited by William Beattie, M.D.; Literary Reminiscences and Memoirs of Thomas Campbell (1860), by Cyrus Redding; The Complete Poetical Works of Thomas Campbell (1860); The Poetical Works of Thomas Campbell (1875), in the Aldine Edition of the British Poets, edited by the Rev. V. Alfred Hill, with a sketch of the poet's life by William Allingham; and the Oxford Edition of the Complete Works of Thomas Campbell (1908), edited by J. Logie Robertson. See also Thomas Campbell by J. Cuthbert Hadden, (Edinburgh: Oliphant, Anderson and Ferrier, 1899, Famous Scots Series), and a selection by Lewis Campbell (1904) for the Golden Treasury Series.\n\n\n== Notes ==\n\n This article incorporates text from a publication now in the public domain: Chisholm, Hugh, ed. (1911). \"Campbell, Thomas\". Encyclopædia Britannica. 5 (11th ed.). Cambridge University Press. p. 130.\n\n\n== External links ==\nThomas Campbell at the Eighteenth-Century Poetry Archive (ECPA)\n\"Archival material relating to Thomas Campbell\". UK National Archives. \nWorks by Thomas Campbell at Project Gutenberg\nWorks by or about Thomas Campbell at Internet Archive\nWorks by Thomas Campbell at LibriVox (public domain audiobooks) \nIndex entry for Thomas Campbell at Poets' Corner\nBates, William (1883). \"Thomas Campbell\" . The Maclise Portrait-Gallery of \"Illustrious Literary Characters\" . Illustrated by Daniel Maclise (1 ed.). London: Chatto and Windus. pp. 4–7 – via Wikisource.\nThomas Campbell Papers. James Marshall and Marie-Louise Osborn Collection, Beinecke Rare Book and Manuscript Library, Yale University.\nThomas Campbell Correspondence. General Collection, Beinecke Rare Book and Manuscript Library, Yale University."