"Should not be confused with the Gregorian calendar.The Gregorian Reforms were a series of reforms initiated by Pope Gregory VII and the circle he formed in the papal curia, c. 1050–80, which dealt with the moral integrity and independence of the clergy. The reforms are considered to be named after Pope Gregory VII (1073–85), though he personally denied it and claimed his reforms, like his regnal name, honoured Pope Gregory I.\n\n\n== Overview ==\n\nDuring Gregory's pontificate, a conciliar approach to implementing papal reform took on an added momentum. Conciliarism properly refers to a later system of power between the Pope, the Roman curia, and secular authorities. During this early period, the scope of Papal authority in the wake of the Investiture Controversy entered into dialog with developing notions of Papal supremacy. The authority of the emphatically \"Roman\" council as the universal legislative assembly was theorised according to the principles of papal primacy contained in Dictatus papae.\nGregory also had to avoid the Church slipping back into the abuses that had occurred in Rome, during the Rule of the Harlots, between 904 and 964. Pope Benedict IX had been elected Pope three times and had sold the Papacy. In 1054 the \"Great Schism\" had divided western European Christians from the Eastern Orthodox Church. Given these events, the Church had to reassert its importance and authority to its followers. Within the Church important new laws were pronounced on simony, on clerical marriage and from 1059, laws extending the prohibited degrees of Affinity. Although at each new turn the reforms were presented to contemporaries as a return to the old ways, they are often seen by modern historians as the first European Revolution. The much later Gregorian calendar of Pope Gregory XIII has no connection to these Gregorian reforms.\n\n\n== Documents ==\nThe reforms are encoded in two major documents: Dictatus papae and the bull Libertas ecclesiae. The Gregorian reform depended in new ways and to a new degree on the collections of canon law that were being assembled, in order to buttress the papal position, during the same period. Part of the legacy of the Gregorian Reform was the new figure of the papal legist, exemplified a century later by Pope Innocent III. There is no explicit mention of Gregory’s reforms against simony (the selling of church offices and sacred things) or nicolaism (which included ritual fornication) at his Lenten Councils of 1075 or 1076. Rather, the gravity of these reforms has to be inferred from his general correspondence. By contrast, Gregory's Register entry for the Roman Council of November 1078 extensively records Gregory’s legislation against 'abuses' such as simony as well as the first ‘full’ prohibition of lay investiture. This record has been interpreted as the essence of the Gregorian 'reform programme'.The powers that the Gregorian papacy gathered to itself are summed up in a list called Dictatus papae around 1075 or shortly after. The major headings of Gregorian reform can be seen as embodied in the Papal electoral decree (1059), and the temporary resolution of the Investiture Controversy (1075–1122) was an overwhelming papal victory. The resolution of this controversy acknowledged papal superiority over secular rulers by implication.\n\n\n== Central status of the Church ==\nBefore the Gregorian Reforms the Church was a heavily decentralized institution, in which the pope held little power outside of his position as Bishop of Rome. With that in mind, the papacy up until the twelfth century held little to no authority over the bishops, who were invested with land by lay rulers. Gregory VII's ban on lay investiture was a key element of the reform, ultimately contributing to the centralized papacy of the later Middle Ages.The reform of the Church, both within it, and in relation to the Holy Roman Emperor and the other lay rulers of Europe, was Gregory VII's life work. It was based on his conviction that the Church was founded by God and entrusted with the task of embracing all mankind in a single society in which divine will is the only law; that, in his capacity as a divine institution, he is supreme over all human structures, especially the secular state; and that the pope, in his role as head of the Church under the petrine commission, is the vice-regent of God on earth, so that disobedience to him implies disobedience to God: or, in other words, a defection from Christianity. But any attempt to interpret this in terms of action would have bound the Church to annihilate not merely a single state, but all states. Thus Gregory, as a politician wanting to achieve some result, was driven in practice to adopt a different standpoint. He acknowledged the existence of the state as a dispensation of Providence, described the coexistence of church and state as a divine ordinance, and emphasized the necessity of union between the sacerdotium and the imperium. But, during no period would he have imagined the two powers on an equal footing. The superiority of Church to State was to him a fact which admitted no discussion and which he had never doubted.\nHe wished to see all important matters of dispute referred to Rome; appeals were to be addressed to himself; the centralization of ecclesiastical government in Rome naturally involved a curtailment of the powers of bishops. Since these refused to submit voluntarily and tried to assert their traditional independence, his papacy was full of struggles against the higher ranks of the clergy.\n\n\n== Clerical celibacy ==\nThis battle for the foundation of papal supremacy is connected with his championship of compulsory celibacy among the clergy and his attack on simony. Gregory VII did not introduce the celibacy of the priesthood into the Church, but he took up the struggle with greater energy than his predecessors. In 1074 he published an encyclical, absolving the people from their obedience to bishops who allowed married priests. The next year he enjoined them to take action against married priests and deprived these clerics of their revenues. Both the campaign against priestly marriage and that against simony provoked widespread resistance.\n\n\n== See also ==\nCluniac Reforms\nConcordat of Worms\nDiploma Ottonianum\nDonation of Constantine\nDonation of Pippin\nFirst Council of the Lateran\nLiber Gomorrhianus\nPope Gelasius I and the \"Gelasian doctrine\"\nWalk to Canossa\n\n\n== Notes ==\n\n\n== External links ==\nGregorian Reform and the First Crusade"