"The KFC Original Recipe is a secret mix of ingredients that fast food restaurant chain KFC uses to produce fried chicken.\n\n\n== History ==\nBy the very late 1930s, Harland Sanders' Corbin, Kentucky, gas station was so well known for its fried chicken, that Sanders decided to remove the gas pumps and build a restaurant and motel in its place. While perfecting his secret recipe with 11 herbs and spices, Sanders found that pan frying chicken was too slow, requiring 30 minutes per order. Deep frying the chicken required half the time, but produced dry, unevenly done chicken. In 1939, he found that using a pressure fryer produced tasty, moist chicken in eight or nine minutes. By July 1940, Sanders finalized what came to be known as his Original Recipe.After Sanders formed a partnership with Pete Harmon, they began marketing the chicken in the 1950s as Kentucky Fried Chicken, the company shipped the spices already mixed to restaurants to preserve the recipe's secrecy. He claimed that the ingredients \"stand on everybody's shelf\".Sanders used vegetable oil for frying chicken. By 1993, for reasons of economy, many KFC outlets had chosen to use a blend of palm and soybean oil. In Japan, the oil used is mainly the more expensive cottonseed and corn oil, as KFC Japan believes that this offers superior taste quality.\n\n\n== Reception ==\nSanders' Original Recipe of \"11 herbs and spices\" is one of the most famous trade secrets in the catering industry. Franchisee Dave Thomas, better known as the founder of Wendy's, argued that the secret recipe concept was successful because \"everybody wants in on a secret\" and former KFC owner John Y. Brown, Jr. called it \"a brilliant marketing ploy.\" The New York Times described the recipe as one of the company's most valuable assets. The recipe is not patented, because patents are published in detail and come with an expiration date, whereas trade secrets can remain the intellectual property of their holders in perpetuity.KFC uses its Original Recipe as a means to differentiate its product from its competitors. Early franchisee Pete Harman credited the chain's popularity to the recipe and the product, and John Y. Brown cites the \"incredibly tasty, almost addictive\" product as the basis of KFC's staying power. On the other hand, Allen Adamson, managing director of brand consultancy Landor, remains unconvinced about the contribution of the secret formula aspect. He argues: \"The story may still be part of these companies' folklore, but I'd be surprised if more than 2 percent buy the brand because of it.\"\n\n\n== Recipe ==\nA copy of the recipe, signed by Sanders, is held safe inside a vault in KFC's Louisville headquarters, along with eleven vials containing the herbs and spices. To maintain the secrecy of the recipe, half of it is produced by Griffith Laboratories before it is given to McCormick, who add the second half.In 1983, William Poundstone conducted laboratory research into the coating mix, as described in his book Big Secrets, and claimed that a sample he examined contained only flour, salt, monosodium glutamate and black pepper. KFC maintains that it still adheres to Sanders' original 1940 recipe. In Todd Wilbur's television program Top Secret Recipe, the Colonel's former secretary, Shirley Topmiller, revealed that Sanders learned from his mother that sage and savory are good seasonings for chicken. Also, Winston Shelton, a former friend of the Colonel, said that the secret recipe contains Tellicherry black pepper.It is well attested that Harland Sanders asked Bill Summers of Marion-Kay Spices in Brownstown, Indiana, US to recreate his secret blend of 11 herbs and spices. While alive, Sanders recommended the Marion-Kay seasoning to franchisees over the corporate version, as he believed the latter had been made inferior by its owners. In 1982, after Sanders' death, KFC brought a lawsuit against Marion-Kay and the latter was barred from selling its mixture to KFC franchises. The Marion-Kay seasoning is still sold under the name \"99-X,\" and according to Sanders biographer Josh Ozersky, it is indistinguishable from the original KFC recipe.In August 2016, the Chicago Tribune reported that Joe Ledington of Kentucky, a nephew by marriage of Colonel Sanders, had claimed to have found a copy of the original KFC fried chicken recipe on a handwritten piece of paper in an envelope in a scrapbook. Tribune staffers conducted a cooking test of this recipe, which took several attempts to get right. They had to determine whether the \"Ts\" meant tablespoons or teaspoons. After some trial and error, they decided the chicken should be soaked in buttermilk and coated once in the breading mixture, then fried in oil at 350 °F (177 °C) in a pressure fryer until golden brown. As a pressure fryer was too big, a deep fryer was used alternatively to substitute the pressure fryer. They also claimed that with the addition of MSG as a flavor enhancer, they could produce fried chicken which tasted \"indistinguishable\" from fried chicken they had purchased at KFC.The recipe found by Joe Ledington reads as follows:\n11 Spices – Mix with 2 cups white flour\n\n2⁄3 tablespoon salt\n1⁄2 tablespoon thyme\n1⁄2 tablespoon basil\n1⁄3 tablespoon oregano\n1 tablespoon celery salt\n1 tablespoon black pepper\n1 tablespoon dry mustard\n4 tablespoon paprika\n2 tablespoon garlic salt\n1 tablespoon ground ginger\n3 tablespoon white pepperWhile Ledington expressed uncertainty that the recipe was the Original Recipe, he had a hand in mixing the Original Recipe for Colonel Sanders when he was a young boy, and recalled that white pepper was a principal ingredient.The Ledington recipe is inaccurate and misleading based on the labeling requirements of the USDA.  KFC by law has published various aspects of their ingredients, however, since mustard is an allergen, it must be clearly labeled as such, and KFC has never published any allergen warnings for the use of mustard in the Original Recipe.  Furthermore, the USDA prohibits the classification of any variations of garlic, celery or onion to be lumped under \"Other Spices\" or \"Natural Flavorings\", once again garlic, celery and onion are not listed by KFC in any published Original Recipe labeling or consumer information, nor are these ingredients listed by Marion-Kay seasoning either for their 99-X.  In conclusion, any KFC Original recipes claiming to contain garlic, onion, celery or mustard in any form (salt, powder or flakes) are incorrect.  The only ingredients which are guaranteed to be legitimate are those listed through labeling and those guaranteed ingredients include: salt, MSG, black pepper, white pepper, coriander and sage. The \"Other\" ingredients are mere speculation, but the most popular conclusions are savory, thyme, ginger and marjoram. There is some debate as to whether or not Colonel Sanders referred to different grinds of black pepper as separate ingredients. \nContrary to popular belief, both visual and laboratory inspections of KFC seasoning mix, Marion-Kay 99-X seasoning mix as well as the Irish equivalent Grace's Strong Blend Seasoning mix; none contain any ingredients which are red in color.  Which means, there is no paprika, no chili powder, no cayenne pepper, or any other ingredient with a red color.  KFC published labeling and consumer information does not contain any references to the use of natural coloring for Original Recipe. Results of visual and laboratory inspection of all the seasoning mixes indicates an overwhelming grey color tone derived from the abundant quantity of black pepper.  References have been made to the \"secret recipe\" containing Tellicherry, but a common misconception regarding Tellicherry black pepper is that it is not a type of pepper.  Tellicherry is nothing more than a size of the peppercorn, not a type or variety of pepper.  What is clear is that black pepper is predominate in the Original Recipe, large black flecks of pepper are easily visible in the final product.  Measurements of the fleck sizes indicate that the flecks are one quarter size cracked black pepper which is equivalent to an 8-10 mesh size, or approximately 1/8\" to 3/32\" in size.  This supports various statements that the use of various grinds of black pepper is accurate including: cracked 8-10 mesh, course 12-16 mesh and fine ground 22-36 mesh.  Its the use of fine ground pepper which is responsible for the heavy grey color overall in all 3 of the commercial seasoning blends.Any discussion regarding the Original Recipe must include 2 important components:\n1. The chicken is brined \"marinated\" in a solution containing salt and MSG. Contrary to certain beliefs KFC is not brined in buttermilk and eggs.\n2. The 2 cups of flour must also include powdered egg whites, powdered milk and a leavening agent - baking powder.\n\n\n== References =="