"Pink salmon or humpback salmon (Oncorhynchus gorbuscha) is a species of anadromous fish in the salmon family. It is the smallest and most abundant of the Pacific salmon. The scientific species name is based on the Russian common name for this species gorbúša (горбуша), which literally means humpie.\n\n\n== Description ==\nIn the ocean, pink salmon are bright silver fish. After returning to their spawning streams, their coloring changes to pale grey on the back with yellowish-white belly (although some turn an overall dull green color). As with all salmon, in addition to the dorsal fin, they also have an adipose fin. The fish is characterized by a white mouth with black gums, no teeth on the tongue, large oval-shaped black spots on the back, a v-shaped tail, and an anal fin with 13-17 soft rays. During their spawning migration, males develop a pronounced humped back, hence their nickname \"humpies\". Pink salmon average 4.8 pounds (2.2 kg) in weight. The maximum recorded size was 30 inches (76 cm) and 15 pounds (6.8 kg).\n\n\n== Distribution ==\nThe native range of the species is in the Pacific and Arctic coastal waters and rivers, from the Sacramento River in northern California to the Mackenzie River in Canada; and in the west from the Lena River in Siberia to Korea and Honshu in Japan. In North America pink salmon spawn from the Mackenzie River in the Arctic to as far south as tributaries of Puget Sound, Washington, although they were also reported in the San Lorenzo River near Santa Cruz, California in 1915 and the Sacramento River in northern California in the 1950s. In 2013 a new record for the southernmost extent of spawning pink salmon was published for the Salinas River. In the fall of 2017 a dozen pink salmon were counted in Lagunitas Creek about 25 miles (40 km) north of San Francisco, California.Pink salmon were introduced into the Great Lakes of North America, where there are now self-sustaining populations, and in Iran. In Europe, pink salmon have been periodically introduced to rivers of the White Sea and Barents Sea basins in Russia since 1956. Stray fish from these rivers have been encountered ascending to rivers also in Norway, Sweden, Ireland, Great Britain and Iceland, and in Norway even self-sustaining populations have been observed. In 2017 larger numbers than usual of this species were caught in rivers in Scotland and spawning was recorded.\n\n\n== Ecology ==\n\n\n=== Habitat ===\nPink salmon are coldwater fish with a preferred temperature range of 5.6 to 14.6 °C, an optimal temperature of 10.1 °C, and an upper incipient lethal temperature of 25.8 °C.\n\n\n=== Reproduction ===\n\nPink salmon in their native range have a strict two year life cycle, thus odd and even-year populations do not interbreed. In the state of Washington, Pink salmon runs occur on odd years.  Adult pink salmon enter spawning streams from the ocean, usually returning to the stream where they originated. Spawning occurs between late June and mid-October, in coastal streams and some longer rivers, and in the intertidal zone or at the mouth of streams if hyporheic freshwater is available. Using her tail, the female digs a trough-shaped nest, called a redd (Scandinavian word for \"nest\"), in the gravel of the stream bed, where she deposits her eggs. As she expels the eggs, she is approached by one or more males, which fertilize them as they fall into the redd. Subsequently, the female covers the newly deposited zygotes, again with thrusts of her tail, against the gravel at the top of the redd. The female lays from 1,000 to 2,000 eggs in several clutches within the redd, often fertilized by different males. Females guard their redds until death, which comes within days of spawning. In dense populations, a major source of mortality for embryos is a superposition of redds by later-spawning fish. The eggs hatch from December to February, depending on water temperature, and the juveniles emerge from the gravel during March and April and quickly migrate downstream to estuaries, at about one-quarter gram in weight. The fish achieve sexual maturity in their second year of life. They return to freshwater in the summer or autumn as two-year-old adults. Pink and chum salmon sometimes interbreed in nature to form the hybrid known as the miko salmon; the hybrids are sterile.\n\n\n=== Diet ===\nIn their freshwater stage, juvenile pink salmon consume invertebrates and zooplankton. In the ocean, they feed on a variety of plankton, invertebrates, and small fish. Adults do not feed as they return to freshwater to spawn.\n\n\n=== Predators and trophic interactions ===\nMany different animals feed on pink salmon throughout their life cycle, from small fish, birds, and mammals in freshwater ecosystems when the salmon are eggs or fry, through large fish, seabirds, and marine mammals when they are in the ocean.Eggs and the carcasses of spawned salmon adults can provide substantial nutrient subsidies to freshwater food webs. Where pink salmon are expanding into subarctic Norwegian rivers, their eggs are consumed by native salmonids. In the Keogh River in Canada, higher numbers of pink salmon eggs were shown to reduce competition among other fish species relying on this food source. Bears feed on adult migrating salmon, and choose to predate on salmon which have not yet spawned and thus are more nutritious, when they have a choice. Many of the pink salmon that are caught by bears in Alaska are transported away from the water into riparian areas and forests, and nutrients from the carcasses end up in plants and trees. Carcasses of pink salmon that successfully spawn decompose rapidly, and are colonized by aquatic invertebrates in the process. These resource subsidies to stream habitats can increase the growth of other salmonid species in the streams.\n\n\n== Conservation status ==\n\nNatureServe lists the pink salmon as critically imperiled in California, and imperiled in Washington. In Alaska and British Columbia, they are considered secure.  No Pink salmon Evolutionary Significant Units are listed under the Endangered Species Act.\n\n\n== Fisheries and use ==\n\nThe commercial harvest of pink salmon is a mainstay of fisheries of both the eastern and western North Pacific. In 2010, the total harvest was some 260 million fish, corresponding to 400,000 tonnes. Of this, 140 million fish were from Russian fisheries and 107 million from the USA (Alaska). Pink salmon account for 69% of the total Russian salmon fisheries. The majority of pink salmon are harvested using coastal set net traps, and the fisheries are concentrated on the east coast of Sakhalin (average 110,000 tonnes per year).In North America, beginning in the late 19th century fish traps were used to supply fish for commercial canning and salting. The industry expanded steadily until 1920. During the 1940s and 1950s, pink salmon populations declined drastically. Fish traps were prohibited in Alaska in 1959. Now, most pink salmon are taken with purse seines, drift nets or gillnets. Populations and harvests increased rapidly after the mid-1970s and have been at record high numbers since the 1980s.\nMore than 20 million harvested pink salmon are produced by fishery-enhancement hatcheries, particularly in the northern Gulf of Alaska.  Pink salmon are not grown in significant numbers in fish farms. The fish are often canned, smoked or salted. Pink salmon roe is also harvested for caviar, a particularly valuable product in Asia.\n\n\n== References ==\n\n\n=== Citations ===\n\n\n=== Sources ===\n\"Oncorhynchus gorbuscha\". Integrated Taxonomic Information System. Retrieved 30 January 2006.\nFroese, Rainer and Pauly, Daniel, eds. (2005). \"Oncorhynchus gorbuscha\" in FishBase. 10 2005 version.\nBonar, S.A., G.B. Pauley, and G.L. Thomas. 1989. Species profiles, life histories and environmental requirements of coastal fishes and invertebrates (Pacific Northwest)--pink salmon. U.S. Fish Wildl. Serv. Biol. Rep. 82(11.88).\nKingsbury, A. 1994. Pink Salmon, Alaska Department of Fish and Game"