"Theosophy is a religion established in the United States during the late 19th century. It was founded primarily by the Russian immigrant Helena Blavatsky and draws its teachings predominantly from Blavatsky's writings. Categorized by scholars of religion as both a new religious movement and as part of the occultist stream of Western esotericism, it draws upon both older European philosophies such as Neoplatonism and Asian religions such as Hinduism and Buddhism.\nAs presented by Blavatsky, Theosophy teaches that there is an ancient and secretive brotherhood of spiritual adepts known as the Masters, who—although found across the world—are centered in Tibet. These Masters are alleged by Blavatsky to have cultivated great wisdom and supernatural powers, and Theosophists believe that it was they who initiated the modern Theosophical movement through disseminating their teachings via Blavatsky. They believe that these Masters are attempting to revive knowledge of an ancient religion once found across the world and which will again come to eclipse the existing world religions. Theosophical groups nevertheless do not refer to their system as a \"religion\". Theosophy preaches the existence of a single, divine Absolute. It promotes an emanationist cosmology in which the universe is perceived as outward reflections from this Absolute. Theosophy teaches that the purpose of human life is spiritual emancipation and claims that the human soul undergoes reincarnation upon bodily death according to a process of karma. It promotes values of universal brotherhood and social improvement, although it does not stipulate particular ethical codes.\nTheosophy was established in New York City in 1875 with the founding of the Theosophical Society by Blavatsky and Americans Henry Olcott and William Quan Judge. In the early 1880s, Blavatsky and Olcott relocated to India, where they established the Society's headquarters at Adyar, Tamil Nadu. Blavatsky described her ideas in two books, Isis Unveiled and The Secret Doctrine. She sought to produce purportedly supernatural phenomena to support her claims regarding the Masters, although was repeatedly accused of fraudulently doing so. Following Blavatsky's death in 1891, there was a schism in the Society, with Judge leading the Theosophical Society in America to split from the international organization.  Under Judge's successor Katherine Tingley, a Theosophical community named Lomaland was established in San Diego. The Adyar-based Society was later taken over by Annie Besant, under whom it grew to its largest extent during the late 1920s, before going into decline. The Theosophical movement still exists, although in much smaller form than in its heyday.\nTheosophy played a significant role in bringing knowledge of South Asian religions to Western countries, as well as in encouraging cultural pride in various South Asian nations. A variety of prominent artists and writers have also been influenced by Theosophical teachings. Theosophy has an international following, and during the 20th century had tens of thousands of adherents. Theosophical ideas have also exerted an influence on a wide range of other esoteric movements and philosophies, among them Anthroposophy, the Church Universal and Triumphant, and the New Age."