"An electronic piano is a keyboard instrument designed to simulate the timbre of a piano (and sometimes a harpsichord or an organ) using analog circuitry.\n\"Electronic Piano\" was also the trade name used for Wurlitzer's popular line of electric pianos, which were produced from the 1950s to the 1980s, although this was not actually what is now commonly known as an electronic piano. Electronic pianos work similarly to analog synthesizers in that they generate their tones through oscillators, whereas electric pianos are mechanical, their sound being electrified by a pickup and then amplified through an internal or external amplifier.\nThe first electronic pianos date from the 1970s and were mostly made in Italy (Davies 2001), although similar models were made concurrently in Japan. An exception is the range of instruments made by RMI in the United States from 1967 to approximately 1980, which was used by Genesis, Yes, Deep Purple, Elton John and Rick Wakeman (Reid 2001). These early electronic pianos (including the RMI) are not velocity sensitive in that, like an organ, they do not vary their volume based on how hard or soft the keys are played. \"The major drawback of the RMI was its total lack of touch sensitivity. I found this very restricting, especially since any bum-notes are played at full volume, no matter how lightly you brush against them\" (Tony Banks, quoted in Reid 2001).\nThe first electronic grand piano was produced in 1979 and patented in 1981 by Wil Decker of St. James, NY. (PianoNova Co.) It contained the first full-touch-sensitive keyboard and working pedals (Decker 1981).\nElectronic pianos became less popular in the 1980s when the digital piano and polyphonic synthesizer became available and affordable enough for both professional and home use as an inexpensive, smaller and lighter alternative to an acoustic piano.\nIn modern usage, the term electronic piano sometimes refers to either a digital piano or a stage piano. This is actually a misnomer, as electronic pianos use analog synthesis to generate its sounds while digital pianos normally use sample-based synthesis. In addition, early digital pianos in the mid-1980s were often referred to as a personal electronic piano.\n\n\n== References ==\n\nDavies, Hugh. 2001. \"Electronic Piano\". The New Grove Dictionary of Music and Musicians, second edition, edited by Stanley Sadie and John Tyrrell. London: Macmillan Publishers.\nDecker, Wil. 1981. Electronic Baby Grand Piano patent. IFI CLAIMS Patent Services (accessed 2 August 2020).\nReid, Gordon. 2001. \"Prog Spawn! The Rise and Fall of Rocky Mount Instruments (Retro) Gordon Reid\". Sound on Sound (December) (Accessed 21 June 2011).\n\n\n== Further reading ==\nTünker, Helmuth. 1975. Electronic-Pianos und Synthesizer. Nach industriellen Gesichtspunkten entworfene, jedoch für den Selbstbau geeignete Schaltungen. Munich: Franzis.\nWeyer, Rolf-Dieter. 1973. \"Typical Sound Characteristics of Piano Sounds, Analysed on the Basis of Piano Sounds and Piano-Like Sounds\". In Papers of the 44th Convention of the Audio Engineering Society, Central Europe Section (1973): Rotterdam, edited by O. H. Bjor. New York: Audio Engineering Society."