"Isidore Singer (10 November 1859 – 1939) was an editor of The Jewish Encyclopedia and founder of the American League for the Rights of Man.\n\n\n== Biography ==\nSinger was born in 1859 in Weisskirchen, Moravia, in the Austrian Empire. He studied at the University of Vienna and the Humboldt University of Berlin, receiving his Ph.D. in 1884.\n\n\n=== France ===\nAfter editing the Allgemeine oesterreichische Literaturzeitung (Austrian literary newspaper) from 1885 to 1886, he became literary secretary to the French ambassador in Vienna. From 1887, he worked in Paris in the press bureau of the French foreign office and was active in the campaign on behalf of Alfred Dreyfus. In 1893 he founded a short-lived biweekly called La Vraie Parole as a foil to the anti-Jewish La Libre Parole.\n\n\n=== New York ===\nSinger moved to New York City in 1895 where he learned English and taught French, raising the money for the Jewish Encyclopedia he had envisioned.Over the course of his career, Singer also proposed many projects which never won backing, including a multi-million-dollar loan to aid the Jews of Eastern Europe, a Jewish university open to students of any background, various encyclopedias about secular topics, and a 25-volume publication series of Hebrew classics. By 1911, the date of this latter proposal, \"neither the [Jewish] Publication Society nor any body of respectable scholars would work with him,\" according to encyclopedist Cyrus Adler.\n\n\n== Religious views ==\nSinger held extremely liberal views which at times proved unpopular. He endorsed Jesus and the Christian New Testament and proposed a Hebrew translation. He founded the Amos Society to promote understanding among followers of monotheistic religions.His 1897 prospectus for the encyclopedia project called for harmony between religions; called the Sabbath and holidays \"heavy burdens, or, at best, mere ceremonies\" for most Jews; and made the radical suggestion that Jewish parents, if honest with their children, would tell them:\n\nOur religion ... does not accord with your ideas. We have neither the power nor the desire to impose it on you. Make your peace with your God and your conscience as best you can,\" and, that said, let us cease to erect new synagogues, let us close our seminaries of theology, and let us disintegrate, little by little, our ancient communal institutions.\nDue to the controversy of Singer's outlooks, his publisher, Funk & Wagnalls, agreed to the encyclopedia project only after divesting Singer of editorial control and appointing a board of prestigious Jewish scholars, including rabbis.\n\n\n== Publications ==\n This article incorporates text from a publication now in the public domain: Singer, Isidore;  et al., eds. (1901–1906). \"[Online version]\". The Jewish Encyclopedia. New York: Funk & Wagnalls.\nRussia at the Bar of the American People: A Memoir of Kinship.  Funk & Wagnalls, 1904.\nThe German Classics (1913–1914), with Kuno Francke: twenty volumes.\nA Religion of Truth, Justice, and Peace: A Challenge to Church and Synagogue to Lead in the Realization of the Social and Peace Gospel of the Hebrew Prophets. Amos Society: 1924.\n\n\n== References ==\n\n\n=== Citations ===\n\n\n=== Sources ==="