"A councillor is a member of a local government council in some countries, e.g. England. In Finland it is a title of honour granted by the government to several categories of Finns.\n\n\n== United Kingdom ==\nAll local authorities in the United Kingdom are overseen by elected councillors. These include:\n\nunitary authorities\ncounty councils and district councils\nparish, town and community councils\nThe Common Council of the City of London (in which councillors are known as aldermen and councilmen)According to Debrett's Correct Form the English title \"Councillor\" (often shortened to 'Cllr') applies only to elected members of city, borough or district councils. However, there is no legal basis for this restriction and in practice the title is applied to all councillors at all levels of local government. Where necessary, parish and county councillors are differentiated by the use of a fuller title such as \"town councillor\" or \"county councillor\". The title precedes the holder's rank or other title, as in Cllr Dr Jenny Smith or Cllr Sir Ricky Taing, and for women it precedes their title of marital status, as in Cllr Mrs Joan Smith. Youth councillors are solely known as Youth Councillors.\nCouncillors are typically elected as members of political parties or alternatively as independents. Councils may also co-opt unelected councillors to fill vacancies on a council where insufficient candidates have stood for election, although in practice this is rare outside parish councils. Once elected, they are meant to represent all the residents under the whole authority, not just those who voted for them or just those in the district or ward they were elected in. They are bound by a code of conduct enforced by standards boards.\nIn 2007 the 'Electoral Representation Act 2006' reduced the age limit for councillors to 18, leading to younger people standing.\n\n\n=== Youth councillors ===\nYouth councillors are also elected in local areas by organisations that are a member of British Youth Council, such as Salford Youth Council.\n\n\n=== Remuneration ===\nMost councillors are not full-time professionals.\nIn England, Wales and Northern Ireland most larger borough, unitary authority or county councils do pay them basic allowances and out-of-pocket expenses. In addition, special responsibility allowances are paid to councillors who carry out more senior duties. The basic allowances and special responsibility allowances are theoretically paid to compensate councillors for time spent on council duties and are classed as salaries for tax purposes. Parish, town or community councillors may, since the Local Government Act 2000, be paid for their services, but most do it voluntarily.\nIn Scotland, since 2007, councillors have received a salary of £15,000, as opposed to a series of allowances. These are often topped up by special responsibility allowances.\n\n\n=== Regional government ===\nThe London Assembly is regarded, not as a local authority, but as a regional devolved assembly and its members are referred to as Assembly Members, not councillors.\n\n\n== United States ==\nCouncil member, councilman/councilwoman, councilor, or councillor is a title for a member of a council used in the United States.In particular, the title is used in the following cases:\n\nCity councils or town councils that do not use the title of alderman\nCouncil of the District of Columbia\n\n\n== The Philippines ==\nUnder the Philippine Republic Act No. 7160 (otherwise known as the Local Government Code of 1991), a councilor is a member of a local council that is the legislative body of the local government unit. They are commonly referred to as \"Sanggunian Member\" because the official designation of municipal, city and provincial councils is the equivalent term in Filipino (used even when speaking or writing in English): Sanggunian Bayan, Sanggunian Panglunsod and Sanggunian Panlalawigan, respectively.\n\n\n== Finland ==\nThis is about honorary rank, not elected officials.\nIn Finland councillor (neuvos) is the highest possible title of honour which can be granted by the President of Finland. There are several ranks of councillors and they have existed since the Russian Regime. Some examples of different councillors in Finland are as follows:\n\nCouncillor of State: the highest class of the titles of honour; granted to successful statesmen\nMining Councillor/Trade Councillor/Industry Councillor/Economy Councillor: granted to leading industry figures in different fields of the economy\nCouncillor of Parliament: granted to successful statesmen\nOffice Councillor: granted to leading university figures\nCouncillor of Culture/Theatre Councillor/Film Councillor: granted to leading cultural figures\nChamber Councillor: granted for successful officials in the field of local government\n\n\n== Canada ==\n\nDue to the control that the provinces have over their municipal governments, terms that councillors serve vary from province to province. Unlike most provincial elections, municipal elections are usually held on a fixed date of 4 years.\n\n\n== Other countries ==\nIn Australia, The Bahamas, Canada, New Zealand, South Africa, Botswana, Trinidad and Tobago and other parts of the Commonwealth, as well as in the Republic of Ireland, a councillor or councilor is an elected representative on a local government council.\nIn the Netherlands, a member of the municipal council is called a gemeenteraadslid or raadslid. Someone out of this group who is elected to serve on the municipal executive is called a wethouder, which is usually translated as 'alderman' or 'councillor'. The Dutch word for mayor is burgemeester. This is expressed in English as \"mayor\" or \"burgomaster\". The municipal executive is referred to collectively as the College van Burgemeester en Wethouders.\nIn Belgium, a member of the municipal council is called a gemeenteraadslid in Dutch, and Conseiller Communal in French. Someone out of this group who is elected to serve on the municipal executive is called a schepen in Dutch or échevin in French. This is usually translated as \"alderman\" or \"councillor\" in English. The municipal executive is referred to collectively as the College van Burgemeester en Schepenen ou Collège du Bourgmestre et Echevins.\nIn Luxembourg, an échevin (Luxembourgish: Schäffe, German: Schöffe) is a member of the administration of a Luxembourgian commune.\nIn Norway, a member of the municipal council, kommunestyret, is called a kommunestyrerepresentant in Norwegian. The Norwegian word for mayor is ordfører.\nIn Hong Kong, members of district councils are also referred to as councillors. Before 1999 the district councils were known as district boards, upon the abolition of the municipal councils (the UrbCo and the RegCo) in December that year. In addition, members of the legislative council are also referred to as councillors. From 1996 to 1998 the Legislative Council were known as \"Provisional Legislative Council\", upon the abolition of the interim legislature in July 1998.\nTwo types of councillor are elected in local elections held every five years in Turkey. These include 1,251 provincial councillors and 20,500 municipal councillors. Municipal councillors serve on the council of the 1,351 district and 30 metropolitan municipalities of Turkey, while provincial councillors serve on the provincial general council (İl Genel Meclisi).\n\n\n== References =="