"\"Handle with Care\" is a song by the British-American supergroup the Traveling Wilburys. It was released in October 1988 as their debut single and as the opening track of their album Traveling Wilburys Vol. 1. The song was the first recording made by the group, although it was originally intended as a bonus track on a European single by George Harrison. When he and Jeff Lynne presented the song to Harrison's record company, the executives insisted it was too good for that purpose, a decision that resulted in the formation of the Wilburys. The song was written primarily by Harrison, although, as with all the tracks on Vol. 1, the writing credit lists all five members of the band: Harrison, Lynne, Bob Dylan, Roy Orbison and Tom Petty.\n\"Handle with Care\" was the Wilburys' most successful single. It peaked at number 45 on the Billboard Hot 100 in the United States, number 2 on the Billboard Album Rock Tracks chart and number 21 on the UK Singles Chart, and was a top-five hit in Australia and New Zealand. Directed by David Leland, the video for the song was an MTV favourite in the late 1980s.\nPetty and his band the Heartbreakers often performed \"Handle with Care\" in concert. Lynne sang it with them at the Concert for George, a year after Harrison's death in November 2001. Harrison's son Dhani Harrison sung lead on the song with Jeff Lynne's ELO during their 2019 US tour.\n\n\n== Background ==\n\n\"Handle with Care\" came about through Warner Bros. Records, which distributed George Harrison's Dark Horse record label, pressing Harrison for an extra track for the European release of his \"This Is Love\" single. Having arrived in Los Angeles in April 1988, Harrison discussed the request over dinner with Jeff Lynne, his co-producer on the Cloud Nine album, and Roy Orbison, whose album Mystery Girl Lynne was producing at the time. Lynne agreed to help him record the track the following day, and Harrison invited Orbison to attend the session, after Orbison had said he \"would like to come along and watch\". With no professional studios available at such short notice, Harrison phoned Bob Dylan, who agreed to let them use his garage studio in Malibu. Tom Petty, who had also been working with Lynne in Los Angeles, was invited the following day, when Harrison went to retrieve his guitar from Petty's house.In a 1990 interview for the Dutch television show Countdown, Harrison said that he started writing \"Handle with Care\" – with a section in mind for Orbison to sing – on the morning of the session. Lynne helped Harrison complete the music for the song when they arrived at Dylan's house; according to Petty, Harrison had the chord sequence \"pretty much\" completed beforehand. In another contemporary interview, Harrison recalled that he had the opening line, \"Been beat-up and battered around\", but otherwise, the lyrics were the result of a group effort. Harrison asked Dylan, who had been tending a barbecue for the musicians, to \"Give us some lyrics, you famous lyricist.\" When Dylan asked for a title for the song, Harrison looked around the garage and said, \"Handle with Care\", after a label on a box.All five musicians assisted in writing the song's lyrics, and sang and played acoustic guitars on the basic track. Harrison said that, having already planned Orbison's segment, he decided to include portions sung by Dylan, Lynne and Petty.\n\n\n== Composition ==\n\"Handle with Care\" was written in the key of G major. The main riff and verses feature a four-bar chord sequence with a descending bass line. The first bridge includes a G augmented chord. The time signature throughout is 4/4, played to a moderate rock beat. In music journalist Matthew Greenwald's description, the composition is \"built around a descending, folk-rock chord pattern and some ... major-key chorus movements\". He identifies the song's message as being \"about getting out from under the shell of the '60s fallout, along with a strong theme of survival\".The song's structure comprises rounds containing three distinct sections: Harrison's verses, the Orbison-sung \"I'm so tired of being lonely\" bridge, and a second bridge led by Dylan. Author Ian Inglis writes that Harrison's verses reflect his having overcome hardships and challenges throughout his musical career, with the line \"Oh, the sweet smell of success!\" conveying a mix of optimism, resignation and cynicism regarding the concept of stardom. Inglis says that while the song bears \"Harrison's distinctive musical and vocal signature\", the Orbison-sung segments evoke the \"lonely\" theme that was a defining element of Orbison's work from the late 1950s onwards, just as Dylan's bridges, containing the line \"Put your body next to mine, and dream on\", capture the \"straightforward sexuality\" evident in songs from that artist's late 1960s country period.\n\n\n== Recording and Wilburys' formation ==\nThe ensemble taped the basic track of acoustic guitars, accompanied by a drum machine, on Dylan's Ampex recorder. According to Lynne, the instruments used were a mix of six- and twelve-string guitars. Having been invited by Harrison to assist with the recording, engineer Bill Bottrell recalled that the garage studio had yet to be set up and the equipment was a mix of seemingly unused items.The released recording includes Harrison's electric guitar riff, played on a Rickenbacker 12-string, and slide guitar solos, and Dylan on harmonica. The electric and bass guitars were added to the basic track on the day after the session at Dylan's house, and drummer Ian Wallace overdubbed tom-toms. According to Petty and Bottrell, Lynne played drums on the track and added a cowbell. The overdubbing session took place at Westlake Audio on Santa Monica Boulevard. Lynne said that they had invited Jim Keltner to play drums but he was unavailable. Wallace recalled that Lynne asked him to add some fills to the existing drum part, which Wallace said was a drum machine part, and that the venue was Quincy Jones' studio in Los Angeles, with all the Wilburys present except for Dylan.When Harrison presented a mix of \"Handle with Care\" to Warner Bros., the company's executives insisted that the track was too good to be used as \"filler\" on a European single. He recalled that they thought the song would be wasted since it would not benefit Cloud Nine's sales. In Petty's recollection, Harrison and Lynne then decided to realise their idea of forming the Traveling Wilburys, a band they had imagined during the sessions for Cloud Nine. On Harrison's next visit to Los Angeles, from 8 May onwards, he, Lynne, Dylan, Orbison and Petty began recording the album Traveling Wilburys Vol. 1. The recordings were completed by Harrison and Lynne, the Wilburys' producers, over the summer, at Harrison's Friar Park studio in  England.\n\n\n== Video ==\n\nThe Wilburys filmed a music video for \"Handle with Care\" in early October 1988, at an abandoned brewery near Union Station in Los Angeles. It was directed by David Leland, who had recently directed Harrison's HandMade Films production Checking Out. The video features the group members performing the song around an old-fashioned omnidirectional microphone. The band were dressed and styled by Roger Burton, whose stylist credits included the films Quadrophenia and Chariots of Fire, and music videos for David Bowie, Eurythmics and UB40.The video was the last to feature Orbison, who died of a heart attack on 6 December. Lynne recalls that, as they all travelled together to the film shoot, Orbison kept the band entertained by reciting entire Monty Python comedy sketches by himself. Lynne continues: \"And he's got this enormous and most infectious giggle you've ever heard, and we'd all be giggling like schoolgirls after a minute or two and all fall about!\" At the time, Lynne described the video as a \"nice film, where we're just playing, with nice shots of guitars and heads and feet\", and free of \"gimmicks and fireworks\". Orbison was dressed in a long black coat, black trousers and red shoes, and wore his usual diamond-encrusted Maltese cross broach.\n\n\n== Release ==\nBacked by \"Margarita\", \"Handle with Care\" was issued as the Wilburys' debut single on 17 October 1988, and as the opening track of Traveling Wilburys Vol. 1 the following day. Although the group were viewed as being mainly Harrison's project, all the participants were keen to maintain a collaborative identity. Rather than use his Dark Horse label, they released the single and the album on a new Warner's imprint, Wilbury Records. The bandmates similarly shared the songwriting credits, although the allocation of each song's publishing rights reflected its main composer. In the case of \"Handle with Care\", the song was allocated to Harrison and his Ganga publishing company, which was later subsumed into his company Umlaut Corporation.Aside from the standard 7-inch record and 3-inch CD releases, the single was available in the 10- and 12-inch vinyl formats, both of which used an extended version of the A-side. In the US, the CD single included both the standard-length and extended versions of \"Handle with Care\". The single's cover art was designed by Wherefore Art? and included a group photograph taken by Neal Preston.According to authors Chip Madinger and Mark Easter, the song received widespread airplay on US radio and the video was given \"saturation play\" on MTV and VH-1. Although the album was a major commercial success there, the popularity of the single failed to translate into sales. On the US charts compiled by Billboard magazine, \"Handle with Care\" peaked at number 45 on the Hot 100, yet number 2 on the radioplay-based Album Rock Tracks chart. Elsewhere, it reached number 21 on the UK Singles Chart, number 3 in Australia, where Vol. 1 was the best-selling album of 1989, and number 4 in New Zealand. It was the highest charting of all the Wilburys' singles in the UK and the US.\n\n\n== Critical reception and legacy ==\nAs with Vol. 1, \"Handle with Care\" received highly favourable reviews from music critics, even though the Wilburys' sound was at odds with contemporary musical trends. In a review of their second album, which Harrison chose to title Traveling Wilburys Vol. 3, Elizabeth Wurtzel of New York magazine highlighted \"Handle with Care\" among the Wilburys' \"upbeat, irresistible songs ... that unified the rock audience\" in 1988, by presenting the middle-aged stars as a \"new act\" to young listeners while also finding favour with the babyboomer market.In his song review for AllMusic, Matthew Greenwald writes of \"Handle with Care\":\n\nThe opening track to the star-studded Traveling Wilburys album puts the group and their attitude in one compact package ... George Harrison handles the verses, and there are also two excellent bridges featuring Roy Orbison and Bob Dylan. Orbison's section capitalizes on his awesome, operatic vocal pipes, and the effect is wonderful ... In the end, the joy of camaraderie is what hits the listener the hardest and makes this one of the most memorable records of the 1980s.\nAuthor Howard Sounes says that, for Dylan, his friendship with Harrison enabled a collaboration that saved Dylan's career at a time when it was \"reaching its nadir\". He adds that the song had \"a clever lyric about middle age and a strong melody\" and featured an Orbison vocal performance that \"soared\". Matt Melis of Consequence of Sound lists \"Handle with Care\" tenth in his \"Top Ten Songs by Ex-Beatles\", saying that the Wilburys showed Harrison \"at his absolute best since his solo work in the early Seventies\" and, following this first spontaneous collaboration, \"The rest is super group history.\"Ian Inglis describes \"Handle with Care\" as a \"glorious example of the way in which a synthesis of contrasting talents can produce music that is effortless and natural\". With reference to the musical eras represented by Orbison, Harrison and Dylan, respectively, he concludes: \"its real significance rests ... on its symbolic fusion of three revolutionary moments in the history of rock 'n' roll that had their beginnings in Sam Phillips' Sun Studio in Memphis, in the clubs and bars of Liverpool and Hamburg, and in the folk venues of New York's Greenwich Village.\" Author Simon Leng views the song as a \"worthy hit\" that displays the three lead singers' styles to equally good effect and, in the closing solos by Harrison and Dylan, features \"two of the most famous instrumental signatures in popular music [playing] in tandem\". Jeff Burger, writing for The Morton Report in 2016, highlighted \"Handle with Care\" and \"Not Alone Any More\" as Vol. 1's fun-filled \"ear candy\" that \"profit from Orbison's inimitable soaring vocals, Harrison's trademark guitar, and Lynne's production\".In an article covering the launch of the expanded edition of Harrison's autobiography, I, Me, Mine, in 2017, Billboard's Andy Gensler commented that \"Handle with Care\" remained a fixture on FM radio.\nIn May 2018, the track was used to close the \"All the Wilburys\" episode of the US television show Billions. The Wilburys' group dynamic is referred to in the episode, when the character Ari Spyros, a socially awkward compliance officer, shouts \"Handle me with care!\" in an effort to persuade his colleagues that he is worthy of Wilbury status.\n\n\n== Live performances and cover versions ==\n\nTom Petty and the Heartbreakers and Lynne performed \"Handle with Care\" at the Concert for George tribute in November 2002, a year after Harrison's death, and at Harrison's induction as a solo artist into the Rock and Roll Hall of Fame in 2004. Petty and the Heartbreakers introduced the song into the set list for their own shows in 2003. A live recording appears on the band's 2005 DVD Live in Concert: Soundstage, recorded in Chicago for the Soundstage television series. In the Concert for George documentary film, which was again directed by David Leland, Petty and Lynne's performance is interspersed with interview footage in which Petty discusses the writing of the song.On 14 September 2014, during the BBC Radio 2 Festival in a Day event in London's Hyde Park, Lynne performed \"Handle with Care\" as a tribute to Harrison and Orbison. The performance was accompanied by images of the two late Wilburys projected onto the backdrop of the stage.In 2006, Jenny Lewis covered \"Handle with Care\" on her debut solo album, Rabbit Fur Coat, recorded with the Watson Twins, Ben Gibbard, Conor Oberst and M. Ward. While Andy Gill of The Independent said that the confident performance by Lewis and her collaborators \"ensures that even a cover as unhip as The Traveling Wilburys' 'Handle With Care' sounds engaging\", Will Levith of Ultimate Classic Rock dismissed it as a \"terrible\" version that resembled a \"boozy, late-night karaoke\" rendition next to the superlative performances of Harrison and Orbison on the Wilburys' \"classic\". Writing in March 2007, after the announcement that the long-unavailable Wilburys' catalogue was about to be reissued, in the box set The Traveling Wilburys Collection, Whitney Pastorek of Entertainment Weekly said: \"while Petty's been doing the tune in concert for years, Jenny Lewis' decision to cover that song on last year's Rabbit Fur Coat seemed to get plenty of hipsters asking, Dude, how come I can't buy the original? And, as we all know, what the hipsters want, the hipsters get. Huzzah!\"Damien Leith included \"Handle with Care\" on his 2011 Orbison tribute album Roy: A Tribute to Roy Orbison. At the 2014 George Fest tribute in Los Angeles, organised by Harrison's son Dhani, the song was performed as the penultimate number by an ensemble including Brandon Flowers, Dhani Harrison, \"Weird Al\" Yankovic, Britt Daniel and Wayne Coyne. Reviewing the 2016 album and DVD release from the concert, for PopMatters, Megan Volpert wrote: \"The gentlemen collaborate with Dhani on the Wilburys' 'Handle with Care', audibly evoking not just the noises of George, but also the ghost of Roy Orbison and almost hilariously good impersonations of Tom Petty and Jeff Lynne ... Dhani could've gotten Petty and Lynne, no doubt – but he is working on something arguably more important here than what Concert for George hoped to accomplish.\" In 2017, Stephen Stills and Judy Collins released a version of the song as the opening track of their album Everybody Knows.Dhani Harrison sang \"Handle with Care\" as a featured guest during Jeff Lynne and ELO's tour of the US in the summer of 2019.\n\n\n== Track listing ==\nDetails per Madinger and Easter:\n7\" and non-US CD single\nA\t \t\"Handle with Care\" (LP Version) – 3:20\nB\t \t\"Margarita\" (LP Version) – 3:1612\" single (also 10\" size)\nA\t \t\"Handle with Care\" (Extended Version) – 5:14\nB\t \t\"Margarita\" – 3:16US CD single\"Handle with Care\" (LP Version) – 3:20\n\"Margarita\" (LP Version) – 3:16\n\"Handle with Care\" (Extended Version) – 5:14\n\n\n== Personnel ==\nTraveling Wilburys\n\nGeorge Harrison – lead and harmony vocals, acoustic and electric guitars, slide guitar\nRoy Orbison – lead and harmony vocals, acoustic guitar\nBob Dylan – harmony vocals, acoustic guitar, harmonica\nJeff Lynne – harmony vocals, acoustic and electric guitars, bass guitar, drums, cowbell\nTom Petty – harmony vocals, acoustic guitarAdditional musician\n\nIan Wallace – tom-toms\n\n\n== Charts ==\n\n\n== Notes ==\n\n\n== References ==\n\n\n== Sources ==\n\n\n== External links ==\n\"Handle with Care\" at Discogs"