"Mars, commonly known as Mars bar, is the name of two varieties of chocolate bar produced by Mars, Incorporated. It was first manufactured in 1932 in Slough, England by Forrest Mars, Sr. In its British version the bar consists of caramel and nougat coated with milk chocolate. An American version of the Mars bar was produced which had nougat and toasted almonds covered in milk chocolate; later, caramel was added to the recipe as well. The American version was discontinued in 2002, then revived in a slightly different form the following year under the name \"Snickers Almond\".\n\n\n== Versions ==\n\n\n=== UK and worldwide ===\n\nIn most of the world, a Mars bar is a candy bar with nougat and caramel, coated with milk chocolate, but without almonds. In the United States it is called a Milky Way.It was first manufactured under the Mars bar name in 1932 in Slough, England by Forrest Mars, Sr., son of American candy maker Frank C. Mars. He modelled it after his father's Milky Way bar, which was already popular in the US, adjusting the recipe to better suit European tastes. He had a staff of twelve people, and originally advertised it as using Cadbury's chocolate couverture. The bar and the proportions of the main components have changed over the years. With minor variations, this version is sold worldwide, except for the US, and is packaged in a black wrapper with red gold-edged lettering.\nIn 2002, the Mars bar was reformulated and its logo was updated with a more cursive appearance except in Australia where it is still has the pre-2002 logo. Its price also increased. The nougat was made lighter, the chocolate on top became thinner, and the overall weight of the bar was reduced slightly. The slogan \"Pleasure you can't measure\" was intended to appeal more to women and youths.Various sizes are made (sizes as of 2008): miniature bars called \"Fun Size\" (19.7 g) and \"Snack Time\" (36.5 g) (both sold in multiple packs); a larger multi-pack size of 54 g; the regular sized single 58 g bar and a \"king-size\" 84 g bar which has since been replaced by \"Mars Duo\" (85 g) – a pack that contains 2 smaller bars of 42.5 g each instead of 1 large one. The regular 58 g single bar contains 260 calories.In the second half of 2008, Mars UK reduced the weight of regular bars from 62.5 g to 58 g. Although the reduction in size was not publicised at the time, Mars claimed the change was designed to help tackle the obesity crisis in the UK. The company later confirmed that the real reason for the change was rising costs. In 2013, the \"standard\" Mars bar was further reduced to 51 g, bringing the change to around 20% in 5 years.In May 2009 the Mars bar size reduced from 60g to 53g in Australia, citing portion sizes and the obesity debate as the primary driver.\n\n\n=== United States ===\n\nIn the United States a Mars bar is a candy bar with nougat and toasted almonds coated with milk chocolate. The same candy bar is known outside the United States as a Mars Almond bar. Originally it didn't have caramel, but at some point caramel was added to it.\nIt was discontinued in 2002, relaunched in January 2010 (initially exclusively through Walmart stores), discontinued again at the end of 2011, and relaunched again in September 2016 by Ethel M. Chocolates, a gourmet chocolate subsidiary of Mars, Inc.. The 2016 version is the \"original American recipe\", which doesn't have caramel. It's available in their stores and on Amazon.com.In 2003 the company introduced a replacement called Snickers Almond. It's similar to the Mars bar, containing nougat, almonds, caramel, and a milk chocolate coating, although there are some differences. For example, the almonds are in smaller pieces in Snickers Almond than in the Mars bar.\nThe European version of the Mars bar is also sold in some United States grocery stores.\n\n\n== Spinoff products ==\nOther products have also been released using the Mars branding.\n\nMars Delight (discontinued in the UK as of 2009)\nMars Extra Chocolate Drink\nMars Active Energy Drink\nMars No Added Sugar Drink\nMars Ice Cream bars\nMars Midnight Ice Cream bars\nMcVities Mars Mini Rolls\nMars Biscuits (Australia and the UK  – a biscuit with Mars topping)\nMars Pods (Australia and New Zealand – a small crunchy wafer shell with Mars filling, also available in variants)\nMars Rocks\nMars Planets\nMars Mix\nMars Frozen Dessert Bar\nMars Protein – A mars bar with less sugar and added protein, this comes as a 50g size. Packaging claims \"More protein, 40% less sugar\" to a normal mars bar.\n\n\n== Custom packaging ==\n\nThe Original Mars bar in \"Believe\" packaging was sold in the UK from 18 April 2006 until the end of the 2006 FIFA World Cup in July. \"Believe\" took prominence on the packaging (\"Original Mars\" appeared in smaller print) to indicate support for the England national football team. Advertising in other nations of the UK was tailored to reflect their own teams after the public condemnation, although in Scotland the \"Believe\" packaging was still used – causing negative publicity.On 30 July 2008, the Tasmanian government announced that it had secured a major sponsor, Mars for a bid to enter the Australian Football League in a deal worth $4 million over 3 years and will temporarily change the name of its top-selling chocolate bar in Australia to Believe, to help promote Tasmania's cause.Mars were re-branded \"Hopp\" (engl. \"Go!\") in Switzerland during UEFA Euro 2008. Like the \"Believe\" packaging sold in the UK in 2006, \"Original Mars\" was also shown in smaller print.In 2010, to promote England's involvement in the 2010 FIFA World Cup, the background of the UK Mars packaging became the St. George cross.\n\n\n== Advertising slogans ==\n\n\n=== Former ===\n\"Maxis from Mars\" – United Kingdom (1969) A number of white Austin Maxis were driven around the country with numbers on the doors and if the number inside your Mars wrapper matched the Maxi you would see driving around your area, you won that very car.\n\"Mars bringt verbrauchte Energie sofort zurück.\" (Mars resplenishes lost energy instantaneously) - Germany (1960s) \n\"Mars macht mobil bei Arbeit, Sport und Spiel\" (Mars mobilises you at work, sports and play) – Germany (1980s and 1990s)\n\"A Mars a day helps you work, rest and play\" – Australia, United Kingdom, Canada, New Zealand\n\"Out of this world!\" – Australia, UK\n\"Earth – what you'd eat if you lived on Mars\" – New Zealand\n\"Another way to make your day\" – UK (2005)\n\"Feels good to be back! \" – Australia (2005)\n\"An almond in every bite!\" – US\n\"Un Mars, et ça repart\" (A Mars, and you're off again) – France (late 1990s and renewed from 2006)\n\"Mars, que du bonheur\" (Mars, only happiness) – France\n\"Mars, haal eruit wat erin zit!\" (Mars, get the most out of it!) – The Netherlands and Flanders, Belgium\n\"Who knows? In 1,000 years we could all be sitting on Mars eating Earth bars.\" – United Kingdom (a full-page advertisement placed in the official Guide Book for the Millennium Dome in 2000)\n\n\n=== Current ===\n\"Mars your day\" – Australia\n\"A Mars a day helps you work, rest and play\" – UK, Australia\n\"Recharge on Mars\" – Canada\n\"Mars, pleasure you just can't measure\" – Europe\n\"Un coup de barre? Mars et ça repart!\" (Feeling beat? A Mars and you're off again!) – France\n\"Nimm Mars, gib Gas\" (Take Mars, step on the gas) – Germany\n\"Mars, momento di vero godimento\" (Mars, a moment of pure enjoyment) – Italy\n\"Mars, geeft je energie\" (Gives you energy) – The Netherlands and Flanders, Belgium\n\"Work-Rest-Play\" – UK (later \"Work-Rest-Play your part\")\n\"Turn Up the Heat!\" – (UK promotional packs in 2010)\n\n\n== Deep-fried Mars bar ==\n\nThis is a Mars bar which has been coated with batter and deep-fried in oil or beef fat. First reports of battered Mars bars being sold in Stonehaven, Scotland date back to 1995. The product is \"not authorised or endorsed\" by Mars, Inc.Deep-fried Mars bars are available from some fish-and-chip shops in the UK (mainly in Scotland), Singapore, Australia, New Zealand, Canada, Ireland and the United States.A similar dish has appeared in Kathmandu, Nepal where momo (dumplings) have used Mars bars as fillings.\n\n\n== Recalls ==\nIn July 2005, Mars bars, along with the Snickers bar, were recalled due to an anonymous extortion attempt against Star City Casino in Sydney. The extortionist claimed to have poisoned seven Mars and Snickers bars at random stores in New South Wales. As a result, Masterfoods Corporation, the company that manufactures Mars bars in Australia, recalled the entire Mars and Snickers product from store shelves in New South Wales. Nineteen people were possibly affected, with two being admitted to hospital. In the later half of August 2005, the threat to the public was deemed negligible and the bars returned to shelves.In February 2016, Mars, Snickers and various other Mars, Inc. chocolate products were recalled in 55 countries in Europe, the Middle East and Asia. The precautionary recall was issued after a customer found pieces of plastic in a Snickers bar purchased in Germany. The error was traced back to a Mars, Inc. factory in Veghel, The Netherlands.\n\n\n== Animal products controversy ==\nIn May 2007 Mars UK announced that Mars bars, along with many of their other products such as Snickers, Maltesers, Minstrels and Twix would no longer be suitable for vegetarians because of the introduction of rennet, a chemical sourced from calves' stomachs used in the production of whey.The rabbinical authorities declared that the products remained kosher for Jewish consumption.The decision was condemned by several groups, with the Vegetarian Society stating that \"at a time when more and more consumers are concerned about the provenance of their food, Mars' decision to use non-vegetarian whey is a backward step\".\nMars later abandoned these plans, stating that it became \"very clear, very quickly\" that it had made a mistake.\n\n\n== Economics ==\nIt has been observed on several occasions that the price of a Mars bar correlates fairly accurately with the change in value of the pound sterling since World War II, much in the way that the Big Mac Index has proven to be a good indicator of the actual relative purchasing power of world currencies.\n\n\n== Popular culture ==\nNorthern Irish pop-punk band The Undertones wrote and recorded a song called \"Mars Bars\", released as a B-side in 1979.\n\n\n== References ==\n\n\n== External links ==\nThe Visible Mars bar project, which shows the difference between US and UK Mars bars.\nSite with cross-sections of both the original US and Canadian Mars bars\nSlough History Online\nTelevision commercial for original US Mars bar showing ingredients"