"Yarovit (Latin: Gerovit, Herovit, Polish: Jarowit) is a god of war worshipped by Polabian Slavs associated with fertility and agriculture. In interpretatio romana, he was compared to Roman god of war Mars. His feast probably fell on April 15 or May 10 - sowing festival. His symbol was a golden shield that was kept in his temple. Because of the identical first part of the name (jar(o)) he can be associated with the East Slavic god Yarilo, and because of the semantic similarity with Svetovit, some scholars suggest that both gods are related.\n\n\n== Sources ==\nYarovit's temple in Wolgast is mentioned in The life of Otto, apostle of Pomerania – hagiography dedicated to Otto of Bamberg, catholic Bishop and missionary whose mission was to Christianize Pomerania. When one of his clerics approached the temple, people probably thought that he wanted to burn it and started running towards him:\n... But one of them name Dietricus, who was in advance of them and had already approached the door of the temple, not knowing where ot turn, bodly entered the shrine itself and, seeing a golden shield fastened to the wall which had beed dedicated to Gerovit their god of war, [Latin: deo suo Gerovito, qui lingua Latina Mars dicitur...] and which they considered it unlawful to touch, he seized the shield and went forth to meet them. They, like ignorant peasants, thought that their god Gerovit was advancing to meet them, and retired stupefied with amazement and fell to the ground. When Dietricus perceived their folly he threw away thee shield and fled, thanking God that He had thought fit to deliver His servants out of their hands.\nOtto also encountered the cult of Yarovit in Havelberg:\n... On the very day of his arrival flags were placed around the town, which was enganged in celebrating a festival in honour of an idol called Gerovit. When the man of God perceived this, he was pricked to the heart on account of the great delusion of its people and refused to enter the walls of the town, but waited in front of the gate and, having summoned Wirikind, the ruler of the place, demanded of him why he permitted this idolatry to be practiced. He protested that the people had rebelled against their Archbishop Noribert because he had tried to subject them to hard servitude, and confessed that they could not be compelled to accept teaching from him, but were prepared to die rather than submit to such a burdensome servitude.Yarovit was also to appear to one of his followers to warn him against the mission.\n\n\n== Etymology ==\nThe god's name consists of two parts: jar- and -vit. The first part, jar-, is interpreted as \"strong, raw, crude, young\", from Proto-Slavic *jarъ (cf. Old Polish jary (\"strong\"), Russian járyj (\"ardent\", \"violent, furious\")). Secondary interpretation of that part is \"spring\", from Proto-Slavic *jaro (cf. Czech jaro (\"spring\")). Second part -vit means \"lord, master\". So the name could mean \"Powerful, Strong Lord\" or \"Young Winner\".\n\n\n== Interpretations ==\nScholars believe that Yarovit was a solar god in addition to being a god of war. This is to be proven by a large, artistic, golden shield belonging to a god that can represent the sun. On the tombstone, which was created in early Christian times, located in the Church of St. Peter in Wolgast there carved a figure with a spear, which is considered the image of Yarovit.Scholars also believe that Yarilo is related to Svetovit. It is argued that the names of both gods mean the same: the name of Svetovit most likely comes from word svęt (\"powerful, mighty\") and -vit. The second similarity is the shield dedicated to Yarovit, which served to divination the victory during the war – the same function was performed by the white horse of Svetovit. Brückner suggested that first the name Yarovit was created and later Rani replaced him with Svetovit, because the first two parts have same meaning.Yarovit could also be associated with fertility and agriculture (just like Roman Mars), and this may also tie him to Yarylo, whose name comes from a similar root. The curse spoken by Yarovit through the mouth of a pagan priest may indicate this:\nI am your god, I, who clothe the plains with grass and the woods with foliage, the produce of the fields and the trees, the offspring of the flocks and everything that is of use to man are in my power. I give these to my worshippers and take them from those who despise me. Tell then the inhabitants of the town of Hologost that they accept no foreign god who cannot help them, and that they suffer not to live the messengers of another religion who, I predict, will come to them.\n\n\n== References ==\n\n\n== Bibliography ==\nBrückner, Aleksander (1985). Mitologia słowiańska. Warszawa: Państwowe Wydawnictwo Naukowe. ISBN 8301062452.\nGieysztor, Aleksander (2006). Mitologia Słowian. Warszawa: Wydawnictwa Uniwersytetu Warszawskiego. ISBN 83-235-0234-X.\nSzyjewski, Andrzej (2003). Religia Słowian. Kraków: Wydawnictwo WAM. ISBN 83-7318-205-5.\nStrzelczyk, Jerzy (2007). Mity, podania i wierzenia dawnych Słowian. ISBN 978-83-7301-973-7."