"Navi Mumbai (Marathi pronunciation: [nəʋiː mumbəiː], is a planned city in india, situated on the west coast of the Indian subcontinent, in the Konkan division of Maharashtra state, on the mainland of western India. The city is divided into two parts, North Navi Mumbai and South Navi Mumbai, for the individual development of Panvel Mega City, which includes the area from Kharghar to Uran, including Taloja and Old Panvel nodes strictly in the city of Navi Mumbai. Though, NMMC doesn't include these nodes in their jurisdiction because CIDCO is currently developing them, after developing these nodes it will be handed over to NMMC. Navi Mumbai has a population of 1,119,477 as per the 2011 provisional census. It has an average city elevation of 14 meters, excluding forest area.\nThe area was proposed in 1971 as a new urban township of Mumbai by the Government of Maharashtra. A new public sector undertaking, CIDCO, was established for this purpose. Navi Mumbai is situated across two districts, Thane Part and Raigad. The city has been ranked 12th among 73 cities surveyed for cleanliness and hygiene by the Union Ministry of Urban Development (MoUD) and Quality Council of India (QCI) as a part of Swachh Bharat Abhiyan.Navi Mumbai is home to various educational institutions offering courses in several streams including engineering, medical sciences, interior designing, and hotel management. Various multinational corporations like Siemens, McDonald's, Morningstar, Inc., Baker Hughes, Bureau Veritas, Bizerba, Reliance, Accenture, and Larsen & Toubro have their Head offices/branches across the city, making it an active business hub. Navi Mumbai also has various recreational facilities such as a Golf Course, Central Park and Pandavkada Water Falls in Kharghar, Parsik Hill near CBD Belapur, Wonders Park and Jewel of Navi Mumbai in Nerul and Seawoods, Mini Seashore Juhu Chowpatty in Juhu Nagar (Juhu Gaon), Sagar Vihar in Vashi, Pirwad, Nagav, and Mankeshwar Beaches in Uran, Belapur Fort in CBD Belapur, Karnala Bird Sanctuary near Panvel, and several other public places like gardens and jogging tracks. Navi Mumbai also has many quality restaurants and luxury hotels for accommodation. There are many shopping malls, such as Seawoods Grand Central Mall in Seawoods, Little World Mall, Glomax Mall and Prime Mall in Kharghar, Orion Mall and K-Mall in Panvel, Center One Mall, Inorbit Mall and Raghuleela Mall in Vashi. Navi Mumbai is also a host to many best health care centres and hospitals like MITR Hospital in Sector 05, Kharghar, Fortis Hiranandani Hospital near Juhu Village, Juhu Nagar (Vashi), Apollo Hospital in Belapur and SRL diagnostic centres in Kharghar, Panvel, Kamothe, Kalamboli, Koper Khairane, Juhu Gaon to name a few.\n\n\n== History ==\nIndia experienced a phenomenal rate of urban growth during the 25 years following independence and Mumbai always has had its due share in it. The population of Greater Mumbai rose from 2.966 million in 1951 to 4.152 million in 1961 and to 5.970 million in 1971, registering 40.0 and 43.80 percent growths during the first and second decades respectively. The rapid rate of growth of population, made possible by the increasing industrial and commercial importance of the city, resulted in a fast deterioration in the quality of life for the majority of people living in the city. Development inputs could not keep pace with the rapidly growing population, industry, trade and commerce. Besides, there are physical limitations to the growth of a city built on a long and narrow peninsula, which has very few connections with the mainland.\nThe Government of Maharashtra has been alive to the emerging problems of this metropolis. Responsible public opinion was equally vigilant and several constructive suggestions appeared from time to time in the press and elsewhere. All this helped in keeping the problems of Bombay in the forefront of public awareness. In 1958, the Govt. of Bombay appointed a study group under the Chairmanship of Shri S.G. Barve, Secretary to Government, Public Works Department, to consider the problems relating to congestion of traffic, deficiency of open spaces and playfields, shortage of housing and over-concentration of industry in the metropolitan and suburban areas of Bombay, and to recommend specific measures to deal with these.\nThe Barve Group reported in February 1959. One of its major recommendations was that a rail-cum-road bridge is built across the Thane Creek to connect peninsular Mumbai with the mainland. The group felt that the bridge would accelerate development across the Creek, relieve pressure on the city's railways and roadways, and draw away industrial and residential concentrations eastward to the mainland. The Group hoped that the eastward development would be orderly and would take place in a planned manner.\nThe Government of Maharashtra accepted the Barve Group recommendation. Another Committee under the Chairmanship of Prof. D.R. Gadgil, then Director of the Gokhale Institute of Politics and Economics, Poona was formed and asked: “to formulate broad principles of regional planning for the metropolitan regions of Mumbai Panvel and Pune and to make recommendations for the establishment of Metropolitan Authorities for preparation and execution of such plans”.\nThe Gadgil Committee inter-alia made two important recommendations which have influenced the planning for Navi Mumbai. One, a planned decentralisation of industries with severe restrictions on further industrial growth in the Bombay region. Two, development of the mainland area as a multi-nucleated settlement, each settlement smaller in size than 250,000 population. These multi-nucleated settlements are called nodes in the plan, where the entire development is proposed as a series of nodes strung out along the mass transit area. The nodes proposed by us are, however, more closely spaced than the multi-nucleated settlements envisaged by Dr. Gadgil. But the principle remains of individual settlements, self-contained in respect of schools and shopping and other essential services and separated from each other by green spaces.\nThe Maharashtra Regional and Town Planning Act was passed in 1966 and brought into force in January 1967. The Bombay Metropolitan Region was notified in June 1967 and a Regional Planning Board constituted under the Chairmanship of Shri L.G. Rajwade, I.C.S. The Draft Regional Plan of the Board was finalised in January 1970. It proposed the development of a twin city across the harbour, on the mainland to the east, as a counter-magnet to the office concentration taking place at the southern tip of Bombay. The alternative growth pole was to siphon off the over-concentration of jobs and population which further growth would cause in the city and reallocate these on the mainland. In making this recommendation, the Board was influenced by various factors such as the existing industrial sites in the Than-Belapur area and Taloja, the imminent completion of the Thana Creek Bridge and the proposal of the Bombay Port Trust to establish a new port at Nhava Sheva.\nThe Board recommended that the new metro-centre or Navi Mumbai as it is now called, be developed to accommodate a population of 2.1 million.\n\n\n== Implementation, development and issues ==\n\nThe planning of Navi Mumbai began in 1971 and involved leading architects and urban planner like Charles Correa (Chief Architect), Shirish Patel, Pravina Mehta and R. K. Jha (Chief Planner), The City and Industrial Development Corporation (CIDCO) was established on 17 March 1971, under the Indian Companies Act, 1956 for this purpose. The area covered 150 kilometres (93 mi) of the total 720 kilometres (450 mi) of the Konkan coast. Privately owned land consisting of 86 villages covering 15,954 hectares (39,420 acres) within the present limits of Navi Mumbai and further villages measuring an additional 2,870 hectares (7,100 acres) were acquired by the government of Maharashtra. The major part of Navi Mumbai covers the southern part of Thane taluka (from Thane District) and part of Panvel and Uran taluka (from Raigad District).\nCIDCO carved out 19 small nodes with a view towards facilitating comprehensive development. These nodes were named Airoli, Ghansoli, Kopar Khairane, Juhu Nagar, Vashi, Turbhe, Sanpada, Juinagar, Nerul, Darave, Karave Nagar, CBD Belapur, Kharghar, Kamothe, New Panvel, Kalamboli, Ulwe, Dronagiri and Taloja.\nCIDCO planned and constructed all the railway stations, roads and public spaces in Navi Mumbai and developed nearby areas commercially.\n\nIn 1973, the Vashi bridge was opened to the public for residents of Vashi, CBD Belapur and Nerul. The Sion-Panvel Highway was built to reduce the time taken to travel from Sion to Panvel. Initially, there was not much response to the new city. Major changes took place only after 1990, with the commissioning of a wholesale agricultural produce market at Turbhe and the construction of a commuter railway line from Mankhurd to Vashi in May 1992. These developments caused a sudden growth in economic activities and population in Navi Mumbai.\nThe city was originally planned to create affordable housing for people who could not afford living in Mumbai. It was decided not to let any slum pockets pop up across the city. But it failed. as, according to the 2001 census, a fifth to a third of the population of municipalised Navi Mumbai lives in slums\n and gaothans (urban villages), with thousands of buildings violating planning norms.By the end of the 1990s, the planning authority of Navi Mumbai initiated private participation in the developmental activity of Navi Mumbai. A new railway link between Nerul and Uran was inaugurated on 11 November 2018. Southern Navi Mumbai is being developed rapidly with its class infrastructure and modern nodes of Kharghar, Kamothe, Panvel and Kalamboli. These nodes are experiencing major infrastructural developments due to their proximity to the proposed Navi Mumbai International Airport. Also, the latest development known as 'One Time Planning' with an estimated budget of ₹12,821 crores is underway to transform the municipalised Navi Mumbai on the lines of the Mega Cities of the world.\n\n\n== Administration ==\n\n\n=== CIDCO ===\nWhen Navi Mumbai was created in the 1970s, CIDCO was the only authority that looked after the development and maintenance of the city. CIDCO prepared a developmental plan for Navi Mumbai covering 95 villages all over the city.\n\nFor the first ten years of the project CIDCO acted as the planning and administrative body and as the developer and builder for the project. Taxes on property, land, commercial and water were payable to CIDCO.\nCIDCO planned 14 nodes divided into the North and the South part. The 7 nodes in the North part are Airoli node, Ghansoli node, Kopar Khairane node, Vashi node, Sanpada node, Nerul node and Belapur node. The 7 nodes in the South part are Kharghar node, Kamothe node, Kalamboli, Pushpak node, Panvel node,  Ulwe node  and Dronagiri node. Also, two municipal bodies have been established, Navi Mumbai Municipal Corporation (NMMC) in the North and Panvel Municipal Corporation in the South.Each of the nodes is divided into smaller groups called sectors.\nInitially only Juhu Vashi, Nerul and CBD Belapur were developed by CIDCO with housing, schools and community centre roads. But after the arrival of the harbour railway line extension in the 1990s, there was an increase in population. CIDCO shifted its development plan to nodes like Kharghar, Kamothe, New Panvel and Kopar Khairane. In its new development plan, CIDCO land was allocated to builders for housing. CIDCO only provided basic infrastructure like roads, water and electricity, these nodes were developed mostly by private builders according to the CIDCO plan.\nThe newly developed nodes of Navi Mumbai on the south side like Kharghar, Kamothe, New Panvel and Kalamboli are maintained by CIDCO. These nodes, which are all beyond CBD Belapur, come under the Raigad district.\n\n\n=== NMMC ===\nOn 17 December 1991, Navi Mumbai Municipal Corporation (NMMC) was constituted by the state government for maintaining some of the developed nodes of Navi Mumbai.\nLocal self-government started on 1 January 1992. NMMC was handed nine of the 14 nodes of the Navi Mumbai project area for its jurisdiction. However, CIDCO, as a planning authority, has rights on the open plots in these five nodes.\nThe NMMC jurisdiction starts at Digha in the North and ends at Belapur in the South. The NMMC area is planned into nine nodes (zones). The nine nodes are Belapur node, Nerul node, Turbhe node, Vashi node, Kopar Khairane node, Ghansoli node, Airoli node, Digha node and Dahisar node.\n\nWith annual budget exceeding Navi Mumbai Municipal Corporation, it is rated amongst the richest corporations in Maharashtra.\nThe municipal corporation is headed by a municipal commissioner and an elected mayor. Currently, the Mayor of Navi Mumbai Municipal Corporation is Nationalist Congress Party (NCP) member Mr. J.D.Sutar. There are 111 electoral wards in Navi Mumbai. A corporator is elected in each of the wards.\n\n\n=== PMC ===\nRecently a resolution has been passed by the general body of the Panvel Municipal Council (PMC), which previously administered the city of Old Panvel spread across an area of 12.11 sq. km. with a population of 1.8 lakh (0.18 mn), lead to upgrade the Municipal Council to a Municipal Corporation. But the minimum requirement for the formation of a Municipal Corporation is having a population of at least 300,000 which the Council falls short of. Hence, a decision has been made by the PMC to incorporate the adjacent nodes of Navi Mumbai under CIDCO's jurisdiction and surrounding villages in the proposed Panvel Municipal Corporation. This would add another 593,000 people under its administration. thereby clearing the first hurdle.\nThe decision propounds that instead of merging the administration of newly developed nodes of Navi Mumbai including New Panvel, Kamothe, Kalamboli, Kharghar, parts of Uran and developing nodes of Ulwe and Dronagiri, which are currently overseen by CIDCO, with NMMC, they should be incorporated under the proposed Panvel Municipal Corporation. This opinion is the result of a political agenda. The fact is, of the total 16 nodes of Navi Mumbai 10 are under NMMC and the rest are under CIDCO. NMMC's jurisdiction is limited within the boundaries of the Thane district, which is a foothold of the Nationalist Congress Party, while the remaining nodes are in the Raigad district, where parties like Bharatiya Janata Party, Shiv Sena and Peasants and Workers Party of India are most active. Hence, the local politicians, especially Panvel MLA Prashant Thakur, oppose the merger of all the nodes under one Municipal Corporation citing political conspiracy. In Panvel Municipal Corporation BJP is in power and Peasants and Workers Party of India leading the opposition represent by Pritam Mhatre.The proposal is to be tabled before the Maharashtra State government which has appointed an expert committee to study the feasibility of the demand to upgrade the Panvel Municipal Council to a Municipal Corporation.But there is some discontent among the residents of the Kharghar node. The residents and some NGOs from Kharghar have voiced their demand for Kharghar to be inducted under NMMC as it would provide them with better civic amenities and would make Kharghar eligible to be a part of the proposed plan of making Navi Mumbai a Smart City which includes only the area under NMMC's jurisdiction. But, in actual, CIDCO South Navi Mumbai will be MMR's second smart city. The other one being the North Navi Mumbai, which is under NMMC's jurisdiction. State government has asked CIDCO to develop South Navi Mumbai as a smart city as it will be a role model for other states in the country. Smart City project includes, Navi Mumbai International Airport, Mumbai Trans Harbour Link connecting Ulwe with Sewri, a long coastal link from Dronagiri, extension of the Palm Beach Road from Kopar Khairane to Airoli, extension of national highway, local train railway from Panvel to Ulwe and Uran, new metro projects, including CBD Belapur, Taloja, Khandeshwar and Navi Mumbai airport metro project, development of fourth container terminal in JNPT, new greenfield cities, one near Uran, affordable housing schemes for low income groups and Project Affected Peoples (PAPs), new parks, playgrounds, auditoriums, bhavans, noise and air quality index checkers using advanced technologies, modern sewage treatment plants.  CIDCO has its own plan of developing the area under its jurisdiction (informally called as Navi Mumbai South) as a smart city. Everything will be completed 2022, except the airport.\n\n\n== Demographics ==\nAs per provisional reports of Census India, population of Navi Mumbai in 2011 is 1,119,477; out of which males and females are 611,501 and 507,976 respectively. Although, Navi Mumbai city has population of 1,119,477; its urban / metropolitan population is 18,414,288 of which 9,894,088 are males and 8,520,200 are females. At least 65.5% of population speaks Marathi language in Navi mumbai.\nIn education section, the total number of literate individuals in Navi Mumbai city is 911,542. Out of this number, 519,257 are males while 392,285 are females. Average literacy rate of Navi Mumbai city is 91.57 percent of which male and female literacy was 95.05 and 87.33 percent.\nThe sex ratio of Navi Mumbai city is 831 females per 1000 males. Child sex ratio of girls is 901 per 1000 boys.\n\n\n== Transport ==\n\nNavi Mumbai has a robust infrastructure, is well connected to other parts of the state and country and is relatively less polluted compared to Mumbai. The city has a good public transportation system with NMMT, the transport wing of NMMC, serving the bus commuters, the Mumbai suburban railway serving the train commuters and a large fleet of auto rickshaws for intra-nodal commute. The Mumbai-Pune Expressway starts at Kalamboli in Navi Mumbai. The Mumbai Trans Harbour Link (MTHL), also known as the Sewri-Nhava Sheva Trans Harbour Link, is an under construction 22-kilometre (14 mi) long freeway grade road bridge connecting South Mumbai with Navi Mumbai.The Mumbai suburban railway network covers most of the populated region of the city. The most important suburban stations are Vashi, Nerul, Belapur and Panvel. The stations are planned as major railway junctions. Panvel is the only mainline station and also the busiest railway station of Navi Mumbai. All outstation trains halt here for time periods varying from 5 to 20 minutes. It is an important junction, railway lines come and meet here and it is connected to almost all parts of India. A new broad gauge line is functional between Karjat & Panvel.\nBrihanmumbai Electric Supply and Transport (BEST) buses run from various area of Mumbai to Navi Mumbai & Navi Mumbai Municipal Transport (NMMT) buses run all over Navi Mumbai and various area in Mumbai, Thane, Bhiwandi, Kalyan-Dombivli-Badlapur, Panvel-Khopoli-Taloja, Uran-Ulwe etc. NMMT runs AC Volvo buses from Navi Mumbai to Mumbai, Thane and Kalyan-Dombivli. The Palm Beach Marg, a 10-kilometre (6.2 mi) long six lane road connects Vashi to CBD Belapur running parallel to the Thane creek.\nNMMT Routes in Navi Mumbai\n\nBEST Routes in Navi Mumbai\n\nKDMT Routes in Navi Mumbai\n\nTMT Routes in Navi Mumbai\n\nAuto rickshaws provide inter as well as intra nodal public transport across the city. Taxis operating from designated taxi stands provide the means to travel to further destinations. Taxis charge a fixed rate approved by the R.T.O. details of which can be found on popular local transit apps of the city.Navi Mumbai has the largest container terminal in India, Jawaharlal Nehru Port at Nhava Sheva near Uran. It is well connected by road and rail, and handles approximately 56.13% of India's container traffic. The Chatrapati Shivaji International Airport, 30 km away, is the nearest airport to the city.\n\n\n=== International Airport ===\n\nThe Navi Mumbai International Airport is being constructed in southern Panvel area near Ulwe. It is being built through Public Private Partnership (PPP), with private sector partners having 74% equity and the Airports Authority of India (AAI) and Government of Maharashtra (through CIDCO) each holding 13%.\nThe International Civil Aviation Organization (ICAO) has already given techno-feasibility clearance to the airport. The central government provided cabinet approval for the construction on 31 May 2007.  While an opening date of 2020 has been mooted, as of March 2018, construction has yet to start.\n\n\n=== Metro Rail ===\n\nThe Navi Mumbai Metro is an under construction rapid transit system in Navi Mumbai. A network of as many as six lines have been planned of which four lines will be constructed by CIDCO in the Navi Mumbai south region, the second and third line of the metro system will be constructed by NMMC and MMRDA respectively. The first line of the metro system is being constructed by CIDCO. This line includes three phases. In the first phase, the line will join the CBD Belapur station on the Mumbai suburban railway and Pendhar village. In the second phase, the line will join Taloja MIDC and Khandeshwar node (which will be extended to the Navi Mumbai International Airport in Ulwe node of the city), and in the third phase, the line will link the Pendhar and Taloja MIDC metro stations. The first phase of the line 1 is slated to become operational by 2020 and CIDCO has claimed to make the network of its four lines fully operational by 2022-2023 along with operationalisation of the city's International Airport in Ulwe node. The cost of the metro project has risen from 4,163 crore for 21.45 km in 2011 to 8,904 crore for 26.26 km in 2018.\n\n\n== Infrastructure ==\nBasic infrastructure worth ₹40 billion (US$560 million) is already in place. The city boasts a reliable supply of electricity from various sources, and excellent motoring conditions, with numerous flyovers, broad roads, and parking lots. The main problem which the residents face is poor connectivity with Mumbai, with only two road links between the two cities and a single rail line. A hovercraft service from Vashi to Colaba and the CBD to Colaba did not succeed due to the high cost of tickets and maintenance. Cidco is planning to relaunch its hovercraft service from Vashi, Belapur, Nerul and Airoli to Gateway of India.\n\n\n== Services ==\nThere are adequate utility services, banks, restaurants, malls, multiplexes and other shops in Navi Mumbai. The City boasts several shopping malls such as Little World Mall, Glomax Mall, Prime mall and Pacific Mall in the most developed node of Navi Mumbai, Kharghar; K-Mall and the Orion mall in Panvel node of the city; Center One, Palm Beach Galleria, Citi Center, Raghuleela Mall and Inorbit Mall in Vashi, alongwith the Seawoods Grand Central Mall in Seawoods. Throughout Navi Mumbai supermarkets and hypermarkets like Big Bazaar, Reliance Smart, Reliance Smart points, Apna Bazaar, More, Spencer's, Reliance Fresh, Spinach, Daily Bazar and Fairprice cater to the shopping needs of the residents. DMart has launched eight hypermarkets in Navi Mumbai.\nLeading banks such as Bank of India, Punjab National Bank, South Indian Bank, State Bank of India, Union Bank, Saraswat Bank, Bank of Baroda, AXIS Bank, Canara Bank, Oriental Bank of Commerce, Central Bank of India, Bank of Maharashtra, State Bank of Hyderabad, Citibank India, ICICI Bank, Jammu & Kashmir Bank and HDFC Bank have their branches and ATMs around Navi Mumbai. The Reserve Bank of India has served the people of Navi Mumbai since 2001.\nCultural centres include the Navi Mumbai Tamil Sangam.\nNavi Mumbai has some three-star and five-star hotels; namely Royal Tulip (five-star hotel in Kharghar), The Hotel Three Star (In Kharghar), The Park (Belapur CBD), Fortune Select Exotica-Member ITC Hotel Group (Vashi), to name a few.\n\n\n== Commerce ==\n\nThe Navi Mumbai Special Economic Zone (SEZ) located in the nodes of Dronagiri and Kalamboli are planned to provide commercial growth and employment to the city. Positioned en route the proposed Navi Mumbai Airport, this megaproject has attracted investments of close to 40,000 crores. Navi Mumbai is a new hub for newly incorporated companies & start ups to establish their base in Mumbai. As per the list of newly incorporated companies in Navi Mumbai around 500 new & startups companies were registered in and around the region every month.\n\n\n== Sports ==\n\nCricket is the prevalent sport in the city. Navi Mumbai has its own International Cricket Ground in Shiravne (Nerul) called the DY Patil Stadium which hosts IPL T-20 matches, including hosting the 2008 and 2010 IPL finals. It is also the home ground for the Indian Super League football club Mumbai City FC. The Fr. Agnel Stadium in Vashi is the training ground of the team.\nNavi Mumbai has an Olympic-size swimming pool at Nerul. CIDCO has proposed two 18-hole golf course academies at Nerul and Kharghar. There are plans to have sports facilities in the proposed 80 hectare Central Park being developed in Kharghar. The CIDCO has also constructed a 11-hole golf course in Kharghar near Central Park.\n\n\n== Education ==\n\nProvision of schools and colleges was priority in the planning of Navi Mumbai. The nodes (townships) were designed to provide one primary school per 5,000 populations, one high school for 12,500 populations and one college for 50,000 population.\nEach of the nodes is self-sufficient in terms of providing quality education. Students are given access to various syllabi, including the State Education Board, CBSE, IGCSE, IB and ICSE patterns. Other than this, CIDCO encouraged private institutions as well.\nAbout 22.5% of the total population is considered to be school-going children. Most students attend school and college within their node (township). 76% of the students walk to their school or college, 12% use public transport, 10% use bicycles and only 2% travel by school bus.\nA number of premier schools and colleges have been set up in Navi Mumbai. And not just local students, but students from Mumbai and even outside come to Navi Mumbai in their quest for quality education. As such, Navi Mumbai is quickly acquiring the title of educational hub.\n\n\n== Colleges ==\nDY Patil University\nIIM Indore (Mumbai Campus)\nNational Institute of Fashion Technology\nFr. Conceicao Rodrigues Institute of Technology\nCDAC Kharghar.\nIndian Maritime University, Navi Mumbai Campus\n\n\n== Schools ==\nApeejay School, Nerul\nApeejay School, Kharghar\nAvalon Heights International School\nD.A.V Public School, Nerul\nDayanand Anglo Vedic Public School, Airoli\nDelhi Public School, Nerul\nFr. Agnel Multipurpose School and Junior College, Vashi\nGoldcrest High International School\nNew Horizon Scholars School, Airoli\nRyan International Schools,              Sanpada, Kharghar, Vashi, Kalamboli\nSacred Heart High School, Vashi\nVIBGYOR Group of Schools, Airoli\nVIBGYOR Group of Schools, Kharghar\nVishwajyot High School, KhargharPresentation Convent School, Nerul\nReliance Foundation School, KoparKhairne \nSt. Lawrence High School, Vashi\nSt Mary's ICSE School, KoparKhairne \nSt.Mary's Multipurpose High School, Vashi\nSeventh-Day Adventist Higher Secondary School (ICSE&ISC), Sanpada\nSt. Xavier's High School & Junior College, Nerul\n\n\n== References ==\n\n\n== External links ==\n Navi Mumbai travel guide from Wikivoyage\n\"Places to Visit in Navi Mumbai\", Tripoto, retrieved 2 November 2014\nNavi Mumbai Municipal Corporation Accessed 11 October 2012.\nNavi Mumbai Special Economic Zone\nCIDCO – City and Industrial Development Corporation Accessed 29 June 2013.\n[1] navi Mumbai metro train trial"