"Navi Mumbai (Marathi pronunciation: [nəʋiː mumbəiː], is a planned city in india, situated on the west coast of the Indian subcontinent, in the Konkan division of Maharashtra state, on the mainland of western India. The city is divided into two parts, North Navi Mumbai and South Navi Mumbai, for the individual development of Panvel Mega City, which includes the area from Kharghar to Uran, including Taloja and Old Panvel nodes strictly in the city of Navi Mumbai. Though, NMMC doesn't include these nodes in their jurisdiction because CIDCO is currently developing them, after developing these nodes it will be handed over to NMMC. Navi Mumbai has a population of 1,119,477 as per the 2011 provisional census. It has an average city elevation of 14 meters, excluding forest area.\nThe area was proposed in 1971 as a new urban township of Mumbai by the Government of Maharashtra. A new public sector undertaking, CIDCO, was established for this purpose. Navi Mumbai is situated across two districts, Thane Part and Raigad. The city has been ranked 12th among 73 cities surveyed for cleanliness and hygiene by the Union Ministry of Urban Development (MoUD) and Quality Council of India (QCI) as a part of Swachh Bharat Abhiyan.Navi Mumbai is home to various educational institutions offering courses in several streams including engineering, medical sciences, interior designing, and hotel management. Various multinational corporations like Siemens, McDonald's, Morningstar, Inc., Baker Hughes, Bureau Veritas, Bizerba, Reliance, Accenture, and Larsen & Toubro have their Head offices/branches across the city, making it an active business hub. Navi Mumbai also has various recreational facilities such as a Golf Course, Central Park and Pandavkada Water Falls in Kharghar, Parsik Hill near CBD Belapur, Wonders Park and Jewel of Navi Mumbai in Nerul and Seawoods, Mini Seashore Juhu Chowpatty in Juhu Nagar (Juhu Gaon), Sagar Vihar in Vashi, Pirwad, Nagav, and Mankeshwar Beaches in Uran, Belapur Fort in CBD Belapur, Karnala Bird Sanctuary near Panvel, and several other public places like gardens and jogging tracks. Navi Mumbai also has many quality restaurants and luxury hotels for accommodation. There are many shopping malls, such as Seawoods Grand Central Mall in Seawoods, Little World Mall, Glomax Mall and Prime Mall in Kharghar, Orion Mall and K-Mall in Panvel, Center One Mall, Inorbit Mall and Raghuleela Mall in Vashi. Navi Mumbai is also a host to many best health care centres and hospitals like MITR Hospital in Sector 05, Kharghar, Fortis Hiranandani Hospital near Juhu Village, Juhu Nagar (Vashi), Apollo Hospital in Belapur and SRL diagnostic centres in Kharghar, Panvel, Kamothe, Kalamboli, Koper Khairane, Juhu Gaon to name a few."