"Maudgalyāyana (Pali: Moggallāna), also known as Mahāmaudgalyāyana or by his birth name Kolita, was one of the Buddha's closest disciples. Described as a contemporary of disciples such as Subhuti, Śāriputra (Pali: Sāriputta), and Mahākāśyapa (Pali: Mahākassapa), he is considered the second of the Buddha's two foremost male disciples, together with Śāriputra. Traditional accounts relate that Maudgalyāyana and Śāriputra become spiritual wanderers in their youth. After having searched for spiritual truth for a while, they come into contact with the Buddhist teaching through verses that have become widely known in the Buddhist world. Eventually they meet the Buddha himself and ordain as monks under him. Maudgalyāyana attains enlightenment shortly after that.\nMaudgalyayana and Śāriputra have a deep spiritual friendship. They are depicted in Buddhist art as the two disciples that accompany the Buddha, and they have complementing roles as teachers. As a teacher, Maudgalyayana is known for his psychic powers, and he is often depicted using these in his teaching methods. In many early Buddhist canons, Maudgalyāyana is instrumental in re-uniting the monastic community after Devadatta causes a schism. Furthermore, Maudgalyāyana is connected with accounts about the making of the first Buddha image. Maudgalyāyana dies at the age of eighty-four, killed through the efforts of a rival sect. This violent death is described in Buddhist scriptures as a result of Maudgalyāyana's karma of having killed his own parents in a previous life.\nThrough post-canonical texts, Maudgalyāyana became known for his filial piety through a popular account of him transferring his merits to his mother. This led to a tradition in many Buddhist countries known as the ghost festival, during which people dedicate their merits to their ancestors. Maudgalyāyana has also traditionally been associated with meditation and sometimes Abhidharma texts, as well as the Dharmaguptaka school. In the nineteenth century, relics were found attributed to him, which have been widely venerated.\n\n\n== Person ==\nIn the Pali Canon, it is described that Maudgalyāyana had a skin color like a blue lotus or a rain cloud. Oral tradition in Sri Lanka says that this was because he was born in hell in many lifetimes (see § Death).  Sri Lankan scholar Karaluvinna believes that originally a dark skin was meant, not blue. In the Mahāsāṃghika Canon, it is stated that he was \"beautiful to look at, pleasant, wise, intelligent, full of merits ...\", as translated by Migot.In some Chinese accounts, the clan name Maudgalyāyana is explained as referring to a legume, which was eaten by an ancestor of the clan. However, the Indologist Ernst Windisch linked the life of Maudgalyayana to the figure of Maudgalya (Mugdala) who appears in the Sanskrit epic Mahabharata, which would explain the name. Windisch believed the account of the diviner Maudgalya had influenced that of Maudgalyayana, since both relate to a journey to heaven. Author Edward J. Thomas considered this improbable, though. Windisch did consider Maudgalyāyana a historical person.\n\n\n== Life ==\n\n\n=== Meeting the Buddha ===\n\nAccording to Buddhist texts, Maudgalyāyana is born in a Brahmin family of the village Kolita (perhaps modern day Kul), after which he is named. His mother is a female Brahmin called Mogallāni, and his father is the village chief of the kshatriya (warrior) caste. Kolita is born on the same day as Upatiṣya (Pali: Upatissa; later to be known as Śāriputra), and the two are friends from childhood. Kolita and Upatiṣya  develop an interest in the spiritual life when they are young. One day while they are watching a festival a sense of disenchantment and spiritual urgency overcomes them: they wish to leave the worldly life behind and start their spiritual life under the mendicant wanderer Sañjaya Vairatiputra (Pali: Sañjaya Belatthiputta). In the Theravāda and Mahāsāṃghika canons, Sañjaya is described as a teacher in the Indian Sceptic tradition, as he does not believe in knowledge or logic, nor does he answer speculative questions. Since he cannot satisfy Kolita and Upatiṣya's spiritual needs, they leave. In the Mūlasarvāstivāda Canon, the Chinese Buddhist Canon and in Tibetan accounts, however, he is depicted as a teacher with admirable qualities such as meditative vision and religious zeal. He falls ill though, and dies, causing the two disciples to look further. In some accounts, he even goes so far to predict the coming of the Buddha through his visions.Regardless, Kolita and Upatiṣya leave and continue their spiritual search, splitting up in separate directions. They make an agreement that the first to find the \"ambrosia\" of the spiritual life will tell the other. What follows is the account leading to Kolita and Upatiṣya taking refuge under the Buddha, which is considered an ancient element of the textual tradition. Upatiṣya meets a Buddhist monk named Aśvajit (Pali: Assaji), one of the first five disciples of the Buddha, who is walking to receive alms from devotees. In the Mūlasarvāstivāda version, the Buddha has sent him there to teach Upatiṣya. Aśvajit's serene deportment inspires Upatiṣya to approach him and learn more. Aśvajit tells him he is still newly ordained and can only teach a little. He then expresses the essence of the Buddha's teaching in these words:\nOf all phenomena sprung from a cause\nThe Teacher the cause hath told;\nAnd he tells, too, how each shall come to its end,\n\nFor such is the word of the Sage.\nThese words help Upatiṣya to attain the first stage on the Buddhist spiritual path. After this, Upatiṣya tells Kolita about his discovery and Kolita also attains the first stage. The two disciples, together with Sañjaya's five hundred students, go to ordain as monks under the Buddha in Veṇuvana (Pali: Veḷuvana). From the time of their ordination, Upatiṣya and Kolita become known as Śāriputra and Maudgalyāyana, respectively, Maudgalyāyana being the name of Kolita's clan. After having ordained, all except Śāriputra and Maudgalyāyana attain arhat (Pali: arahant; last stage of enlightenment). Maudgalyāyana and Śāriputra attain enlightenment one to two weeks later, Maudgalyāyana in Magadha, in a village called Kallavala. At that time, drowsiness is obstructing him from attaining further progress on the path. After he has a vision of the Buddha advising him how to overcome it, he has a breakthrough and attains enlightenment. In some accounts, it is said that he meditates on the elements in the process. In the Commentary to the Pali Dhammapada, the question is asked why the two disciples attain enlightenment more slowly than the other former students of Sañjaya. The answer given is that Śāriputra and Maudgalyāyana are like kings, who require a longer time to prepare for a journey than commoners. In other words, their attainment is of greater depth than the other students and therefore requires more time.Aśvajit's brief statement, known as the Ye Dharma Hetu stanza (\"Of all phenomena...\"), has traditionally been described as the essence of the Buddhist teaching, and is the most inscribed verse throughout the Buddhist world. It can be found in all Buddhist schools, is engraved in many materials, can be found on many Buddha statues and stūpas (structures with relics), and is used in their consecration rituals. According to Indologist Oldenberg and translator Thanissaro Bhikkhu, the verses were recommended in one of Emperor Asoka's edicts as subject of study and reflection. The role of the stanza is not completely understood by scholars. Apart from the complex nature of the statement, it has also been noted it has not anywhere been attributed to the Buddha in this form, which indicates it was Aśvajit's own summary or paraphrasing. Indologist T.W. Rhys Davids believed the brief poem may have made a special impression on Maudgalyāyana and Sariputta, because of the emphasis on causation typical for Buddhism. Philosopher Paul Carus explained that the stanza was a bold and iconoclastic response to Brahmanic traditions, as it \"repudiates miracles of supernatural interference by unreservedly recognising the law of cause and effect as irrefragable\",  whereas Japanese Zen teacher Suzuki was reminded of the experience that is beyond the intellect, \"in which one idea follows another in sequence finally to terminate in conclusion or judgment\".Although in the Pali tradition, Maudgalyāyana is described as an arhat who will no longer be reborn again, in the Mahayāna traditions this is sometimes interpreted differently. In the Lotus Sutra, Chapter 6 (Bestowal of Prophecy), the Buddha is said to predict that the disciples Mahākasyapa, Subhuti, Mahakatyayana, and Maudgalyāyana will become Buddhas in the future.\n\n\n=== Śāriputra and Maudgalyāyana ===\n\nOn the day of Maudgalyāyana's ordination, the Buddha allows him and Śāriputra to take the seats of the chief male disciples. According to the Pali Buddhavaṃsa text, each Buddha has had such a pair of chief disciples. As they have just ordained, some other monks feel offended that the Buddha gives such honor to them. The Buddha responds by pointing out that seniority in the monkhood is not the only criterion in such an appointment, and explains his decision further by relating a story from the past. He says that both disciples aspired many lifetimes ago to become chief disciples under him. They made such a resolution since the age of the previous Buddha Aṇomadassī, when Maudgalyāyana was a layman called Sirivadha. Sirivaddha felt inspired to become a chief disciple under a future Buddha after his friend, Śāriputra in a previous life, recommended that he do so. He then invited Buddha Aṇomadassī and the monastic community (Saṃgha) to have food at his house for seven days, during which he made his resolution to become a chief disciple for the first time. Afterwards, he and Śāriputra continued to do good deeds for many lifetimes, until the time of Sakyamuni Buddha. After the Buddha appoints Maudgalyāyana as chief disciple, he becomes known as \"Mahā-Maudgalyāyana\", mahā meaning 'great'. This epithet is given to him as an honor, and to distinguish him from others of the same name.Post-canonical texts describe Maudgalyāyana as the second chief male disciple, next to Śāriputra. The early canons agree that Śāriputra is spiritually superior to Maudgalyāyana, and their specializations are described as psychic powers (Sanskrit: ṛddhi, Pali: iddhi) for Maudgalyāyana and wisdom for Śāriputra. In Buddhist art en literature, Buddhas are commonly depicted with two main disciples (Japanese: niky ōji, Classical Tibetan: mchog zung) at their side—in the case of Sakyamuni Buddha, the two disciples depicted are most often Maudgalyāyana and Śāriputra. Although there are different perspectives among different Buddhist canons as to the merits of each disciple, in all Buddhist canons, Maudgalyāyana and Śāriputra are recognized as the two main disciples of the Buddha. This fact is also confirmed by iconography as discovered in archaeological findings, in which the two disciples tend to be pictured attending their master. Moreover, Maudgalyāyana is often included in traditional lists of 'four great disciples' (pinyin: sida shengwen) and eight arhats. Despite these widespread patterns in both scripture and archaeological research, it has been noted that in later iconography, Ānanda and Mahākasyapa are depicted much more, and Maudgalyāyana and Śāriputra are depicted much less.The lives of Maudgalyāyana and Śāriputra are closely connected. Maudgalyāyana and Śāriputra are born on the same day, and die in the same period. Their families have long been friends. In their student years, Maudgalyāyana and Śāriputra are co-pupils under the same teacher. After having helped each other to find the essence of the spiritual life, their friendship remains. In many sutras they show high appreciation and kindness to one another. For example, when Śāriputra falls ill, it is described that Maudgalyāyana used his psychic powers to obtain medicine for Śāriputra. Śāriputra is considered the wisest disciple of the Buddha, but Maudgalyāyana is second to him in wisdom. The one thing that gives them a strong bond as spiritual friends is the love for the Buddha, which both express often.\n\n\n=== Role in the community ===\n\nSeveral teachings in the Pali Canon are traditionally ascribed to Maudgalyāyana, including several verses in the Theragatha and many sutras in the Samyutta Nikaya. Besides these, there are many passages that describe events in his life. He is seen as learned and wise in ethics, philosophy and meditation. When comparing Śāriputra with Maudgalyāyana, the Buddha uses the metaphor of a woman giving birth to a child for Śāriputra, in that he establishes new students in the first attainment on the spiritual path (Pali: sotāpanna). Maudgalyāyana, however, is compared with the master who trains the child up, in that he develops his students further along the path to enlightenment.The Buddha is described in the texts as placing great faith in Maudgalyāyana as a teacher. He often praises Maudgalyāyana for his teachings, and sometimes has Maudgalyāyana teach in his place. Maudgalyāyana is also given the responsibility to train Rahula, the Buddha's son. On another occasion, the Buddha has Maudgalyāyana announce a ban on a group of monks living in Kitigara, whose problematic behavior has become widely known in the area. Furthermore, Maudgalyāyana plays a crucial role during the schism caused by the disciple Devadatta. Through his ability to communicate with devas (god-like beings), he learns that Devadatta was acting inappropriately. He obtains information that Devadatta is enjoining Prince Ajatasatru (Pali: Ajatasattu) for help, and the two form a dangerous combination. Maudgalyāyana therefore informs the Buddha of this. Later, when Devadatta has successfully created a split in the Buddhist community, the Buddha asks Maudgalyāyana and Śāriputra to convince Devadatta's following to reunite with the Buddha, which in the Pali account they are able to accomplish. Because Devadatta believes they come to join his following, he lets his guard down. They then persuade the other monks to return while Devadatta is asleep. After the split off party has successfully been returned to the Buddha, Maudgalyāyana expresses astonishment because of Devadatta's actions. The Buddha explains that Devadatta had acted like this habitually, throughout many lifetimes. In the Vinaya texts of some canons, the effort at persuading the split off monks is met with obstinacy and fails. French Buddhologist André Bareau believes this latter version of the account to be historically authentic, which he further supports by the report of the Chinese pilgrim Xuan Zang, twelve centuries later, that Devadatta's sect had still continued to exist.\n\n\n=== Teaching through psychic powers ===\nIn the Anguttara Nikaya, Maudgalyāyana is called foremost in psychic powers. In teaching, Maudgalyāyana relies much on such powers. Varying accounts in the Pali Canon show Maudgalyāyana travelling to and speaking with pretas (spirits in unhappy destinations) in order to explain to them their horrific conditions. He helps them understand their own suffering, so they can be released from it or come to terms with it. He then reports this to the Buddha, who uses these examples in his teachings. Similarly, Maudgalyāyana is depicted as conversing with devas and brahmas (heavenly beings), and asking devas what deeds they did to be reborn in heaven. In summary, Maudgalyāyana's meditative insights and psychic powers are not only to his own benefit, but benefit the public at large. In the words of historian Julie Gifford, he guides others \"by providing a cosmological and karmic map of samsara\".Maudgalyāyana is able to use his powers of mind-reading in order to give good and fitting advice to his students, so they can attain spiritual fruits quickly. He is described as using his psychic powers to discipline not only monks, but also devas and other beings. One day some monks are making noise as they were sitting in the same building as the Buddha. Maudgalyāyana then shakes the building, to teach the monks to be more restrained. But the most-quoted example of Maudgalyāyana's demonstration of psychic powers is his victory over the dragon (naga) Nandopananda, which requires mastery of the jhānas (states in meditation). Many of his demonstrations of psychic powers are an indirect means of establishing the Buddha as a great teacher. People ask themselves, if the disciple has these powers, then how spiritually powerful will his teacher be?\n\n\n=== Rescuing his mother ===\n\nThe account of Maudgalyāyana looking for his mother after her death is widespread. Apart from being used to illustrate the principles of karmic retribution and rebirth, in China, the story developed a new emphasis. There Maudgalyāyana was known as \"Mulian\", and his story was taught in a mixture of religious instruction and entertainment, to remind people of their duties to deceased relatives. Its earliest version being the Sanskrit Ullambana Sutra, the story has been made popular in China, Japan, and Korea through edifying folktales such as the Chinese bianwen (for example, The Transformation Text on Mu-lien Saving His Mother from the Dark Regions). In most versions of the story, Maudgalyāyana uses his psychic powers to look for his deceased parents and see in what world they have been reborn. Although he can find his father in a heaven, he cannot find his mother and asks the Buddha for help. The Buddha brings him to his mother, who is located in a hell realm, but Maudgalyāyana cannot help her. The Buddha then advises him to make merits on his mother's behalf, which helps her to be reborn in a better place. In the Laotian version of the story, he travels to the world of Yama, the ruler of the underworld, only to find the world abandoned. Yama then tells Maudgalyāyana that he allows the denizens of the hell to go out of the gates of hell to be free for one day, that is, on the full moon day of the ninth lunar month. On this day, the hell beings can receive merit transferred and be liberated from hell, if such merit is transferred to them. In some other Chinese accounts, Maudgalyāyana finds his mother, reborn as a hungry ghost. When Maudgalyāyana tries to offer her food through an ancestral shrine, the food bursts into flames each time. Maudgalyāyana therefore asks the Buddha for advice, who recommends him to make merit to the Saṃgha and transfer it to his mother. The transfer not only helps his mother to be reborn in heaven, but can also be used to help seven generations of parents and ancestors. The offering was believed to be most effective when collectively done, which led to the arising of the ghost festival.(see § Heritage)\nSeveral scholars have pointed out the similarities between the accounts of Maudgalyāyana helping his mother and the account of Phra Malai, an influential legend in Thailand and Laos. Indeed, in some traditional accounts Phra Malai is compared to Maudgalyāyana. On a similar note, Maudgalyāyana's account is also thought to have influenced the Central Asian Epic of King Gesar, Maudgalyāyana being a model for the king.\n\n\n=== Making the Udāyana image ===\nAnother account involving Maudgalyayana, related in the Chinese translation of the Ekottara Agāma, in the Thai Jinakālamālī and the post-canonical Paññāsajātakā, was the production of what was described as the first Buddha image, the Udāyana Buddha. The account relates that the Buddha pays a visit to the Trāyastriṃśa Heaven (Pali: Tāvatiṃsa) to teach his mother. King Udāyana misses the Buddha so much that he asks Maudgalyāyana to use his psychic powers to transport thirty-two craftsmen to the heaven, and make an image of the Buddha there. The image that is eventually made is from sandalwood, and many accounts have attempted to relate it to later Buddha images in other areas and countries. Although the traditional accounts mentioned state that the Udāyana Buddha was the first image, there were probably several Buddha images preceding the Udāyana Buddha, made by both kings and commoners. It could also be that these accounts originate from the same common narrative about a first Buddha image.\n\n\n=== Death ===\n\nAccording to the Pali tradition, Maudgalyāyana's death comes in November of the same year as the Buddha's passing, when Maudgalyāyana is traveling in Magadha. He dies at the age of eighty-four. Some accounts put forth that rivaling traditions stone him to death, others say that those people hire robbers. The Pali tradition states that Jain monks persuade a group of robbers led by a Samaṇa-guttaka to kill Maudgalyāyana, out of jealousy for his success. Maudgalyāyana often teaches about the visits he has made to heaven and hell, the fruits of leading a moral life, and the dangers of leading an immoral life. These teachings make the number of followers from rivaling traditions decrease. Whoever kills Maudgalyāyana, the general agreement among different accounts is that he is killed in a violent fashion at the Kālasilā Cave, on the Isigili Hill near Rājagaha, which might be equated with modern Udaya Hill.At that time, Maudgalyāyana dwells alone in a forest hut. When he sees the bandits approaching, he makes himself vanish with psychic powers. The bandits find an empty hut, and although they search everywhere, they find nobody. They leave and return on the following day, for six consecutive days, with Maudgalyāyana escaping from them in the same way. On the seventh day, Maudgalyāyana suddenly loses the psychic powers he has long wielded. Maudgalyāyana realizes that he is now unable to escape. The bandits enter, beat him repeatedly and leave him lying in his blood. Being keen on quickly getting their payment, they leave at once. Maudgalyāyana's great physical and mental strength is such that he is able to regain consciousness and is able to journey to the Buddha. In some accounts, he then returns to Kalasila and dies there, teaching his family before dying. In other accounts, he dies in the Buddha's presence.It is described that in a previous life, Maudgalyāyana is the only son born to his family. He is dutiful, and takes care of all the household duties. As his parents age, this increases his workload. His parents urge him to find a wife to help him, but he persistently refuses, insisting on doing the work himself. After persistent urging from his mother, he eventually marries. His wife looks after his elderly parents, but after a short period becomes hostile to them. She complains to her husband, but he pays no attention to this. One day, when he is outside the house, she scatters rubbish around and when he returns, blames it on his blind parents. After continual complaints, he capitulates and agrees to deal with his parents. Telling his parents that their relatives in another region wish to see them, he leads his parents onto a carriage and begins driving the oxen cart through the forest. While in the depths of the forest, he dismounts and walks along with the carriage, telling his parents that he has to watch out for robbers, which are common in the area. He then impersonates the sounds and cries of thieves, pretending to attack the carriage. His parents tell him to fend for himself (as they are old and blind) and implore the imaginary thieves to leave their son. While they are crying out, the man beats and kills his parents, and throws their bodies into the forest before returning home. In another version recorded in the commentary to the Pali Jātaka, Maudgalyāyana does not carry the murder through though, touched by the words of his parents.After Maudgalyāyana's death, people ask why Maudgalyāyana had not protected himself, and why a great enlightened monk would suffer such a death. The Buddha then says that because Maudgalyāyana has contracted such karma in a previous life (the murder of one's own parents is one of the five heinous acts that reap the worst karma), so he could not avoid reaping the consequences. He therefore accepted the results.\n Further, the Buddha states that even psychic powers will be of no use in avoiding karma, especially when it is serious karma. Shortly after having left Maudgalyāyana for dead, the bandits are all executed. Religious Studies scholar James McDermott therefore concludes that there must have been \"a confluence\" of karma between Maudgalyāyana and the bandits, and cites the killing as evidence that in Buddhist doctrine the karma of different individuals can interact. Indologist Richard Gombrich raises the example of the murder to prove another point: he points out that Maudgalyāyana is able to attain enlightenment, despite his heavy karma from a past life. This, he says, shows that the Buddha teaches everyone can attain enlightenment in the here and now, rather than enlightenment necessarily being a gradual process built up through many lifetimes.Gifford speculates that Maudgalyāyana believes he is experiencing heavy karma from a past life. This awareness leads him to want to prevent others from making the same mistakes and leading an unethical life. This may be the reason why he is so intent on teaching about the law of karmic retribution.After Maudgalyāyana's and Śāriputra's death, the Buddha states the monastic community has now become less, just like a healthy tree has some branches that have died off. Then he adds to that all impermanent things must perish. In some accounts of Maudgalyāyana's death, many of his students fall ill after his death, and die as well.\n\n\n== Heritage ==\n\nIn Buddhist history, Maudgalyāyana has been honored for several reasons. In some canons such as the Pali Tipiṭaka, Maudgalyāyana is held up by the Buddha as an example which monks should follow. The Pali name Moggallāna was used as a monastic name by Buddhist monks up until the twelfth century C.E.In East Asia, Maudgalyāyana is honored as a symbol of filial piety and psychic powers. Maudgalyāyana has had an important role in many Mahāyāna traditions. The Ullambana Sutra is the main Mahāyāna sūtra in which Maudgalyāyana's rescue of his mother is described (see § Rescuing his mother).  The sutra was highly influential, judging from the more than sixty commentaries that were written about it. Although the original Sanskrit sutra already encouraged filial piety, later Chinese accounts inspired by the sutra emphasized this even more. Furthermore, Chinese accounts described merit-making practices and filial piety as two inseparable sides of the same coin. The sūtra became popular in China, Japan, and Korea, and led to the Yulan Hui (China) and Obon (Japan) festivals. This festival probably spread from China to Japan in the seventh century, and similar festivals have been observed in India (Avalamba), Laos and Vietnam. The festival is celebrated on the seventh lunar month (China; originally only on the full moon, on the Pravāraṇa Day),  or from 13 to 15 July (Japan). It is believed that in this period ancestors reborn as pretas or hungry ghosts wander around. In China, this was the time when the yearly varṣa for monastics came to an end (normally translated as rains retreat, but in China this was a Summer Retreat). It was a time that the monastics completed their studies and meditation, which was celebrated. Up until the present day, people make merits and transfer merit through several ceremonies during the festival, so the spirits may be reborn in a better rebirth. The festival is also popular among non-Buddhists, and has led Taoists to integrate it in their own funeral services.The festival has striking similarities to Confucian and Neo-Confucian ideals, in that it deals with filial piety. It has been observed that the account of rescuing the mother in hell has helped Buddhism to integrate into Chinese society. At the time, due to the Buddhist emphasis on the renunciant life, Buddhism was criticized by Confucianists. They felt Buddhism went against the principle of filial piety, because Buddhist monks did not have offspring to make offerings for ancestor worship. Maudgalyāyana's account helped greatly to improve this problem, and has therefore been raised as a textbook example of the adaptive qualities of Buddhism. Other scholars have proposed, however, that the position of Buddhism in India versus China was not all that different, as Buddhism had to deal with the problem of filial piety and renunciation in India as well. Another impact the story of Maudgalyāyana's had was that, in East Asia, the account helped to shift the emphasis of filial piety towards the mother, and helped redefine motherhood and femininity.Apart from the Ghost Festival, Maudgalyāyana also has an important role in the celebration of Māgha Pūjā in Sri Lanka. On Māgha Pūjā, in Sri Lanka called Navam Full Moon Poya, Maudgalyāyana's appointment as a chief disciple of the Buddha is celebrated by various merit-making activities, and a pageant.There are several canonical and post-canonical texts that are traditionally connected to the person of Maudgalyāyana. In the Theravāda tradition, the Vimānavatthu is understood to be a collection of accounts related by Maudgalyayana to the Buddha, dealing with his visits to heavens. In the Sarvāstivāda tradition, Maudgalyāyana is said to have composed the Abhidharma texts called the Dharmaskandha and the Prajñāptibhāsya, although in some Sanskrit and Tibetan scriptures the former is attributed to Śāriputra. Scholars have their doubts on whether Maudgalyāyana was really the author of these works. They do believe, however, that Maudgalyāyana and some other main disciples compiled lists (Sanskrit: mātṛikā, Pali: mātikā) of teachings as mnemonic devices. These lists formed the basis for what later became the Abhidharma. Despite these associations with Abhidharma texts, pilgrim Xuan Zang reports that during his visits in India, Śāriputra was honored by monks for his Abhidharma teachings, whereas Maudgalyāyana was honored for his meditation, the basis for psychic powers. French scholar André Migot has proposed that in most text traditions Maudgalyāyana was associated with meditation and psychic powers, as opposed to Śāriputra's specialization in wisdom and Abhidharma.Traditions have also connected Maudgalyāyana with the symbol of the Wheel of Becoming (Sanskrit: bhavacakra, Pali: bhavacakka). Accounts in the Mūlasarvāstivāda Vinaya and the Divyāvadāna relate that Ānanda once told the Buddha about Maudgalyāyana's good qualities as a teacher. Maudgalyayana was a very popular teacher, and his sermons with regard to afterlife destinations were very popular. The Buddha said that in the future, a person like him would be hard to find. The Buddha then had an image painted on the gate of the Veluvaḷa monastery to honor Maudgalyāyana, depicting the Wheel of Becoming. This wheel showed the different realms of the cycle of existence, the three poisons in the mind (greed, hatred and delusion), and the teaching of dependent origination. The wheel was depicted as being in the clutches of Māra, but at the same time included the symbol of a white circle for Nirvana. The Buddha further decreed that a monk be stationed at the painting to explain the law of karma to visitors. Images of the Wheel of Becoming are widespread in Buddhist Asia, some of which confirm and depict the original connection with Maudgalyāyana.Finally, there was also an entire tradition that traces its origins to Maudgalyayana, or to a follower of him, called Dharmagupta: this is the Dharmaguptaka school, one of the early Buddhist schools.\n\n\n== Relics ==\n\nIn a Pali Jātaka account, the Buddha is said to have had the ashes of Maudgalyāyana collected and kept in a stūpa in the gateway of the Veluvaḷa. In two other accounts, however, one from the Dharmaguptaka and the other from the Mūlasarvāstivāda tradition, Anāthapiṇḍika and other laypeople requested the Buddha to build a stūpa in honor of Maudgalyāyana. According to the Divyāvadāna, emperor Ashoka visited the stūpa and made an offering, on the advice of Upagupta Thera. During the succeeding centuries, Xuan Zang and other Chinese pilgrims reported that a stūpa with Maudgalyāyana's relics could be found under the Indian city Mathura, and in several other places in Northeast India. However, as of 1999, none of these had been confirmed by archaeological findings.\n\nAn important archaeological finding was made elsewhere, however. In the nineteenth century, archaeologist Alexander Cunningham and Lieutenant Fred. C. Maisey discovered bone fragments in caskets, with Maudgalyāyana's and Śāriputra's names inscribed on it, both in the Sanchi Stūpa and at the stūpas at Satdhāra, India. The caskets contained pieces of bone and objects of reverence, including sandalwood which Cunningham believed had once been used on the funeral pyre of Śāriputra. The finding was important in several ways, and was dated from the context to the second century BCE.Initially, Cunningham and Maisey divided the shares of the discovered items and had them shipped to Britain. Since some of Cunningham's discovered items were lost when one ship sank, some scholars have understood that the Sanchi relics were lost. However, in a 2007 study, the historian Torkel Brekke used extensive historical documents to argument that it was Maisey who took all the relics with him, not Cunningham. This would imply that the relics reached Britain in their entirety. After the relics reached Britain, they were given to the Victoria and Albert Museum in London in 1866. When the relics were given to the V&A Museum, pressure from Buddhists to return the relics to their country of origin arose. Although at first the museum dismissed the complaints as coming from a marginal community of English Buddhists, when several Buddhist societies in India took notice, as well as societies in other Asian countries, it became a serious matter. Eventually, the museum was pressured by the British government to return the relics and their original caskets, for diplomatic reasons. After many requests and much correspondence, the museum had the relics brought back to the Sri Lankan Maha Bodhi Society in 1947. They were formally re-installed into a shrine at Sanchi, India, in 1952, after it had been agreed that Buddhists would continue to be their caretaker, and a long series of ceremonies had been held to pay due respect. The relics were paraded through many countries in South and Southeast Asia, in both Theravāda and Mahāyāna countries. At the same time, Indian Prime Minister Nehru used the opportunity to propagate a message of unity and religious tolerance, and from a political perspective, legitimate state power. Indeed, even for other countries, such as Burma, in which the relics were shown, it helped to legitimate the government, create unity, and revive religious practice: \"those tiny pieces of bone moved not only millions of devotees worldwide, but national governments as well\", as stated by art historian Jack Daulton. For these reasons, Burma asked for a portion of the relics to keep there. In ceremonies attended by hundred of thousands people, the relics were installed in the Kaba Aye Pagoda, in the same year as India.Sri Lanka also obtained a portion, kept at the Maha Bodhi Society, which is annually exhibited during a celebration in May. In 2015, the Catholic world was surprised to witness that the Maha Bodhi Society broke with tradition by showing the relics to Pope Francis on a day outside of the yearly festival. Responding to critics, the head of the society stated that no pope had set foot inside a Buddhist temple since 1984, and added that \"religious leaders have to play a positive role to unite [their] communities instead of dividing\". As for the original Sanchi site in India, the relics are shown every year on the annual international Buddhist festival in November. As of 2016, the exhibition was visited by hundred thousands visitors from over the world, including Thai princess Sirindhorn.\n\n\n== See also ==\nThe ten principal disciples\n\n\n== Notes ==\n\n\n== Citations ==\n\n\n== References ==\n\n\n== External links ==\nVivid report about Ghost festival in Singapore"