"In musical form and analysis, exposition is the initial presentation of the thematic material of a musical composition, movement, or section. The use of the term generally implies that the material will be developed or varied.\n\nIn sonata form, the exposition is \"the first major section, incorporating at least one important modulation to the dominant or other secondary key and presenting the principal thematic material.\"\nIn a fugue, the exposition is \"the statement of the subject in imitation by the several voices; especially the first such statement, with which the fugue begins.\"\n\n\n== In Classical Sonatas ==\nThe term is most widely used as an analytical convenience to denote a portion of a movement identified as an example of classical tonal sonata form. The exposition typically establishes the music's tonic key, and then modulates to, and ends in, the dominant. If the exposition starts in a minor key, it typically modulates to the relative major key.  There are many exceptions, especially in the late Classical and Romantic era. For example, to the mediant (the first movement of Beethoven's \"Waldstein Sonata\"), the flat mediant (Ferdinand Ries' \"Pastorale\" Concerto No. 5), the dominant when in a minor key (Ries' Concerto No. 3), the minor dominant (Chopin's Piano Concerto No. 2, Brahms' Piano Concerto No. 2), the submediant (Schubert's \"Unfinished Symphony\"), the relative minor (Beethoven's \"Triple Concerto\", Ries' Concerto No. 6), or the parallel major (Chopin's Piano Concerto No. 1).  Saint-Saens' Piano Concerto No. 3 even modulates to the leading tone in its first movement exposition, with no orchestral accompaniment. On the other hand, other Classical and Romantic composers strictly adhered to the traditional scheme of modulating to the dominant in a major key or the relative major in a minor key, including Haydn, Mozart, Hummel, John Field, and Mendelssohn. The exposition may include identifiable musical themes (whether melodic, rhythmic or chordal in character), and may develop them, but it is usually the key relationships and the sense of \"arrival\" at the dominant that is used by analysts in identifying the exposition.\nThe exposition in classical symphonies is typically repeated, although there are many examples where the composer does not specify such a repeat, and it never is repeated in concertos. In the recapitulation, the material in the exposition is repeated or paraphrased either in the home key (as by Mozart), or the parallel major of the home key if it is minor (as by Beethoven), although as with the exposition, a different modulation may be used (such as to the mediant in Dvorak's \"New World Symphony\").\nIf the movement starts with an introductory section, this introduction is not usually analysed as being part of the movement's exposition.\nIn many works of the Classical period and some of the Romantic era, the exposition is often bracketed by repeat signs, indicating that it is to be played twice. This is something which is not always done in concert from the 20th Century onwards.\n\n\n== In Fugue ==\nA fugue usually has two main sections: the exposition and the body. In the exposition, each voice plays its own adaptation of the theme, in either a subject or an answer; they also provide countersubjects (counterpoints) to the following voices as they enter. The exposition usually ends on either a I or V chord, and is then followed by the body.\n\n\n== References =="