"Vidarbha (Pronunciation: [ʋid̪əɾbʱə]) is the north-eastern region of the Indian state of Maharashtra, comprising Nagpur Division and Amravati Division. Amravati division's former name is Berar (Varhad in Marathi). It occupies 31.6% of the total area and holds 21.3% of the total population of Maharashtra. It borders the state of Madhya Pradesh to the north, Chhattisgarh to the east, Telangana to the south and Marathwada and Khandesh regions of Maharashtra to the west. Situated in central India. The largest city in Vidarbha is Nagpur followed by Amravati and Yavatmal. A majority of Vidarbhians speak Varhadi and Zadi dialects of Marathi.The Nagpur region is known for growing oranges and cotton. Vidarbha holds two-thirds of Maharashtra's mineral resources and three-quarters of its forest resources, and is a net producer of power.Throughout its history, Vidarbha has remained much calmer than the rest of India, especially during the communal troubles. However, there is considerable poverty and malnutrition. It is less economically prosperous compared to the rest of Maharashtra. The living conditions of farmers in this region are poor compared to India as a whole. There have been more than 200,000 farmers' suicides in Maharashtra in a decade, of which 70% being in the 11 districts of Vidarbha region.There have been recent calls for a separate state of Vidarbha, due to perceived neglect from the Government of Maharashtra and incompetent political leadership in Vidarbha. Being culturally, politically and financially distinct from the rest of Maharashtra, the calls for a separate state rose to prominence only when the leaders from this region were sidelined by other political leaders in recent years. Statehood demands have not been fulfilled mainly due to the opposition from the Shiv Sena, a major state political party.\n\n\n== History ==\n\n\n=== Ancient period ===\n\nVidarbha was part of the Satavahana Empire (1st century BCE - 2nd century CE), as suggested by Satavahana coin finds in Pauni.\n\n\n=== Medieval period ===\n\nNagpur was the capital of the Berar Subah, known as the Gulshan-e-Berar in the Medieval period, from the rule of the Khaljis to the Mughals, according to the Ain-i-Akbari and Alamgir Namah. In 1724, when Nizam-ul-Mulk Asaf Jah declared independence, the existence of Berar as a Mughal Subah came to an end. It became (though nominally) a part of Nizam state.\n\n\n== Geography ==\n\nVidarbha lies on the northern part of the Deccan Plateau. Unlike the Western Ghats, there are no major hilly areas. The Satpura Range lies to the north of Vidarbha region in Madhya Pradesh. The Melghat area of Amravati district is on the southern offshoot of the Satpura Range. Large basaltic rock formations exists throughout Vidarbha, part of the 66-million-year-old volcanic Deccan Traps. Bhandara and Gondia district are entirely occupied by metamorphic rock and alluvium, making their geology unique in Maharashtra.\n\n\n== Administration ==\nVidarbha region has 11 districts divided into two divisions (Amravati and Nagpur). \n\nEach district has a collector's office which is responsible for day-to-day administration.The District Collector is a Central Indian Government IAS appointee who is in charge of the governance of a district in a state.\n\n\n== Demographics ==\nVidarbha has a total population of 23,003,179 according to the 2011 India census.\n\n\n== Religion ==\n\nReligion in Vidarbha is characterized by the diversity of religious beliefs and practices. Vidarbha possesses six of the world's major religions; namely Hinduism, Buddhism, Islam, Jainism, Christianity, and Sikhism.\n\nAccording to the 2011 census, Hinduism was the principal religion in the state at 76.91% of the total population, while Buddhists constituted 13.08 of the total population. Vidarbha accounts for 45.91% of total Buddhists in Maharashtra.\n\n\n== Language and culture ==\nHindu festivals like Holi, Diwali and Dasara are celebrated throughout the region.\n\nAs per the 2011 census, 73.7% of the population speaks Marathi, 8.3% Hindi, 6.2% Urdu, 2.5% Lambadi, 1.8% Gondi, and 1.1% Telugu and Korku as their first language.The Nagpur Central Museum (est. 1863) maintains collections that are mainly from Vidarbha.\nKundinpur/Kaundinyapur/Kundinapuri, the mythological capital of Vidarbha as mentioned in Mahabharata.\n\n\n== Economy ==\n\nNagpur is a central hub for business and healthcare. Amravati is known for film distributors and cloth markets.Yavatmal is cotton city and it is exporter of cotton and Raymond UCO Denim Pvt. Ltd. is situated in Yavatmal. Chandrapur has a thermal power station which is one of the biggest in India and some other heavy industries such as paper (BILT Ballarpur), steel (MEL from Steel Authority of India, etc.), cement (UltraTech Cement, Ambuja Cements, ACC Limited, Manikgarh Cement, Murli Cement) industries and numerous coal mines.An international cargo hub project, the Multi-modal International Cargo Hub and Airport at Nagpur, (MIHAN), is being developed. MIHAN will be used for handling heavy cargo coming from South-East Asia and Middle-East Asia. The project will also include a ₹100 billion (US$1.4 billion) Special Economic Zone (SEZ) for information-technology companies. This will be India's biggest development project.\n\n\n=== Agriculture ===\n \nVidarbha has recently gained notoriety for the number of suicides committed by farmers.\nOn 1 July 2006 the Prime Minister of India Manmohan Singh announced a ₹3,750-crore (37.5 billion rupee) relief package for Vidarbha. The package is intended to help farmers in six districts of the region. However the package was not welcomed by most financial pundits and journalist P Sainath wrote in The Hindu that the package was destined to fail. Corruption was found amongst most of the officials involved with the packages and the government considered suspended more that 400 officials in the scam.\n\n\n=== Mineral wealth ===\nNagpur, Amravati, Yavatmal ,Chandrapur, Gadchiroli, Bhandara is form the main mineral belt, with coal and manganese as the major minerals. Chandrapur district contributes 29% of all mineral output of Maharashtra. Iron ore and limestone are identified as potential mining resources.\n\n\n=== Industry ===\nNagpur, Amravati, Yavatmal, Wardha and Chandrapur are Large Industrial center in Vidarbha resp.\nBallarpur Industries, India's largest manufacturer and exporter of paper is located in Chandrapur district.\n\n\n== Education ==\n\n\n== Sports ==\n\nCricket is the most-popular sport in the region and Nagpur's Vidarbha Cricket Association Ground (VCA) has hosted international cricket matches. It has been superseded by the Vidarbha Cricket Association Stadium, built in 2008 in Jamtha.\n\n\n== Tourism ==\n\nThe eastern region of Vidarbha contains Maharashtra's oldest National Park, the Tadoba Andhari Tiger Reserve, one of India's 39 Project Tiger Reserves.\nTipeshwar Wildlife Sanctuary has large number of Tiger. Shegaon is good tourist place.\n\n\n== Politics ==\n\n\n=== Representation in Lok Sabha ===\nVidarbha is represented at national level by ten Lok Sabha seats. Nagpur district which has the highest population density is split into two lok sabha seats, Nagpur and Ramtek, while districts with lower population density like Chimur and Gadchiroli are clubbed together,while Yavatmal-Washim is one of most important seat in Vidharbha as it include two district headquarters. Ramtek and Amravati seats are reserved for Scheduled Caste candidates only while Gadchiroli-Chimur is reserved for Scheduled Tribes.\n\n\n=== Representation in Vidhan Sabha ===\nVidarbha is represented at state level by 62 Vidhan Sabha seats. Nagpur has the densest concentration of assembly seats with the city divided into six areas.While Amravati and Yavatmal are some of the important seat in Maharashtra. Certain seats are reserved for Scheduled Tribe candidates only, while others are open to all.Pusad seat in Yavatmal District is also important as it gives two Chief-Ministers to Maharashtra \n\n\n=== Separate statehood movement ===\n\nPolitician and economist Dr. Shrikant Jichkar opposed separation of Vidarbha from Maharashtra, believing that it was not sustainable: \"If Vidarbha is hived off, we will have no funds from day one to run the new State. The region's share is burdened by a deficit and Monopoly Cotton Purchase Scheme, Employment Guarantee Scheme and such activity will immediately cease since we would not have money to pay salaries.\" He noted that income from available natural resources could not balance Mumbai's subsidies, and that Mumbai's cooperation was vital to any development—in addition to the societal risks of dividing the Marathi-speaking state.\n\n\n== See also ==\nDehani lift irrigation scheme\nList of cities in Vidarbha\nList of Maratha dynasties and states\nManav Vikas Mission\nProposed states and territories of India\n\n\n== References ==\n\n\n== External links ==\nArticle regarding environment of Vidarbha by Dr. Heda\nTigertrails\nNational Park In Vidarbha\nChisholm, Hugh, ed. (1911). \"Berar\" . Encyclopædia Britannica. 3 (11th ed.). Cambridge University Press. p. 763. This details the history of the province up to 1903, and itself cites Imperial Gazetteer of India (Oxford, 1908)"