"A canoe is a lightweight narrow water vessel, typically pointed at both ends and open on top, propelled by one or more seated or kneeling paddlers facing the direction of travel and using a single-bladed paddle.In British English, the term \"canoe\" can also refer to a kayak, while canoes are then called Canadian or open canoes to distinguish them from kayaks.\nCanoes were developed by cultures all over the world, including some designed for use with sails or outriggers. Until the mid-1800s the canoe was an important means of transport for exploration and trade, and in some places is still used as such, sometimes with the addition of an outboard motor. Where the canoe played a key role in history, such as the northern United States, Canada, and New Zealand, it remains an important theme in popular culture.\nCanoes are now widely used for competition and pleasure, such as racing, whitewater, touring and camping, freestyle and general recreation. Canoeing has been part of the Olympics since 1936. The intended use of the canoe dictates its hull shape, length, and construction material. Historically, canoes were dugouts or made of bark on a wood frame, but construction materials evolved to canvas on a wood frame, then to aluminum. Most modern canoes are made of molded plastic or composites such as fiberglass.\n\n\n== History ==\n\nThe word canoe came into English from the French, who had borrowed it from the Spanish. They in turn had borrowed the word from the Arawakan languages of the Caribbean.\n\n\n=== Dugouts ===\n\nMany peoples made dugout canoes, by carving out a single piece of wood; either a whole trunk, or a slab of trunk from particularly large trees.Constructed between 8200 and 7600 BC, and found in the Netherlands, the Pesse canoe may be the oldest known canoe. Excavations in Denmark reveal the use of dugouts and paddles during the Ertebølle period, (c. 5300–3950 BC).One of the oldest canoes in the world is the Dufuna canoe in Nigeria. It is the oldest boat to be discovered in Africa, and the third oldest known worldwide. The canoe is currently in Damaturu, the state capital.Canoes have also played a vital role in the colonisation of the Pre-Columbian Caribbean as they represented the only possibility of reaching the Caribbean Islands from mainland South America. Around 3500 BC ancient Amerindian groups colonised the first Caribbean Islands using single-hulled canoes. Only very few Pre-Columbian Caribbean canoes have been uncovered.  There are several families of trees that could have been used to construct Caribbean canoes. These include woods of the mahogany family (Meliaceae) such as the Cuban mahogany (Swietenia mahagoni), that can reach heights of 30–35 m, the ceiba family (Malvacae) such as Ceiba pentandra, than can grow up to 60–70 m tall and the cedar family such as the Red Cedar (Cedrela odorata) that can grow up to 60 m in height. It is likely that these canoes were built in a variety of sizes. Ranging from fishing canoes, holding one or a few individuals, to larger ones able to carry as many as a few dozen people that could have been used to reach the Caribbean Islands from the mainland. Reports by historical chroniclers claim to have witnessed a canoe \"containing 40 to 50 Caribs [...] when it came out to trade with a visiting English ship\". These is still much dispute regarding the use of sails in Caribbean canoes. Some archaeologists doubt that oceanic transportation would have been possible without the use of sails as winds and currents would have carried the canoes off course. However, no evidence of a sail or a Caribbean canoe that could have made use of a sail has been found. Furthermore, no historical sources mention Caribbean canoes with sails. One possibility could be that canoes with sails were initially used in the Caribbean but later abandoned before European contact. This, however, seems unlikely, as long-distance trade continued in the Caribbean even after the prehistoric colonisation of the islands. Hence, it is likely that early Caribbean colonists made use of canoes without sails.The indigenous people of the Amazon commonly used Hymenaea trees. \nNative American groups of the north Pacific coast made dugout canoes in a number of styles for different purposes, from western red-cedar (Thuja plicata) or yellow-cedar (Chamaecyparis nootkatensis), depending on availability. Different styles were required for ocean-going vessels versus river boats, and for whale-hunting versus seal-hunting versus salmon-fishing. The Quinault of Washington State built shovel-nose canoes, with double bows, for river travel that could slide over a logjam without portaging. The Kootenai of British Columbia province made sturgeon-nosed canoes from pine bark, designed to be stable in windy conditions on Kootenay Lake. In recent years First Nations in British Columbia and Washington State have been revitalizing the ocean-going canoe tradition. Beginning in the 1980s, the Heiltsuk and Haida were early leaders in this movement. The paddle to Expo 86 in Vancouver by the Heiltsuk, and the 1989 Paddle to Seattle were early instances of this. In 1993 a large number of canoes paddled from up and down the coast to Bella Bella in its first canoe festival – 'Qatuwas. The revitalization continued – and Tribal Journeys began with trips to various communities held most years.\nAustralian Aboriginal people made canoes from hollowed out tree trunks, as well as from tree bark.\n\n\n=== Skin canoes ===\n\n\n==== Australia ====\nSome Australian Aboriginal peoples made bark canoes. They could only be made from the bark of certain trees (usually red gum or box gum) and during summer. After cutting the outline of the required size and shape, a digging stick was used to cut through the bark to the hardwood, and the bark was then slowly prised out using numerous smaller sticks. The slab of bark was held in place by branches or hand-woven rope, and after separation from the tree, lowered to the ground and small fires lit on the inside of the bark. This would cause the bark to dry out and curl upwards, after which the ends could be pulled together and stitched with hemp and plugged with mud. It was then allowed to mature, with frequent applications of grease and ochre. The remaining tree was later dubbed a canoe tree by Europeans. Because of the porosity of the bark, they did not last too long (about two years), and were mainly used for fishing or crossing rivers or lakes rather than long journeys. They were usually propelled by punting with a long stick. Another type of bark canoe was made out of a type of stringybark gum known as Messmate stringybark (Eucalyptus obliqua), where the bark was pleated and tied at each end, with a framework of cross-ties and ribs. This type was known as a pleated or tied bark canoe. Bark strips could also be sewn together to make larger canoes, known as sewn bark canoes.\n\n\n==== Americas ====\nMany indigenous peoples of the Americas built bark canoes. They were usually skinned with birch bark over a light wooden frame, but other types could be used if birch was scarce. At a typical length of 4.3 m (14 ft) and weight of 23 kg (50 lb), the canoes were light enough to be portaged, yet could carry a lot of cargo, even in shallow water. Although susceptible to damage from rocks, they are easily repaired. Their performance qualities were soon recognized by early European settler colonials, and canoes played a key role in the exploration of North America, with Samuel de Champlain canoeing as far as the Georgian Bay in 1615. René de Bréhant de Galinée, a French missionary who explored the Great Lakes in 1669, declared: \"The convenience of these canoes is great in these waters, full of cataracts or waterfalls, and rapids through which it is impossible to take any boat. When you reach them you load canoe and baggage upon your shoulders and go overland until the navigation is good; and then you put your canoe back into the water, and embark again. American painter, author and traveler George Catlin wrote that the bark canoe was \"the most beautiful and light model of all the water crafts that ever were invented\".\n\nThe first explorer to cross the North American continent, Alexander Mackenzie, used canoes extensively, as did David Thompson and the Lewis and Clark Expedition.\nIn the North American fur trade the Hudson's Bay Company's voyageurs used three types of canoe:\nThe rabaska or canot du maître was designed for the long haul from the St. Lawrence River to western Lake Superior. Its dimensions were: length approximately 11 m (35 ft), beam 1.2 to 1.8 m (4 to 6 ft), and height about 76 cm (30 in). It could carry 60 packs weighing 41 kg (90 lb), and 910 kg (2,000 lb) of provisions. With a crew of eight or ten (paddling or rowing), they could make three knots over calm waters. Four to six men could portage it, bottom up. Henry Schoolcraft declared it \"altogether one of the most eligible modes of conveyance that can be employed upon the lakes\". Archibald McDonald of the Hudson's Bay Company wrote: \"I never heard of such a canoe being wrecked, or upset, or swamped ... they swam like ducks.\"\nThe canot du nord (French: \"canoe of the north\"), a craft specially made and adapted for speedy travel, was the workhorse of the fur trade transportation system. About one-half the size of the Montreal canoe, it could carry about 35 packs weighing 41 kg (90 lb) and was manned by four to eight men. It could be carried by two men and was portaged in the upright position.\nThe express canoe or canot léger, was about 4.6 m (15 ft) long and were used to carry people, reports, and news.The birch bark canoe was used in a 6,500-kilometre (4,000 mi) supply route from Montreal to the Pacific Ocean and the Mackenzie River, and continued to be used up to the end of the 19th century.The indigenous peoples of eastern Canada and the northeast United States made canoes using the bark of the paper birch, which was harvested in early spring by stripping off the bark in one piece, using wooden wedges. Next, the two ends (stem and stern) were sewn together and made watertight with the pitch of balsam fir. The ribs of the canoe, called verons in Canadian French, were made of white cedar, and the hull, ribs, and thwarts were fastened using watap, a binding usually made from the roots of various species of conifers, such as the white spruce, black spruce, or cedar, and caulked with pitch.\n\n\n=== Modern canoes ===\n\nIn 19th-century North America, the birch-on-frame construction technique evolved into the wood-and-canvas canoes made by fastening an external waterproofed canvas shell to planks and ribs by boat builders such as Old Town Canoe, E. M. White Canoe, Peterborough Canoe Company and at the Chestnut Canoe Company in New Brunswick. While similar to bark canoes in the use of ribs, and a waterproof covering, the construction method is different, being built by bending ribs over a solid mold. Once removed from the mold, the decks, thwarts and seats are installed, and canvas is stretched tightly over the hull. The canvas is then treated with a combination of varnishes and paints to render it more durable and watertight.\n\nAlthough canoes were once primarily a means of transport, with industrialization they became popular as recreational or sporting watercraft. John MacGregor popularized canoeing through his books, and in 1866 founded the Royal Canoe Club in London and in 1880 the American Canoe Association. The Canadian Canoe Association was founded in 1900, and the British Canoe Union in 1936.\nSprint canoe was a demonstration sport at the 1924 Paris Olympics and became an Olympic discipline at the 1936 Berlin Olympics. The International Canoe Federation was formed in 1946 and is the umbrella organization of all national canoe organizations worldwide.\n\n\n== Hull design ==\n\nHull design must meet different, often conflicting, requirements for speed, carrying capacity, maneuverability, and stability The canoe's hull speed can be calculated using the principles of ship resistance and propulsion.\n\nLength: this is often stated by manufacturers as the overall length of the boat, but what counts in performance terms is the length of the waterline, and more specifically its value relative to the displacement of the canoe. Displacement is the amount of water displaced by the boat. It is equal to the total weight of the boat and its contents since a floating body displaces its own weight in water. When a canoe is paddled through water, it takes an effort to push all of the displaced water out of the way. Canoes are displacement hulls: the longer the waterline relative to its displacement, the faster it can be paddled. Among general touring canoeists, 5.18 m (17 ft) is a popular length, providing a good compromise between capacity and cruising speed. Too large a canoe will simply mean extra work paddling at cruising speed.\nWidth (beam): a wider boat provides more stability at the expense of speed. A canoe cuts through the water like a wedge, and a shorter boat needs a narrower beam to reduce the angle of the wedge cutting through the water. Canoe manufacturers typically provide three beam measurements: the gunwale (the measurement at the top of the hull), the waterline (the measurement at the point where the surface of the water meets the hull when it is empty), and the widest point. Another variation of the waterline beam measurement is called 4\" waterline where the displacement is taken into account. This measurement is done at the waterline level when the maximum load is applied to the canoe. Some canoe races use the 4\" waterline beam measurement as the standard for their regulations. In races, the measurement is done by measuring the widest point at 4 inches (10 cm) from the bottom of the canoe.\nFreeboard: a higher-sided boat stays drier in rough water. The cost of high sides is extra weight, extra wind resistance and increased susceptibility to cross-winds.\nStability and immersed bottom shape: the hull can be optimized for initial stability (the boat feels steady when it sits flat on the water) or final stability (resistance to rolling and capsizing). A flatter-bottomed hull has higher initial stability, versus a rounder or V-shaped hull in cross-section has high final stability. The fastest flat water non-racing canoes have sharp V-bottoms to cut through the water, but they are difficult to turn and have a deeper draft which makes them less suitable for shallows. Flat-bottomed canoes are most popular among recreational canoeists. At the cost of speed, they have a shallow draft, turn better, and more cargo space. The reason a flat bottom canoe has lower final stability is that the hull must wrap a sharper angle between the bottom and the sides, compared to a more round-bottomed boat. However, the sides of the canoe can be constructed where the gunwale sheer line is compressed inboard towards to keel line (rather than flaring outboard and outwards from the keel line) resulting in tumblehome, which increases final stability (increases the number of degrees of lateral roll possible before the gunwale is first submerged).\nKeel: an external keel makes a canoe track (hold its course) better and can stiffen a floppy bottom, but it can get stuck on rocks and decrease stability in rapids.\nProfile, the shape of the canoe's sides. Sides that flare out above the waterline deflect water but require the paddler to reach out over the side of the canoe. If the gunwale width is less than the waterline width (or the maximum width) the canoe is said to have tumblehome. This increases final hull stability.\nRocker: viewed from the side of the canoe, rocker is the amount of curve in the hull, much like the curve of a banana. A straight keeled canoe, with no rocker, is meant for covering long distances in a straight line. The full length of the hull is in the water, so it tracks well and has good speed. As the rocker increases, so does the ease of turning, at the cost of tracking. Native American birch-bark canoes were often characterized by extreme rocker.\nHull symmetry: viewed from above, a symmetrical hull has its widest point at the center of the hull and both ends are identical. An asymmetrical hull typically has the widest section aft of centerline, creating a longer bow and improving speed.\n\n\n== Modern materials and construction ==\n\n\n=== Plastic ===\nRoyalex is a composite material, comprising an outer layer of vinyl and hard acrylonitrile butadiene styrene plastic (ABS) and an inner layer of ABS foam, bonded by heat treatment. As a canoe material, Royalex is lighter, more resistant to UV damage, is more rigid, and has greater structural memory than non-composite plastics such as polyethylene.  Royalex canoes are, however, more expensive than aluminium canoes or canoes made from traditionally molded or roto-molded polyethylene hulls. It is heavier, and less suited for high-performance paddling than fiber-reinforced composites, such as fiberglass, kevlar, or graphite. Roto-molded polyethylene is a cheaper alternative to Royalex. Production of Royalex ceased in 2014.\nFolding canoes usually consist of a PVC skin around an aluminum frame.\nInflatable: These contain no rigid frame members and can be deflated, folded, and stored in a bag. The more durable types consist of an abrasion-resistant nylon or rubber outer shell, with separate PVC air chambers for the two side tubes and the floor.\n\n\n=== Fiber reinforced composites ===\nModern canoes are generally constructed by layering a fiber material inside a \"female\" mold. Fiberglass is the most common material used in manufacturing canoes. Fiberglass is not expensive, can be molded to any shape, and is easy to repair. Kevlar is popular with paddlers looking for a light, durable boat that will not be taken in whitewater. Fiberglass and Kevlar are strong but lack rigidity.  Carbon fiber is used in racing canoes to create a very light, rigid construction usually combined with Kevlar for durability. Boats are built by draping the cloth in a mold, then impregnating it with a liquid resin. Optionally, a vacuum process can be used to remove excess resin to reduce weight. \nA gel coat on the outside gives a smoother appearance.With stitch and glue, plywood panels are stitched together to form a hull shape, and the seams are reinforced with fiber reinforced composites and varnished.\nA cedar strip canoe is essentially a composite canoe with a cedar core. Usually fiberglass is used to reinforce the canoe since it is clear and allows a view of the cedar.\n\n\n=== Aluminum ===\nBefore the invention of fiberglass, this was the standard choice for whitewater canoeing. It is good value and very strong by weight. This material was once more popular but is being replaced by modern lighter materials. \"It is tough, durable, and will take being dragged over the bottom very well\", as it has no gel or polymer outer coating which would make it subject to abrasion.  The hull does not degrade from long term exposure to sunlight, and \"extremes of hot and cold do not affect the material\". It can dent, is difficult to repair, is noisy, can get stuck on underwater objects, and requires buoyancy chambers to assist in keeping the canoe afloat in a capsize.\n\n\n== In culture ==\n\nIn Canada, the canoe has been a theme in history and folklore, and is a symbol of Canadian identity. From 1935 to 1986 the Canadian silver dollar depicted a canoe with the Northern Lights in the background.\nThe Chasse-galerie is a French-Canadian tale of voyageurs who, after a night of heavy drinking on New Year's Eve at a remote timber camp want to visit their sweethearts some 100 leagues (about 400 km) away. Since they have to be back in time for work the next morning they make a pact with the devil. Their canoe will fly through the air, on condition that they not mention God's name or touch the cross of any church steeple as they fly by in the canoe. One version of this fable ends with the coup de grâce when, still high in the sky, the voyageurs complete the hazardous journey but the canoe overturns, so the devil can honour the pact to deliver the voyageurs and still claim their souls.\nIn John Steinbeck's novella The Pearl set in Mexico, the main character's canoe is a means of making a living that has been passed down for generations and represents a link to cultural tradition.The Māori, indigenous Polynesian people arrived in New Zealand in several waves of canoe voyage. Canoe traditions are important to the identity of Māori. Whakapapa (genealogical links) back to the crew of founding canoes served to establish the origins of tribes, and defined tribal boundaries and relationships.\n\n\n== Types ==\nModern canoe types are usually categorized by the intended use. Many modern canoe designs are hybrids (a combination of two or more designs, meant for multiple uses). The purpose of the canoe will also often determine the materials used. Most canoes are designed for either one person (solo) or two people (tandem), but some are designed for more than two people.\n\n\n=== Sprint ===\nSprint canoe is also known as flatwater racing. The paddler kneels on one knee, and uses a single-blade paddle. Canoes have no rudder, so the boat must be steered by the athlete's paddle using a j-stroke. Canoes may be entirely open or be partly covered. The minimum length of the opening on a C1 is 280 cm (110 in). Boats are long and streamlined with a narrow beam, which makes them very unstable.  A C4 can be up to 9 m (30 ft) long and weigh 30 kg (66 lb). ICF classes include C1 (solo), C2 (crew of two), and C4 (crew of four). Race distances at the 2012 Olympic Games were 200 and 1000 meters.\n\n\n=== Slalom and wildwater ===\n\nIn ICF whitewater slalom paddlers negotiate their way down a 300 m (980 ft) of whitewater rapids, through a series of up to 25 gates (pairs of hanging poles). The colour of the poles indicates the direction in which the paddlers must pass through; time penalties are assessed for striking poles or missing gates. Categories are C1 (solo) and C2 (tandem), the latter for two men, and C2M (mixed) for one woman and one man. C1 boats must have a minimum weight and width of 10 kg (22 lb) and 0.65 m (2 ft 2 in) and be not more than 3.5 m (11 ft) long. C2s must have a minimum weight and width of 15 kg (33 lb) and 0.75 m (2 ft 6 in), and be not more that 4.1 m (13 ft). Rudders are prohibited. Canoes are decked and propelled by single-bladed paddles, and the competitor must kneel.In ICF wildwater canoeing athletes paddle a course of class III to IV whitewater (using the International Scale of River Difficulty), passing over waves, holes and rocks of a natural riverbed in events lasting either 20–30 minutes (\"Classic\" races) or 2–3 minutes (\"Sprint\" races). Categories are C1 and C2, for both women and men. C1s must have a minimum weight and width of 12 kg (26 lb) and 0.7 m (2 ft 4 in), and a maximum length of 4.3 m (14 ft). C2s must have a minimum weight and width of 18 kg (40 lb) and 0.8 metres (2 ft 7 in), and a maximum length of 5 metres (16 ft). Rudders are prohibited. The canoes are decked boats which must be propelled by single bladed paddles and inside which the paddler kneels.\n\n\n=== Marathon ===\nMarathons are long-distance races which may include portages. Under ICF rules minimum canoe weight is 10 and 14 kg (22 and 31 lb) for C1 and C2 respectively. Other rules can vary by race, for example in the Classique Internationale de Canots de la Mauricie athletes race in C2s, with a maximum length of 5.6 m (18 ft 6 in), minimum width of 69 cm (27 in) at 8 cm (3 in) from the bottom of the centre of the craft, minimum height of 38 cm (15 in) at the bow and 25 cm (10 in) at the centre and stern. The Texas Water Safari, at 422 km (262 mi), includes an open class, the only rule being the vessel must be human-powered, and although novel setups have been tried, the fastest so far has been the six-man canoe.\n\n\n=== Touring ===\n\nA \"touring\" or \"tripping\" canoe is a boat for traveling on lakes and or rivers with capacity for camping gear. Tripping canoes such as the Chestnut Prospector and Old Town Tripper derivates are touring canoes for wilderness trips. They are typically made of heavier and tougher materials and designed with the ability to carry large amounts of gear while being maneuverable enough for rivers with some whitewater. Prospector is now a generic name for derivates of the Chestnut model, a popular type of wilderness tripping canoe marked by a shallow arch hull with a relatively large amount of rocker, giving a nice balance for wilderness tripping over lakes and rivers with some rapids.\nA touring canoe is sometimes covered with a greatly extended deck, forming a \"cockpit\" for the paddlers. A cockpit has the advantage that the gunwales can be made lower and narrower so the paddler can reach the water more easily.\n\n\n=== Freestyle ===\n\nA canoe specialized for whitewater play and tricks. Most are identical to short, flat-bottomed kayak playboats except for internal outfitting. The paddler kneels and uses a single-blade canoe paddle. Playboating is a discipline of whitewater canoeing where the paddler performs various technical moves in one place (a playspot), as opposed to downriver where the objective is to travel the length of a section of river (although whitewater canoeists will often stop and play en route). Specialized canoes known as playboats can be used.\n\n\n=== General recreation ===\nA square-stern canoe is an asymmetrical canoe with a squared-off stern for the mounting of an outboard motor, and is meant for lake travel or fishing. (In practice, use of a side bracket on a double-ended canoe often is more comfortable for the operator, with little or no loss of performance.) Since mounting a rudder on the square stern is very easy, such canoes often are adapted for sailing.\n\n\n== Canoe launches ==\nA canoe launch is a place for launching canoes, similar to a boat launch which is often for launching larger watercraft. Canoe launches are frequently on river banks or beaches. Canoe launches may be designated on maps of places such as parks or nature reserves.\n\n\n== Gallery ==\n\n\t\t\n\t\t\n\t\t\n\n\n== See also ==\n\n\n== References ==\n\n\n== External links ==\n Media related to Canoes at Wikimedia Commons"