"Leonard Bernstein ( BURN-styne; August 25, 1918 – October 14, 1990) was an American conductor, composer, pianist, music educator, author, and lifelong humanitarian who was one of the most significant American cultural personalities of the 20th century. Among the most important conductors of his time, he was also the first American conductor to receive international acclaim. According to music critic Donal Henahan, he was \"one of the most prodigiously talented and successful musicians in American history\".As a composer he wrote in many styles, including symphonic and orchestral music, ballet, film and theatre music, choral works, opera, chamber music and works for the piano. His best-known work is the Broadway musical West Side Story, which continues to be regularly performed worldwide, and was made into an Academy Award-winning feature film. His works include three symphonies, Chichester Psalms, Serenade after Plato's \"Symposium\", the original score for the film On the Waterfront, and theater works including On the Town, Wonderful Town, Candide, and his MASS.\nBernstein was the first American-born conductor to lead an American orchestra. He was music director of the New York Philharmonic and conducted the world's major orchestras, generating a significant legacy of audio and video recordings. He was also a critical figure in the modern revival of the music of Gustav Mahler, the composer whose music he was most passionately interested in. A skilled pianist, he often conducted piano concertos from the keyboard.\nBernstein was the first conductor to share and explore music on television with a mass audience. Through dozens of national and international broadcasts, including the Emmy Award-winning Young People's Concerts with the New York Philharmonic, he made even the most rigorous elements of classical music an adventure in which everyone could join. Through his educational efforts, including several books and the creation of two major international music festivals, he influenced several generations of young musicians.\nA lifelong humanitarian, Bernstein worked in support of civil rights; protested the Vietnam War; advocated for nuclear disarmament; raised money for HIV/AIDS research and awareness; and engaged in multiple international initiatives for human rights and world peace. Near the end of his life, he conducted a historic performance of Beethoven's Symphony No. 9 in Berlin to celebrate the fall of the Berlin Wall. The concert was televised live, worldwide, on Christmas Day, 1989.Bernstein was the recipient of many honors, including eleven Emmy Awards, one Tony Award, seventeen Grammy Awards, including the Lifetime Achievement and the Kennedy Center Honor."