"Jābir ibn Ḥayyān (Arabic: جابر بن حيّان, variously called al-Ṣūfī, al-Azdī, al-Kūfī, or al-Ṭūsī), died c. 806−816, is the purported author of an enormous number and variety of works, often called the Jabirian corpus. The works that survive today mainly deal with alchemy and chemistry, magic, and Shi'ite religious philosophy. However, the original scope of the corpus was vast and diverse, covering a wide range of topics ranging from cosmology, astronomy and astrology, over medicine, pharmacology, zoology and botany, to metaphysics, logic, and grammar.\nJabir's works contain the oldest known systematic classification of chemical substances, and the oldest known instructions for deriving an inorganic compound (sal ammoniac or ammonium chloride) from organic substances (such as plants, blood, and hair) by chemical means. His works also contain one of the earliest known versions of the sulfur-mercury theory of metals, a mineralogical theory that would remain dominant until the 18th century.\nA significant part of Jabir's writings were informed by a philosophical theory known as \"the science of the balance\" (Arabic: ʿilm al-mīzān), which was aimed at reducing all phenomena (including material substances and their elements) to a system of measures and quantitative proportions. The Jabirian works also contain some of the earliest preserved Shi'ite eschatological, soteriological and imamological doctrines, which Jabir presented as deriving from his purported master, the Shi'ite Imam Jaʿfar al-Ṣādiq.\nAs early as the 10th century, the identity and exact corpus of works of Jabir was in dispute in Islamic scholarly circles. The authorship of all these works by a single figure, and even the existence of a historical Jabir, are also doubted by modern scholars. Instead, Jabir ibn Hayyan is thought to have been a pseudonym used by an anonymous school of Shi'ite alchemists writing in the late 9th and early 10th centuries.\nSome Arabic Jabirian works (e.g., The Great Book of Mercy, and The Book of Seventy) were translated into Latin under the Latinized name \"Geber\", and in 13th-century Europe an anonymous writer, usually referred to as pseudo-Geber, started to produce alchemical and metallurgical writings under this name.\n\n\n== Biography ==\n\n\n=== Historicity ===\nIt is not clear whether Jabir ibn Hayyan ever existed as a historical person. He is purported to have lived in the 8th century, and to have been a disciple of the Shi'ite Imam Jaʿfar al-Ṣādiq (died 765). However, he is not mentioned in any historical source before c. 900, and the first known author to write about Jabir from a biographical point of view was the Baghdadi bibliographer Ibn al-Nadīm (c. 932–995). In his Fihrist (\"The Book Catalogue\", written in 987), Ibn al-Nadīm compiled a list of Jabir's works, adding a short notice on the various claims that were then circulating about Jabir. Already in Ibn al-Nadīm's time, there were some people who explicitly asserted that Jabir had never existed, although Ibn al-Nadīm himself disagreed with this claim. Jabir was often ignored by medieval Islamic biographers and historians, but especially significant is the fact that early Shi'ite biographers such as Aḥmad al-Barqī (died c. 893), Abū ʿAmr al-Kashshī (first half of the 10th century), Aḥmad ibn ʿAlī al-Najāshī (983–1058), and Abū Jaʿfar al-Ṭūsī (995–1067), who wrote long volumes on the companions of the Shi'ite Imams (including the many companions of Jaʿfar al-Ṣādiq), did not mention Jabir at all.\n\n\n=== Dating of the Jabirian corpus ===\nApart from outright denying his existence, there were also some who, already in Ibn al-Nadīm's time, questioned whether the writings attributed to Jabir were really written by him. The authenticity of these writings was expressly denied by the Bagdhadi philosopher Abū Sulaymān al-Sijistānī (c. 912–985) and his pupil Abū Ḥayyān al-Tawḥīdī (c. 932–1023), though this may have been related to the hostility of both these thinkers to alchemy in general. Modern scholarly analysis has tended to confirm the inauthenticity of the writings attributed to Jabir. Much of the philosophical terminology used in the Jabirian treatises was only coined around the middle of the 9th century, and some of the Greek philosophical texts cited in the Jabirian writings are known to have been translated into Arabic towards the end of the 9th century. Moreover, an important part of the corpus deals with early Shi'ite religious philosophy that is elsewhere only attested in late 9th-century and early 10th-century sources. As a result, the dating of the Jabirian corpus to c. 850–950 has been widely accepted in modern scholarship. However, it has also been noted that many Jabirian treatises show clear signs of having been redacted multiple times, and the writings as we now have them may well have been based on an earlier 8th-century core. Despite the obscurity involved, it is not impossible that some of these writings, in their earliest form, were written by a real Jabir ibn Hayyan. In any case, it is clear that Jabir's name was used as a pseudonym by one or more anonymous Shi'ite alchemists writing in the late 9th and early 10th centuries, who also redacted the corpus as we now know it.\n\n\n=== Biographical clues and legend ===\nJabir was generally known by the kunya Abū Mūsā (\"Father of Mūsā\"), or sometimes Abū ‘Abd Allāh (\"Father of ‘Abd Allāh\"), and by the nisbas (attributive names) al-Ṣūfī, al-Azdī, al-Kūfī, or al-Ṭūsī. The name al-Azdī points to his affiliation with the Southern-Arabian (Yemenite) tribe of the Azd. However, it is not clear whether Jabir was an Arab belonging to the Azd tribe, or a non-Arab Muslim client (mawlā) of the Azd. According to Ibn al-Nadīm, Jabir hailed from Khurasan (eastern Iran), but spent most of his life in Kufa (Iraq). Since the Azd were firmly established both in Kufa and in Khurasan, Jabir may well have been a descendant of the Arab settlers in Khurasan. If, however, he was a non-Arab Muslim client of the Azd, he is most likely to have been Iranian, given his ties with eastern Iran (his nisba al-Ṭūsī also points to Tus, a city in Khurasan). Various late reports put his date of death between 806 (190 AH) and 816 (200 AH).Given the lack of independent biographical sources, most of the biographical information about Jabir can be traced back to the Jabirian writings themselves. There are references throughout the Jabirian corpus to the Shi'ite Imam Jaʿfar al-Ṣādiq (died 765), whom Jabir generally calls \"my master\" (Arabic: sayyidī), and whom he represents as the original source of all his knowledge. In one work, Jabir is also represented as an associate of the Bactrian vizier family of the Barmakids, whereas Ibn al-Nadīm reports that some claimed Jabir to have been especially devoted to Jaʿfar ibn Yaḥyā al-Barmakī (767–803), the Abbasid vizier of One Thousand and One Nights fame. Jabir's links with the Abbasids were stressed even more by later tradition, which turned him into a favorite of the Abbasid caliph Hārūn Ar-Rashīd (c. 763–809, also of One Thousand and One Nights fame), for whom Jabir would have composed a treatise on alchemy, and who would have commanded the translation of Greek works into Arabic on Jabir's instigation.Given Jabir's purported ties with both the Shi'ite Imam Jaʿfar al-Ṣādiq and the Barmakid family (who served the Abbasids as viziers), or with the Abbasid caliphs themselves, it has sometimes been thought plausible that Ḥayyān al-ʿAṭṭār (\"Hayyan the Druggist\"), a proto-Shi'ite activist who was fighting for the Abbasid cause in the early 8th century, may have been Jabir's father (Jabir's name \"Ibn Hayyan\" literally means \"The Son of Hayyan\"). Although there is no direct evidence supporting this hypothesis, it fits very well in the historical context, and it allows us to think of Jabir, however obscure, as a historical figure. However, it has recently been shown that Ḥayyān al-ʿAṭṭār was a client (mawlā) of the Nakhaʿ tribe, which renders it highly improbable that he should have been the father of Jabir.\n\n\n== The Jabirian corpus ==\nThere are about 600 Arabic works attributed to Jabir ibn Hayyan that are known by name, approximately 215 of which are still extant today. Though some of these are full-length works (e.g., The Great Book on Specific Properties), most of them are relatively short treatises and belong to larger collections (The One Hundred and Twelve Books, The Five Hundred Books, etc.) in which they function rather more like chapters. When the individual chapters of some full-length works are counted as separate treatises too, the total length of the corpus may be estimated at about 3000 treatises/chapters.The overwhelming majority of Jabirian treatises that are still extant today deal with alchemy or chemistry (though these may also contain religious speculations, and discuss a wide range of other topics ranging from cosmology to grammar). Nevertheless, there are also a few extant treatises which deal with magic, i.e., \"the science of talismans\" (ʿilm al-ṭilasmāt, a form of theurgy) and \"the science of specific properties\" (ʿilm al-khawāṣṣ, the science dealing with the hidden powers of mineral, vegetable and animal substances, and with their practical applications in medical and various other pursuits). Other writings dealing with a great variety of subjects were also attributed to Jabir (this includes such subjects as engineering, medicine, pharmacology, zoology, botany, logic, metaphysics, mathematics, astronomy and astrology), but almost all of these are lost today.\n\n\n=== Alchemical writings ===\nNote that Paul Kraus, who first catalogued the Jabirian writings and whose numbering will be followed here, conceived of his division of Jabir's alchemical writings (Kr. nos. 5–1149) as roughly chronological in order.\nThe Great Book of Mercy (Kitāb al-Raḥma al-kabīr, Kr. no. 5): This was considered by Kraus to be the oldest work in the corpus, from which it may have been relatively independent. Some 10th-century skeptics considered it to be the only authentic work written by Jabir himself. The Persian physician, alchemist and philosopher Abū Bakr al-Rāzī (c. 854–925) appears to have written a (lost) commentary on it. It was translated into Latin in the 13th century under the title Liber Misericordiae.\nThe One Hundred and Twelve Books (al-Kutub al-miʾa wa-l-ithnā ʿashar, Kr. nos. 6–122): This collection consists of relatively independent treatises dealing with different practical aspects of alchemy, often framed as an explanation of the symbolic allusions of the 'ancients'. An important role is played by organic alchemy. Its theoretical foundations are similar to those of The Seventy Books (i.e., the reduction of bodies to the elements fire, air, water and earth, and of the elements to the 'natures' hot, cold, moist, and dry), though their exposition is less systematic. Just like in The Seventy Books, the quantitative directions in The One Hundred and Twelve Books are still of a practical and 'experimental' rather than of a theoretical and speculative nature, such as will be the case in The Books of the Balances. The first four treatises in this collection, i.e., the three-part Book of the Element of the Foundation (Kitāb Usṭuqus al-uss, Kr. nos. 6–8, the second part of which contains an early version of the famous Emerald Tablet attributed to Hermes Trismegistus) and a commentary on it (Tafsīr kitāb al-usṭuqus, Kr. no. 9), have been translated into English.\nThe Seventy Books (al-Kutub al-sabʿūn, Kr. nos. 123–192) (also called The Book of Seventy, Kitāb al-Sabʿīn): This contains a systematic exposition of Jabirian alchemy, in which the several treatises form a much more unified whole as compared to The One Hundred and Twelve Books. It is organized into seven parts, containing ten treatises each: three parts dealing with the preparation of the elixir from animal, vegetable, and mineral substances, respectively; two parts dealing with the four elements from a theoretical and practical point of view, respectively; one part focusing on the alchemical use of animal substances, and one part focusing on minerals and metals. It was translated into Latin by Gerard of Cremona (c. 1114–1187) under the title Liber de Septuaginta.\nTen books added to the Seventy (ʿasharat kutub muḍāfa ilā l-sabʿīn, Kr. nos. 193–202): The sole surviving treatise from this small collection (The Book of Clarification, Kitāb al-Īḍāḥ, Kr. no. 195) briefly discusses the different methods for preparing the elixir, criticizing the philosophers who have only expounded the method of preparing the elixir starting from mineral substances, to the exclusion of vegetable and animal substances.\nThe Ten Books of Rectifications (al-Muṣaḥḥaḥāt al-ʿashara, Kr. nos. 203–212): Relates the successive improvements (“rectifications”, muṣaḥḥaḥāt) brought to the art by such 'alchemists' as 'Pythagoras' (Kr. no. 203), 'Socrates' (Kr. no. 204), 'Plato' (Kr. no. 205), 'Aristotle' (Kr. no. 206), 'Archigenes' (Kr. nos. 207–208), 'Homer' (Kr. no. 209), 'Democritus' (Kr. no. 210), Ḥarbī al-Ḥimyarī (Kr. no. 211), and Jabir himself (Kr. no. 212). The only surviving treatise from this small collection (The Book of the Rectifications of Plato, Kitāb Muṣaḥḥaḥāt Iflāṭūn, Kr. no. 205) is divided into 90 chapters:  20 chapters on processes using only mercury, 10 chapters on processes using mercury and one additional 'medicine' (dawāʾ), 30 chapters on processes using mercury and two additional 'medicines', and 30 chapters on processes using mercury and three additional 'medicines'. All of these are preceded by an introduction describing the laboratory equipment mentioned in the treatise.\nThe Twenty Books (al-Kutub al-ʿishrūn, Kr. nos. 213–232): Only one treatise (The Book of the Crystal, Kitāb al-Billawra, Kr. no. 220) and a long extract from another one (The Book of the Inner Consciousness, Kitāb al-Ḍamīr, Kr. no. 230) survive. The Book of the Inner Consciousness appears to deal with the subject of specific properties (khawāṣṣ) and with talismans (ṭilasmāt).\nThe Seventeen Books (Kr. nos. 233–249); three treatises added to the Seventeen Books (Kr. nos. 250–252); thirty unnamed books (Kr. nos. 253–282); The Four Treatises and some related treatises (Kr. nos. 283–286, 287–292); The Ten Books According to the Opinion of Balīnās, the Master of Talismans (Kr. nos. 293–302): Of these, only three treatises appear to be extant, i.e., the Kitāb al-Mawāzīn (Kr. no. 242), the Kitāb al-Istiqṣāʾ (Kr. no. 248), and the Kitāb al-Kāmil (Kr. no. 291).\nThe Books of the Balances (Kutub al-Mawāzīn, Kr. nos. 303–446): This collection appears to have consisted of 144 treatises of medium length, 79 of which are known by name and 44 of which are still extant. Though relatively independent from each other and devoted to a very wide range of topics (cosmology, grammar, music theory, medicine, logic, metaphysics, mathematics, astronomy, astrology, etc.), they all approach their subject matter from the perspective of \"the science of the balance\" (ʿilm al-mīzān, a theory which aims at reducing all phenomena to a system of measures and quantitative proportions). The Books of the Balances are also an important source for Jabir's speculations regarding the apparition of the \"two brothers\" (al-akhawān), a doctrine which was later to become of great significance to the Egyptian alchemist Ibn Umayl (c. 900–960).\nThe Five Hundred Books (al-Kutub al-Khamsumiʾa, Kr. nos. 447–946): Only 29 treatises in this collection are known by name, 15 of which are extant. Its contents appear to have been mainly religious in nature, with moral exhortations and alchemical allegories occupying an important place. Among the extant treatises, The Book of the Glorious (Kitāb al-Mājid, Kr. no. 706) and The Book of Explication (Kitāb al-Bayān, Kr. no. 785) are notable for containing some of the earliest preserved Shi'ite eschatological, soteriological and imamological doctrines. Intermittent extracts from The Book of Kingship (Kitāb al-Mulk, Kr. no. 454) exist in a Latin translation under the title Liber regni.\nThe Books on the Seven Metals (Kr. nos. 947–956): Seven treatises which are closely related to The Books of the Balances, each one dealing with one of Jabir's seven metals (respectively gold, silver, copper, iron, tin, lead, and khārṣīnī or \"chinese metal\"). In one manuscript, these are followed by the related three-part Book of Concision (Kitāb al-Ījāz, Kr. nos. 954–956).\nDiverse alchemical treatises (Kr. nos. 957–1149): In this category, Kraus placed a large number of named treatises which he could not with any confidence attribute to one of the alchemical collections of the corpus. According to Kraus, some of them may actually have been part of The Five Hundred Books.\n\n\n=== Writings on magic (talismans, specific properties) ===\nAmong the surviving Jabirian treatises, there are also a number of relatively independent treatises dealing with \"the science of talismans\" (ʿilm al-ṭilasmāt, a form of theurgy) and with \"the science of specific properties\" (ʿilm al-khawāṣṣ, i.e., the science dealing with the hidden powers of mineral, vegetable and animal substances, and with their practical applications in medical and various other pursuits). These are:\n\nThe Book of the Search (Kitāb al-Baḥth, also known as The Book of Extracts, Kitāb al-Nukhab, Kr. no. 1800): This long work deals with the philosophical foundations of theurgy or \"the science of talismans\" (ʿilm al-ṭilasmāt). It is also notable for citing a significant number of Greek authors: there are references to (the works of) Plato, Aristotle, Archimedes, Galen, Alexander of Aphrodisias, Porphyry, Themistius, (pseudo-)Apollonius of Tyana, and others.\nThe Book of Fifty (Kitāb al-Khamsīn, perhaps identical to The Great Book on Talismans, Kitāb al-Ṭilasmāt al-kabīr, Kr. nos. 1825–1874): This work, only extracts of which are extant, deals with subjects such as the theoretical basis of theurgy, specific properties, astrology, and demonology.\nThe Great Book on Specific Properties (Kitāb al-Khawāṣṣ al-kabīr, Kr. nos. 1900–1970): This is Jabir's main work on \"the science of specific properties\" (ʿilm al-khawāṣṣ), i.e., the science dealing with the hidden powers of mineral, vegetable and animal substances, and with their practical applications in medical and various other pursuits. However, it also contains a number of chapters on \"the science of the balance\" (ʿilm al-mīzān, a theory which aims at reducing all phenomena to a system of measures and quantitative proportions).\nThe Book of the King (Kitāb al-Malik, kr. no. 1985): Short treatise on the effectiveness of talismans.\nThe Book of Black Magic (Kitāb al-Jafr al-aswad, Kr. no. 1996): This treatise is not mentioned in any other Jabirian work.\n\n\n=== Other extant writings ===\nWritings on a wide variety of other topics were also attributed to Jabir. Most of these are lost (see below), except for:\n\nThe Book on Poisons and on the Repelling of their Harmful Effects (Kitāb al-Sumūm wa-dafʿ maḍārrihā, Kr. no. 2145): on pharmacology.\nThe Book of Comprehensiveness (Kitāb al-Ishtimāl, Kr. no. 2715): a long extract of this philosophical treatise is preserved by the poet and alchemist al-Ṭughrāʾī (1061–c. 1121).\n\n\n=== Lost writings ===\nAlthough a significant number of the Jabirian treatises on alchemy and magic do survive, many of them are also lost. Apart from two surviving treatises (see immediately above), Jabir's many writings on other topics are all lost:\n\nCatalogues (Kr. nos. 1–4): There are three catalogues which Jabir is said to have written of his own works (Kr. nos. 1–3), and one Book on the Order of Reading our Books (Kitāb Tartīb qirāʾat kutubinā, Kr. no. 4). They are all lost.\nThe Books on Stratagems (Kutub al-Ḥiyal, Kr. nos. 1150–1449) and The Books on Military Stratagems and Tricks (Kutub al-Ḥiyal al-ḥurūbiyya wa-l-makāyid, Kr. nos. 1450–1749): Two large collections on 'mechanical tricks' (the Arabic word ḥiyal translates Greek μηχαναί, mēchanai) and military engineering, both lost.\nMedical and pharmacological writings (Kr. nos. 2000–2499): Seven treatises are known by name, the only one extant being The Book on Poisons and on the Repelling of their Harmful Effects (Kitāb al-Sumūm wa-dafʿ maḍārrihā, Kr. no. 2145). Kraus also included into this category a lost treatise on zoology (The Book of Animals, Kitāb al-Ḥayawān, Kr. no. 2458) and a lost treatise on botany (The Book of Plants or The Book of Herbs, Kitāb al-Nabāt or Kitāb al-Ḥashāʾish, Kr. no. 2459).\nPhilosophical writings (Kutub al-falsafa, Kr. nos. 2500–2799): Under this heading, Kraus mentioned 23 works, most of which appear to deal with Aristotelian philosophy (titles include, e.g., The Books of Logic According to the Opinion of Aristotle, Kr. no. 2580; The Book of Categories, Kr. no. 2582; The Book on Interpretation, Kr. no. 2583; The Book of Metaphysics, Kr. no. 2681; The Book of the Refutation of Aristotle in his Book On the Soul, Kr. no. 2734). Of one treatise (The Book of Comprehensiveness, Kitāb al-Ishtimāl, Kr. no. 2715) a long extract is preserved by the poet and alchemist al-Ṭughrāʾī (1061–c. 1121), but all other treatises in this group are lost.\nMathematical, astronomical and astrological writings (Kr. nos. 2800–2899): Thirteen treatises in this category are known by name, all of which are lost. Notable titles include a Book of Commentary on Euclid (Kitāb Sharḥ Uqlīdiyas, Kr. no. 2813), a Commentary on the Book of the Weight of the Crown by Archimedes (Sharḥ kitāb wazn al-tāj li-Arshamīdas, Kr. no. 2821), a Book of Commentary on the Almagest (Kitāb Sharḥ al-Majisṭī, Kr. no. 2834), a Subtle Book on Astronomical Tables (Kitāb al-Zāj al-laṭīf, Kr. no. 2839), a Compendium on the Astrolabe from a Theoretical and Practical Point of View (Kitāb al-jāmiʿ fī l-asṭurlāb ʿilman wa-ʿamalan, Kr. no. 2845), and a Book of the Explanation of the Figures of the Zodiac and Their Activities (Kitāb Sharḥ ṣuwar al-burūj wa-afʿālihā, Kr. no. 2856).\nReligious writings (Kr. nos. 2900–3000): Apart from those known to belong to The Five Hundred Books (see above), there are a number of religious treatises whose exact place in the corpus is uncertain, all of which are lost. Notable titles include Books on the Shi'ite Schools of Thought (Kutub fī madhāhib al-shīʿa, Kr. no. 2914), Our Books on the Transmigration of the Soul (Kutubunā fī l-tanāsukh, Kr. no. 2947), The Book of the Imamate (Kitāb al-Imāma, Kr. no. 2958), and The Book in Which I Explained the Torah (Kitābī alladhī fassartu fīhi al-tawrāt, Kr. no. 2982).\n\n\n== Historical background ==\n\n\n=== Greco-Egyptian, Byzantine and Persian alchemy ===\n\nThe Jabirian writings contain a number of references to Greco-Egyptian alchemists such as pseudo-Democritus (fl. c. 60), Mary the Jewess (fl. c. 0–300), Agathodaemon (fl. c. 300), and Zosimos of Panopolis (fl. c. 300), as well as to legendary figures such as Hermes Trismegistus and Ostanes, and to scriptural figures such as Moses and Jesus (to whom a number of alchemical writings were also ascribed). However, these references may have been meant as an appeal to ancient authority rather than as an acknowledgement of any intellectual borrowing, and in any case Jabirian alchemy was very different from what is found in the extant Greek alchemical treatises: it was much more systematic and coherent, it made much less use of allegory and symbols, and a much more important place was occupied by philosophical speculations and their application to laboratory experiments. Furthermore, whereas Greek alchemical texts had been almost exclusively focused on the use of mineral substances (i.e., on 'inorganic chemistry'), Jabirian alchemy pioneered the use of vegetable and animal substances, and so represented an innovative shift towards 'organic chemistry'.Nevertheless, there are some important theoretical similarities between Jabirian alchemy and contemporary Byzantine alchemy, and even though the Jabirian authors do not seem to have known Byzantine works that are extant today such as the alchemical works attributed to the Neoplatonic philosophers Olympiodorus (c. 495–570) and Stephanus of Alexandria (fl. c. 580–640), it seems that they were at least partly drawing on a parallel tradition of theoretical and philosophical alchemy. In any case, the writings actually used by the Jabirian authors appear to have mainly consisted of alchemical works falsely attributed to ancient philosophers like Socrates, Plato, and Apollonius of Tyana, only some of which are still extant today, and whose philosophical content still needs to be determined.One of the innovations in Jabirian alchemy was the addition of sal ammoniac (ammonium chloride) to the category of chemical substances known as 'spirits' (i.e., strongly volatile substances). This included both naturally occurring sal ammoniac and synthetic ammonium chloride as produced from organic substances, and so the addition of sal ammoniac to the list of 'spirits' is likely a product of the new focus on organic chemistry. Since the word for sal ammoniac used in the Jabirian corpus (nūshādhir) is Iranian in origin, it has been suggested that the direct precursors of Jabirian alchemy may have been active in the Hellenizing and Syriacizing schools of the Sassanid Empire.\n\n\n== Chemical philosophy ==\n\n\n=== Elements and natures ===\nBy Jabir's time Aristotelian physics had become Neoplatonic. Each Aristotelian element was composed of these qualities: fire was both hot and dry, earth, cold and dry, water cold and moist, and air, hot and moist. In the Jabirian corpus, these qualities came to be called \"natures\" (ṭabāʾiʿ), and elements are said to be composed of these 'natures', plus an underlying \"substance\" (jawhar). In metals two of these 'natures' were interior and two were exterior. For example, lead was cold and dry and gold was hot and moist. Thus, Jabir theorized, by rearranging the natures of one metal, a different metal would result. Like Zosimos, Jabir believed this would require a catalyst, an al-iksir, the elusive elixir that would make this transformation possible – which in European alchemy became known as the philosopher's stone.\n\n\n=== The sulfur-mercury theory of metals ===\nThe sulfur-mercury theory of metals, though first attested in pseudo-Apollonius of Tyana's The Secret of Creation (Sirr al-khalīqa, late 8th or early 9th century, but largely based on older sources), was also adopted by the Jabirian authors. According to the Jabirian version of this theory, metals form in the earth through the mixing of sulfur and mercury. Depending on the quality of the sulfur, different metals are formed, with gold being formed by the most subtle and well-balanced sulfur. This theory, which is ultimately based on ancient meteorological speculations such as those found in Aristotle's Meteorology, has formed the basis of all theories of metallic composition until the 18th century.\n\n\n== See also ==\n\n\n== References ==\n\n\n== Bibliography ==\n\n\n=== English translations of Arabic Jabirian texts ===\nNomanul Haq, Syed (1994). Names, Natures and Things: The Alchemist Jābir ibn Ḥayyān and his Kitāb al-Aḥjār (Book of Stones). Dordrecht: Kluwer. ISBN 9789401118989. (contains a new edition of parts of the Kitāb al-Aḥjār with English translation)\nO’Connor, Kathleen M. (1994). The Alchemical Creation of Life (Takwīn) and Other Concepts of Genesis in Medieval Islam (PhD diss.). University of Pennsylvania. (contains translations of extensive passages from various Jabirian works, with discussion)\nZirnis, Peter (1979). The Kitāb Usṭuqus al-uss of Jābir ibn Ḥayyān (Unpublished PhD diss.). New York University. (contains an annotated copy of the Kitāb Usṭuqus al-uss with English translation)\n\n\n=== Latin translations of Arabic Jabirian texts ===\nBerthelot, Marcellin (1906). \"Archéologie et Histoire des sciences\". Mémoires de l'Académie des sciences de l'Institut de France. 49. (pp. 310–363 contain an edition of the Latin translation of  Jabir's Seventy Books under the title Liber de Septuaginta)\nColinet, Andrée (2000). \"Le Travail des quatre éléments ou lorsqu'un alchimiste byzantin s'inspire de Jabir\".  In Draelants, Isabelle; Tihon, Anne; Van den Abeele, Baudouin (eds.). Occident et Proche-Orient: Contacts scientifiques au temps des Croisades. Actes du colloque de Louvain-la-Neuve, 24 et 25 mars 1997. Reminisciences. 5. Turnhout: Brepols. pp. 165–190. doi:10.1484/M.REM-EB.6.09070802050003050101010600. ISBN 978-2-503-51116-0. (pp. 179–187 contain an edition of the Latin translation of a separate treatise belonging to Jabir’s Seventy Books, i.e., The Book of the Thirty Words, Kitāb al-Thalāthīn kalima, Kr. no. 125, translated as Liber XXX verborum)\nDarmstaedter, Ernst (1925). \"Liber Misericordiae Geber: Eine lateinische Übersetzung des gröβeren Kitâb l-raḥma\". Archiv für Geschichte der Medizin. 17 (4): 181–197. (edition of the Latin translation of Jabir’s The Great Book of Mercy, Kitāb al-Raḥma al-kabīr, Kr. no. 5, under the title Liber Misericordiae)\nNewman, William R. (1994). \"Arabo-Latin Forgeries: The Case of the Summa Perfectionis (with the text of Jābir ibn Ḥayyān's Liber Regni)\".  In Russell, G. A. (ed.). The 'Arabick' Interest of the Natural Philosophers in Seventeenth-Century England. Leiden: Brill. pp. 278–296. ISBN 978-90-04-09888-6. (pp. 288–291 contain a Latin translation of intermittent extracts of Jabir’s Book of Kingship, Kitāb al-Mulk, Kr. no. 454, under the title Liber regni, with an English translation on pp. 291–293)Note that some other Latin works attributed to Jabir/Geber (Summa perfectionis, De inventione veritatis, De investigatione perfectionis, Liber fornacum, Testamentum Geberi, and Alchemia Geberi) are widely considered to be pseudepigraphs which, though largely drawing on Arabic sources, were originally written by Latin authors in the 13th–14th centuries (see pseudo-Geber); see Moureau 2020, p. 112; cf. Forster 2018.\n\n\n=== Encyclopedic sources ===\nDe Smet, Daniel (2008–2012). \"Jaʿfar al-Ṣādeq iv. Esoteric Sciences\". Encyclopaedia Iranica.\nForster, Regula (2018). \"Jābir b. Ḥayyān\".  In Fleet, Kate; Krämer, Gudrun; Matringe, Denis; Nawas, John; Rowson, Everett (eds.). Encyclopaedia of Islam, Three. doi:10.1163/1573-3912_ei3_COM_32665.\nKraus, Paul; Plessner, Martin (1960–2007). \"Djābir B. Ḥayyān\".  In Bearman, P.; Bianquis, Th.; Bosworth, C.E.; van Donzel, E.; Heinrichs, W.P. (eds.). Encyclopaedia of Islam, Second Edition. doi:10.1163/1573-3912_islam_SIM_1898.\nLory, Pierre (2008a). \"Jābir Ibn Hayyān\".  In Koertge, Noretta (ed.). New Dictionary of Scientific Biography. Vol. 4. Detroit: Thomson Gale. pp. 19–20. ISBN 9780684313207. \nLory, Pierre (2008b). \"Kimiā\". Encyclopaedia Iranica.\nPlessner, Martin (1981). \"Jābir Ibn Hayyān\".  In Gillispie, Charles C. (ed.). Dictionary of Scientific Biography. Vol. 7. New York: Charles Scribners’s Sons. pp. 39–43. \n\n\n=== Secondary sources ===\nal-Hassan, Ahmad Y. (2009). Studies in al-Kimya': Critical Issues in Latin and Arabic Alchemy and Chemistry. Hildesheim: Georg Olms Verlag. ISBN 9783487142739. (the same content and more is also available online) (argues against the great majority of scholars that the Latin Geber works were translated from the Arabic and that ethanol and mineral acids were known in early Arabic alchemy)\nBurnett, Charles (2001). \"The Coherence of the Arabic-Latin Translation Program in Toledo in the Twelfth Century\". Science in Context. 14 (1–2): 249–288. doi:10.1017/S0269889701000096. S2CID 143006568.\nCapezzone, Leonardo (2020). \"The Solitude of the Orphan: Ǧābir b. Ḥayyān and the Shiite Heterodox Milieu of the Third/Ninth–Fourth/Tenth Centuries\". Bulletin of the School of Oriental and African Studies. 83 (1): 51–73. doi:10.1017/S0041977X20000014. S2CID 214044897. (recent study of Jabirian Shi'ism, arguing that it was not of a form of Isma'ilism, but an independent sectarian current related to the late 9th-century Shi'ites known as ghulāt)\nCorbin, Henry (1950). \"Le livre du Glorieux de Jâbir ibn Hayyân\". Eranos-Jahrbuch. 18: 48–114.\nDelva, Thijs (2017). \"The Abbasid Activist Ḥayyān al-ʿAṭṭār as the Father of Jābir b. Ḥayyān: An Influential Hypothesis Revisited\". Journal of Abbasid Studies. 4 (1): 35–61. doi:10.1163/22142371-12340030. (rejects Holmyard 1927’s hypothesis that Jabir was the son of a proto-Shi'ite pharmacist called Ḥayyān al-ʿAṭṭār on the basis of newly available evidence; contains the most recent status quaestionis on Jabir’s biography, listing a number of primary sources on this subject that were still unknown to Kraus 1942–1943)\nEl-eswed, Bassam I. (2006). \"Spirits: The Reactive Substances in Jābir's Alchemy\". Arabic Sciences and Philosophy. 16 (1): 71–90. doi:10.1017/S0957423906000270. S2CID 170880312. (the first study since the days of Berthelot, Stapleton, and Ruska to approach the Jabirian texts from a modern chemical point of view)\nFück, Johann W. (1951). \"The Arabic Literature on Alchemy According to An-Nadīm (A.D. 987)\". Ambix. 4 (3–4): 81–144. doi:10.1179/amb.1951.4.3-4.81.\nGannagé, Emma (1998). Le commentaire d'Alexandre d'Aphrodise In de generatione et corruptione perdu en grec, retrouvé en arabe dans Ǧābir ibn Ḥayyān, Kitāb al-Taṣrīf (Unpublished PhD diss.). Université Paris 1 Panthéon-Sorbonne.\nHolmyard, Eric J. (1923). \"Jābir ibn Ḥayyān\". Proceedings of the Royal Society of Medicine. 16: 46–57. doi:10.1177/003591572301601606. (pioneering paper first showing that a great deal of Jabir’s non-religious alchemical treatises are still extant, that some of these treatises contain a sophisticated system of natural philosophy, and that Jabir knew the sulfur-mercury theory of metals)\nHolmyard, Eric J. (1927). \"An Essay on Jābir ibn Ḥayyān\".  In Ruska, Julius (ed.). Studien zur Geschichte der Chemie: Festgabe Edmund O. v. Lippmann. Berlin: Springer. pp. 28–37. doi:10.1007/978-3-642-51355-8_5. (seminal paper first presenting the hypothesis that Jabir was the son of a proto-Shi'ite pharmacist called Ḥayyān al-ʿAṭṭār)\nKraus, Paul (1930). \"Dschābir ibn Ḥajjān und die Ismāʿīlijja\".  In Ruska, Julius (ed.). Dritter Jahresbericht des Forschungsinstituts für Geschichte der Naturwissenschaften. Mit einer Wissenschaftlichen Beilage: Der Zusammenbruch der Dschābir-Legende. Berlin: Springer. pp. 23–42. OCLC 913815541. (seminal paper arguing that the Jabirian writings should be dated to ca. 850–950; the first to point out the similarities between Jabirian Shi'ism and early Isma'ilism)\nKraus, Paul (1931). \"Studien zu Jābir ibn Hayyān\" (PDF). Isis. 15 (1): 7–30. doi:10.1086/346536. JSTOR 224568. S2CID 143876602. (contains further arguments for the late dating of the Jabirian writings; analyses Jabir’s accounts of his relations with the Barmakids, rejecting their historicity)\nKraus, Paul (1942). \"Les dignitaires de la hiérarchie religieuse selon Ǧābir ibn Ḥayyān\". Bulletin de l'institut français d'archéologie orientale. 41: 83–97. (pioneering paper on Jabirian proto-Shi'ism)\nKraus, Paul (1942–1943). Jâbir ibn Hayyân: Contribution à l'histoire des idées scientifiques dans l'Islam. I. Le corpus des écrits jâbiriens. II. Jâbir et la science grecque. Cairo: Institut Français d'Archéologie Orientale. ISBN 9783487091150. OCLC 468740510. (vol. 1 contains a pioneering analysis of the sources for Jabir’s biography, and a catalogue of all known Jabirian treatises and the larger collections they belong to; vol. 2 contains a seminal analysis of the Jabirian philosophical system and its relation to Greek philosophy;  remains the standard reference work on Jabir even today)\nLory, Pierre (1983). Jâbir ibn Hayyân: Dix traités d'alchimie. Les dix premiers Traités du Livre des Soixante-dix. Paris: Sindbad. ISBN 9782742710614. (elaborates Kraus’s suggestion that the Jabirian writings may have developed from an earlier core, arguing that some of them, even though receiving their final redaction only in ca. 850–950, may date back to the late 8th century)\nLory, Pierre (1989). Alchimie et mystique en terre d'Islam. Lagrasse: Verdier. ISBN 9782864320913. (focuses on Jabir's religious philosophy; contains an analysis of Jabirian Shi'ism, arguing that it is in some respects different from Isma'ilism and may have been relatively independent)\nLory, Pierre (2000). \"Eschatologie alchimique chez jâbir ibn Hayyân\". Revue des mondes musulmans et de la Méditerranée. 91–94 (91–94): 73–92. doi:10.4000/remmm.249.\nLory, Pierre (2016). \"Aspects de l'ésotérisme chiite dans le Corpus Ǧābirien: Les trois Livres de l'Elément de fondation\". Al-Qantara. 37 (2): 279–298. doi:10.3989/alqantara.2016.009.\nMoureau, Sébastien (2020). \"Min al-kīmiyāʾ ad alchimiam. The Transmission of Alchemy from the Arab-Muslim World to the Latin West in the Middle Ages\". Micrologus. 28: 87–141. hdl:2078.1/211340. (a survey of all Latin alchemical texts known to have been translated from the Arabic)\nNewman, William R. (1985). \"New Light on the Identity of Geber\". Sudhoffs Archiv. 69 (1): 76–90. JSTOR 20776956. PMID 2932819.\nNewman, William R. (1991). The Summa perfectionis of Pseudo-Geber: A Critical Edition, Translation and Study. Leiden: Brill. ISBN 978-90-04-09464-2.\nNewman, William R. (1996). \"The Occult and the Manifest among the Alchemists\".  In Ragep, F. Jamil; Ragep, Sally P.; Livesey, Steven (eds.). Tradition, Transmission, Transformation: Proceedings of Two Conferences on Pre-Modern Science held at the University of Oklahoma. Leiden: Brill. pp. 173–198. ISBN 978-90-04-10119-7.\nNomanul Haq, Syed (1994). Names, Natures and Things: The Alchemist Jābir ibn Ḥayyān and his Kitāb al-Aḥjār (Book of Stones). Dordrecht: Kluwer. ISBN 9789401118989. (signalled some new sources on Jabir’s biography; followed Sezgin 1971 in arguing for an early date for the Jabirian writings)\nNorris, John (2006). \"The Mineral Exhalation Theory of Metallogenesis in Pre-Modern Mineral Science\". Ambix. 53 (1): 43–65. doi:10.1179/174582306X93183. S2CID 97109455. (important overview of the sulfur-mercury theory of metals from its conceptual origins in ancient Greek philosophy to the 18th century; discussion of the Arabic texts is brief and dependent on secondary sources)\nRuska, Julius (1923a). \"Sal ammoniacus, Nušādir und Salmiak\". Sitzungsberichte der Heidelberger Akademie der Wissenschaften, Philosophisch-Historische Klasse. 14 (5). doi:10.11588/diglit.38046.\nRuska, Julius (1923b). \"Über das Schriftenverzeichnis des Ǧābir ibn Ḥajjān und die Unechtheit einiger ihm zugeschriebenen Abhandlungen\". Archiv für Geschichte der Medizin. 15: 53–67. JSTOR 20773292.\nRuska, Julius (1927). \"Die siebzig Bücher des Ǵābir ibn Ḥajjān\".  In Ruska, Julius (ed.). Studien zur Geschichte der Chemie: Festgabe Edmund O. v. Lippmann. Berlin: Springer. pp. 38–47. doi:10.1007/978-3-642-51355-8_6.\nRuska, Julius (1928). \"Der Salmiak in der Geschichte der Alchemie\". Zeitschrift für angewandte Chemie. 41 (50): 1321–1324. doi:10.1002/ange.19280415006.\nRuska, Julius; Garbers, Karl (1939). \"Vorschriften zur Herstellung von scharfen Wässern bei Gabir und Razi\". Der Islam. 25: 1–34. doi:10.1515/islm.1938.25.1.1. S2CID 161055255. (contains a comparison of Jabir's and Abū Bakr al-Rāzī's knowledge of chemical apparatus, processes and substances)\nSarton, George (1927–1948). Introduction to the History of Science. Vol. I–III. Baltimore: Williams & Wilkins. OCLC 476555889. \nSezgin, Fuat (1971). Geschichte des arabischen Schrifttums, Band IV: Alchimie, Chemie, Botanik, Agrikultur bis ca. 430 H. Leiden: Brill. pp. 132–269. ISBN 9789004020092. (contains a penetrating critique of Kraus’ thesis on the late dating of the Jabirian works)\nStapleton, Henry E. (1905). \"Sal Ammoniac: A Study in Primitive Chemistry\". Memoirs of the Asiatic Society of Bengal. I (2): 25–40.\nStapleton, Henry E.; Azo, R.F.; Hidayat Husain, M. (1927). \"Chemistry in Iraq and Persia in the Tenth Century A.D.\". Memoirs of the Asiatic Society of Bengal. VIII (6): 317–418. OCLC 706947607.\nStarr, Peter (2009). \"Towards a Context for Ibn Umayl, Known to Chaucer as the Alchemist Senior\" (PDF). Journal of Arts and Sciences. 11: 61–77.\nUllmann, Manfred (1972). Die Natur- und Geheimwissenschaften im Islam. Leiden: Brill. ISBN 978-90-04-03423-5.\nWeisser, Ursula (1980). Das \"Buch über das Geheimnis der Schöpfung\" von Pseudo-Apollonios von Tyana. Berlin: De Gruyter. doi:10.1515/9783110866933. ISBN 978-3-11-086693-3."