"Jābir ibn Ḥayyān (Arabic: جابر بن حيّان, variously called al-Ṣūfī, al-Azdī, al-Kūfī, or al-Ṭūsī), died c. 806−816, is the purported author of an enormous number and variety of works, often called the Jabirian corpus. The works that survive today mainly deal with alchemy and chemistry, magic, and Shi'ite religious philosophy. However, the original scope of the corpus was vast and diverse, covering a wide range of topics ranging from cosmology, astronomy and astrology, over medicine, pharmacology, zoology and botany, to metaphysics, logic, and grammar.\nJabir's works contain the oldest known systematic classification of chemical substances, and the oldest known instructions for deriving an inorganic compound (sal ammoniac or ammonium chloride) from organic substances (such as plants, blood, and hair) by chemical means. His works also contain one of the earliest known versions of the sulfur-mercury theory of metals, a mineralogical theory that would remain dominant until the 18th century.\nA significant part of Jabir's writings were informed by a philosophical theory known as \"the science of the balance\" (Arabic: ʿilm al-mīzān), which was aimed at reducing all phenomena (including material substances and their elements) to a system of measures and quantitative proportions. The Jabirian works also contain some of the earliest preserved Shi'ite eschatological, soteriological and imamological doctrines, which Jabir presented as deriving from his purported master, the Shi'ite Imam Jaʿfar al-Ṣādiq.\nAs early as the 10th century, the identity and exact corpus of works of Jabir was in dispute in Islamic scholarly circles. The authorship of all these works by a single figure, and even the existence of a historical Jabir, are also doubted by modern scholars. Instead, Jabir ibn Hayyan is thought to have been a pseudonym used by an anonymous school of Shi'ite alchemists writing in the late 9th and early 10th centuries.\nSome Arabic Jabirian works (e.g., The Great Book of Mercy, and The Book of Seventy) were translated into Latin under the Latinized name \"Geber\", and in 13th-century Europe an anonymous writer, usually referred to as pseudo-Geber, started to produce alchemical and metallurgical writings under this name."