"During the Early Modern period the Holy Roman Empire was divided into Imperial Circles (Latin: Circuli imperii, German: Reichskreise; singular Circulus imperii, Reichskreis), administrative groupings whose primary purposes were the organization of common defensive structure and the collection of imperial taxes. They were also used as a means of organization within the Imperial Diet and the Imperial Chamber Court. Each circle had a Circle Diet, although not every member of the Circle Diet would hold membership of the Imperial Diet as well.\nSix Imperial Circles were introduced at the Diet of Augsburg in 1500. In 1512, three more circles were added, and the large Saxon Circle was split into two, so that from 1512 until the collapse of the Holy Roman Empire in the Napoleonic era, there were ten Imperial Circles. The Crown of Bohemia, the Swiss Confederacy and Italy remained unencircled, as did various minor territories which held imperial immediacy.\n\n\n== Formation ==\nInitially the 1500 Diet of Augsburg set up six Imperial Circles as part of the Imperial Reform:\n\nthe Bavarian Circle\nthe Franconian Circle\nthe Saxon Circle\nthe Swabian Circle\nthe Upper Rhenish Circle\nthe (Lower Rhenish-)Westphalian CircleOriginally, the territories held by the Habsburg dynasty and the Electors remained unencircled. In 1512 the Diet at Trier and Cologne organized these lands into three more circles:\n\nthe Austrian Circle, including the Habsburg territories inherited by Maximilian I\nthe Burgundian Circle, including the patrimony of Maximilian's late wife, Mary of Burgundy\nthe Electoral Rhenish Circle, including the ecclesiastical Electorates of Mainz, Cologne and Trier, and the secular Electorate of the Palatinate.Also, the Saxon circle got divided into:\n\nthe Lower Saxon Circle\nthe Upper Saxon Circle, including the Electorates of Saxony and BrandenburgThough the Empire lost several western territories after the secession of the Seven United Netherlands in 1581 and during the French annexations of the 1679 Peace of Nijmegen, the ten circles remained largely unchanged until the early 1790s, when the French Revolutionary Wars brought about significant changes to the political map of Europe.\nSome of the circles were de facto controlled by a powerful noble house. The Austrian Circle corresponded almost exactly with the Habsburg hereditary lands. The Burgundian Circle encompassed the territory controlled by the Spanish Habsburgs (Franche-Comte and the Habsburg Netherlands). The Bavarian Circle mostly consisted of the Wittelsbach Duchy of Bavaria plus its satellites. The Upper Saxon Circle was dominated by the electorates of Saxony (plus its satellite Ernestine duchies) and Brandenburg.\n\n\n== Unencircled territories ==\n\nA number of imperial territories remained unencircled, notably the lands of the Bohemian crown, the Old Swiss Confederacy and most of the Italian territories.\nBesides these, there were also a considerable number of minor territories which retained imperial immediacy, such as individual Imperial Villages, and the lands held by individual Imperial Knights.\n\n\n== References ==\n\nWinfried Dotzauer: Die deutschen Reichskreise in der Verfassung des alten Reiches und ihr Eigenleben. 1500–1806. Wissenschaftliche Buchgesellschaft, Darmstadt 1989, ISBN 3-534-04139-9 [1]\nPeter Claus Hartmann (ed.): Regionen in der frühen Neuzeit. Reichskreise im deutschen Raum, Provinzen in Frankreich, Regionen unter polnischer Oberhoheit. Ein Vergleich ihrer Strukturen, Funktionen und ihrer Bedeutung. (= Zeitschrift für historische Forschung; Beiheft 17). Duncker und Humblot, Berlin 1994, ISBN 3-428-08078-5.\n\n\n== Literature ==\nContemporary (1500–1806) literature and source material:\n\nWolfgang Wüst (ed.): Die \"gute\" Policey im Reichskreis. Zur frühmodernen Normensetzung in den Kernregionen des Alten Reiches, edition of primary sources in four volumes, vol. 1: Der Schwäbische Reichskreis, unter besonderer Berücksichtigung Bayerisch-Schwabens, Berlin 2001; vol. 2: Der Fränkische Reichskreis, Berlin 2003; vol. 3: Der Bayerische Reichskreis und die Oberpfalz, Berlin 2004; vol.: Die lokale Policey: Normensetzung und Ordnungspolitik auf dem Lande. Ein Quellenwerk, Berlin 2008.\nHernach volgend die Zehen Krayß, 1532.\nJohannes Alhusius: Politica methodice digesta. 3.Aufl., Herborn 1614.\nMartin Zeiller: Von den zehn Kreisen. 1660, 1694.\nJohann Samuel Tromsdorff: Accurate neue und alte Geographie von ganz Teutschland. Frankfurt 1711 (pp. 128ff).\n\"Creiß\" in:  Zedler, Grosses vollständiges Universallexikon aller Wissenschaften und Künste, vol. 6 (Ci – Cz), 1733.\n\n\n== External links ==\n\"Imperial Circles in the 16th Century\", Historical Maps of Germany, Webs, archived from the original on 2012-01-27."