"Harold Charles Schonberg (November 29, 1915 – July 26, 2003) was an American music critic and journalist, best known for his contributions to The New York Times. In 1971, he became the first music critic to win the Pulitzer Prize for Criticism. In addition, Schonberg reviewed mysteries and thrillers for The New York Times under the name Newgate Callender for nearly a quarter of a century. He also wrote a number of books on music, and one on chess.\n\n\n== Life and career as music critic ==\nSchonberg was born in New York City to David and Minnie (Kirsch) Schonberg on November 29, 1915. He had a brother (Stanley) and a sister (Edith). His aunt, Alice Frisca, was a former concert pianist, and would become his first music teacher. Schonberg graduated from Brooklyn College in 1937, and undertook graduate studies at New York University. In 1939, he became a record critic for American Music Lover Magazine (later renamed the American Record Guide).\nDuring World War II, Schonberg was a first lieutenant in the United States Army Airborne Signal Corps. He had hoped to enlist as a pilot, but was declared pastel-blind (he could distinguish colors but not shadings and subtleties) and was sent to London, where he was a code breaker and later a parachutist. He broke his leg on a training jump before D-Day and could not participate in the Normandy landings; every member of his platoon who jumped into France was ultimately killed. He remained in the Army until 1946.\nSchonberg joined The New York Times in 1950. He rose to the post of senior music critic for the Times a decade later. In this capacity he published daily reviews and longer features on operas and classical music on Sundays. He also worked effectively behind the scenes to increase music coverage in the Times and develop its first-rate music staff. Upon his retirement as senior music critic in 1980, he became cultural correspondent for the Times.\nSchonberg also wrote articles for Harper's and High Fidelity magazine, among others.\nSchonberg was an extremely influential music writer. Aside from his contributions to music journalism, he published 13 books, most of them on music, including The Great Pianists: From Mozart to the Present (1963, revised 1987)—pianists were a specialty of Schonberg—and The Lives of the Great Composers (1970; revised 1981, 1997) which traced the lives of major composers from Monteverdi through to modern times. Schonberg wrote a biography of Vladimir Horowitz, one of the most famous pianists of the 20th century, entitled Horowitz: His Life and Music (1992).\n\n\n=== Criticisms of Bernstein ===\nSchonberg was highly critical of Leonard Bernstein during the composer-conductor's eleven-year tenure (1958–69) as principal conductor of the New York Philharmonic. He accused Bernstein of showing off by using exaggerated gestures on the podium and of conducting a piece in a way that made its structure overly obvious to audiences (e.g., slowing down during the transition from one main theme to another).One of Schonberg's best remembered criticisms of Bernstein was written after the famous April 6, 1962, performance before which Bernstein announced that he disagreed with pianist Glenn Gould's interpretation of Brahms' Piano Concerto No. 1 but was going to conduct it anyway because he found it fascinating. Schonberg chided Bernstein in print, suggesting that he should have either refrained from publicizing his disagreement, backed out of the concert, or imposed his own will on Gould; Schonberg called Bernstein \"the Peter Pan of music\". In the chapter on Bernstein in his 1967 book The Great Conductors, Schonberg quotes the remark but neglects to mention that he was the critic who had made it.\nAfter Bernstein's regular tenure at the New York Philharmonic ended, however, Schonberg seemed to mellow in his attitude toward him and actually began to praise his conducting, stating in his book The Glorious Ones that \"with age, came less of a need to prove something\", and that \"there were moments of glory in his conceptions.\"\n\n\n== Other interests ==\nA devoted and skilled chess player, Schonberg covered the 1972 championship match between Boris Spassky and Bobby Fischer held in Reykjavík, Iceland. One of Schonberg's books not on music was Grandmasters of Chess. He also reviewed mysteries and thrillers for The New York Times under the pseudonym Newgate Callender from 1972-1995.Schonberg was an avid golfer, though a poor one by his own estimation. He co-authored the book How To Play Double Bogey Golf (1975) along with Hollis Alpert, founder of the National Society of Film Critics, and fellow author Ira Mothner. Schonberg, Mothner and Alpert frequently played golf together, according to the book.\n\n\n== Later life and death ==\nIn 1984, Schonberg taught music criticism at McMaster University in Hamilton, Canada.\nIn 1987, it was announced that Schonberg was assisting Vladimir Horowitz in the preparation of the pianist's memoirs. Although the project was never completed, Schonberg's biography of Horowitz was published in 1992. Also in 1987, he served on the jury of the Paloma O'Shea Santander International Piano Competition.Schonberg died in New York City on July 26, 2003, at the age of 87. In his obituary notice in The New York Times the next day, Allan Kozinn wrote that Schonberg \"set the standard for critical evaluation and journalistic thoroughness.\"\n\n\n== Books ==\nSchonberg, Harold C. (1955). Chamber and Solo Instrument Music. Guide to Long-Playing Records. New York: Alfred A. Knopf.\n—— (1959). The Collector's Chopin and Schumann. Keystone Books in Music. J. B. Lippincott.\n—— (1956). The Great Pianists. London: Victor Gollancz.\n—— (1987). The Great Pianists (Rev. and updated ed.). New York: Simon & Schuster. ISBN 9780671638375. OCLC 15196909.\n—— (1972). Grandmasters of Chess. Philadelphia and New York: J. B. Lippincott. ISBN 9784871875677. OCLC 951569212.\n—— (1981). The Great Conductors. New York: Summit Books. ISBN 9780671254063. OCLC 614438015.\n—— (1981). Facing the Music. New York: Summit Books. ISBN 9780671254063. OCLC 7204970. OL 4255142M.\n—— (1997). The Lives of the Great Composers (Third ed.). New York. ISBN 9780393038576. OCLC 34356892. OL 3259514W.\n—— (1985). The Glorious Ones: Classical Music's Legendary Performers. New York. ISBN 9780812911893. OCLC 11598959. OL 3259509W.\n—— (1992). Horowitz: his life and music. New York: Simon & Schuster. ISBN 9780671712198. OCLC 26130513. (a biography of Vladimir Horowitz)\n\n\n== References ==\n\nSony Classical. Glenn Gould/Leonard Bernstein/Brahms Piano Concerto No. 1 Glenn Gould, piano; Leonard Bernstein leading the New York Philharmonic. Released 1998."