"Margate is a seaside town in Thanet, Kent, England, 15 miles (24.1 km) north-east of Canterbury, which includes Cliftonville, Garlinge, Palm Bay and Westbrook.\nThe town has been a significant maritime port since the Middle Ages, and was associated with Dover as part of the Cinque Ports in the 15th century. It became a popular place for holidaymakers in the 18th century, owing to easy access via the Thames, and later with the arrival of the railways; popular landmarks include the sandy beaches and the Dreamland amusement park. During the late 20th century, the town went into decline along with other British seaside resorts, but attempts are being made to revitalise the economy.\n\n\n== History ==\n\nMargate was recorded as \"Meregate\" in 1264 and as \"Margate\" in 1299, but the spelling continued to vary into modern times. The name is thought to refer to a pool gate or gap in a cliff where pools of water are found, often allowing swimmers to jump in. The cliffs of the Isle of Thanet are composed of chalk, a fossil-bearing rock.\nMargate gives its name to the relatively unknown yet influential Battle of Margate, starting on 24 March 1387, it was the last major naval battle of the Caroline War phase of the Hundred Years' War. Despite the battle being named after Margate, very little actually happened near the coastal town - the battle is named after Margate as this was where an English fleet of 51 vessels that was anchored at Margate Roadstead first spotted a Franco-Castilian-Flemish wine fleet of around 250-360 vessels. The English gave chase after the undermanned wine fleet and finally defeated the fleet a day later on the 25 March 1387 off the coast of Cadzand, Zeeland, Netherlands.\nThe town's history is tied closely to the sea and it has a proud maritime tradition. Margate was a \"limb\" of Dover in the ancient confederation of the Cinque ports. It was added to the confederation in the 15th century. Margate has been a leading seaside resort for at least 250 years. Like its neighbour Ramsgate, it has been a traditional holiday destination for Londoners drawn to its sandy beaches. Margate had a Victorian jetty which was largely destroyed by a storm in 1978.In the late 18th century, the town was chosen by the physician John Coakley Lettsom as the place in which he would build the Royal Sea Bathing Hospital, which was the first of its kind in Britain.\nLike Brighton and Southend, Margate was infamous for gang violence between mods and rockers in the 1960s, and mods and skinheads in the 1980s.The Turner Contemporary art gallery occupies a prominent position next to the harbour, and was constructed there with the specific aim of revitalising the town. The Thanet Offshore Wind Project, completed in 2010, is visible from the seafront.\n\n\n== Government ==\n\nSince 1983, the Member of Parliament for North Thanet, covering northern Thanet and Herne Bay, has been the Conservative, Roger Gale. At the 2017 General Election, in North Thanet the Conservatives won a majority of 10,738 and 56.2% of the vote. Labour won 34.0% of the vote, and United Kingdom Independence Party 4.5%.Margate was incorporated as a municipal borough in 1857. This was abolished in 1974, since which date Margate has been part of the Thanet district of Kent. The town contains the seven electoral wards of Margate Central, Cliftonville West, Cliftonville East (both Cliftonville wards were formally Margate Cliftonville from 1973 to 2003), Westbrook, Garlinge, Dane Valley and Salmestone. These wards have seventeen of the fifty six seats on the Thanet District Council. At the 2007 Local Elections, nine of those seats were held by the Conservatives, seven by Labour and one by an Independent.\n\n\n== Climate ==\nMargate experiences an oceanic climate (Köppen climate classification Cfb) similar to much of the United Kingdom. Like almost all of southern Britain, Margate experiences mild temperatures, complemented by a relatively large amount of sunshine (more, for example, than London and even nearby Ramsgate). Rainfall is quite low, and Margate is one of the drier Kent towns.\n\n\n== Demography ==\nAt the 2001 UK census:\nMargate had a population of 40,386. The urban area had a population of 46,980 at the 2001 census, increasing to 49,709 at the 2011 census (5.8% increase).The ethnicity of the town was 97.1% white, 1.0% mixed race, 0.5% black, 0.8% Asian, 0.6% Chinese or other ethnicity.The place of birth of residents was 94.2% United Kingdom, 0.9% Republic of Ireland, 0.5% Germany, 0.8% other Western Europe countries, 0.7% Africa, 0.6% Eastern Europe, 0.5% Far East, 0.5% South Asia, 0.5% Middle East, 0.4% North America and 0.3% Oceania.Religion was recorded as 71.6% Christian, 17.1% no religion, 0.7% Muslim, 0.3% Buddhist, 0.3% Jewish, 0.2% Hindu, 0.1% Sikh; 0.3% had an alternative religion and 9.8% did not state their religion.For every 100 females, there were 92 males. The age distribution was 6% aged 0–4 years, 16% aged 5–15 years, 5% aged 16–19 years, 31% aged 20–44 years, 23% aged 45–64 years and 19% aged 65 years and over.11% of Margate residents had some kind of higher or professional qualification, compared to the national average of 20%.\n\n\n== Economy ==\nAt the 2001 UK census, the economic activity of residents aged 16–74 was 33.8% in full-time employment, 11.8% in part-time employment, 8.0% self-employed, 5.5% unemployed, 2.2% students with jobs, 3.9% students without jobs, 15.5% retired, 8.3% looking after home or family, 7.9% permanently sick or disabled and 3.6% economically inactive for other reasons. The rate of unemployment in the town was considerably higher than the national rate of 3.4%.The industry of employment of residents was 17% retail, 16% health & social work, 13% manufacturing, 9% construction, 8% real estate, 8% education, 7% transport & communications, 5% public administration, 6% hotels & restaurants, 2% finance, 1% agriculture and 6% other community, social or personal services. Compared to national figures, the town had a relatively high number of workers in the construction, hotels & restaurants and health & social care industries and a relatively low number in real estate and finance.Margate railway station, constructed in 1926 to designs by Edwin Maxwell Fry, serves the town. Train services are provided by Southeastern Trains.\n\n\n== Tourism ==\n\nFor at least 250 years, Margate has been a leading seaside resort in the UK, drawing Londoners to its beaches, Margate Sands. The bathing machines in use at Margate were described in 1805 as\n\nfour-wheeled carriages, covered with canvas, and having at one end of them an umbrella of the same materials which is let down to the surface of the water, so that the bather descending from the machine by a few steps is concealed from the public view, whereby the most refined female is enabled to enjoy the advantages of the sea with the strictest delicacy.\nThe Dreamland Amusement Park (featured in \"The Jolly Boys' Outing\" extended episode of the television series Only Fools and Horses) is situated in the centre of Margate. After its closure in 2006, it reopened in 2015 following a lengthy campaign by the \"Save Dreamland Campaign\" group.\nThe Scenic Railway roller coaster at Dreamland, which opened in 1920, is Grade II* Listed and the second oldest in the world, was severely damaged in a fire on 7 April 2008 but has now been fully restored and reopened to the public in October 2015. Today the Dreamland roller coaster is one of only two early-20th century scenic railways still remaining in the UK; the only other surviving UK scenic railway is in Great Yarmouth and was built in 1932. The Margate roller coaster is an ACE Coaster Classic.Cliftonville, next to Margate, had a classic British Arnold Palmer seaside mini golf course. It closed and was illegally converted to a skate park, which was later shut down by the council amid Safety Concerns.\n\nThere are two notable theatres, the Theatre Royal in Addington Street – the second oldest theatre in the country – and the Tom Thumb Theatre, the second smallest in the country, in addition to the Winter Gardens. The Theatre Royal was built in 1787, burned down in 1829 and was remodelled in 1879 giving Margate more national publicity. The exterior is largely from the 19th century. From 1885 to 1899 actor-manager Sarah Thorne ran a school for acting at the Theatre Royal which is widely regarded as Britain's first formal drama school. Actors who received their initial theatrical training there include Harley Granville-Barker, Evelyn Millard, Louis Calvert, George Thorne, Janet Achurch, Adelaide Neilson and Irene and Violet Vanbrugh, among others.An annual jazz festival takes place on a weekend in June.\nIn September, an annual car show commences known as \"Oh So Retro\" featuring classic and retro vehicles, trade stalls and family-friendly entertainment.Margate Museum in Market Place explores the town's seaside heritage in a range of exhibits and displays, and is now opened at weekends by a team of volunteers.\nFirst discovered in 1798, the Margate Caves (also known as the Vortigern Caves) are situated at the bottom of Northdown Road. Reopened summer of 2019.The Shell Grotto, which has walls and roof covered in elaborate decorations of over four million shells covering 2,000 square feet (190 m2) in complex patterns, was rediscovered in 1835, but is of unknown age and origin. It has been designated as a Grade I listed building.The Walpole Bay Tidal Pool is a Grade 2 listed tidal sea bathing pool built in 1937. The pool covers over four acres and its dimensions are 450 ft long, 300 ft wide at the seaward end and 550 ft long at the landward end. The water in the pool is refreshed by the incoming tide twice a day and fresh water springs rise from the beach within the walls.\n\n\n== Regeneration ==\n\nThe former chairman of the Margate Civic Society, John Crofts, had a plan to develop a centre that would explore and show the link that the painter JMW Turner shared with Margate. Turner described the Thanet skies as the \"loveliest in all Europe.\" In 1994 Crofts became increasingly determined to create such a gallery and in 1998 the Leader of Kent County Council met a number of people from the art world to discuss the idea. They hoped that the centre would regenerate the once-thriving town of Margate and offer an alternative to Margate's traditional tourist trade. In the late 1990s, the County Council offered to fund the building of the Turner Gallery. Additional funding was contributed by the Arts Council England and South East England Development Agency. In 2001 the Turner Contemporary was officially established. The view from the gallery is similar to that seen by Turner from his lodging house.To reduce the cost, Thanet District Council chose a new site inland from the harbour wall. The scheme was supported by the artist Tracey Emin, who was brought up in Margate. The building itself was designed by David Chipperfield Architects after the abandonment of the design by Snøhetta + Spence architects. Building work started in 2008 but the project's initiator, John Crofts, died in 2009. The Turner Contemporary Gallery officially opened on 16 April 2011.Across the road from the gallery in Margate Old Town there is a community of independent shops. Accessed from the seafront via Market Street, Duke Street and King Street this area is clustered around the old Margate Town Hall in the centre of the Market Place. There is also a small museum in the town hall complex which provides information about the history of Margate. In 2012 Margate was chosen as one of the towns to benefit from the Portas Pilot Scheme aimed at regenerating some of Britain's high streets.\n\n\n== Historic sites ==\nThere is a 16th-century, two-storey timber-framed Tudor house built on a flint plinth in King Street.Margate's Jubilee Clock Tower was built to commemorate Queen Victoria's Golden Jubilee in 1887, although not completed until 1889. It had a Time Ball mechanism, mounted on a mast atop the tower, which was raised a few minutes before 1 pm each day and dropped at precisely 1 pm, thereby allowing residents, visitors and ships to know the exact time. This was, of course, in the days before wireless transmission of time signals. The Time Ball fell out of use many years ago, but following a suggestion by Arnold Schwartzman OBE RDI, a former Margate resident, Margate Civic Society raised funds to have the Time Ball repaired and brought back into use. This was successful, and a civic ceremony celebrated the restoration on 24 May 2014, Queen Victoria's birthday and the 125th anniversary of the Clock Tower's official opening.  The Time Ball now drops at 1 pm each day and is one of only a handful of working time balls in the world.\nDraper's Mill is a smock mill built in 1845 by John Holman. It was working by wind until 1916 and by engine until the late 1930s. It was saved from demolition and is now restored and open to the public.\n\n\n== Cultural references ==\n\n\n=== Literature ===\nMargate features at the start and as a recurrent theme in Margate writer Iain Aitch's travelogue, A Fete Worse Than Death. The author was born in the town.\nT. S. Eliot, who in 1921 recuperated after a mental breakdown in the suburb of Cliftonville, commented in his poem The Waste Land Part III - The Fire Sermon:\n\nOn Margate sands.\nI can connect\nNothing with nothing.Margate features as a destination in Graham Swift's novel Last Orders and its film adaptation. The character Jack Dodds had asked to have his remains scattered at Margate, and the book tells the tale of the drive to Margate and the memories evoked on the way.\nThe Victorian author William Thackeray used out-of-season Margate as the setting for his early unfinished novel 'A Shabby Genteel Story'.\n\n\n=== Music ===\n\"Margate\" is the title of a UK single released by Chas & Dave in 1982.\n\"Margate Fhtagn\" is a song by UK steampunk band The Men That Will Not Be Blamed For Nothing. The story related in the song combines the Victorian tradition of the seaside holiday with the works of H. P. Lovecraft, specifically the Cthulhu Mythos, to tell the tale of a Victorian family going on a seaside holiday to Margate, which gets interrupted by Cthulhu rising from the sea.\"Die Muschel von Margate\" (Seashells from Margate) is a song written by Kurt Weill and Felix Gasbarra from 1928. It featured in Konjunktur (Oil Boom), a play by Leo Lania in which three oil companies fight over the rights to oil production in a primitive Balkan country, and in the process exploit the people and destroy the environment.It is thought that Ralph Vaughan Williams wrote his Lark Ascending whilst walking along the cliffs in Margate.[2]\n\n\n=== Film and television ===\nJ. M. W. Turner's long-term relationship with Mrs. Sophia Booth of Margate was featured in the film Mr. Turner (2014).\nThe railway station and Dreamland feature prominently in the Only Fools & Horses episode \"The Jolly Boys' Outing\" (1989).\nIn series 4 (2017) of the British television crime drama Peaky Blinders, the character Alfie Solomons (played by Tom Hardy) chooses to reside at Margate, where he's shot on the beach by Tommy Shelby.\nThe town appeared on BBC TV's The Apprentice in May 2009.The 2012 BBC television drama series True Love was set and filmed in Margate. The show had its first public screening at the Turner Contemporary.\nThe 2014 ITV sitcom Edge of Heaven was set at a 1980s-themed bed and breakfast on the Margate seaside.\n\n\n== Education ==\n\nHartsdown Academy\nEast Kent Sudbury school (private)\n\n\n== Sport ==\nMargate F.C. play at Hartsdown Park. The club has played in the National League, and the National League South, but, as of 2021, they are currently playing in the Isthmian League.\nThe Margate Beach Cross Weekend, run on the beach at Margate, had its 9th event on 26 and 27 October 2013 and attracts a number of the UK and Europe's top quad and solo riders along with SSV pilots. The event is run by the QRA UK.\n\n\n== Local media ==\nMargate has two paid-for newspapers, the Isle of Thanet Gazette and Thanet Times (which ceased publication in 2012), which are owned by Northcliffe Media. Free newspapers for the town include online-only Isle of Thanet News; the Thanet Extra, part of the KM Group; and yourthanet, part of KOS Media. Local radio stations are KMFM Thanet, owned by the KM Group, community radio station Academy FM (Thanet); and the county-wide stations Heart Kent, Gold and BBC Radio Kent. Thanet Community Radio also offers an online community podcasting service for Ramsgate, Broadstairs, Margate and the wider areas of Thanet.\nRecent Facebook poll on Thanet group showed Margate to be the worst place to live in Thanet.\n\n\n== References ==\n\n\n== Further reading ==\nOulton, W.C. Picture of Margate, and Its Vicinity [1820] Paternoster Row, London: Baldwin, Cradock, and Joy. (2005 reprint) Ramsgate, Kent: Michaels Bookshop, ISBN 1-905477-20-1. Title page of original edition: Google Books\n\n\n== External links ==\nChisholm, Hugh, ed. (1911). \"Margate\" . Encyclopædia Britannica (11th ed.). Cambridge University Press.\nMargate Civic Society\nMargate Cliff Railway (Cliftonville Lido) (1913-1970s)\nOfficial Margate tourism site"