"Mount Kilimanjaro () is a dormant volcano in Tanzania. It has three volcanic cones: Kibo, Mawenzi, and Shira. It is the highest mountain in Africa and the highest single free-standing mountain in the world: 5,895 metres (19,341 ft) above sea level and about 4,900 metres (16,100 ft) above its plateau base.\nKilimanjaro is the fourth most topographically prominent peak on Earth. It is part of Kilimanjaro National Park and is a major climbing destination. Because of its shrinking glaciers and ice fields, which are projected to disappear between 2030 and 2050, it has been the subject of many scientific studies.\n\n\n== Toponym ==\n\nThe origin of the name Kilimanjaro is not known, but a number of theories exist. European explorers had adopted the name by 1860 and reported that Kilimanjaro was the mountain's Kiswahili name. The 1907 edition of The Nuttall Encyclopædia also records the name of the mountain as Kilima-Njaro.Johann Ludwig Krapf wrote in 1860 that Swahilis along the coast called the mountain Kilimanjaro. Although he did not offer any support, he claimed that Kilimanjaro meant either mountain of greatness or mountain of caravans. Under the latter meaning, kilima meant mountain and jaro meant caravans. Jim Thompson claimed in 1885, again without support, that the term Kilima-Njaro \"has generally been understood to mean\" the mountain (kilima) of greatness (njaro). He also suggested \"though not improbably it may mean\" the white mountain.Njaro is an ancient Kiswahili word for shining. Similarly, Krapf wrote that a chief of the Wakamba people, whom he visited in 1849, \"had been to Jagga and had seen the Kima jajeu, mountain of whiteness, the name given by the Wakamba to Kilimanjaro....\" More correctly in the Kikamba language this would be kiima kyeu, and this possible derivation has been popular with several investigators.Others have assumed that kilima is Kiswahili for mountain. The problem with this assumption is that kilima actually means hill and is, therefore, the diminutive of mlima, the proper Kiswahili word for mountain. However, \"[i]t is ... possible ... that an early European visitor, whose knowledge of [Kiswahili] was not extensive, changed mlima to kilima by analogy with the two Wachagga names: Kibo and Kimawenzi.\" A different approach is to assume that the kileman part of Kilimanjaro comes from the Kichagga kileme, which means that which defeats, or kilelema, which means that which has become difficult or impossible. The jaro part would \"then be derived from njaare, a bird; or, according to other informants, a leopard; or, possibly from jyaro, a caravan\". Considering that the name Kilimanjaro has never been current among the Wachagga people, it is possible that the name was derived from Wachagga saying that the mountain was unclimbable, kilemanjaare or kilemajyaro, and porters misinterpreting this as being the name of the mountain.In the 1880s, the mountain became a part of German East Africa and was called Kilima-Ndscharo in German following the Kiswahili name components. On 6 October 1889, Hans Meyer reached the highest summit on the crater ridge of Kibo. He named it Kaiser-Wilhelm-Spitze (Kaiser Wilhelm peak). That name was used until Tanzania was formed in 1964, when the summit was renamed Uhuru Peak, meaning freedom peak in Kiswahili.\n\n\n== Geology and geography ==\nKilimanjaro is a large dormant stratovolcano composed of three distinct volcanic cones: Kibo, the highest; Mawenzi at 5,149 metres (16,893 ft); and Shira, the lowest at 4,005 metres (13,140 ft). Mawenzi and Shira are extinct, while Kibo is dormant and could erupt again.Uhuru Peak is the highest summit on Kibo's crater rim. The Tanzania National Parks Authority, a Tanzanian government agency, and the United Nations Educational, Scientific and Cultural Organization lists the height of Uhuru Peak as 5,895 m (19,341 ft), based on a British survey in 1952. The height has since been measured as 5,892 metres (19,331 ft) in 1999, 5,902 metres (19,364 ft) in 2008, and 5,899 metres (19,354 ft) in 2014.A map of the Kibo cone on Mount Kilimanjaro was published by the British government's Directorate of Overseas Surveys (DOS) in 1964 based on aerial photography conducted in 1962 as the \"Subset of Kilimanjaro, East Africa (Tanganyika) Series Y742, Sheet 56/2, D.O.S. 422 1964, Edition 1, Scale 1:50,000\". Tourist mapping was first published by the Ordnance Survey in England in 1989 based on the original DOS mapping at a scale of 1:100,000, with 100 feet (30 m) contour intervals, as DOS 522. West Col Productions produced a map with tourist information in 1990, at a scale of 1:75,000, with 100 metres (330 ft) contour intervals; it included inset maps of Kibo and Mawenzi on 1:20,000 and 1:30,000 scales respectively and with 50 metres (160 ft) contour intervals. In recent years, numerous other maps have become available, of various qualities.\n\n\n=== Volcanology ===\nThe volcanic interior of Kilimanjaro is poorly known because there has not been any significant erosion to expose the igneous strata that comprises the volcano's structure.Eruptive activity at the Shira centre commenced about 2.5 million years ago, with the last important phase occurring about 1.9 million years ago, just before the northern part of the edifice collapsed. Shira is topped by a broad plateau at 3,800 metres (12,500 ft), which may be a filled caldera. The remnant caldera rim has been degraded deeply by erosion. Before the caldera formed and erosion began, Shira might have been between 4,900 and 5,200 m (16,100 and 17,100 ft) high. It is mostly composed of basic lavas, with some pyroclastics. The formation of the caldera was accompanied by lava emanating from ring fractures, but there was no large scale explosive activity. Two cones formed subsequently, the phonolitic one at the northwest end of the ridge and the doleritic Platzkegel in the caldera centre.Both Mawenzi and Kibo began erupting about 1 million years ago. They are separated by the Saddle Plateau at 4,400 metres (14,400 ft) elevation.: 3 The youngest dated rocks at Mawenzi are about 448,000 years old. Mawenzi forms a horseshoe-shaped ridge with pinnacles and ridges opening to the northeast, with a tower-like shape resulting from deep erosion and a mafic dike swarm. Several large cirques cut into the ring. The largest of these sits on top of the Great Barranco gorge. Also notable are the East and West Barrancos on the northeastern side of the mountain. Most of the eastern side of the mountain has been removed by erosion. Mawenzi has a subsidiary peak, Neumann Tower, 4,425 metres (14,518 ft).\n\nKibo is the largest cone on the mountain and is more than 24 km (15 mi) wide at the Saddle Plateau altitude. The last activity here, dated to 150,000–200,000 years ago, created the current Kibo summit crater. Kibo still has gas-emitting fumaroles in its crater. Kibo is capped by an almost symmetrical cone with escarpments rising 180 to 200 metres (590 to 660 ft) on the south side. These escarpments define a 2.5-kilometre-wide (1.6 mi) caldera caused by the collapse of the summit.\nWithin this caldera is the Inner Cone and within the crater of the Inner Cone is the Reusch Crater, which the Tanganyika government in 1954 named after Gustav Otto Richard Reusch, upon his climbing the mountain for the 25th time (out of 65 attempts during his lifetime). The Ash Pit, 350 metres (1,150 ft) deep, lies within the Reusch Crater. About 100,000 years ago, part of Kibo's crater rim collapsed, creating the area known as the Western Breach and the Great Barranco.An almost continuous layer of lava buries most older geological features, with the exception of exposed strata within the Great West Notch and the Kibo Barranco. The former exposes intrusions of syenite. Kibo has five main lava formations:\nPhonotephrites and tephriphonolites of the Lava Tower group, on a dyke cropping out at 4,600 metres (15,100 ft), dated to 482,000 years ago.\nTephriphonolite to phonolite lavas \"characterized by rhomb mega-phenocrysts of sodic feldspars\" of the Rhomb Porphyry group, dated to 460,000–360,000 years ago.\nAphyric phonolite lavas, \"commonly underlain by basal obsidian horizons\", of the Lent group, dated to 359,000–337,000 years ago\nPorphyritic tephriphonolite to phonolite lavas of the Caldera Rim group, dated to 274,000–170,000 years ago\nPhonolite lava flows with aegirine phenocrysts, of the Inner Crater group, which represents the last volcanic activity on KiboKibo has more than 250 parasitic cones on its northwest and southeast flanks that were formed between 150,000 and 200,000 years ago and erupted picrobasalts, trachybasalts, ankaramites, and basanites. They reach as far as Lake Chala and Taveta in the southeast and the Lengurumani Plain in the northwest. Most of these cones are well preserved, with the exception of the Saddle Plateau cones that were heavily affected by glacial action. Despite their mostly small size, lava from the cones has obscured large portions of the mountain. The Saddle Plateau cones are mostly cinder cones with terminal effusion of lava, while the Upper Rombo Zone cones mostly generated lava flows. All Saddle Plateau cones predate the last glaciation.According to reports gathered in the 19th century from the Maasai, Lake Chala on Kibo's eastern flank was the site of a village that was destroyed by an eruption.\n\n\n=== Glaciers ===\n\nKibo's diminishing ice cap exists because Kilimanjaro is a little-dissected, massive mountain that rises above the snow line. The cap is divergent and at the edges splits into individual glaciers. The central portion of the ice cap is interrupted by the presence of the Kibo crater.: 5  The summit glaciers and ice fields do not display significant horizontal movements because their low thickness precludes major deformation.Geological evidence shows five successive glacial episodes during the Quaternary period, namely First (500,000 BP), Second (greater than 360,000 years ago to 240,000 BP), Third (150,000 to 120,000 BP), Fourth (also known as \"Main\") (20,000 to 17,000 BP), and Little (16,000 to 14,000 BP). The Third may have been the most extensive, and the Little appears to be statistically indistinguishable from the Fourth.A continuous ice cap covering approximately 400 square kilometres (150 sq mi) down to an elevation of 3,200 metres (10,500 ft) covered Kilimanjaro during the Last Glacial Maximum in the Pleistocene epoch (the Main glacial episode), extending across the summits of Kibo and Mawenzi. Because of the exceptionally prolonged dry conditions during the subsequent Younger Dryas stadial, the ice fields on Kilimanjaro may have become extinct around 11,500 years BP. Ice cores taken from Kilimanjaro's Northern Ice Field (NIF) indicates that the glaciers there have a basal age of about 11,700 years, although an analysis of ice taken in 2011 from exposed vertical cliffs in the NIF supports an age extending only to 800 years BP. Higher precipitation rates at the beginning of the Holocene epoch (11,500 years BP) allowed the ice cap to reform. The glaciers survived a widespread drought during a three century period beginning around 4,000 years BP.\n\nIn the late 1880s, the summit of Kibo was completely covered by an ice cap about 20 square kilometres (7.7 sq mi) in extent with outlet glaciers cascading down the western and southern slopes, and except for the inner cone, the entire caldera was buried. Glacier ice also flowed through the Western Breach. The slope glaciers retreated rapidly between 1912 and 1953, in response to a sudden shift in climate at the end of the 19th century that made them \"drastically out of equilibrium\", and more slowly thereafter. Their continuing demise indicates they are still out of equilibrium in response to a constant change in climate over the past century.In contrast to the persistent slope glaciers, the glaciers on Kilimanjaro's crater plateau have appeared and disappeared repeatedly during the Holocene epoch, with each cycle lasting a few hundred years.: 1088  It appears that decreasing specific humidity instead of temperature changes has caused the shrinkage of the slope glaciers since the late 19th century. No clear warming trend at the elevation of those glaciers occurred between 1948 and 2005. Although air temperatures at that elevation are always below freezing, solar radiation causes melting on vertical faces. Vertical ice margin walls are a unique characteristic of the summit glaciers and a major place of the shrinkage of the glaciers. They manifest stratifications, calving, and other ice features. \"There is no pathway for the plateau glaciers other than to continuously retreat once their vertical margins are exposed to solar radiation.\" The Kilimanjaro glaciers have been used for deriving ice core records, including two from the southern icefield. Based on this data, this icefield formed between 1,250 and 1,450 years BP.\n\nAlmost 85 percent of the ice cover on Kilimanjaro disappeared between October 1912 and June 2011, with coverage decreasing from 11.40 square kilometres (4.40 sq mi) to 1.76 square kilometres (0.68 sq mi).: 423  Between 1912 and 1953, there was about a 1.1 percent average annual loss of ice coverage. The average annual loss for 1953 to 1989 was 1.4 percent, while the loss rate for 1989 to 2007 was 2.5 percent. Of the ice cover still present in 2000, almost 40 percent had disappeared by 2011.: 425  Ice climber Will Gadd noticed differences between his 2014 and 2020 climbs. The glaciers are thinning in addition to losing areal coverage, and do not have active accumulation zones; retreat occurs on all glacier surfaces. Loss of glacier mass is caused by both melting and sublimation. While the current shrinking and thinning of Kilimanjaro's ice fields appears to be unique within its almost twelve millennium history, it is contemporaneous with widespread glacier retreat in mid-to-low latitudes across the globe. In 2013 it was estimated that, at the current rate of global warming, most of the ice on Kilimanjaro will disappear by 2040 and \"it is highly unlikely that any ice body will remain after 2060\".: 430 A complete disappearance of the ice would be of only \"negligible importance\" to the water budget of the area around the mountain. The forests of Kilimanjaro, far below the ice fields, \"are [the] essential water reservoirs for the local and regional populations\".\n\n\n=== Drainage ===\n\nKilimanjaro is drained by a network of rivers and streams, especially on the wetter and more heavily eroded southern side and especially above 1,200 metres (3,900 ft). Below that altitude, increased evaporation and human water usage reduces the waterflows. The Lumi and Pangani rivers drain Kilimanjaro on the eastern and southern sides, respectively.\n\n\n== Human history ==\n\n\n=== African culture ===\nKilimanjaro is attested to in numerous stories by the peoples who live in East Africa. The Chagga, who traditionally lived on the southern and eastern slopes of the mountain, tell how a man named Tone once provoked a god, Ruwa, to bring famine upon the land. The people became angry at Tone, forcing him to flee. Nobody wanted to protect him but a solitary dweller who had stones that turned miraculously into cattle. The dweller bid that Tone never open the stable of the cattle. When Tone did not heed the warning and the cattle escaped, Tone followed them, but the fleeing cattle threw up hills to run on, including Mawenzi and Kibo. Tone finally collapsed on Kibo, ending the pursuit.Another Chagga legend tells of ivory-filled graves of elephants on the mountain, and of a cow named Rayli that produces miraculous fat from her tail glands. If a man tries to steal such a gland but is too slow in his moves, Rayli will blast a powerful snort and blow the thief down onto the plain.\n\n\n=== Early records ===\nThe mountain may have been known to non-Africans since antiquity. Sailors' reports recorded by Ptolemy mention a \"moon mountain\" and a spring lake of the Nile, which may indicate Kilimanjaro; although available historical information does not allow differentiation among others in East Africa like Mount Kenya, the mountains of Ethiopia, the Virunga Mountains, the Rwenzori Mountains, and Kilimanjaro. Before Ptolemy, Aeschylus and Herodotus referred to \"Egypt nurtured by the snows\" and to a spring between two mountains, respectively. One of these mentions two tall mountains in the coastal regions with a valley with traces of fire between. Martín Fernández de Enciso, a Spanish traveller to Mombasa who obtained information about the interior from native caravans, said in his Summa de Geografía (1519) that west of Mombasa \"stands the Ethiopian Mount Olympus, which is exceedingly high, and beyond it are the Mountains of the Moon, in which are the sources of the Nile\".: 1–5 : 114 \n\n\n=== European exploration ===\nThe German missionaries Johannes Rebmann of Mombasa and Krapf were the first Europeans known to have attempted to reach the mountain. According to English geographer Halford Mackinder and English explorer Harry Johnston, Rebmann in 1848 was the first European to report the existence of Kilimanjaro. Hans Meyer has claimed that Rebmann first arrived in Africa in 1846 and quotes Rebmann's diary entry of 11 May 1848 as saying, This morning, at 10 o'clock, we obtained a clearer view of the mountains of Jagga, the summit of one of which was covered by what looked like a beautiful white cloud. When I inquired as to the dazzling whiteness, the guide merely called it 'cold' and at once I knew it could be neither more nor less than snow.... Immediately I understood how to interpret the marvelous tales Dr. Krapf and I had heard at the coast, of a vast mountain of gold and silver in the far interior, the approach to which was guarded by evil spirits.: 6 \nIn August 1861, the Prussian officer Baron Karl Klaus von der Decken accompanied by English geologist Richard Thornton made an attempt to climb Kibo but \"got no farther than 2,500 metres (8,200 ft) owing to the inclemency of the weather\".: 9  In December 1862, von der Decken tried a second time together with Otto Kersten, reaching a height of 4,300 metres (14,000 ft).In August 1871, missionary Charles New became the \"first European to reach the equatorial snows\" on Kilimanjaro at an elevation of slightly more than 4,000 metres (13,000 ft).: 11  In June 1887, the Hungarian Count Sámuel Teleki and the Austrian Lieutenant Ludwig von Höhnel made an attempt to climb the mountain. Approaching from the saddle between Mawenzi and Kibo, Höhnel stopped at 4,950 metres (16,240 ft), but Teleki continued until he reached the snow at 5,300 metres (17,400 ft). Later in 1887, the German geology professor Hans Meyer reached the lower edge of the ice cap on Kibo, where he was forced to turn back because he lacked the equipment needed to progress across the ice.: 81  The following year, Meyer planned another attempt with Oscar Baumann, a cartographer, but the mission was aborted after the pair were held hostage and ransomed during the Abushiri Revolt.: 82  In the autumn of 1888, the American naturalist Dr. Abbott and the German explorer Otto Ehrenfried Ehlers approached the summit from the northwest. While Abbott turned back earlier, Ehlers at first claimed to have reached the summit rim, but after severe criticism of the claim, withdrew it.: 17–19 In 1889, Meyer returned to Kilimanjaro with the Austrian mountaineer Ludwig Purtscheller for a third attempt.: 82  This attempt was based on the establishment of several campsites with food supplies so that multiple attempts at the top could be made without having to descend too far.: 82  Meyer and Purtscheller pushed to near the crater rim on 3 October but turned back exhausted from hacking footsteps in the icy slope.: 82  Three days later, they reached the highest summit, on the southern rim of the crater.: 82  They were the first to confirm that Kibo has a crater.: 82  After descending to the saddle between Kibo and Mawenzi, Meyer and Purtscheller attempted to climb the more technically challenging Mawenzi but could only reach the top of Klute Peak, a subsidiary peak, before retreating due to illness.: 84  On 18 October, they reascended Kibo to enter and study the crater, cresting the rim at Hans Meyers Notch.: 84  In total, Meyer and Purtscheller spent 16 days above 4,600 metres (15,000 ft) during their expedition.: 84  They were accompanied in their high camps by Mwini Amani of Pangani, who cooked and supplied the sites with water and firewood.: 135–186 The first ascent of the highest summit of Mawenzi was made on 29 July 1912, by the German climbers Eduard Hans Oehler and Fritz Klute, who named it Hans Meyer Peak. Oehler and Klute went on to make the third-ever ascent of Kibo, via the Drygalski Glacier, and descended via the Western Breach.: 85 In 1989, the organizing committee of the 100-year celebration of the first ascent decided to award posthumous certificates to the African porter-guides who had accompanied Meyer and Purtscheller. One person in pictures or documents of the 1889 expedition was thought to match a living inhabitant of Marangu, Yohani Kinyala Lauwo. Lauwo did not know his own age, nor remember Meyer or Purtscheller. He did recall joining a Kilimanjaro expedition involving a Dutch doctor who lived near the mountain, and that he did not wear shoes during the climb. Lauwo claimed that he had climbed the mountain three times before the beginning of World War I. The committee concluded that he had been a member of Meyer's team and therefore must have been born around 1871. Lauwo died on 10 May 1996, 107 years after the first ascent. It is sometimes suggested that he was a co-first-ascendant of Kilimanjaro.\n\n\n== Fauna and flora ==\n\n\n=== Animals ===\n\nLarge animals are rare on Kilimanjaro and are more frequent in the forests and lower parts of the mountain. Elephants and Cape buffaloes are among the animals that can be potentially hazardous to trekkers. Bushbucks, chameleons, dik-diks, duikers, mongooses, sunbirds, and warthogs have also been reported. Zebras, leopards and hyenas have been observed sporadically on the Shira plateau. Specific species associated with the mountain include the Kilimanjaro shrew and the chameleon Kinyongia tavetana.\n\n\n=== Vegetation ===\n\nNatural forests cover about 1,000 square kilometres (250,000 acres) on Kilimanjaro. In the foothill area maize, beans, sunflowers and, on the western side, wheat are cultivated. Remnants of the former savanna vegetation with Acacia, Combretum, Terminalia and Grewia also occur. Between 1,000 metres (3,300 ft) and 1,800 metres (5,900 ft), coffee also appears as part of the \"Chagga home gardens\" agroforestry. Native vegetation at this altitude range (Strombosia, Newtonia, and Entandrophragma) is limited to inaccessible valleys and gorges and is completely different from vegetation at higher altitudes. On the southern slope montane forests first contain Ocotea usambarensis as well as ferns and epiphytes, farther up in cloud forests Podocarpus latifolius, Hagenia abyssinica and Erica excelsa grow as well as fog-dependent mosses. On the drier northern slopes olive, Croton-Calodendrum, Cassipourea, and Juniperus form forests in order of increasing altitude. Between 3,100 metres (10,200 ft) and 3,900 metres (12,800 ft) lie Erica bush and heathlands, followed by Helichrysum until 4,500 metres (14,800 ft). Neophytes have been observed, including Poa annua.Records from the Maundi crater at 2,780 metres (9,120 ft) indicate that the vegetation of Kilimanjaro has varied over time. Forest vegetation retreated during the Last Glacial Maximum and the ericaceous vegetation belt lowered by 1,500 metres (4,900 ft) between 42,000 and 30,000 years ago because of the drier and colder conditions.The Tussock Grassland is an area on the slopes of Mount Kilimanjaro that contains many unique species of vegetation such as the water holding cabbage.\n\n\n== Climate ==\nThe climate of Kilimanjaro is influenced by the height of the mountain, which allows the simultaneous influence of the equatorial trade winds and the high altitude anti-trades; and by the isolated position of the mountain. Kilimanjaro has daily upslope and nightly downslope winds, a regimen stronger on the southern than the northern side of the mountain. The flatter southern flanks are more extended and affect the atmosphere more strongly.: 3–4 Kilimanjaro has two distinct rainy seasons, one from March to May and another around November. The northern slopes receive much less rainfall than the southern ones. The lower southern slope receives 800 to 900 millimetres (31 to 35 in) annually, rising to 1,500 to 2,000 millimetres (59 to 79 in) at 1,500 metres (4,900 ft) altitude and peaking \"partly over\" 3,000 millimetres (120 in) in the forest belt at 2,000 to 2,300 metres (6,600 to 7,500 ft). In the alpine zone, annual precipitation decreases to 200 millimetres (7.9 in).: 18 The average temperature in the summit area is approximately −7 °C (19 °F). Nighttime surface temperatures on the Northern Ice Field (NIF) fall on average to −9 °C (16 °F) with an average daytime high of −4 °C (25 °F). During nights of extreme radiational cooling, the NIF can cool to as low as −15 to −27 °C (5 to −17 °F).: 674 Snowfall can occur at any time of year but is mostly associated with northern Tanzania's two rainy seasons.: 673  Precipitation in the summit area occurs principally as snow and graupel of 250 to 500 millimetres (9.8 to 19.7 in) per year and ablates within days or years.\n\n\n=== Climatic zones ===\nBushland / Lower Slope:, 800 m – 1,800 m (2,600 ft – 5,900 ft);\nRainforest: 1,800 m – 2,800 m (5,900 ft – 9,200 ft);\nHeather / Moorland: 2,800 m – 4,000 m (9,200 ft – 13,100 ft);\nAlpine Desert: 4,000 m – 5,000 m (13,100 ft– 16,400 ft);\nArctic: 5,000 m – 5,895 m (16,400 ft – 19,300 ft).\n\n\n== Tourism industry ==\n\nKilimanjaro National Park generated US$51 million in revenue in 2013,: 285  the second-most of any Tanzanian national park.: 258  The Tanzania National Parks Authority reported that the park recorded 57,456 tourists during the 2011–12 budget year, of whom 16,425 hiked the mountain; the park's General Management Plan specifies an annual capacity of 28,470. The mountain hikers generated irregular and seasonal jobs for about 11,000 guides, porters, and cooks in 2007. Concerns have been raised about their poor working conditions and inadequate wages of these workers.: 287–291 : 259  \nDue to its popularity as destination, the Tanzanian and Kenyan governments have invested in road infrastructure to improve accessibility to Kilimanjaro National Park. In Tanzania, Kilimanjaro International Airport also serves as an important transportation hub.There are seven official trekking routes by which to ascend and descend Kilimanjaro: Lemosho, Lemosho Western-Breach, Machame, Marangu, Mweka, Rongai, Shira, and Umbwe. The Machame route can be completed in six or seven days, Lemosho in six to eight, and the Northern Circuit routes in seven or more days. The Lemosho Route can also be continued via the Western-Breach, summitting via the western side of the mountain. The Western-Breach is more secluded and avoids the 6-hour midnight ascent to the summit (like other routes). The Rongai is the easiest of the camping routes. The Marangu is also relatively easy, if frequently busy; accommodation is in shared huts. The Lemosho Western-Breach Route commences on the western side of Kilimanjaro at Lemosho and continues to the summit via the Western-Breach Route.\n\n\n=== Climbing records ===\n\nThe oldest person to climb Mount Kilimanjaro is Anne Lorimor, who reached Uhuru Peak 3.14 p.m. local time on 18 July 2019 aged 89 years and 37 days. The oldest man to summit the mountain is the American Robert Wheeler, who was 85 years and 201 days when he summited on 2 October 2014. Maxwell J. Ojerholm of Massachusetts, USA reached Uhuru Peak, the true summit, unassisted at the age of ten years old on July 4, 2009 taking the difficult Machame Route. Colin M. Barker of Missouri, USA, later completed the same route at the age of ten years old on December 22, 2020. Theodore Margaroli from London age 10 reached the summit unassisted by the Western Breach, the hardest but most scenic route in 2019. Despite an age-limit of 10 years for a climbing permit, Keats Boyd from Los Angeles reached the summit on 21 January 2008 at the age of 7. This record was equaled by Montannah Kenney from Texas in March 2018.\nThe fastest ascent and the fastest roundtrip have been recorded by the Swiss-Ecuadorian mountain guide Karl Egloff. On 13 August 2014, after guiding a party to the summit the previous days, he ran from Umbwe Gate to the top in 4 hours and 56 minutes and returned to the Mweka Gate at 1,630 metres (5,350 ft) in a total time of 6 hours, 42 minutes and 24 seconds. Previous records, using the same route, were held by Spanish mountain runner Kílian Jornet (ascent in 5:23:50, roundtrip 7:14 on 29 September 2010) and by Tanzanian guide Simon Mtuy (an unsupported roundtrip in 9:21 on 22 February 2006).The female roundtrip record is held by Fernanda Maciel from Brazil in a time of 10 hours and 6 minutes. Her ascent time of 7:08 was broken on 23 February 2018 by the Danish ultramarathon runner Kristina Schou Madsen with a time of 6:52:54 from Mweka Gate.Several climbs by disabled people have drawn attention. Wheelchair user Bernard Goosen from South Africa scaled Kilimanjaro in six days in 2007. In 2012, Kyle Maynard who has no forearms or lower legs, crawled unassisted to the summit of Mount Kilimanjaro.In 2020, a team featuring two double above-knee amputees, Hari Budha Magar and Justin Oliver Davis, summited Kilimanjaro. It took them six days to cover the 56-kilometre (35 mi) distance to the summit.\n\n\n=== Safety ===\nThough the climb is not technically as challenging as the Himalayas or Andes, the high elevation, low temperature, and occasional high winds can make Kilimanjaro a difficult trek. Acclimatization is required, and even experienced and physically fit trekkers may suffer some degree of altitude sickness. A study of people attempting to reach the summit of Kilimanjaro in July and August 2005 found that 61.3 percent succeeded and 77 percent experienced acute mountain sickness (AMS). A retrospective study of 917 persons who attempted to reach the summit via the Lemosho or Machame routes found that 70.4 percent experienced AMS, defined in this study to be headache, nausea, diarrhea, vomiting, or loss of appetite.Kilimanjaro's summit is well above the altitude at which life-threatening high altitude pulmonary edema (HAPE) or high altitude cerebral edema (HACE), the most severe forms of AMS, can occur. These health risks are increased substantially by excessively fast climbing schedules motivated by high daily national park fees, busy holiday travel schedules, and the lack of permanent shelter on most routes. The six-day Machame route, which involves one day of \"climbing high\" to Lava Tower (15,190 ft) and \"sleeping low\" at Barranco Camp (13,044 ft), may delay the onset of AMS but does not ultimately prevent its occurrence.Falls on steep portions of the mountain and rock slides have killed trekkers. For this reason, the route via the Arrow Glacier was closed for several years, reopening in December 2007. The improper disposal of human waste on the mountain environment has created a health hazard, necessitating the boiling of all water.According to the Kilimanjaro Christian Medical Centre in Moshi, 25 people died from January 1996 to October 2003 while climbing the mountain. Seventeen were female and eight were male, ranging in age from 29 to 74. Fourteen died from advanced high altitude illness, including one with HACE, five with HAPE, and six with both HACE and HAPE. The remaining eleven deaths resulted from \"trauma (3), myocardial infarction (4), pneumonia (2), cardio-pulmonary failure of other underlying cause (1), and acute appendicitis (1). The overall mortality rate was an 13.6 per 100,000 climbers.\"\n\n\t\t\n\t\t\n\t\t\n\n\n== In popular culture ==\nThe Snows of Kilimanjaro is a 1936 short story by Hemingway that references Kilimanjaro. The story was adapted into a film in 1952.\nUnder Kilimanjaro is a non-fiction novel (fictionalized memoir) by Ernest Hemingway about his travels in the region.\nSia Lives on Kilimanjaro is a 1958 children's book by Astrid Lindgren.\nMount Kilimanjaro is featured in The original Lion King,  its sequel, and its reboot.\nMount Kilimanjaro was the namesake for the Kilimanjaro Safaris on Disney's Animal Kingdom.\nMount Kilimanjaro appeared on Kimba the White Lion.\nMount Kilimanjaro appeared near Megatron's camp on Transformers: Dark of the Moon.\nMount Kilimanjaro was featured on documentaries including Wild Africa and Planet Earth.\n\n\n== Special events ==\nAccording to the Tanzania National Parks Authority, the first wedding performed on the mountain below the summit took place on 21 September 2014, when an American couple exchanged vows at Shira 2 Camp. In 2011, a couple had exchanged their vows at the summit.\nOn 26 September 2014, a new world record for the highest-ever cricket match was set when a group of international cricketers played on a flat crater on the mountain at an elevation of 5,730 metres (18,800 ft).\n\n\n== See also ==\nBalletto Glacier\nBarranco Glacier\nCredner Glacier\nFurtwängler Glacier\nGreat Penck Glacier\nList of volcanoes in Tanzania\nLittle Penck Glacier\nRebmann Glacier\nSacred mountains\nSoutheast Africa\n\n\n== References ==\n\n\n== External links ==\n\n\"Kilimanjaro\". Global Volcanism Program. Smithsonian Institution. Retrieved 24 June 2021.\nMount Kilimanjaro National Park\nNASA Earth Explorer page\nWeather forecast for Mount Kilimanjaro (19,565 feet)\nGlacial Recession on Kilimanjaro (pictures of southern icefields)\nMount Kilimanjaro live webcam\nKilimanjaro flora picture gallery\nAerial photographs of Mount Kilimanjaro, 1937–38\nKilimanjaro"