"Arsène Lupin (French pronunciation: ​[aʁsɛn lypɛ̃]) is a fictional gentleman thief and master of disguise created in 1905 by French writer Maurice Leblanc. He was originally called Arsène Lopin, until a local politician of the same name protested. The character was first introduced in a series of short stories serialized in the magazine Je sais tout. The first story, \"The Arrest of Arsène Lupin\", was published on 15 July 1905.\nLupin was featured in 17 novels and 39 novellas by Maurice Leblanc, with the novellas or short stories collected into book form for a total of 24 books. The number becomes 25 if the 1923 novel The Secret Tomb  is counted: Lupin doesn't appear in it, but the main character Dorothée solves one of Arsène Lupin's four fabulous secrets.\nThe character has also appeared in a number of books from other writers as well as numerous film, television, stage play, and comic book adaptations. Five authorized sequels were written in the 1970s by the celebrated mystery writing team of Boileau-Narcejac.\n\n\n== Origin ==\nArsène Lupin is a literary descendant of Pierre Alexis Ponson du Terrail's fictional character Rocambole, whose adventures were published from 1857 to 1870. Like Rocambole, Lupin is often a force for good while operating on the wrong side of the law. Those whom Lupin defeats are worse villains than he is.  Lupin shares similarities with E. W. Hornung's gentleman thief A. J. Raffles, whose stories were published from 1898 to 1909. Both Raffles and Lupin have inspired later characters such as Louis Joseph Vance's The Lone Wolf (created in 1914) and Leslie Charteris's The Saint (created in 1928).\n\n\n== Fantasy elements ==\nSeveral Arsène Lupin novels contain some fantasy elements: a radioactive 'god-stone' that cures people and causes mutations is the object of an epic battle in L’Île aux trente cercueils; the secret of the Fountain of Youth, a mineral water source hidden beneath a lake in the Auvergne, is the goal sought by the protagonists in La Demoiselle aux yeux verts; finally, in La Comtesse de Cagliostro, Lupin's arch-enemy and lover is none other than Joséphine Balsamo, the alleged granddaughter of Cagliostro himself.\n\n\n== Arsène Lupin and Sherlock Holmes ==\n\nLeblanc introduced Sherlock Holmes to Lupin in the short story \"Sherlock Holmes Arrives Too Late\" in Je sais tout No. 17, 15 June 1906. In it, an aged Holmes meets a young Lupin for the first time. After legal objections from Doyle, the name was changed to \"Herlock Sholmes\" when the story was collected in book form in Volume 1.\nSholmes returned in two more stories collected in Volume 2, \"Arsène Lupin contre Herlock Sholmes\", and then in a guest-starring role in the battle for the secret of the Hollow Needle in L'Aiguille creuse. Arsène Lupin contre Herlock Sholmes was published in the United States in 1910 under the title \"The Blonde Lady\" which used the name \"Holmlock Shears\" for Sherlock Holmes, and \"Wilson\" for Watson.\nIn 813, Lupin manages to solve a riddle that Herlock Sholmes was unable to figure out.\nSherlock Holmes, this time with his real name and accompanied by familiar characters such as Watson and Lestrade (all copyright protection having long expired), also confronted Arsène Lupin in the 2008 PC 3D adventure game Sherlock Holmes Versus Arsène Lupin. In this game Holmes (and occasionally others) are attempting to stop Lupin from stealing five valuable British items. Lupin wants to steal the items in order to humiliate Britain, but he also admires Holmes and thus challenges him to try to stop him.\nIn a novella \"The Prisoner of the Tower, or A Short But Beautiful Journey of Three Wise Men\" by Boris Akunin published in 2008 in Russia as the conclusion of \"Jade Rosary Beads\" book, Sherlock Holmes and Erast Fandorin oppose Arsène Lupin on December 31, 1899.\nDue to long-standing copyright issues related to the character of Sherlock Holmes with the estate of Sir Arthur Conan Doyle, the \"Herlock Sholmes\" was used for the character of the same name in the international release of The Great Ace Attorney Chronicles in honour of Leblanc, with the characters of John and Iris Watson having their surnames changed to \"Wilson\".\n\n\n== Bibliography ==\nArsène Lupin, Gentleman Burglar (Arsène Lupin, gentleman cambrioleur, 1907 coll., 9 novellas) (AKA: Exploits of Arsène Lupin, Extraordinary Adventures of Arsène Lupin)\nArsène Lupin vs. Herlock Sholmes (Arsène Lupin contre Herlock Sholmès, 1908 coll., 2 stories) (AKA: The Blonde Lady)\nThe Hollow Needle (L'Aiguille creuse, 1909, novel)\n813 (813, 1910, novel)\nThe Crystal Stopper (Le Bouchon de cristal, 1912, novel)\nThe Confessions of Arsène Lupin (Les Confidences d'Arsène Lupin, 1913 coll., 9 novellas)\nThe Teeth of The Tiger (Les Dents du tigre, 1914, novel) Published in English in 1914, but remained unpublished in French until 1920.\nThe Shell Shard (L'Éclat d'obus, 1916, novel) (AKA: Woman of Mystery) Not originally part of the Arsène Lupin series, Lupin was written into the story in the 1923 edition.\nThe Golden Triangle (Le Triangle d'or, 1918, novel) (AKA: The Return of Arsène Lupin)\nThe Island of Thirty Coffins (L’Île aux trente cercueils, 1919, novel) (AKA: The Secret of Sarek)\nThe Eight Strokes of The Clock (Les Huit Coups de l'horloge, 1922 coll., 8 novellas)\nThe Secret Tomb (Dorothée, Danseuse de Corde, 1923. The main character Dorothée solves one of Arsène Lupin's four fabulous secrets.\nThe Countess of Cagliostro (La Comtesse de Cagliostro, 1924, novel) (AKA: Memoirs of Arsène Lupin) Published in English in 1925.\nThe Overcoat of Arsène Lupin (Le Pardessus d'Arsène Lupin, published in English in 1926) Novella first published in 1924 in France as La Dent d'Hercule Petitgris. Altered into a Lupin story and published in English as The Overcoat of Arsène Lupin in 1926 in The Popular Magazine\nThe Damsel With Green Eyes (La Demoiselle aux yeux verts, 1927, novel) (AKA: The Girl With the Green Eyes, Arsène Lupin, Super Sleuth)\nThe Man with the Goatskin (L'Homme à la peau de bique (1927, novella)\nThe Barnett & Co. Agency (L'Agence Barnett et Cie., 1928 coll., 8 novellas) (AKA: Jim Barnett Intervenes, Arsène Lupin Intervenes) The English edition includes The Bridge That Broke story, which was unpublished in France at the time.\nThe Mysterious Mansion (La Demeure mystérieuse, 1929, novel) (AKA: The Melamare Mystery)\nThe Emerald Cabochon (Le Cabochon d'émeraude (1930, novella)\nThe Mystery of The Green Ruby (La Barre-y-va, 1931, novel)\nThe Woman With Two Smiles (La Femme aux deux sourires, 1933, novel) (AKA: The Double Smile)\nVictor of the Vice Squad (Victor de la Brigade mondaine, 1933, novel) (AKA: The Return of Arsène Lupin)\nThe Revenge of The Countess of Cagliostro (La Cagliostro se venge, 1935, novel)\nThe Billions of Arsène Lupin (Les Milliards d'Arsène Lupin, 1939/1941, novel) - The official last book of the series, The Billions of Arsène Lupin, was serialised in 1939 and published posthumously as a book in 1941 - yet without the ninth chapter \"The Safe\" (\"IX. Les coffres-forts\"). This edition was later withdrawn at the request of Leblanc's son. In 2002, through the efforts of some Lupinians and Korean translator Seong Gwi-Soo, the missing chapter was restored and the complete final Lupin novel published in Korea by Kachi Publishing House. A complete French e-book is now also available, as well as a printed edition by Editions Manucius (2015).\nThe Last Love of Arsène Lupin (Le Dernier Amour d'Arsène Lupin, novel), written around 1936 and posthumously published in 2012 after being found by chance in 2011 \"on top of a cupboard in a beige shirt with rusty hooks\" by Florence Boespflug-Leblanc.\n\n\n=== Plays written by Leblanc ===\nArsène Lupin Originally a 4-part play written by Maurice Leblanc and Francis de Croisset (1908), it was subsequently novelized by Edgar Jepson and published in 1909 by Doubleday as \"Arsène Lupin: By Edgar Jepson\"\nAn Adventure of Arsène Lupin (1911)\nThe Return of Arsène Lupin (1920) Written by Maurice Leblanc and Francis de Croisset.\nThis Woman is Mine (Cette femme est à moi, (1930)\nA Quarter-hour with Arsène Lupin (Un quart d'heure avec Arsène Lupin, 1932)\n\n\n== Stories by other writers ==\n\"The Adventure of Mona Lisa\" by Carolyn Wells in The Century (January, 1912), a short parody featuring an \"International Society of Infallible Detectives\" with Sherlock Holmes as the president and Arsène Lupin, The Thinking Machine, Monsieur Lecoq, A. J. Raffles, C. Auguste Dupin and Luther Trant as the other members.\nSure Way to Catch Every Criminal. Ha! Ha! by Carolyn Wells in The Century (July, 1912)\nThe Adventure of the Clothes-Line by Carolyn Wells in The Century (May, 1915)\nThe Silver Hair Crime (= Clue?) by Nick Carter in New Magnet Library No. 1282 (1930)\nŌgon-kamen (The Golden Mask) by Edogawa Rampo (1930). Here Rampo's recurring private sleuth Kogoro Akechi would match wits with Lupin, where the thief plays a central role as the Golden Mask.\nLa Clé est sous le paillasson by Marcel Aymé (1934)\nGaspard Zemba who appears in The Shadow Magazine (December 1, 1935) by Walter B. Gibson\nArsène Lupin vs. Colonel Linnaus by Anthony Boucher in Ellery Queen's Mystery Magazine Vo. 5, No. 19 (1944)\nL’Affaire Oliveira by Thomas Narcejac in Confidences dans ma nuit (1946)\nLe Gentleman en Noir by Claude Ferny (c. 1950) (two novels)\nInternational Investigators, Inc. by Edward G. Ashton in Ellery Queen’s Mystery Magazine (February 1952)\nLe Secret des rois de France ou La Véritable identité d’Arsène Lupin by Valère Catogan (1955)\nIn Compartment 813 by Arthur Porges in Ellery Queen’s Mystery Magazine (June 1966)\nLe Secret d’Eunerville (1973) by the writing duo Boileau-Narcejac\nLa Poudrière (1974) by the writing duo Boileau-Narcejac\nLe Second visage d’Arsène Lupin (1975) by the writing duo Boileau-Narcejac\nLa Justice d’Arsène Lupin (1977) by the writing duo Boileau-Narcejac\nLe Serment d’Arsène Lupin (1979) by the writing duo Boileau-Narcejac\nArsène Lupin, gentleman de la nuit by Jean-Claude Lamy (1983)\nVarious stories in the Tales of the Shadowmen anthology series, ed. by Jean-Marc Lofficier and Randy Lofficier, Black Coat Press (2005-ongoing)\nPřípad Grendwal (A Grendwal Case), a play by Pavel Dostál, Czech playwright and Minister of Culture\nArsène Lupin et le mystère d'Arsonval by Michel Zink\nQui fait peur à Virginia Woolf ? (... Élémentaire mon cher Lupin !) by Gabriel Thoveron\nCrimes parfaits by Christian Poslaniec\nLa Dent de Jane by Daniel Salmon (2001)\nLes Lupins de Vincent by Caroline Cayol et Didier Cayol (2006)\nCode Lupin by Michel Bussi (2006)\nThe Prisoner of the Tower, or A Short But Beautiful Journey of Three Wise Men (Узница башни, или Краткий, но прекрасный путь трёх мудрых) by Boris Akunin in a selection of stories The Jade Beads (Нефритовые чётки) (2006, in Russian). Arsène Lupin appears in this novella with Sherlock Holmes, Dr. Watson, and Akunin's own characters Erast Fandorin and Masa, the Japanese. The story is dedicated to Sir Arthur Conan Doyle and Maurice Leblanc.\nL'Église creuse by Patrick Genevaux (2009) (short story)\nThe Many Faces of Arsène Lupin collection of short stories edited by Jean-Marc Lofficier & Randy Lofficier (Black Coat Press, 2012)\nSherlock, Lupin et Moi, a children's book series written by Italian author Alessandro Gatti, where Irene Adler tells the adventures that she, Sherlock Holmes and Arsène Lupin had when they were kids. The books are written under the pseudonym Irene Adler. Five books have been published so far : Le Mystère de la Dame en Noir, Dernier Acte à l'Opéra, L'Énigme de la Rose Écarlate, La Cathédrale de la Peur, and LeChâteau de Glace.\n\n\n== In other media ==\n\n\n=== Films ===\nThe Gentleman Burglar (B&W., US, 1908) with William Ranows (Lupin).\nArsène Lupin contra Sherlock Holmes (B&W., Germany, 1910) with Paul Otto (Lupin).\nArsène Lupin (B&W., France, 1914) with Georges Tréville (Lupin).\nThe Gentleman Burglar (B&W., US, 1915) with William Stowell (Lupin).\nArsène Lupin (B&W., UK, 1916) with Gerald Ames (Lupin).\nArsène Lupin (B&W., US, 1917) with Earle Williams (Lupin).\nThe Teeth of the Tiger (B&W., US, 1919) with David Powell (Lupin).\n813 (B&W., US, 1920) with Wedgwood Nowell (Lupin) and Wallace Beery.\nLes Dernières aventures d'Arsène Lupin (B&W., France/Hungary, 1921).\n813 - Rupimono (B&W., Japan, 1923) with Minami Mitsuaki (Lupin).\nArsène Lupin (B&W., US, 1932) with John Barrymore (Lupin).\nArsene Lupin, Detective (Arsène Lupin détective, B&W., France, 1937) with Jules Berry (Lupin).\nArsène Lupin Returns (B&W., US, 1938) with Melvyn Douglas (Lupin).\nEnter Arsène Lupin (B&W., US, 1944) with Charles Korvin (Lupin).\nArsenio Lupin (B&W., Mexico, 1945) with R. Pereda (Lupin).\nNanatsu-no Houseki (B&W., Japan, 1950) with Keiji Sada (Lupin).\nTora no-Kiba (B&W., Japan, 1951) with Ken Uehara (Lupin).\nKao-no Nai Otoko (B&W., Japan, 1955) with Eiji Okada (Lupin).\nThe Adventures of Arsène Lupin (Les Aventures d'Arsène Lupin, col., France, 1957) with Robert Lamoureux (Lupin).\nSigné Arsène Lupin (B&W., France, 1959) with Robert Lamoureux (Lupin).\nArsène Lupin contre Arsène Lupin (B&W., France, 1962) with Jean-Pierre Cassel and Jean-Claude Brialy (Lupins).\nKaitō Lupin: 813 no Nazo (col., Japan, 1979) with Katsuo Nakamura (Lupin).\nLupin tai Holmes (col., Japan, 1981) with Taichirou Hirokawa (Lupin).\nArsène Lupin (col., France, 2004) with Romain Duris (Lupin).\nLupin no Kiganjo (col., Japan, 2011) with Kōichi Yamadera (Lupin).\n\n\n=== Television ===\nLupin III Part I (1971) Based on Monkey Punch Manga Lupin III.  Story centering around Arsène Lupin III\nArsène Lupin, 26 60-minute episodes (1971, 1973–1974) with Georges Descrières (Lupin)\nL'Île aux trente cercueils, six 60-minute episodes (1979) The character of Lupin, who only appears at the end of the novel, was removed entirely.\nArsène Lupin joue et perd, six 52-minute episodes (1980) loosely based on 813 with Jean-Claude Brialy (Lupin).\nLe Retour d'Arsène Lupin, twelve 90-minute episodes (1989–1990) and Les Nouveaux Exploits d'Arsène Lupin, eight 90-minute episodes (1995–1996) with François Dunoyer (Lupin).\nLes Exploits d'Arsène Lupin (also known as Night Hood), 26 episodes for 24 min. (1996), produced by Cinar & France-Animation, with Luis de Cespedes (Lupin).\nLupin, Philippine series (2007) with Richard Gutierrez (Lupin).\nThe 2014 movie Kamen Rider × Kamen Rider Drive & Gaim: Movie War Full Throttle features a character based on Lupin named Kamen Rider Lupin.\nCode: Realize ~Guardian of Rebirth~, anime television series (2017) based on the video game, produced by the studio M.S.C, with Tomoaki Maeno and J. Michael Tatum (Lupin in Japanese and English, respectively).\nThe 2018 42nd Season Super Sentai series Kaitou Sentai Lupinranger VS Keisatsu Sentai Patranger features two teams, one of which is the Lupinrangers. Consisting of three members,  they are recruited by Kogure, Arsène's butler, and executor of  Arsène Lupin's will, to retrieve the Lupin Collection, Arsène's personal collection of the most dangerous artifacts he ever stole, with the understanding that if they collect them all, they will be granted a single wish, to retrieve the people they care most about from the clutches of the Gangler. Later on they are joined by part-time Phantom Thief Noel Takao, the adopted son of Arsène Lupin, who seeks to destroy the Don of the Gangler, and bring together all the pieces of the collection to bring his father back, since when the Ganglers broke in they murdered Arsène and stole most of the pieces.\nThe 2019 Girls X Heroine Series Secret × Heroine Phantomirage! features playing card suits and phantom thief which is the Phantomirage's main motifs.\nThe 2021 Netflix series Lupin stars Omar Sy as Assane Diop, a professional thief inspired by Arsène Lupin who seeks revenge on a wealthy family who framed his father for a crime he didn't commit. The show has been renewed for a 2nd season.\n\n\n=== Stage ===\n Arsène Lupin by Francis de Croisset and Maurice Leblanc. Four-act play first performed on October 28, 1908, at the Athenée in Paris.\nArsène Lupin contre Herlock Sholmès by Victor Darlay & Henry de Gorsse. Four-act play first performed on October 10, 1910, at the Théâtre du Châtelet in Paris. (American edition ISBN 1-932983-16-3)\nLe Retour d'Arsène Lupin by Francis de Croisset and Maurice Leblanc. One-act play first performed on September 16, 1911, at the Théâtre de la Cigale in Paris.\nArsène Lupin, Banquier by Yves Mirande & Albert Willemetz, libretto by Marcel Lattès. Three-act operetta, first performed on May 7, 1930, at the Théâtre des Bouffes Parisiennes in Paris.\nA/L The Youth of Phantom Thief Lupin by Yoshimasa Saitou . Takarazuka Revue performance, 2007, starring Yūga Yamato and Hana Hizuki.\nRupan －ARSÈNE LUPIN－ by Haruhiko Masatsuka . Takarazuka Revue performance, 2013, starring Masaki Ryū and Reika Manaki (after Le Dernier Amour d'Arsène Lupin)\n\n\n=== Comics ===\nArsène Lupin, written by Georges Cheylard, art by Bourdin. Daily strip published in France-Soir in 1948–49.\nArsène Lupin, written & drawn by Jacques Blondeau. 575 daily strips published in Le Parisien Libéré from 1956 to 1958.\nArsène Lupin contre Herlock Sholmès: La Dame blonde, written by Joëlle Gilles, art by Gilles & B. Cado, published by the authors, 1983.\nArsène Lupin, written by André-Paul Duchateau, artist Géron, published by C. Lefrancq.\nLe Bouchon de cristal (1989)\n813 — La Double Vie d'Arsène Lupin (1990)\n813 — Les Trois crimes d'Arsène Lupin (1991)\nLa Demoiselle aux yeux verts (1992)\nL'Aiguille creuse (1994)\nLupin the Third is a Japanese manga series written and illustrated by Monkey Punch that follows the escapades of master thief Arsène Lupin III, the grandson of Arsène Lupin.\nIn Alan Moore's The League of Extraordinary Gentlemen: Black Dossier, Lupin is featured as a member of Les Hommes Mysterieux, the French analogue of Britain's League of Extraordinary Gentlemen.\nThe manga series Soul Eater features a thief character named Lupin in chapter three, which is an obvious reference to Arsène Lupin.\nThere is a  manga adaptation of Arsène Lupin first published in 2011, from Gundam artist Takashi Morita.\n\n\n=== Video games ===\nSherlock Holmes Versus Arsène Lupin (known in North America and some parts of England as Sherlock Holmes: Nemesis) is an adventure game for Windows-compatible computers. It was developed by the game development studio Frogwares, and released in October, 2007. The game follows Holmes and Watson as Holmes is challenged by the legendary gentleman thief Arsène Lupin, who threatens to steal England's most-prized treasures.\nPersona 5 and Persona 5 Royal feature beings known as Personas that are the manifestation of their owners' rebellious spirit and are inspired by fictional characters and mythological beings. The protagonist utilizes Arsène as his initial persona and also resides in the attic of a café named Leblanc, a reference to Maurice Leblanc. Similarly to Arsène, the protagonist is also a phantom thief who fights for good on the wrong side of the law. In Royal, new Personas are available for the main cast, and the protagonist gains access to a different version of the Arsène Persona (through DLC) named Raoul, based on one of Lupin's most common aliases.\nCode: Realize ~Guardian of Rebirth~, an otome game for the PlayStation Vita, features several fictional characters as potential romantic interests for the player character. The main male character is a gentleman thief named Arsène Lupin.\n\n\n== References ==\n\n\n== External links ==\nA collection of Arsène Lupin eBooks at Standard Ebooks\nArsène Lupin eBooks at Project Gutenberg\nWorks by or about Arsène Lupin at Internet Archive\nWorks by Maurice Leblanc at LibriVox (public domain audiobooks) \nArsène Lupin at Cool French Comics"