"Transient global amnesia (TGA) is a neurological disorder whose key defining characteristic is a temporary but almost total disruption of short-term memory with a range of problems accessing older memories. A person in a state of TGA exhibits no other signs of impaired cognitive functioning but recalls only the last few moments of consciousness, as well as possibly a few deeply encoded facts of the individual's past, such as their childhood, family, or home perhaps.Both TGA and anterograde amnesia deal with disruptions of short-term memory. However, a TGA episode generally lasts no more than 2 to 8 hours before the patient returns to normal with the ability to form new memories. A patient with anterograde amnesia may not be able to form new memories indefinitely.\n\n\n== Signs and symptoms ==\nA person having an attack of TGA has almost no capacity to establish new memories, but generally appears otherwise mentally alert and lucid, possessing full knowledge of self-identity and identity of close family, and maintaining  intact perceptual skills and a wide repertoire of complex learned behavior. The individual simply cannot recall anything that happened outside the last few minutes, while memory for more temporally distant events may or may not be largely intact. The degree of amnesia is profound, and, in the interval during which the individual is aware of his or her condition, is often accompanied by anxiety.\nThe diagnostic criteria for TGA, as defined for purposes of clinical research, include:\nThe attack was witnessed by a capable observer and reported as being a definite loss of recent memory (anterograde amnesia).\nThere was an absence of clouding of consciousness or other cognitive impairment other than amnesia.\nThere were no focal neurological signs or deficits during or after the attack.\nThere were no features of epilepsy, or active epilepsy in the past two years, and the patient did not have any recent head injury.\nThe attack resolved within 24 hours.\n\n\n=== Progression of a TGA event ===\nThis onset of TGA is generally fairly rapid, and its duration varies but generally lasts between 2 and 8 hours. A person experiencing TGA typically has memory only of the past few minutes or less, and cannot retain new information beyond that period of time. One of its bizarre features is perseveration, in which the victim of an attack faithfully and methodically repeats statements or questions, complete with profoundly identical intonation and gestures \"as if a fragment of a sound track is being repeatedly rerun.\" This is found in almost all TGA attacks and is sometimes considered a defining characteristic of the condition. The individual experiencing TGA retains social skills and older significant memories, almost always including knowing his or her own identity and the identity of family members, and the ability to perform various complex learned tasks including driving and other learned behavior; one individual \"was able to continue putting together the alternator of his car.\" Though outwardly appearing to be normal, a person with TGA is disoriented in time and space, perhaps knowing neither the year nor where they reside. Although confusion is sometimes reported,  others consider this an imprecise observation, but an elevated emotional state (compared to patients experiencing Transient Ischemic Attack, or TIA) is common. In a large survey, 11% of individuals in a TGA state were described as exhibiting \"emotionalism\" and 14% \"fear of dying\". The attack lessens over a period of hours, with older memories returning first, and the repetitive fugue slowly lengthening so that the victim retains short-term memory for longer periods. While seemingly back to normal within 24 hours, there are subtle effects on memory that can persist longer. In the majority of cases there are no long-term effects other than a complete lack of recall for this period of the attack and an hour or two before its onset.\nThere is emerging evidence for observable impairments in a minority of cases weeks or even years following a TGA attack.There is also evidence that the victim is aware that something is not quite right, even though they can't pinpoint it. Persons suffering from the attack may vocalize signs that 'they just lost their memory', or that they believed they had a stroke, although they aren't aware of the other signs that they are displaying. The main sign of this condition is the repetitive actions of something that is not usually repeated.\n\n\n== Causes ==\nThe underlying cause of TGA remains enigmatic. \nThe leading hypotheses are some form of epileptic event, a problem with blood circulation around, to or from the brain, or some kind of migraine-like phenomenon.\nThe differences are sufficiently meaningful that transient amnesia may be considered a heterogeneous clinical syndrome with multiple etiologies, corresponding mechanisms, and differing prognoses.\n\n\n=== Precipitating events ===\nTGA attacks are associated with some form of precipitating event in at least one-third of cases. The most commonly cited precipitating events include vigorous exercise (including sexual intercourse), swimming in cold water or enduring other temperature changes, and emotionally traumatic or stressful events. There are reports of TGA-like conditions following certain medical procedures and disease states.  One study reports two cases of familial incidence (in which two members of the same family experienced TGA), out of 114 cases considered. This indicates the possibility that there could be a slight familial incidence.\nIf the definition of a precipitating event is widened to include events days or weeks earlier, and to take in emotionally stressful burdens such as money worries, attending a funeral or exhaustion due to overwork or unusual childcare responsibilities, a large majority, over 80%, of TGA attacks are said to correlate with precipitating events.The role of psychological co-factors has been addressed by some research. It is the case that people in a state of TGA exhibit measurably elevated levels of anxiety and/or depression. Emotional instability may leave some people vulnerable to stressful triggers and thus be associated with TGA. Individuals who have experienced TGA, compared with similar people with TIA, are more likely to have some kind of emotional problem (such as depression or phobias) in their personal or family history or to have experienced some kind of phobic or emotionally challenging precipitating event.\n\n\n=== Vascular hypotheses ===\nCerebral ischemia is a frequently disputed possible cause, at least for some segment of the TGA population, and until the 1990s it was generally thought that TGA was a variant of transient ischemic attack (TIA) secondary to some form of cerebrovascular disease. Those who argue against a vascular cause point to evidence that those experiencing TGA are no more likely than the general population to have subsequent cerebral vascular disease. In fact, \"in comparison with TIA patients, TGA patients had a significantly lower risk of combined stroke, myocardial infarct, and death.\"Other vascular origins remain a possibility, however, according to research of jugular vein valve insufficiency in patients with TGA. In these cases TGA has followed vigorous exertion. One current hypothesis is that TGA may be due to venous congestion of the brain, leading to ischemia of structures involved with memory, such as the hippocampus.  It has been shown that performing a Valsalva maneuver (involving \"bearing down\" and increasing breath pressure against a closed glottis, which occurs frequently during exertion) may be related to retrograde flow of blood in the jugular vein, and therefore, presumably, cerebral blood circulation, in patients with TGA.\n\n\n=== Migraine ===\nA history of migraine is a statistically significant risk factor identified in the medical literature. \"When comparing TGA patients with normal control subjects… the only factor significantly associated with an increased risk for TGA was migraine.\" Fourteen percent of people with TGA had a history of migraine in one study, and approximately a third of the participants in another clinical study reported such a history.However, migraine does not appear to occur simultaneously with TGA nor serve as a precipitating event. Headache frequently occurs during TGA, as does nausea, both symptoms often associated with migraine, but it appears that these do not indicate migraine in patients during a TGA event. The connection remains conceptual, and muddied further by a lack of consensus about the definition of migraine itself, and by the differences in age, gender, and psychological characteristics of migraine sufferers when compared to those variables in the TGA cohort.\n\n\n=== Epilepsy ===\nAmnesia is often a symptom in epilepsy, and for that reason people with known epilepsy are disqualified from most studies of TGA.  In a study where strict criteria were applied to TGA diagnosis, no epileptic features were seen in EEGs of over 100 patients with TGA. However, despite the fact that EEG readings are usually normal during a TGA attack, and other usual symptoms of epilepsy are not observed with TGA, it has been speculated that some initial epileptic attacks present as TGA. The observation that 7% of people who experience TGA will develop epilepsy calls into question whether those case are, in fact, TGA or transient epileptic amnesia (TEA). TEA attacks tend to be short (under one hour) and tend to recur, so that a person who has experienced both repeated attacks of temporary amnesia resembling TGA and if those events lasted less than one hour is very likely to develop epilepsy.There is additional speculation that atypical cases of TEA in the form of nonconvulsive status epilepticus may present with duration similar to TGA. This may constitute a distinct subgroup of TGA.\nTEA, as opposed to \"pure\" TGA, is also characterized by \"two unusual forms of memory deficit …: (i) accelerated long-term forgetting (ALF): the excessively rapid loss of newly acquired memories over a period of days or weeks and (ii) remote autobiographical memory loss: a loss of memories for salient, personally experienced events of the past few decades.\"Whether an amnestic event is TGA or TEA thus presents a diagnostic challenge, especially in light of the recently published descriptions of possible long-term cognitive deficits with (presumably correctly diagnosed) TGA.\n\n\n=== Other putative associations ===\nThere have been assertions of a possible link between TGA and the use of statins (a class of drug used in treating cholesterol).\nEn bloc memory loss which is total, permanent, and irrecoverable can occur as an alcoholic \"black out,\" usually lasting longer than an hour and up to 2–5 days.\nMarijuana intoxication, Halogenated hydroxyquinolines such as Clioquinol, PDE inhibitors such as sildenafil, Digitalis and scopolamine intoxication, and general anaesthesia have been reported with TGA.\n\n\n== Diagnosis ==\n\n\n=== Differential diagnosis ===\nA differential diagnosis should include:\nThrombosis of the basilar artery\nCardioembolic stroke\nComplex partial seizures\nFrontal lobe epilepsy\nLacunar syndromes\nMigraine variants\nPosterior cerebral artery stroke\nSyncope and related paroxysmal spells\nTemporal lobe epilepsyIf the event lasts less than one hour, transient epileptic amnesia (TEA) might be implicated.If the condition lasts longer than 24 hours, it is not considered TGA by definition.  A diagnostic investigation would then probably focus on some form of undetected ischemic attack or cranial bleed.\n\n\n== Prognosis ==\nThe prognosis of \"pure\" TGA is very good. It does not affect mortality or morbidity and unlike earlier understanding of the condition, TGA is not a risk factor for stroke or ischemic disease. Rates of recurrence are variously reported, with one systematic calculation suggesting the rate is under 6% per year.  TGA \"is universally felt to be a benign condition which requires no further treatment other than reassurance to the patient and his or her family.\" \n\"The most important part of management after diagnosis is looking after the psychological needs of the patient and his or her relatives. Seeing a once competent and healthy partner, sibling or parent become incapable of remembering what was said only a minute ago is very distressing, and hence it is often the relatives who will require reassurance.\"TGA may have multiple etiologies and prognoses. Atypical presentations may masquerade as epilepsy and be more properly considered TEA. In addition to such probable TEA cases, some people experiencing amnestic events diverging from the diagnostic criteria articulated above may have a less benign prognosis than those with \"pure\" TGA.Recently, moreover, both imaging and neurocognitive testing studies question whether TGA is as benign as has been thought.  MRI scans of the brain in one study showed that among people who had experienced TGA, all had cavities in the hippocampus, and these cavities were far more numerous, larger, and more suggestive of pathological damage than in either healthy controls or a large control group of people with tumor or stroke. Verbal and cognitive impairments have been observed days after TGA attacks, of such severity that the researchers estimated the effects would be unlikely to resolve within a short time frame. A large neurocognitive study of patients more than a year after their attack has shown persistent effects consistent with amnestic mild cognitive impairment (MCI-a) in a third of the people who had experienced TGA. In another study, \"selective cognitive dysfunctions after the clinical recovery\" were observed, suggesting a prefrontal impairment. These dysfunctions  may not be in memory per se but in retrieval, in which speed of access is part of the problem among people who have had TGA and experience ongoing memory problems.\n\n\n== Epidemiology ==\nThe estimated annual incidence of TGA varies from a minimum of 2.9 cases per 100,000 population (in Spain) and 5.2 per 100,000 (in the US), but among people aged over 50, the rate of TGA incidence is  reported to range from approximately 23 per 100,000 (in a US population) to 32 per 100,000 (in a population in Scandinavia).TGA is most common in people between age 56 and 75, with the average age of a person experiencing TGA being approximately 62.\n\n\n== See also ==\nAmnesia\nDissociative amnesia\n\n\n== References ==\n\n\n== External links =="