"A major (or the key of A) is a major scale based on A, with the pitches A, B, C♯, D, E, F♯, and G♯. Its key signature has three sharps. Its relative minor is F-sharp minor and its parallel minor is A minor. The key of A major is the only key where a Neapolitan sixth chord on \n  \n    \n      \n        \n          \n            \n              2\n              ^\n            \n          \n        \n      \n    \n    {\\displaystyle {\\hat {2}}}\n   requires both a flat and a natural accidental.\nThe A major scale is:\n\nIn the treble, alto, and bass clefs, the G♯ in the key signature is placed higher than C♯. However, in the tenor clef, it would require a ledger line and so G♯ is placed lower than C♯.\n\n\n== History ==\nAlthough not as rare in the symphonic literature as sharper keys, examples of symphonies in A major are not as numerous as for D major or G major. Beethoven's Symphony No. 7, Bruckner's Symphony No. 6 and Mendelssohn's Symphony No. 4 comprise a nearly complete list of symphonies in this key in the Romantic era. Mozart's Clarinet Concerto and Clarinet Quintet are both in A major, along with his 23rd piano concerto, and generally Mozart was more likely to use clarinets in A major than in any other key besides E-flat major. Moreover, the climax part of Tchaikovsky's Violin Concerto is also in A major.\nThe key of A major occurs frequently in chamber music and other music for strings, which favor sharp keys. Franz Schubert's Trout Quintet and Antonín Dvořák's Piano Quintet No. 2 are both in A major. Johannes Brahms, César Franck, and Gabriel Fauré wrote violin sonatas in A major. In connection to Beethoven's Kreutzer Sonata, Peter Cropper said that A major \"is the fullest sounding key for the violin.\"According to Christian Friedrich Daniel Schubart, A major is a key suitable for \"declarations of innocent love, ... hope of seeing one's beloved again when parting; youthful cheerfulness and trust in God.\"For orchestral works in A major, the timpani are typically set to A and E a fifth apart, rather than a fourth apart as for most other keys. Hector Berlioz complained about the custom of his day in which timpani tuned to A and E a fifth apart were notated C and G a fourth apart, a custom which survived as late as the music of Franz Berwald.\n\n\n== Notable compositions in A major ==\n\n\n== See also ==\nMajor and minor\nChord (music)\nChord names and symbols (popular music)\n\n\n== References ==\n\n\n== External links ==\n Media related to A major at Wikimedia Commons"