"Sparta (Doric Greek: Σπάρτα, Spártā; Attic Greek: Σπάρτη, Spártē) was a prominent city-state in Laconia, in ancient Greece. In antiquity, the city-state was known as Lacedaemon (Λακεδαίμων, Lakedaímōn), while the name Sparta referred to its main settlement on the banks of the Eurotas River in Laconia, in south-eastern Peloponnese. Around 650 BCE, it rose to become the dominant military land-power in ancient Greece.\nGiven its military pre-eminence, Sparta was recognized as the leading force of the unified Greek military during the Greco-Persian Wars, in rivalry with the rising naval power of Athens. Sparta was the principal enemy of Athens during the Peloponnesian War (between 431 and 404 BCE), from which it emerged victorious. The decisive Battle of Leuctra in 371 BCE ended the Spartan hegemony, although the city-state maintained its political independence until the Roman conquest of Greece in 146 BCE. After the division of the Roman Empire, Sparta underwent a long period of decline, especially in the Middle Ages, when many of its citizens moved to Mystras. Modern Sparta is the capital of the southern Greek region of Laconia and a center for processing citrus and olives.\nSparta was unique in ancient Greece for its social system and constitution, which were supposedly introduced by the semi-mythical legislator Lycurgus. His laws configured the Spartan society to maximize military proficiency at all costs, focusing all social institutions on military training and physical development. The inhabitants of Sparta were stratified as Spartiates (citizens with full rights), mothakes (free non-Spartiate people descended from Spartans), perioikoi (free non-Spartiates), and helots (state-owned enslaved non-Spartan locals). Spartiate men underwent the rigorous agoge training regimen, and Spartan phalanx brigades were widely considered to be among the best in battle. Spartan women enjoyed considerably more rights than elsewhere in classical antiquity.\n\nSparta was frequently a subject of fascination in its own day, as well as in Western culture following the revival of classical learning. The admiration of Sparta is known as laconophilia. Bertrand Russell wrote:Sparta had a double effect on Greek thought: through the reality, and through the myth.... The reality enabled the Spartans to defeat Athens in war; the myth influenced Plato's political theory, and that of countless subsequent writers.... [The] ideals that it favors had a great part in framing the doctrines of Rousseau, Nietzsche, and National Socialism."