"A chicken nugget is a food product consisting of a small piece of deboned chicken meat that is breaded or battered, then deep-fried or baked. Invented in the 1950s, chicken nuggets have become a very popular fast food restaurant item, as well as widely sold frozen for home use.\n\n\n== History ==\nThe chicken nugget was invented in the 1950s by Robert C. Baker, a food science professor at Cornell University, and published as unpatented academic work. This bite-sized piece of chicken, coated in batter and then deep fried, was called the \"Chicken Crispie\" by Baker and his associates. Two problems the meat industry was facing at the time were being able to clump ground meat without a skin and producing a batter coating that could be both deep fried and frozen without becoming detached. Baker's innovations solved these problems and made it possible to form chicken nuggets in any shape by first coating the meat in vinegar, salt, grains, and milk powder to make it hold together and then using an egg and grain based batter that could be fried as well as frozen.\n\n\n== Nutritional information ==\nChicken nuggets are generally regarded as a fatty, unhealthy food. A study published in the American Journal of Medicine analyzed the composition of chicken nuggets from two American fast food chains. It found that less than half of the material was skeletal muscle, with fat occurring in an equal or greater proportion. Other components included epithelial tissue, bone, nervous tissue and connective tissue. The authors concluded that \"Chicken nuggets are mostly fat, and their name is a misnomer.\"\n\n\n== Manufacturing ==\n\nThe processing required for making chicken nuggets begins with deboning. The chicken is cut and shaped to the correct size. This is done either manually, or by a series of automatic blades, or by a process called grinding (a method of deboning in which the softer parts of the chicken carcass are forced through a mesh, leaving behind the more solid pieces, resulting in a meat paste. If used, this paste is then shaped before battering). The pieces are battered and breaded in a large cylindrical drum that rotates, evenly coating all of the pieces in the desired spices and breading. The pieces are then fried in oil until the batter has set and the outside reaches the desired color. Finally, the nuggets are packaged, frozen and stored for shipping. While specific ingredients and production methods may vary between manufacturers, the above practices hold true for most of the industry.\n\n\n== In popular culture ==\nChicken nuggets have been the subject of food challenges, social media phenomena, and many more forms of public notoriety. The dish has inspired gourmet restaurants, exercise routines, and even feature-length productions, including Cooties, a movie about a grade school child whom eats a chicken nugget infected with a virus in which turns prepubescent children into zombies. Thomas Welborn holds the world record for eating the most chicken nuggets in three minutes (746 grams, or approximately 42 chicken nuggets).On Twitter, the most retweeted tweet of 2017 was made by Carter Wilkerson who asked Wendy's what it would take for them to offer him a year of free nuggets. The tweet generated over 3.5 million retweets.The largest recorded chicken nugget weighed 51.1 pounds (23.2 kg) and was 3.25 feet (0.99 m) long and 2 feet (0.61 m) wide and was created by Empire Kosher. It was unveiled at Kosherfest in Secaucus, New Jersey on October 29, 2013.\n\n\n== Alternatives ==\nSome fast food restaurants have launched vegetarian alternatives. McDonald's served Garden McNuggets made of beans and Swedish fast food restaurant Max Hamburgare offers a dish containing nuggets made of falafel. Quorn also supplies vegetarian chicken-like nuggets derived from fungus.\n\n\n== See also ==\n\nChicken fingers\nFried chicken\n\n\n== References ==\n\n\n== External links ==\n\"Why Chicken Nugget Demand Is Flat\". YouTube. CNBC. March 20, 2019."