"Biology appears in fiction, especially but not only in science fiction, both in the shape of real aspects of the science, used as themes or plot devices, and in the form of fictional elements, whether fictional extensions or applications of biological theory, or through the invention of fictional organisms. Major aspects of biology found in fiction include evolution, disease, genetics, physiology, parasitism and symbiosis (mutualism), ethology, and ecology.\nSpeculative evolution enables authors with sufficient skill to create what the critic Helen N. Parker calls biological parables, illuminating the human condition from an alien viewpoint. Fictional alien animals and plants, especially humanoids, have frequently been created simply to provide entertaining monsters. Zoologists such as Sam Levin have argued that, driven by natural selection on other planets, aliens might indeed tend to resemble humans to some extent.\nMajor themes of science fiction include messages of optimism or pessimism; Helen N. Parker has noted that in biological fiction, pessimism is by far the dominant outlook. Early works such as H. G. Wells's novels explored the grim consequences of Darwinian evolution, ruthless competition, and the dark side of human nature; Aldous Huxley's Brave New World was similarly gloomy about the effects of genetic engineering.\nFictional biology, too, has enabled major science fiction authors like Stanley Weinbaum, Isaac Asimov, John Brunner, and Ursula Le Guin to create what Parker called biological parables, with convincing portrayals of alien worlds able to support deep analogies with Earth and humanity.\n\n\n== Aspects of biology ==\nAspects of biology found in fiction include evolution, disease, ecology, ethology, genetics, physiology, parasitism, and mutualism (symbiosis).\n\n\n=== Evolution ===\n\nEvolution, including speculative evolution, has been an important theme in fiction since the late 19th century. It began, however, before Charles Darwin's time, and reflects progressionist and Lamarckist views (as in Camille Flammarion's 1887 Lumen) as well as Darwin's. Darwinian evolution is pervasive in literature, whether taken optimistically in terms of how humanity may evolve towards perfection, or pessimistically in terms of the dire consequences of the interaction of human nature and the struggle for survival. Other themes include the replacement of humanity, either by other species or by intelligent machines.\n\n\n=== Disease ===\n\nDiseases, both real and fictional, play a significant role in both literary and science fiction, some like Huntington's disease and tuberculosis appearing in many books and films. Pandemic plagues threatening all human life, such as The Andromeda Strain, are among the many fictional diseases described in literature and film. Science fiction takes an interest, too, in imagined advances in medicine. The Economist suggests that the abundance of apocalyptic fiction describing the \"near annihilation or total extinction of the human race\" by threats including deadly viruses rises when general \"fear and unease\", as measured by the Doomsday Clock, increase.Tuberculosis was a common disease in the 19th century. In Russian literature, it appeared in several major works. Fyodor Dostoevsky used the theme of the consumptive nihilist repeatedly, with Katerina Ivanovna in Crime and Punishment; Kirillov in The Possessed, and both Ippolit and Marie in The Idiot. Turgenev did the same with Bazarov in Father and Sons. In English literature of the Victorian era, major tuberculosis novels include Charles Dickens's 1848 Dombey and Son, Elizabeth Gaskell's 1855 North and South, and Mrs. Humphry Ward's 1900 Eleanor.\n\n\n=== Genetics ===\n\nAspects of genetics including mutation or hybridisation,  cloning (as in Brave New World), genetic engineering, and eugenics have appeared in fiction since the 19th century. Genetics is a young science, having started in 1900 with the rediscovery of Gregor Mendel's study on the inheritance of traits in pea plants. During the 20th century it developed to create new sciences and technologies including molecular biology, DNA sequencing, cloning, and genetic engineering. The ethical implications of modifying humans (and all their descendants) were brought into focus with the eugenics movement. Since then, many science fiction novels and films have used aspects of genetics as plot devices, often taking one of two routes: a genetic accident with disastrous consequences; or, the feasibility and desirability of a planned genetic alteration. The treatment of science in these stories has been uneven and often unrealistic. The 1997 film Gattaca did attempt to portray science accurately but was criticised by scientists. Michael Crichton's 1990 novel Jurassic Park portrayed the cloning of whole dinosaur genomes from fossil remains of species extinct for millions of years, and their use to recreate living animals, using what was then known of genetics and molecular biology to create an \"entertaining\" and \"thought-provoking\" story.\n\nThe lack of scientific understanding of genetics in the 19th century did not prevent science fiction works such as Mary Shelley's 1818 novel Frankenstein and H. G. Wells's  1896 The Island of Dr Moreau from exploring themes of biological experiment, mutation, and hybridisation, with their disastrous consequences, asking serious questions about the nature of humanity and responsibility for science.\n\n\n=== Physiology ===\nThe creation scene in James Whale's 1931 film Frankenstein makes use of electricity to bring the monster to life. Shelley's idea of reanimation through electric shock was based on the physiology experiments of Luigi Galvani, who noted that a shock made the leg of a dead frog twitch. Electric shock is now routinely used in pacemakers, maintaining heart rhythm, and defibrillators, restoring heart rhythm.The ability to produce electricity is central to Naomi Alderman's 2016 science fiction novel\nThe Power. In the book, women develop the ability to release electrical jolts from their fingers, powerful enough to stun or kill. Fish such as the electric eel, Electrophorus electricus, create powerful electric fields with modified muscles, stacked end-to-end as cells in a battery, and the novel indeed references such fish and the electricity generated in striated muscle.\n\n\n=== Parasitism ===\n\nParasites appear frequently in fiction, from ancient times onwards as seen in mythical figures like the blood-drinking Lilith, with a flowering in the nineteenth century. These include intentionally disgusting alien monsters in science fiction films, though these are sometimes less \"horrible\" than real examples in nature. Authors and scriptwriters have to some extent exploited parasite biology: lifestyles including parasitoid, behaviour-altering parasite, brood parasite, parasitic castrator, and many forms of vampire are found in books and films.\nSome fictional parasites, like the deadly parasitoid Xenomorphs in Alien, have become well known in their own right. Terrifying monsters are clearly alluring: writer Matt Kaplan notes that they induce signs of stress including raised heart rate and sweating, but people continue indulging in such works. Kaplan compares this to the \"masochism\" of liking very hot spicy foods, which induce mouth burns, sweating, and tears. The psychologist Paul Rozin suggests that there is a pleasure in seeing one's own body react as if to stress while knowing that no real harm will result.\n\n\n=== Symbiosis ===\n\nSymbiosis (mutualism) appears in fiction, especially science fiction, as a plot device. It is distinguished from parasitism in fiction, a similar theme, by the mutual benefit to the organisms involved, whereas the parasite inflicts harm on its host. Fictional symbionts often confer special powers on their hosts. After the Second World War, science fiction moved towards more mutualistic relationships, as in Ted White's 1970 By Furies Possessed, which viewed aliens positively. In The Phantom Menace, Qui-Gon Jinn says microscopic lifeforms called midi-chlorians, inside all living cells, allow characters with enough of these symbionts in their cells to feel and use the Force.\n\n\n=== Ethology ===\n\nEthology, the study of animal behaviour, appears in the wildlife scientist Delia Owens's 2018 novel Where the Crawdads Sing. The protagonist, Kya, is abandoned by her parents at age six, and grows up alone in a North Carolina swamp, learning camouflage and how to hunt from the animals there. The local townspeople call her \"the marsh girl\". She reads about ethology including an article entitled \"Sneaky Fuckers\", using her knowledge to navigate the tricks and dating rituals of the local boys; and she compares herself to a female firefly, who uses her coded flashing light signal to lure a male of another species to his death, or a female mantis, who starts eating her mate's head and thorax while his abdomen is still copulating with her. \"Female insects, Kya thought, know how to deal with their lovers.\"\n\n\n=== Ecology ===\nEcology, the study of the relationships between organisms and their environment, appears in fiction in novels such as Frank Herbert's 1965 Dune, Kim Stanley Robinson's 1992 Red Mars, and Margaret Atwood's 2013 MaddAddam. Dune brought ecology centre stage, with a whole planet struggling with its environment. Its lifeforms included giant sandworms for whom water is fatal and mouse-like animals able to survive in the planet's desert conditions. The book was influential on the environmental movement of the time.In the 1970s, the impact of human activity on the environment stimulated a new kind of writing, ecofiction. It has two branches: stories about human impact on nature; and stories about nature (rather than humans). It encompasses books written in styles from modernism to magical realism, and in genres from mainstream to romance and speculative fiction. A 1978 anthology of ecofiction includes 19th and 20th century works by authors as diverse as Ray Bradbury, John Steinbeck, Edgar Allan Poe, Daphne du Maurier, E. B. White, Kurt Vonnegut Jr., Frank Herbert, H. H. Munro, J. G. Ballard, and Isaac Asimov.\n\n\n=== Fictional organisms ===\n\nFiction, especially science fiction, has created large numbers of fictional species, both alien and terrestrial. One branch of fiction, speculative evolution or speculative biology, consists specifically of the design of imaginary organisms in particular scenarios; this is sometimes informed by precise science.\n\n\n== Functions ==\nFictional biology serves a variety of function in film and literature, including the supply of suitably terrifying monsters, the communication of an author's worldview, and the creation of aliens for  biological parables to illuminate what it is to be human. Real biology, such as of infectious diseases, equally provides a variety of contexts, from personal to highly dystopian, that can be exploited in fiction.\n\n\n=== Monsters and aliens ===\n\nA common use of fictional biology in science fiction is to provide plausible alien species, sometimes simply as terrifying subjects, but sometimes for more reflective purposes. Alien species include H. G. Wells's Martians in his 1898 novel The War of the Worlds, the bug-eyed monsters of early 20th century science fiction, fearsome parasitoids, and a variety of giant insects, especially in early 20th century big bug movies.Humanoid (roughly human-shaped) aliens are common in science fiction. One reason is that authors use the only example of intelligent life that they know: humans. The zoologist Sam Levin points out that aliens might indeed tend to resemble humans, driven by natural selection. Luis Villazon points out that animals that move necessarily have a front and a back; as with bilaterian animals on Earth, sense organs tend to gather at the front as they encounter stimuli there, forming a head. Legs reduce friction, and with legs, bilateral symmetry makes coordination easier. Sentient organisms will, Villazon argues, likely use tools, in which case they need hands and at least two other limbs to stand on. In short, a generally humanoid shape is likely, though octopus- or starfish-like bodies are also possible.Many fictional plants were created in the 20th century, including John Wyndham's venomous, walking, carnivorous triffids. in his 1951 novel The Day of the Triffids, The idea of plants that could attack an incautious traveller began in the late 19th century; the potatoes in Samuel Butler's Erewhon had \"low cunning\". Early tales included Phil Robinson's 1881 The Man-Eating Tree with its gigantic flytraps, Frank Aubrey's 1897 The Devil Tree of El Dorado, and Fred White's 1899 Purple Terror. Algernon Blackwood's 1907 story \"The Willows\" powerfully tells of malevolent trees that manipulate people's minds.\n\n\t\t\n\t\t\n\t\t\n\n\n=== Optimism and pessimism ===\n\nA major theme of science fiction and of speculative biology is to convey a message of optimism or pessimism according to the author's worldview. Whereas optimistic visions of technological progress are common enough in hard science fiction, pessimistic views of the future of humanity are far more usual in fiction based on biology.A rare optimistic note is struck by the evolutionary biologist J. B. S. Haldane in his tale, The Last Judgement, in the 1927 collection Possible Worlds. Both Arthur C. Clarke's 1953 Childhood's End and Brian Aldiss's 1959 Galaxies Like Grains of Sand, too, optimistically imagine that humans will evolve godlike mental capacities.The grim possibilities of Darwinian evolution with its ruthless \"survival of the fittest\" has been explored repeatedly from the beginnings of science fiction, as in H. G. Wells's novels The Time Machine (1895), The Island of Dr Moreau (1896), and The War of the Worlds (1898); these all pessimistically explore the possible dire consequences of the darker sides of human nature in the struggle for survival. Aldous Huxley's 1931 novel Brave New World is similarly gloomy about the oppressive consequences of advances in genetic engineering applied to human reproduction.\n\n\n=== Biological parables ===\n\nThe literary critic Helen N. Parker suggested in 1977 that speculative biology could serve as biological parables which throw light on the human condition. Such a parable brings aliens and humans into contact, allowing the author to view humanity from an alien perspective. She noted that the difficulty of doing this at length meant that only a few major authors had attempted it, naming Stanley Weinbaum, Isaac Asimov, John Brunner, and Ursula Le Guin. In her view, all four had impressively full characterizations of alien beings. Weinbaum had created a \"bizarre assortment\" of intelligent beings, unlike Brunner's crablike but extinct Draconians.  What united all four writers, she argued, was that the novels centred on the interactions between aliens and humans, creating deep analogies between the two kinds of life and from there commenting on humanity now and in the future. Weinbaum's 1934 A Martian Odyssey explored the question of how aliens and humans could communicate, given that their thought processes were utterly different.\nAsimov's 1972 The Gods Themselves both makes the aliens major characters, and explores parallel universes.\nBrunner's 1974 Total Eclipse creates a whole alien world, extrapolated from terrestrial threats.In her 1969 The Left Hand of Darkness, Le Guin presents her vision of a universe of planets all inhabited by \"men\", descendants from the planet Hain. In the book, the ambassador Genly Ai from the civilised Ekumen worlds visits the \"backward- and inward-looking\" people of Gethen, only to end up in danger, from which he escapes by crossing the polar ice cap on a desperate but well-planned expedition with an exiled Gethenian Lord Chancellor, Estraven. They are ambisexual with no fixed gender, and go through periods of oestrus, called \"kemmer\", at which point an individual comes temporarily to function as either a male or a female, depending on whether they first encounter a male- or female-functioning partner during their period of kemmer. The invented biology reflects and exemplifies, according to Parker, the opposing but united dualities of Taoism such as light and darkness, maleness and femaleness, yin and yang. So too do the opposed characters of Genly Ai with his carefully objective reports, and of Estraven with his or her highly personal diary, as the story unfolds, illuminating humanity through adventure and science fiction strangeness.\n\n\n=== Structure and themes ===\n\nModern novels sometimes make use of biology to provide structure and themes. Thomas Mann's 1912 Death in Venice relates the feelings of the protagonist to the progress of an epidemic of cholera, which eventually kills him.Richard Flanagan's 2001 novel Gould's Book of Fish, which makes use of the illustrations from artist and convict William Buelow Gould's book of 26 paintings of fish for chapter headings and as the inspiration for the various characters in the novel.\n\n\n== Realism ==\nThe geneticist Dan Koboldt observes that the science in science fiction is often oversimplified, reinforcing popular myths to the point of \"pure fiction\". In his own field, he gives as examples the idea that first-degree relatives have the same hair, eyes and nose as each other, and that a person's future is predicted by their genetic code, as (he states) in Gattaca. Koboldt points out that eye colour changes as children grow up: adults with green or brown eyes often had blue eyes as babies; that brown-eyed parents can have children with blue eyes, \"and vice versa\"; and that the brown pigment melanin is controlled by around 10 different genes, so inheritance is along a spectrum rather than being a blue/brown switch. Other authors in his edited collection Putting the Science in Fiction point out a wide variety of errors in the portrayal of other biological sciences.\n\n\n== References ==\n\n\n== Sources ==\nKoboldt, Dan, ed. (16 October 2018). Putting the Science in Fiction. Writer's Digest Books. ISBN 978-1-4403-5338-3.\nParker, Helen N. (1977). Biological Themes in Modern Science Fiction. UMI Research Press. ISBN 978-0835715775."