"Maria Wisława Anna Szymborska (Polish: [viˈswava ʂɨmˈbɔrska]; 2 July 1923 – 1 February 2012) was a Polish poet, essayist, translator and recipient of the 1996 Nobel Prize in Literature. Born in Prowent, which has since become part of Kórnik, she later resided in Kraków until the end of her life. In Poland, Szymborska's books have reached sales rivaling prominent prose authors', though she wrote in a poem, \"Some Like Poetry\" (\"Niektórzy lubią poezję\"), that \"perhaps\" two in a thousand people like poetry.Szymborska was awarded the 1996 Nobel Prize in Literature \"for poetry that with ironic precision allows the historical and biological context to come to light in fragments of human reality\". She became better known internationally as a result. Her work has been translated into English and many European languages, as well as into Arabic, Hebrew, Japanese, Persian and Chinese.\n\n\n== Life ==\n\nWisława Szymborska was born on 2 July 1923 in Prowent, Poland (now part of Kórnik, Poland), the second daughter of Wincenty Szymborski and Anna (née Rottermund) Szymborska. Her father was at that time the steward of Count Władysław Zamoyski, a Polish patriot and charitable patron. After Zamoyski's death in 1924, her family moved to Toruń, and in 1931 to Kraków, where she lived and worked until her death in early 2012.When World War II broke out in 1939, she continued her education in underground classes. From 1943, she worked as a railroad employee and managed to avoid being deported to Germany as a forced labourer. During this time, her career as an artist began, with illustrations for an English-language textbook. She also began writing stories and occasional poems. In 1945, she began studying Polish literature before switching to sociology at Jagiellonian University in Kraków. There, she became involved in the local writing scene, and met and was influenced by Czesław Miłosz. In March 1945, she published her first poem, \"Szukam słowa\" (\"Looking for words\"), in the daily newspaper Dziennik Polski. Her poems continued to be published in various newspapers and periodicals for a number of years. In 1948, she quit her studies without a degree, due to poor financial circumstances; the same year, she married poet Adam Włodek, whom she divorced in 1954. They remained close until Włodek's death in 1986. Their union was childless. Around the time of her marriage, she was working as a secretary for an educational biweekly magazine as well as an illustrator. Her first book was to be published in 1949, but did not pass censorship as it \"did not meet socialist requirements\".\nSzymborska adhered to the People's Republic of Poland's (PRL) official ideology early in her career, signing an infamous 1953 political petition condemning Polish priests accused of treason in a show trial. Her early work supported socialist themes, as seen in her debut collection Dlatego żyjemy (That is what we are living for), containing the poems \"Lenin\" and \"Młodzieży budującej Nową Hutę\" (\"For the Youth who are building Nowa Huta\"), about the construction of a Stalinist industrial town near Kraków. She became a member of the ruling Polish United Workers' Party.\nAlthough initially close to the official party line, as the Polish Communist Party shifted from the Stalinist communists to \"national\" communists, Szymborska grew estranged from socialist ideology and renounced her earlier political work. Although she did not officially leave the Communist party until 1966, she began to establish contacts with dissidents. As early as 1957, she befriended Jerzy Giedroyc, the editor of the influential Paris-based émigré journal Kultura, to which she contributed. In 1964, she opposed a Communist-backed protest to The Times against independent intellectuals, demanding freedom of speech instead.In 1953, Szymborska joined the staff of the literary review magazine Życie Literackie (Literary Life), where she continued to work until 1981 and from 1968 had a book review column, Lektury Nadobowiązkowe. Many of her essays from this period were later published in book form. From 1981 to 1983, she was an editor of the Kraków-based monthly periodical NaGlos (OutLoud). In the 1980s, she intensified her oppositional activities, contributing to the samizdat periodical Arka under the pseudonym \"Stańczykówna\", as well as to Kultura. In the early 1990s, with a poem published in Gazeta Wyborcza, she supported the vote of no confidence in the first non-Communist government that brought former Communists back to power. The last collection published while Szymborska was still alive, Dwukropek, was chosen as the best book of 2006 by readers of Poland's Gazeta Wyborcza. She also translated French literature into Polish, in particular Baroque poetry and the works of Agrippa d'Aubigné, a Huguenot soldier-poet during the French Wars of Religion . In Germany, Szymborska is closely associated with her translator Karl Dedecius, who did much to popularize her works there.\n\n\n== Death and last works ==\nSurrounded by friends and relatives, Szymborska died peacefully of lung cancer in her sleep at home in Kraków in 2012, aged 88. She was working on new poetry at the time of her death, but was unable to arrange her final poems for publication in the way she wanted. Her last poetry was published later in 2012. In 2013, the Wisława Szymborska Award was established in honour of her legacy.\n\n\n== Themes ==\nSzymborska frequently employed literary devices such as ironic precision, paradox, contradiction, and understatement to illuminate philosophical themes and obsessions. Many of her poems feature war and terrorism.\nShe wrote from unusual points of view, such as a cat in the newly empty apartment of its dead owner. Her reputation rests on a relatively small body of work, fewer than 350 poems. When asked why she had published so few poems, she said, \"I have a trash can in my home\".\n\n\n== Pop culture ==\nSzymborska's poem \"Nothing Twice\" was set to music by Andrzej Munkowski and performed by Łucja Prus in 1965. Rock singer Kora's cover of \"Nothing Twice\" was a hit in 1994.\nThe poem \"Love at First Sight\" was used in the film Turn Left, Turn Right, starring Takeshi Kaneshiro and Gigi Leung. Krzysztof Kieślowski's film Three Colors: Red was also inspired by \"Love at First Sight\".\nIn her last years, Szymborska collaborated with Polish jazz trumpeter Tomasz Stańko, who dedicated his record Wisława (ECM, 2013) to her memory, taking inspiration from their collaboration and her poetry.Szymborska's poem \"People on the Bridge\" was made into a film by Beata Pozniak. It was shown worldwide and at a New Delhi film festival. As an award, it was screened 36 more times in 18 Indian cities.\n\n\n== Major works ==\n\n1952: Dlatego żyjemy (\"That's Why We Are All Alive\")\n1954: Pytania zadawane sobie (\"Questioning Yourself\")\n1957: Wołanie do Yeti (\"Calling Out to Yeti\")\n1962: Sól (\"Salt\")\n1966: 101 wierszy (\"101 Poems\")\n1967: Sto pociech (\"No End of Fun\")\n1967: Poezje wybrane (\"Selected Poetry\")\n1969: Wszelki wypadek (\"Couldn't Have\")\n1976: Wielka liczba (\"A Large Number\")\n1986: Ludzie na moście (\"People on the Bridge\")\n1989: Poezje: Poems, bilingual Polish-English edition\n1992: Lektury nadobowiązkowe (\"Non-required Reading\")\n1993: Koniec i początek (\"The End and the Beginning\")\n1996: Widok z ziarnkiem piasku (\"View with a Grain of Sand\")\n1997: Sto wierszy – sto pociech (\"100 Poems – 100 Happinesses\")\n2002: Chwila ( \"Moment\")\n2003: Rymowanki dla dużych dzieci (\"Rhymes for Big Kids\")\n2005: Dwukropek (\"Colon\")\n2009: Tutaj (\"Here\")\n2012: Wystarczy (\"Enough\")\n2013: Błysk rewolwru (\"The Glimmer of a Revolver\")\n\n\n== Prizes and awards ==\n\n1954: The City of Kraków Prize for Literature\n1963: The Polish Ministry of Culture Prize\n1974: Knight's Cross of the Order of Polonia Restituta\n1990: Kościelski Award\n1991: Goethe Prize\n1995: Herder Prize\n1995: Honorary Degree of the Adam Mickiewicz University (Poznań)\n1996: The Polish PEN Club prize\n1996: Nobel Prize in Literature\n1996: Person of the Year by Wprost\n1997: Honorary Resident of the Royal Capital City of Kraków\n2005: Gold Medal for Merit to Culture - Gloria Artis\n2011: Order of the White Eagle\n\n\n== Reviews ==\n1998 Boston Review: Poems – New and Collected 1957–1997 by Francis Padorr Brent\n2001 The New Republic: \"Miracle Fair: Selected Poems of Wislawa Szymborska\" by Ruth Franklin\n2006 The Christian Science Monitor: A fascinating journey with two women poets by Elizabeth Lund \n2006 Moondance magazine: Stories/Poems. Plain and Simple. – Mapping the Words of Wislawa Szymborska on Her Latest Book, Monologue of a Dog by Lys Anzia \n2006 Sarmatian Review: Wislawa Szymborska's 'Conversation With a Stone' – An Interpretation by Mary Ann Furno\n2006 Words Without Borders: Monologue of a Dog – New Poems of Wislawa Szymborska by W. Martin\n2015 All roads will lead you home Poetic Alchemy: Wislawa Szymborska’s Map: Collected and Last Poems by Wally Swist [vacpoetry.org/journal/]\n\n\n== See also ==\n\nList of female Nobel laureates\nList of Nobel laureates in Literature\nList of Polish Nobel laureates\nList of Polish-language poets\nWisława Szymborska Award\nPolish Writers on Writing featuring Wislawa Szymborska. Edited by Adam Zagajewski (Trinity University Press, 2007).\n\n\n== References ==\n\n\n== External links ==\n Media related to Wisława Szymborska at Wikimedia Commons\n Quotations related to Wisława Szymborska at Wikiquote\n\nWislawa Szymborska: Including biography and Nobel speech – NobelPrize.org\nWisława Szymborska on Nobelprize.org  including the Nobel Lecture, 7 December 1996 The poet and the world\nList of Works\nWisława Szymborska at Encyclopædia Britannica"