"The Saxons (Latin: Saxones, German: Sachsen, Old English: Seaxan, Old Saxon: Sahson, Low German: Sassen, Dutch: Saksen) were a group of early Germanic peoples whose name was given in the early Middle Ages to a large country (Old Saxony, Latin: Saxonia) near the North Sea coast of northern Germania, what is now Germany. In the late Roman Empire, the name was used to refer to Germanic coastal raiders, and also as a word something like the later \"Viking\". Their origins appear to be mainly somewhere in or near the above-mentioned German North Sea coast where they are found later, in Carolingian times. In Merovingian times, continental Saxons had also been associated with the activity and settlements on the coast of what later became Normandy. Their precise origins are uncertain, and they are sometimes described as fighting inland, coming into conflict with the Franks and Thuringians. There is possibly a single classical reference to a smaller homeland of an early Saxon tribe, but its interpretation is disputed (see below). According to this proposal, the Saxons' earliest area of settlement is believed to have been Northern Albingia. This general area is close to the probable homeland of the Angles.In contrast, the British \"Saxons\", today referred to in English as Anglo-Saxons, became a single nation bringing together Germanic peoples (Frisian, Jutish, Angle) with a small part of the vanquished Romanized Britons, establishing long-lasting post-Roman kingdoms equivalent to those formed by the Franks on the continent. Their earliest weapons and clothing south of the Thames were based on late Roman military fashions, but later immigrants north of the Thames showed a stronger North German influence. The term \"Anglo-Saxon\", combining the names of the Angles and the Saxons, came into use by the 8th century (for example Paul the Deacon) to distinguish the Germanic inhabitants of Britain from continental Saxons (referred to in the Anglo-Saxon Chronicle as Ealdseaxe, 'old Saxons'), but both the Saxons of Britain and those of Old Saxony (Northern Germany) continued to be referred to as 'Saxons' in an indiscriminate manner, especially in the languages of Britain and Ireland.\nWhile the English Saxons were no longer raiders, the political history of the continental Saxons is unclear until the time of the conflict between their semi-legendary hero Widukind and the Frankish emperor Charlemagne. While the continental Saxons are no longer a distinctive ethnic group or country, their name lives on in the names of several regions and states of Germany, including Lower Saxony (which includes central parts of the original Saxon homeland known as Old Saxony), Saxony in Upper Saxony, as well as Saxony-Anhalt (which includes Old, Lower and Upper Saxon regions)."