"The chamois (Rupicapra rupicapra) is a species of goat-antelope native to mountains in Europe, from west to east, including the Cantabrian Mountains, the Pyrenees, the Alps and the Apennines, the Dinarides, the Tatra and the Carpathian Mountains, the Balkan Mountains, the Rila–Rhodope massif, Pindus, the northeastern mountains of Turkey, and the Caucasus. The chamois has also been introduced to the South Island of New Zealand. Some subspecies of chamois are strictly protected in the EU under the European Habitats Directive.\n\n\n== Names ==\n\nThe English name comes from French chamois. The latter is derived from Gaulish camox (attested in Latin, 5th century), itself perhaps borrowing from some Alpine language (Raetic, Ligurian). The Gaulish form also underlies German Gemse, Gams, Gämse, Italian camoscio, Ladin ciamorz.\nThe usual pronunciation for the animal is UK:  or US: , approximating the French pronunciation [ʃamwa]. However, when referring to chamois leather, and in New Zealand often for the animal itself, it is , and sometimes spelt shammy or chamy. The plural of \"chamois\" is spelled the same as the singular, and it may be pronounced with the final \"s\" sounded. However, as with many other quarry species, the plural for the animal is often pronounced the same as the singular.\nThe Dutch name for the chamois is gems, and the male is called a gemsbok. In Afrikaans, the name gemsbok came to refer to a species of Subsaharan antelope of the genus Oryx, and this meaning of \"gemsbok\" has been adopted into English.\n\n\n== Taxonomy ==\nThe chamois (along with sheep and goats) are in the goat-antelope subfamily (Caprinae) of the family Bovidae.\nThere are two species of chamois in the genus Rupicapra:\n\nRupicapra rupicapra\nRupicapra pyrenaicaThe species R. rupicapra  is categorized into seven subspecies:\n\nR. r. asiatica (Anatolian chamois or Turkish chamois): Turkey\nR. r. balcanica (Balkan chamois): Albania, Bosnia and Herzegovina, Bulgaria, Croatia, northern Greece (the Pindus Mountains), North Macedonia, Serbia, Montenegro, and Slovenia (isolated populations)\nR. r. carpatica (Carpathian chamois): Romania\nR. r. cartusiana (Chartreuse chamois): France\nR. r. caucasica (Caucasian chamois): Azerbaijan, Georgia, Russia\nR. r. rupicapra (Alpine chamois): Austria, France, Germany, Italy, Switzerland, Slovenia, Slovakia (Veľká Fatra, Slovak Paradise)\nR. r. tatrica (Tatra chamois): Slovakia (Tatras and Low Tatras) and Poland (Tatras)\n\n\n== Description ==\n\nThe chamois is a very small bovid. A fully grown chamois reaches a height of 70–80 cm (28–31 in) and measures 107–137 cm (42–54 in) (the tail is not generally visible except when mating). Males, which weigh 30–60 kg (66–132 lb), are slightly larger than females, which weigh 25–45 kg (55–99 lb). Both males and females have short, straightish horns which are hooked backwards near the tip, the horn of the male being thicker. In summer, the fur has a rich brown colour which turns to a light grey in winter. Distinct characteristics are white contrasting marks on the sides of the head with pronounced black stripes below the eyes, a white rump and a black stripe along the back.\n\n\n== Biology and behaviour ==\n\nFemale chamois and their young live in herds of up to 15 to 30 individuals; adult males tend to live solitarily for most of the year. During the rut (late November/early December in Europe, May in New Zealand), males engage in fierce battles for the attention of unmated females. An impregnated female undergoes a gestation period of 170 days, after which a single kid is usually born in May or early June.  On rare occasions, twins may be born. If a mother is killed, other females in the herd may try to raise the young. The kid is weaned at six months of age and is fully grown by one year of age. However, the kids do not reach sexual maturity until they are three to four years old, although some females may mate at as early two years old. At sexual maturity, young males are forced out of their mother's herds by dominant males (who sometimes kill them), and then wander somewhat nomadically until they can establish themselves as mature breeding specimens at eight to nine years of age.Chamois eat various types of vegetation, including highland grasses and herbs during the summer and conifers, barks and needles from trees in winter. Primarily diurnal in activity, they often rest around mid-day and may actively forage during moonlit nights.Chamois can reach an age of 22 years in captivity, although the maximum recorded in the wild is from 15 to 17 years of age. Common causes of mortality can include avalanches, epidemics and predation. At present, humans are the main predator of chamois. In the past, the principal predators were Eurasian lynxes, Persian leopards and gray wolves; with some predation possibly by brown bears and golden eagles. Chamois usually use speed and stealthy evasion to escape predators and can run at 50 kilometers per hour (31 mph) and can jump 2 m (6.6 ft) vertically into the air or over a distance of 6 m (20 ft).\n\n\n== Distribution and habitat ==\n\nThe chamois is native to the Pyrenees, the mountains of south and central Europe, Turkey, and the Caucasus. It lives in precipitous, rugged, rocky terrain at moderately high elevations of up to at least 3,600 m (11,800 ft). In Europe, the chamois spends the summer months in alpine meadows above the tree line, but moves to elevations of around 800 m (2,600 ft) to spend the winter in pine-dominated forests.\n\n\n== In New Zealand ==\nAlpine chamois arrived in New Zealand in 1907 as a gift from the Austrian Emperor, Franz Joseph I in exchange for specimens of living ferns, rare birds and lizards. Mr Albert E.L. Bertling, formerly head keeper of the Zoological Society's Gardens, Regents Park, London, accepted an invitation from the New Zealand Government to deliver a consignment of chamois (two bucks and six does) to the colony. They arrived in Wellington, New Zealand, on 23 January 1907, on board the \"SS Turakina\". From Wellington the chamois were transhipped to the \"Manaroa\" and conveyed to Lyttelton, then by rail to Fairlie in South Canterbury and a four-day horse trek to Mount Cook. The first surviving releases were made in the Aoraki / Mount Cook region and these animals gradually spread over much of the South Island.In New Zealand, chamois hunting is unrestricted and even encouraged by the Department of Conservation to limit the animal's impact on New Zealand's native alpine flora.New Zealand chamois tend to weigh about 20% less than European individuals of the same age, suggesting that food supplies may be limited.\n\n\n== Hunting and wildlife management ==\nAs their meat is considered tasty, chamois are popular game animals. Chamois have two traits that are exploited by hunters: the first is that they are most active in the morning and evening when they feed; the second is that they tend to look for danger originating from below, which means that a hunter stalking chamois from above is less likely to be observed and more likely to be successful.The tuft of hair from the back of the neck, the gamsbart (chamois \"beard\"), is traditionally worn as a decoration on hats throughout the alpine countries.\n\n\n== Chamois leather ==\n\nChamois leather, traditionally made from the hide of the chamois, is very smooth and absorbent and is favoured in cleaning, buffing, and polishing because it produces no scratching. Modern chamois leather may be made from chamois hides, but hides of deer or domestic goats or sheep are commonly used.\n\n\n== Chamois fabric ==\nA fabric known as chamois is made variously from cotton flannel, PVA, Viscose, and other materials with similar qualities.  It is napped to produce a plush surface similar to moleskin or chamois leather.\n\n\n== See also ==\nCantabrian chamois\nPyrenean chamois\nTatra chamois\n\n\n== References ==\n\n\n== External links ==\nITIS (Integrated Taxonomic Information System) report for the species Chamois\nNew Zealand Chamois and their distribution in New Zealand\nChamois is the logo for the French ski manufacturer - Duret Archived 6 March 2016 at the Wayback Machine\n Texts on Wikisource:\n\"Chamois\". Encyclopædia Britannica (11th ed.). 1911.\n\"Chamois\". Encyclopedia Americana. 1920."