"Club Basket Bilbao Berri S.A.D., commonly known as Bilbao Basket (pronounced [bilˈβao basˈket]) and as RETAbet Bilbao Basket for sponsorship reasons, is a professional basketball club based in Bilbao, Spain. The team plays in the Liga ACB. Their home arena is the Bilbao Arena, Spain.\n\n\n== History ==\nThe club was founded in 2000 after replacing the former city clubs: Cajabilbao and SD Patronato. After four seasons between LEB and LEB 2, Bilbao promoted to Liga ACB in 2004 by winning by 3–1 to Baloncesto León in the LEB semifinals.\nBilbao spent ten seasons in the top tier of the Spanish basketball becoming finalist of the league in the 2010–11 season, where it lost in the finals to FC Barcelona by 3–0. In 2012, Bilbao played the EuroLeague and it was eliminated in the quarterfinals by CSKA Moscow, who won the series by 3–1.\nThe best era of the club finished in 2013, when it lost the 2013 Eurocup Final at Charleroi against Lokomotiv Kuban.\nOn 17 July 2014, the ACB excluded Bilbao Basket from the Liga ACB due to its financial trouble, but on 8 August, the Association was forced to retire the exclusion and finally Bilbao Basket remained in the Spanish top league.The club played four more seasons in Liga ACB until their relegation on 13 May 2018, after losing against Baskonia the Basque derby by 74–78.\n\n\n== Sponsorship naming ==\nBilbao Basket has had several denominations through the years due to its sponsorship:\n\nLagun Aro Bilbao Basket: 2004–07\niurbentia Bilbao Basket: 2007–09\nBizkaia Bilbao Basket: 2009–11\nGescrap Bizkaia Bilbao Basket: 2011–2012\nUxúe Bilbao Basket: 2012–2013\nDominion Bilbao Basket: 2015–2016\nRETAbet Bilbao Basket: 2016–present\n\n\n== Logos ==\n\n\t\t\n\t\t\n\n\n== Home arenas ==\nPabellón La Casilla: (2000–09)\nBizkaia Arena: (2009–10), occasionally used for home games in 2007 and 2008\nBilbao Arena: (2010–present)\n\n\n== Players ==\n\n\n=== Retired numbers ===\n\n\n=== Current roster ===\n\n\n=== Depth chart ===\n\n\n== Head coaches ==\n\n\n== Season by season ==\n\n\n== Trophies and awards ==\n\n\n=== Trophies ===\nLiga ACB:\nRunners-up (1): 2011\nSupercopa de España:\nRunners-up (1): 2007\nEuroCup Basketball:\nRunners-up (1): 2013\nLEB Oro: (1)\n2004\nCopa Princesa de Asturias:\nRunners-up (2): 2002, 2019\nLEB Plata: (1)\n2002\nCopa LEB Plata: (1)\n2002\n\n\n=== Individual awards ===\nAll-ACB First Team\n\nMarcelo Huertas – 2008\nMarko Todorović – 2015\nÁlex Mumbrú – 2016EuroCup MVP\n\nMarko Banić – 2010All-EuroCup First Team\n\nMarko Banić – 2009, 2010\nKostas Vasileiadis – 2013All-EuroCup Second Team\n\nLamont Hamilton – 2013EuroCup Coach of the Year\n\nFotios Katsikaris – 2013\n\n\n== Notable players ==\n\n\n== Matches against NBA teams ==\n\n\n== Rivalries ==\nBilbao Basket has a strong rivalry with Saski Baskonia. Their games together are called the Basque basketball derby.\n\n\n== Fundación Bilbao Basket ==\nFundación Bilbao Basket is the reserve team of Bilbao Basket. It currently plays in Primera División, the fifth tier of Spanish basketball.\n\n\n=== Season by season ===\n\n\n== References ==\n\n\n== External links ==\nOfficial website\nBilbao Basket at ACB.com (in Spanish)"