"The High Court of Justice in London, known properly as Her Majesty’s High Court of Justice in England, together with the Court of Appeal and the Crown Court, are the Senior Courts of England and Wales. Its name is abbreviated as EWHC for legal citation purposes.\nThe High Court deals at first instance with all high value and high importance civil law (non-criminal) cases, and also has a supervisory jurisdiction over all subordinate courts and tribunals, with a few statutory exceptions, though there are debates as to whether these exceptions are effective.The High Court consists of three divisions: the Queen's Bench Division, the Chancery Division, and the Family Division. Their jurisdictions overlap in some cases, and cases started in one division may be transferred by court order to another where appropriate. The differences of procedure and practice between divisions are partly historical, derived from the separate courts which were merged into the single High Court by the 19th-century Judicature Acts, but are mainly driven by the usual nature of their work, for example, conflicting evidence of fact is quite commonly given in person in the Queen's Bench Division, but evidence by affidavit is more usual in the Chancery Division which is primarily concerned with points of law.\nMost High Court proceedings are heard by a single judge, but certain kinds of proceedings, especially in the Queen's Bench Division, are assigned to a divisional court—a bench of two or more judges. Exceptionally the court may sit with a jury, but in practice normally only in defamation cases or cases against the police. Litigants are normally represented by counsel but may be represented by solicitors qualified to hold a right of audience, or they may act in person.\nIn principle, the High Court is bound by its own previous decisions, but there are conflicting authorities as to what extent this is so. Appeal from the High Court in civil matters normally lies to the Court of Appeal, and thence in cases of importance to the Supreme Court (the House of Lords before 2009); in some cases a \"leapfrog\" appeal may be made directly to the Supreme Court. In criminal matters appeals from the Queen's Bench Divisional Court are made directly to the Supreme Court.\nThe High Court is based at the Royal Courts of Justice on the Strand in the City of Westminster, London. It has district registries across England and Wales and almost all High Court proceedings may be issued and heard at a district registry.\n\n\n== History ==\nThe High Court of Justice was established in 1875 by the Supreme Court of Judicature Act 1873. The Act merged eight existing English courts—the Court of Chancery, the Court of Queen's Bench, the Court of Common Pleas, the Court of Exchequer, the High Court of Admiralty, the Court of Probate, the Court for Divorce and Matrimonial Causes, and the London Court of Bankruptcy—into a new Supreme Court of Judicature (now known as the Senior Courts of England and Wales). The new Supreme Court was divided into the Court of Appeal, which exercised appellate jurisdiction, and the High Court, which exercised original jurisdiction.\nOriginally, the High Court consisted of five divisions—the King’s Bench, Common Pleas, Exchequer, Chancery, and Probate, Divorce and Admiralty divisions. In 1880, the Common Pleas and Exchequer divisions were abolished, leaving three divisions. The Probate, Divorce and Admiralty Division was renamed to the Family Division by the Administration of Justice Act 1970, and its jurisdiction reorganised accordingly.\n\n\n== Divisions ==\nThe High Court is organised into three divisions: the Queen's Bench Division, the Chancery Division, and the Family Division. A list of hearings in the High Court's divisions is published daily.\n\n\n=== Queen's Bench Division ===\n\nThe Queen's Bench Division – or King's Bench Division when the monarch is male – has two roles. It hears a wide range of common law cases and also has special responsibility as a supervisory court. Until 2005, the head of the QBD was the Lord Chief Justice. The post of President of the Queen's Bench Division was created by the Constitutional Reform Act 2005, leaving the Lord Chief Justice as President of the Courts of England and Wales, Head of the Judiciary of England and Wales and Head of Criminal Justice. Sir Igor Judge was the first person to hold this office, appointed in October 2005.The Queen's Bench Division has supervisory jurisdiction over inferior courts, and its Administrative Court is generally the appropriate legal forum where the validity (but, at least in principle, not the merits) of official decisions may be challenged. Generally, unless specific appeal processes are provided, the validity of any decision of a government minister, inferior court, tribunal, local authority or official body may be challenged by someone with sufficient interest by judicial review in the Administrative Court of the Queen's Bench Division. A single judge first decides whether the matter is fit to bring to the court (to filter out frivolous or unarguable cases) and if so the matter is allowed to go forward to a full judicial review hearing with one or more judges.\nIn addition, the Queen's Bench Divisional Court hears appeals on points of law from magistrates' courts and from the Crown Court. These are known as appeals by way of case stated, since the questions of law are considered solely on the basis of the facts found and stated by the authority under review.\nOther specialised courts of the Queen's Bench Division include the Technology and Construction Court, Commercial Court, and the Admiralty Court. The specialised judges and procedures of these courts are tailored to their type of business, but they are not essentially different from any other court of the QBD.\nAppeals from the High Court in civil matters are made to the Court of Appeal (Civil Division); in criminal matters appeal from the Divisional Court is made only to the Supreme Court of the United Kingdom.\n\n\n=== Chancery Division ===\n\nThe Chancery Division (housed in the Rolls Building) deals with business law, trusts law, probate law, insolvency, and land law in relation to issues of equity. It has specialist courts (the Patents Court and the Companies Court) which deal with patents and registered designs and company law matters respectively. All tax appeals are assigned to the Chancery Division. The head of the Chancery Division was known as the Vice-Chancellor until October 2005, when the title was changed by the Constitutional Reform Act 2005 to Chancellor of the High Court. The first Chancellor (and the last Vice-Chancellor) was Sir Andrew Morritt, who retired in 2013 to be succeeded by Sir Terence Etherton. In 2016, Sir Geoffrey Vos succeeded Sir Terence as Chancellor on the latter's appointment as Master of the Rolls. Cases heard before the Chancery Division are reported in the Chancery Division law reports. In practice, there is some overlap of jurisdiction with the QBD.\nFrom October 2015, the Chancery Division and the Commercial Court (England and Wales) have maintained the Financial List for cases which would benefit from being heard by judges with suitable expertise and experience in the financial markets or which raise issues of general importance to the financial markets. The procedure was introduced to enable fast, efficient and high quality dispute resolution of claims related to the financial markets.\n\n\n==== Business and Property Courts ====\nThe formation within the High Court of the Business and Property Courts of England & Wales was announced in March 2017, and launched in London in July 2017. The courts would in future administer the specialist jurisdictions previously administered in the Queen's Bench Division under the names of the Admiralty Court, the Commercial Court, and the Technology and Construction Court, and in the Chancery Division under the lists for Business, Company and Insolvency, Competition, Financial, Intellectual Property, Revenue, and Trusts and Probate. The change was meant to enable judges who have suitable expertise and experience in the specialist business and property jurisdictions to be cross-deployed to sit in the specialist courts, while continuing existing practices for cases that proceed in them.\n\n\n=== Family Division ===\nThe Family Division deals with personal human matters such as divorce, children, probate and medical treatment. Its decisions are often of great importance only to the parties, but may concern life and death and are perhaps inevitably regarded as controversial. For example, it permitted a hospital to separate conjoined twins without the parents' consent. In 2002 it made a landmark judgement in the case of Ms B v An NHS Hospital Trust regarding the right of mentally competent patients to withdraw from life saving treatment. The Family Division exercises jurisdiction to hear all cases relating to children's welfare, and has an exclusive jurisdiction in wardship cases. Its head is the President of the Family Division, currently Sir Andrew McFarlane. High Court Judges of the Family Division sit at the Royal Courts of Justice, Strand, London, while District Judges of the Family Division sit at First Avenue House, Holborn, London.The Family Division is comparatively modern. The Judicature Acts first combined the Court of Probate, the Court for Divorce and Matrimonial Causes and the High Court of Admiralty into the then Probate, Divorce and Admiralty Division of the High Court, or The Court of Wills, Wives & Wrecks, as it was informally called. That was renamed the Family Division in 1971 when the admiralty and contentious probate business were transferred elsewhere.The Family Division has faced criticism by allowing allegedly abusive partners to cross-examine their former partners; a procedure already banned in criminal procedure. Peter Kyle, MP for Hove, claimed this amounted to \"abuse and brutalisation\", and called for the system to be changed. Liz Truss, when she was Lord Chancellor, announced plans to end this practice, and proposals were contained in Clause 47 of the Prisons and Courts Bill before Parliament was prorogued for the 2017 General Election.\n\n\n== Sittings ==\nThe High Court only operates within four traditional periods in the year, known as sittings:\n\nMichaelmas: 1 October to 21 December\nHilary: 11 January to the Wednesday before Easter\nEaster: the second Tuesday after Easter to the Friday before the Spring bank holiday (last Monday in May)\nTrinity: the second Tuesday after the spring holiday to 31 July\n\n\n== Judges ==\n \nThe Justices of Her Majesty's High Court of Justice are informally known as High Court judges, and in judicial matters are formally styled \"The Honourable Mr(s) Justice (Forename) Surname\", abbreviated in writing to \"Surname J\". In court, they are properly addressed as My Lord. Since by convention they are knighted upon appointment, socially they are addressed as Sir Forename or Dame Forename. High Court judges are sometimes referred to as red judges after the colour of their formal robes, in contrast to the junior circuit judges who are referred to as purple judges for the same reason. Masters (also judges in the High Court) are addressed as 'Master' regardless of gender and they wear dark blue gowns with pink tabs echoing the red of the High Court justices' robes. Within the Chancery Division of the High Court, there are also Insolvency and Companies Court judges, who hear the majority of High Court insolvency (both personal and corporate) and company law cases, together with some appeals from the County Court. They too wear dark blue gowns with pink tabs and are addressed as 'Judge' in court.\nJustices of the High Court, Insolvency and Companies Court judges and masters are appointed by the Queen on the recommendation of Judicial Appointments Commission, from qualified lawyers. The Lord Chancellor, and all government ministers, are statutorily required to \"uphold the continued independence of the judiciary\", and both Houses of Parliament have standing orders to similar effect. High Court justices may be removed before their statutory retirement age only by a procedure requiring the approval of both Houses of Parliament.\nIn addition to full High Court justices, other qualified persons such as retired judges, circuit judges from the County Court, and barristers are appointed to sit as deputy judges of the High Court to hear particular cases, and while sitting are addressed as though they were full High Court judges. Occasionally trials in London are conducted by masters, who have almost identical trial jurisdiction to full High Court judges but who do not hear committals to prison, criminal cases, or judicial review and do not travel 'on circuit' to outlying courts.\nHigh Court justices (usually from the Queen's Bench Division) also sit in the Crown Court, which try the more significant criminal cases, but High Court Judges only hear the most serious and important cases, with circuit judges and recorders hearing the majority.\n\n\n== Circuits and district registries ==\n\nHistorically the ultimate source of all justice in England was the monarch. All judges sit in judgment on the monarch's behalf (hence they have the royal coat of arms displayed behind them) and criminal prosecutions are generally made in the monarch's name. Historically, local magnates administered justice in manorial courts and other ways. Inevitably, the justice administered was patchy and appeals were made direct to the monarch. The monarch's travelling representatives (whose primary purpose was tax collection) acted on behalf of the monarch to make the administration of justice more even.\nThe tradition continues of judges travelling around the country in set 'circuits', where they hear cases in the 'district registries' of the High Court. The 'main' High Court (in the City of Westminster, London) is not itself a High Court district registry.The High Court previously divided England and Wales into six circuits namely the Midlands, Northern England, North Eastern England, South Eastern England, Wales (including Cheshire), and Western England. Since 2005, the High Court has used seven circuits, listed below, which are identical to the Crown Court regions.\nLondon, consisting of the Greater London region.\nMidlands, consisting of the East Midlands and West Midlands regions, plus North East Lincolnshire and North Lincolnshire.\nNorth East England, consisting of the North East England and Yorkshire and the Humber regions, minus North East Lincolnshire and North Lincolnshire.\nNorth West England, consisting of the North West England region.\nSouth East England, consisting of the East of England and South East England regions, minus Hampshire and the Isle of Wight.\nSouth West England, consisting of the South West England region, plus Hampshire and the Isle of Wight.\nWales, consisting of all of Wales.\n\n\n== Costs Office ==\nThe Senior Courts Costs Office, which quantifies legal costs pursuant to orders for costs, serves all divisions. Such Costs Office is part of the High Court. Because the Costs Office is part of the High Court, generally all detailed assessment proceedings commenced in the Costs Office are subject to provisional assessment. Exceptions from provisional assessment are detailed assessment proceedings in which the costs claimed are large (greater than £75,000) or in which the potential paying party does not respond to the notice of assessment.  \n\n\n== See also ==\nHigh Court enforcement officer\n\n\n== References ==\n\n\n== Bibliography ==\nWilliams, Glanville Llewellyn; Smith, A. T. H. (27 July 2010). Learning the Law. Sweet & Maxwell. ISBN 978-0-414-04173-8. Retrieved 29 August 2011.\n\n\n== External links ==\nRoyal Courts of Justice"