"The High Court of Justice in London, known properly as Her Majesty’s High Court of Justice in England, together with the Court of Appeal and the Crown Court, are the Senior Courts of England and Wales. Its name is abbreviated as EWHC for legal citation purposes.\nThe High Court deals at first instance with all high value and high importance civil law (non-criminal) cases, and also has a supervisory jurisdiction over all subordinate courts and tribunals, with a few statutory exceptions, though there are debates as to whether these exceptions are effective.The High Court consists of three divisions: the Queen's Bench Division, the Chancery Division, and the Family Division. Their jurisdictions overlap in some cases, and cases started in one division may be transferred by court order to another where appropriate. The differences of procedure and practice between divisions are partly historical, derived from the separate courts which were merged into the single High Court by the 19th-century Judicature Acts, but are mainly driven by the usual nature of their work, for example, conflicting evidence of fact is quite commonly given in person in the Queen's Bench Division, but evidence by affidavit is more usual in the Chancery Division which is primarily concerned with points of law.\nMost High Court proceedings are heard by a single judge, but certain kinds of proceedings, especially in the Queen's Bench Division, are assigned to a divisional court—a bench of two or more judges. Exceptionally the court may sit with a jury, but in practice normally only in defamation cases or cases against the police. Litigants are normally represented by counsel but may be represented by solicitors qualified to hold a right of audience, or they may act in person.\nIn principle, the High Court is bound by its own previous decisions, but there are conflicting authorities as to what extent this is so. Appeal from the High Court in civil matters normally lies to the Court of Appeal, and thence in cases of importance to the Supreme Court (the House of Lords before 2009); in some cases a \"leapfrog\" appeal may be made directly to the Supreme Court. In criminal matters appeals from the Queen's Bench Divisional Court are made directly to the Supreme Court.\nThe High Court is based at the Royal Courts of Justice on the Strand in the City of Westminster, London. It has district registries across England and Wales and almost all High Court proceedings may be issued and heard at a district registry."