"\"Lucy Does a TV Commercial\" is the 30th episode of the 1950s television sitcom I Love Lucy, airing on May 5, 1952. It is considered to be the most famous episode of the show. In 1997, TV Guide ranked it #2 on their list of the \"100 Greatest Episodes of All Time\". In 2009, they ranked it #4 on their list of \"TV's Top 100 Episodes of All Time.\" The initial episode was watched by 68% of the television viewing audience at the time.\n\n\n== Plot ==\nRicky (Desi Arnaz) is given an opportunity to host a television show and is notified that he needs to find a girl to do a commercial spot for one of their sponsors. Lucy (Lucille Ball) begs Ricky to let her do the commercial, but he refuses. Lucy asks Fred (William Frawley) to assist her in a scheme to get Ricky to watch her on television. When Ricky returns home from his band rehearsal, she is behind the TV screen – inside the set's empty body – doing a mock commercial as Johnny, the bellhop of Phillip Morris fame. Ricky, disliking the stunt, goes behind the set and plugs the cord back into its outlet, which sets off a minor explosion behind Lucy. Ricky discovers that she has taken each part of the television set out, piece by piece (rather than sliding the whole chassis out), so that she could fit into the box.\nThe following morning, Lucy avoids Ricky. Ricky asks Fred if he can wait for a telephone call from the girl willing to do the commercial to tell her the time and studio. After Ricky leaves, Lucy tells Fred she will deliver the message instead. When the girl calls, Lucy tells her she is not needed for the commercial and proceeds to takes her place.\nThe director of the commercial (Ross Elliot) explains to Lucy their sales pitch regarding the \"Vitameatavegamin\" health tonic. What both Lucy and the director are unaware of – but what the propman (Jerry Hausner) realizes to his shock – is that the tonic contains 23% alcohol. Lucy begins her first take, taking a sip of the tonic, which tastes terrible, as evidenced by her grimace. After a few more practice runs, Lucy becomes intoxicated and her speech becomes slurred. The director asks the propman to take her to her dressing room to rest until the commercial goes live. When the television show begins, Ricky sings \"El Relicario\", but Lucy comes out from backstage and staggers toward Ricky. She sways, waves to the camera, starts singing along with Ricky, and repeats her sales pitch in the middle of his singing despite Ricky's attempts to keep her off-screen. Ricky desperately carries her off the stage.\n\n\n== Notes ==\nIn later reruns, the scene where Lucy is in a broken television set was edited to remove references to Philip Morris, which was sponsoring I Love Lucy at the time. (The Public Health Cigarette Smoking Act banned tobacco advertisements from broadcast television beginning in 1971.) The DVD release, as well as the colorized episode, restore this.\nThe Vitameatavegamin was originally 11% alcohol, but was increased to 23% on the show. The bottle from which Lucille Ball was at first pouring the tonic, and later drinking from directly, actually contained apple pectin.\nThe character of Ethel (Vivian Vance) is absent from this episode; Fred says that she is visiting her mother.\nThe central sketch was originally created by Red Skelton and had been part of his vaudeville routine since the 1930s. Skelton granted Ball permission to use it in I Love Lucy.\nAs of 2017, the dress Ball wore during the rehearsal scene is owned by actress Laura Dern.\n\n\n== Enduring popularity ==\nThe word \"Vitameatavegamin\" has since become a shorthand for this episode and for the I Love Lucy show in general. In 2011, more than 900 Lucille Ball lookalikes gathered under a \"Vitameatavegamin\" sign to honor Ball's 100th birthday, setting a world record for the most Lucy lookalikes in one place. Also in 2011, a talking Lucy doll was produced which recites lines from this episode.In the April 9, 2020 episode of Will & Grace, Debra Messing recreated the scene.\n\n\n== See also ==\nLucille Ball (2009 statue)\n\n\n== References ==\n\n\n== See also ==\n\"Dinner for One\"\nList of I Love Lucy episodes"