"A Thousand Acres is a 1991 novel by American author Jane Smiley. It won the 1992 Pulitzer Prize for Fiction, the National Book Critics Circle Award for fiction in 1991 and was adapted to a 1997 film of the same name.\nThe novel is a modernized retelling of Shakespeare's King Lear and is set on a thousand-acre (four hundred hectares) farm in Iowa owned by a family of a father and his three daughters. It is told through the point of view of the oldest daughter, Ginny.\n\n\n== Plot summary ==\nLarry Cook is an aging farmer who decides to incorporate his farm, handing complete and joint ownership to his three daughters, Ginny, Rose, and Caroline. When the youngest daughter objects, she is removed from the agreement. This sets off a chain of events that brings dark truths to light and explodes long-suppressed emotions, as the story eventually reveals the long-term sexual abuse of the two eldest daughters that was committed by their father.\nThe plot also focuses on Ginny's troubled marriage, her difficulties in bearing a child and her relationship with her family.\n\n\n== Similarities to King Lear ==\nThere are many similarities between King Lear and A Thousand Acres, including both plot details and character development. For example, some of the names of the main characters in the novel are reminiscent of their Shakespearean counterparts. Larry is Lear, Ginny is Goneril, Rose is Regan, and Caroline is Cordelia. The role of the Cooks' neighbors, Harold Clark and his sons Loren and Jess, also rework the importance of Gloucester, Edgar and Edmund in King Lear.\nThe novel maintains major themes present in Lear, namely: gender roles, appearances vs. reality, generational conflict, hierarchical structures (the Great chain of being), madness, and the powerful force of nature.\n\n\n=== Correspondences between the characters in the novel and in the play ===\nLarry Cook = King Lear\nGinny Cook Smith = Goneril\nRose Cook Lewis = Regan\nCaroline Cook Rasmussen = Cordelia\nFrank Rasmussen = King of France\nTy Smith = Duke of Albany\nPete Lewis = Duke of Cornwall\nJess Clark = Edmund\nHarold Clark = Earl of Gloucester\nLoren Clark = Edgar\nKen La Salle = Kent\nMarv Carson (The Fool)\n\n\n== References ==\n\n\n== External links ==\nJane Smiley discusses A Thousand Acres on the BBC World Book Club\nPhotos of the first edition of A Thousand Acres"