"The Lingones (Gaulish: \"the jumpers\") were a Gallic tribe of the Iron Age and Roman periods. They dwelled in the region surrounding the present-day city of Langres, between the provinces of Gallia Lugdunensis and Gallia Belgica.\n\n\n== Name ==\n\n\n=== Attestations ===\nThey are mentioned as Língōnes (Λίγγωνες) by Polybius (2nd c. BC), Lingones by Caesar (mid-1st c. BC), Pliny (1st c. AD) and Tacitus (early 2nd c. AD), Díngones (Δίγγονες) by Strabo (early 1st c. AD), and as Lóngōnes (Λόγγωνες) by Ptolemy (2nd c. AD).\n\n\n=== Etymology ===\nThe Gaulish ethnonym Lingones literally means 'the jumpers'. It stems from the root ling- ('to jump'), itself from the Proto-Celtic verbal base *leng- ('to jump'; cf. Old Irish lingid 'he jumps'), extended by the suffix -on-es. The name could be interpreted as 'good at jumping (on horseback)', or else as 'the dancers'.The city of Langres, attested ca. 400 AD as civitas Lingonum, is named after the Gallic tribe.\n\n\n== Geography ==\nThe territory of the Lingones was situated on the border separating Gallia Lugdunensis from Gallia Belgica, between the Senones and the Sequani.\n\n\n=== Settlement ===\nTheir capital Andematunnum (present-day Langres, Haute-Marne) is attested from 43 AD on boundary markers (abbreviated as AND). It was built on a Bajocian limestone promontory, overlooking the Marne valley to the east and north, and the Bonnelle valley to the west. Only the southern part, open to the Langres plateau, did not possess natural defences. Archeological evidence have demonstrated a continuity between the La Tène and Roman periods on the site of Langres, and the city of Andematunnum appears to have been built at the turn of the 1st century BC on a previous Gallic settlement. The Roman-era civitas of the Lingones was located at the crossroad of the modern départments of Aube, Haute-Marne, Côte d’Or and Yonne.The Cathedral St-Mammes, built in the Burgundian Romanesque style for the ancient diocese that was referred to as Lingonae (\"of the Lingones\") and rivalled Dijon. Three of its early bishops were martyred by the invasion of the Vandals, about 407.\n\n\n== History ==\nSome of the Lingones migrated across the Alps and settled near the mouth of the Po River in Cisalpine Gaul of northern Italy around 400 BC. These Lingones were part of a wave of Celtic tribes that included the Boii and Senones (Polybius, Histories ii.17). The Lingones may have helped sack Rome in 390 BC.The Gaulish Lingones did not participate in the battles of the Gauls against Caesar. They gained Roman citizenship at the end of the first century AD. They were caught up in the Batavian rebellion (69 AD) described by Tacitus.\nThe strategist Sextus Julius Frontinus, author of the Strategemata, the earliest surviving Roman military textbook, mentions the Lingones among his examples of successful military tactics:\n\nIn the war waged under the auspices of the Emperor Caesar Domitianus Augustus Germanicus and begun by Julius Civilis in Gaul, the very wealthy city of the Lingones, which had revolted to Civilis, feared that it would be plundered by the approaching army of Caesar. But when, contrary to expectation, the inhabitants remained unharmed and lost none of their property, they returned to their loyalty, and handed over to me seventy thousand armed men.\nIn Roman Britain, at least three named cohorts of Lingones, probably subscripted from among the Lingones who had remained in the area of Langres and Dijon are attested in the 2nd and 3rd centuries, from dedicatory inscriptions and stamped tiles. The 1st cohort of Lingones (part-mounted ) is attested at Bremenium, the 2nd cohort of Lingones is attested at Ilkley Roman Fort by their Prefect, and the fourth cohort built part of Hadrian's Wall near Carlisle.\n\n\n== Religion ==\nDuring the Roman period, Mars Cicolluis was the main god of the Lingones.\n\n\n== See also ==\nAncient peoples of Italy\nCelts in the Alps and Po Valley\nLepontii\nPrehistoric Italy\n\n\n== References ==\n\n\n=== Bibliography ===\n\n\n== External links ==\nLivius.org: Lingones\nLivius.org: Lingones in the Batavian revolt\nSecond Cohort of Lingones in Roman Britain\n(in Italian) Lingones in Italy"