"Robert Anson Heinlein (; July 7, 1907 – May 8, 1988) was an American science fiction author, aeronautical engineer, and naval officer. Sometimes called the \"dean of science fiction writers\", he was among the first to emphasize scientific accuracy in his fiction, and was thus a pioneer of the subgenre of hard science fiction. His published works, both fiction and non-fiction, express admiration for competence and emphasize the value of critical thinking. His work continues to have an influence on the science-fiction genre, and on modern culture more generally.\nHeinlein became one of the first American science-fiction writers to break into mainstream magazines such as The Saturday Evening Post in the late 1940s. He was one of the best-selling science-fiction novelists for many decades, and he, Isaac Asimov, and Arthur C. Clarke are often considered the \"Big Three\" of English-language science fiction authors.\n Notable Heinlein works include Stranger in a Strange Land,\nStarship Troopers (which helped mold the space marine and mecha archetypes) and The Moon Is a Harsh Mistress.\n \nHis work sometimes had controversial aspects, such as plural marriage in The Moon is a Harsh Mistress, militarism in Starship Troopers and technologically competent women characters that were formidable, yet often stereotypically feminine – such as Friday.\nA writer also of numerous science-fiction short stories, Heinlein was one of a group of writers who came to prominence under the editorship (1937–1971) of John W. Campbell at Astounding Science Fiction magazine, though Heinlein denied that Campbell influenced his writing to any great degree.\nHeinlein used his science fiction as a way to explore provocative social and political ideas, and to speculate how progress in science and engineering might shape the future of politics, race, religion, and sex.\n \nWithin the framework of his science-fiction stories, Heinlein repeatedly addressed certain social themes: the importance of individual liberty and self-reliance, the nature of sexual relationships, the obligation individuals owe to their societies, the influence of organized religion on culture and government, and the tendency of society to repress nonconformist thought. He also speculated on the influence of space travel on human cultural practices.\nHeinlein was named the first Science Fiction Writers Grand Master in 1974.\n \nFour of his novels won Hugo Awards. In addition, fifty years after publication, seven of his works were awarded \"Retro Hugos\"—awards given retrospectively for works that were published before the Hugo Awards came into existence.\n \nIn his fiction, Heinlein coined terms that have become part of the English language, including grok,\nwaldo and speculative fiction, as well as popularizing existing terms like \"TANSTAAFL\", \"pay it forward\", and \"space marine\". He also anticipated mechanical computer-aided design with \"Drafting Dan\" and described a modern version of a waterbed in his novel Beyond This Horizon.\n \nIn the first chapter of the novel Space Cadet he anticipated the cellular phone, 35 years before Motorola invented the technology.\n  \nSeveral of Heinlein's works have been adapted for film and television."