"Sir Robert Filmer (c. 1588 – 26 May 1653) was an English political theorist who defended the divine right of kings. His best known work, Patriarcha, published posthumously in 1680, was the target of numerous Whig attempts at rebuttal, including Algernon Sidney's Discourses Concerning Government, James Tyrrell's Patriarcha Non Monarcha and John Locke's Two Treatises of Government. Filmer also wrote critiques of Thomas Hobbes, John Milton, Hugo Grotius and Aristotle.\n\n\n== Life ==\nThe eldest child of Sir Edward Filmer and Elizabeth Filmer (née Argall) of East Sutton in Kent, he matriculated at Trinity College, Cambridge, in 1604. He did not take a degree and was admitted to Lincoln's Inn on 24 January 1605. He was called to the bar in 1613, but there is no evidence he practised law. He bought the porter's lodge at Westminster Abbey for use as his town house. On 8 August 1618 he married Anne Heton in St Leonard's Church in London, with their first child baptised in February 1620. On 24 January 1619, King James I knighted Filmer at Newmarket.Filmer's father died in November 1629 and Filmer, as the oldest child, took over his father's manor house and estate. He became a Justice of the Peace and an officer of the county militia in the 1630s. Filmer's eldest son Sir Edward was active in opposing the Long Parliament and Filmer stood surety for £5000 for the release of his friend Sir Roger Twysden, who had been imprisoned for his part in the Kentish petition. The Parliamentary army looted his manor house in September 1642. By the next year his properties in Westminster and Kent were being heavily taxed to fund the Parliamentary cause. Filmer was investigated by the county committee on suspicion of supporting the King, though no firm evidence was uncovered. Filmer asked the investigators to note \"how far he hath binn from medling on either side in deeds or so much as words.\" One of his tenants claimed that Filmer had hidden arms for the Royalists, although this was apparently a false charge. Perhaps for that reason, Filmer was imprisoned for some years in Leeds Castle and his estates were sequestered.Filmer died on or about 26 May 1653. His funeral took place in East Sutton on 30 May, where he was buried in the church, surrounded by descendants of his to the tenth generation. He was survived by his wife, three sons and one daughter, one son and one daughter having predeceased him.\nHis son, also Robert, was created the first of the Filmer baronets in 1674. His other son, Beversham Filmer, became the owner of Luddenham Court, near Faversham, who then passed it on through his family.\n\n\n== Patriarcha and other works ==\n\nFilmer was already middle-aged when the controversy between the King and the House of Commons roused him to literary activity. His writings provide examples of the doctrines held by the extreme section of the Divine Right party.\nThe fullest expression of Filmer's thoughts is found in Patriarcha, or the Natural Power of Kings, published posthumously in 1680, but probably begun in the 1620s and almost certainly completed before the Civil War began in 1642. According to Christopher Hill, \"The whole argument of... Patriarcha, and of his works published earlier in the 1640s and 1650s, is based on Old Testament history from Genesis onwards\". Filmer's modern proponents counter this by noting that the focus on Filmer's biblical arguments neglects his stronger arguments from history and logic.His position was enunciated by the works which he published in his lifetime. Of the Blasphemie against the Holy Ghost, from 1646 or 1647, argued against Calvinists, starting from John Calvin's doctrine on blasphemy. The Freeholders Grand Inquest (1648) concerned English constitutional history. Filmer's early published works did not receive much attention, while Patriarcha circulated only in manuscript. Anarchy of a Limited and Mixed Monarchy (1648) was an attack on a treatise on monarchy by Philip Hunton, who had maintained that the king's prerogative was not superior to the authority of the Houses of Parliament.\nFilmer's Observations concerning the Original of Government upon Mr Hobbes's Leviathan, Mr Milton against Salmasius, and H. Grotius' De jure belli ac pacis appeared in 1652. In line with its title, it attacks several political classics, the De jure belli ac pacis of Grotius, the Defensio pro Populo Anglicano of John Milton, and the Leviathan of Thomas Hobbes. The pamphlet entitled The Power of Kings, and in particular, of the King of England (written 1648) was first published in 1680.\n\n\n== Views ==\nFilmer's theory is founded upon the statement that the government of a family by the father is the true origin and model of all government. In the beginning God gave authority to Adam, who had complete control over his descendants, even over life and death itself. From Adam this authority was inherited by Noah. Here Filmer is most likely to be quoting the legend of Noah sailing up the Mediterranean and allocating the three continents of the Old World to the rule of his three sons. This assumes that from Shem, Ham and Japheth the patriarchs inherited the absolute power which they exercised over their families and servants, and that it is from these patriarchs that all kings and governors (whether a single monarch or a governing assembly) derive their authority, which is therefore absolute, and founded on divine right.\nThe difficulty inherent in judging the validity of claims to power by men who claim to be acting upon the \"secret\" will of God was disregarded by Filmer, who held that it altered in no way the nature of such power, based on the natural right of a supreme father to hold sway. The king is perfectly free from all human control. He cannot be bound by the acts of his predecessors, for which he is not responsible; nor by his own, for it is impossible that a man should give a law to himself – a law must be imposed by another upon the person bound by it.\nAs for the English constitution, he asserted in his Freeholders Grand Inquest touching our Sovereign Lord the King and his Parliament (1648) that the Lords give counsel only to the king, that the Commons are to perform and consent only to the ordinances of Parliament, and that the king alone is the maker of laws, which derive their power purely from his will. Filmer considered it monstrous that the people should judge or depose their king, for they would then become judges in their own cause.\nFilmer was a severe critic of democracy. In his opinion, democracy of ancient Athens was in fact a \"justice-trading system\". Athenians, he claimed, never knew real justice, only the will of the mob. Ancient Rome was, according to Filmer, ruled fairly only after the Empire was established.\n\n\n== Reception ==\nFilmer's theory obtained wide recognition owing to a timely posthumous publication. Nine years after the publication of Patriarcha, at the time of the Revolution which banished the Stuarts from the throne, John Locke singled out Filmer among the advocates of Divine Right and attacked him expressly in the first part of the Two Treatises of Government. The first Treatise goes into all his arguments seriatim, and especially points out that even if the first principles of his argument are to be taken for granted, the rights of the eldest born have been so often cast aside that modern kings can claim no such inheritance of authority, as Filmer asserts.\nFilmer's patriarchal monarchism was also the target of Algernon Sidney in his Discourses Concerning Government and of James Tyrrell in his Patriarcha non-monarcha.\nJohn Kenyon, in his study of British political debate from 1689 to 1720, claimed that \"any unbiased study of the position shows in fact that it was Filmer, not Hobbes, Locke or Sidney, who was the most influential thinker of the age... Filmer's influence can be measured by the fact that both Locke... and Sidney... were not so much [making] independent and positive contributions to political thought as elaborate refutations of his Patriarcha, written soon after its first publication. Indeed, but for him it is doubtful whether either book would have been written.\"During the reign of Queen Anne Filmer's works enjoyed a revival. In 1705 the non-juror Charles Leslie devoted twelve successive issues of the weekly Rehearsal to explaining Filmer's doctrines and published them in a volume.In an unpublished manuscript, Jeremy Bentham wrote:\n\nFilmer's origin of government is exemplified everywhere: Locke's scheme of government has not ever, to the knowledge of any body, been exemplified any where. In every family there is government, in every family there is subjection, and subjection of the most absolute kind: the father, sovereign, the mother and the young, subjects. According to Locke's scheme, men knew nothing at all of governments till they met together to make one. Locke has speculated so deeply, and reasoned so ingeniously, as to have forgot that he was not of age when he came into the world... Under the authority of the father, and his assistant and prime-minister the mother, every human creature is enured to subjection, is trained up into a habit of subjection. But, the habit once formed, nothing is easier than to transfer it from one object to another. Without the previous establishment of domestic government, blood only, and probably a long course of it, could have formed political government.\nBentham went on to claim that Filmer had failed to prove divine right theory but he had proved \"the physical impossibility of the system of absolute equality and independence, by showing that subjection and not independence is the natural state of man\".\n\n\n== Family ==\nHis first son Sir Edward was Gentleman of the Privy Chamber. He died in 1668 and the East Sutton estate passed to his brother Robert who was created a baronet in 1674 in honour of their father's loyalty to the Crown. See Filmer baronets. Filmer's third son, Samuel, married Maria Horsmanden and lived in Virginia Colony before dying childless soon after.\n\n\n== List of works ==\nOf the Blasphemie against the Holy Ghost (1647)\nThe Free-holders Grand Inquest (1648)The authorship of The Freeholders is usually attributed to Robert Filmer by Peter Laslett, but contemporary historian Anthony Wood attributed it to Robert Holborne. \nThe Anarchy of a Limited or Mixed Monarchy (1648)\nThe Necessity of the Absolute Power of All Kings (1648)\nObservations Concerning the Originall of Government, upon Mr Hobs Leviathan, Mr Milton against Salmasius, H. Grotius De Jure Belli (1652)\nObservations on Mr Hobbes's Leviathan. In G. A. J. Rogers, Robert Filmer, George Lawson, John Bramhall & Edward Hyde Clarendon (eds.), Leviathan: Contemporary Responses to the Political Theory of Thomas Hobbes. Thoemmes Press (1995)\nObservations Upon Aristotles Politiques concerning Forms of Government, Together with Directions for Obedience to Gouvernors in dangerous and doubtfull times (1652)\nAn Advertisement to the Jury-Men of England Touching Witches (1653)\nAn Advertisement to the Jury-Men of England Touching Witches, The Rota at the University of Exeter, (1975)\nPatriarcha (1680)There are two modern editions of the complete works of Filmer:\n\nFilmer: Patriarcha and Other Writing, edited by Johann P. Sommerville (Cambridge University Press, 1991)\nPatriarcha and other political works of Sir Robert Filmer, edited by Peter Laslett (B. Blackwell, 1949)\n\n\n== Notes ==\n\n\n== References ==\nThis article incorporates text from a publication now in the public domain: Chisholm, Hugh, ed. (1911). \"Filmer, Sir Robert\". Encyclopædia Britannica. 10 (11th ed.). Cambridge University Press. p. 345.\n\n\n== Further reading ==\n\n\n== External links ==\nR. Filmer Patriarcha\nPatriarcha, or the Natural Power of Kings\nHutchinson, John (1892). \"Robert Filmer\" . Men of Kent and Kentishmen (Subscription ed.). Canterbury: Cross & Jackman. pp. 44–45."