"Econometrica is a peer-reviewed academic journal of economics, publishing articles in many areas of economics, especially econometrics. It is published by Wiley-Blackwell on behalf of the Econometric Society. The current editor-in-chief is Guido Imbens.\nEconometrica was established in 1933. Its first editor was Ragnar Frisch, recipient of the first Nobel Memorial Prize in Economic Sciences in 1969, who served as an editor from 1933 to 1954. Although Econometrica is currently published entirely in English, the first few issues also contained scientific articles written in French.\nThe Econometric Society aims to attract high-quality applied work in economics for publication in Econometrica through the Frisch Medal. This prize is awarded every two years for an empirical or theoretical applied article published in Econometrica during the past five years.\n\n\n== Notable papers ==\nEven apart from those being awarded with the Frisch medal, numerous Econometrica articles have been highly influential in economics and social sciences, including:\nFrisch, Ragnar; Waugh, Frederick V. (1933). \"Partial Time Regressions as Compared with Individual Trends\". Econometrica. 1 (4): 387–401. doi:10.2307/1907330. JSTOR 1907330.\nEvsey D., Domar (1946). \"Capital Expansion, Rate of Growth, and Employment\". Econometrica. 14 (2): 137–147. doi:10.2307/1905364. JSTOR 1905364.\nMuth, John F. (1961). \"Rational Expectations and the Theory of Price Movements\". Econometrica. 29 (3): 315–335. doi:10.2307/1909635. JSTOR 1909635.\nPratt, J. W. (1964). \"Risk Aversion in the Small and in the Large\". Econometrica. 32 (1–2): 122–136. doi:10.2307/1913738. JSTOR 1913738.\nKahneman, Daniel; Tversky, Amos (1979). \"Prospect Theory: An Analysis of Decision under Risk\". Econometrica. 47 (2): 263–291. CiteSeerX 10.1.1.407.1910. doi:10.2307/1914185. JSTOR 1914185.\nSims, Christopher A. (1980). \"Macroeconomics and Reality\". Econometrica. 48 (1): 1–48. CiteSeerX 10.1.1.163.5425. doi:10.2307/1912017. JSTOR 1912017.\nWhite, Halbert (1980). \"A Heteroskedasticity-Consistent Covariance Matrix Estimator and a Direct Test for Heteroskedasticity\". Econometrica. 48 (4): 817–838. CiteSeerX 10.1.1.11.7646. doi:10.2307/1912934. JSTOR 1912934.\nEngle, Robert F. (1982). \"Autoregressive Conditional Heteroscedasticity with Estimates of the Variance of United Kingdom Inflation\". Econometrica. 50 (4): 987–1007. doi:10.2307/1912773. JSTOR 1912773.\nKydland, Finn E.; Prescott, Edward C. (1982). \"Time to Build and Aggregate Fluctuations\". Econometrica. 50 (6): 1345–1370. doi:10.2307/1913386. JSTOR 1913386.\nEngle, Robert F.; Granger, C. W. J. (1987). \"Co-Integration and Error Correction: Representation, Estimation, and Testing\" (PDF). Econometrica. 55 (2): 251–276. doi:10.2307/1913236. JSTOR 1913236.\nAghion, Philippe; Howitt, Peter (1992). \"A Model of Growth Through Creative Destruction\". Econometrica. 60 (2): 323–351. doi:10.2307/2951599. hdl:1721.1/63839. JSTOR 2951599.\nMelitz, Marc J. (2003). \"The Impact of Trade on Intra-Industry Reallocations and Aggregate Industry Productivity\". Econometrica. 71 (6): 1695–1725. CiteSeerX 10.1.1.563.6294. doi:10.1111/1468-0262.00467.\n\n\n== References ==\n\n\n== External links ==\nOfficial website"