"Necromancy () is the practice of magic involving communication with the dead – either by summoning their spirits as apparitions, visions or raising them bodily – for the purpose of divination, imparting the means to foretell future events, discover hidden knowledge, to bring someone back from the dead, or to use the dead as a weapon. Sometimes referred to as \"Death Magic\", the term may also sometimes be used in a more general sense to refer to black magic or witchcraft.The word necromancy is adapted from Late Latin necromantia, itself borrowed from post-Classical Greek νεκρομαντεία (nekromanteía), a compound of Ancient Greek νεκρός (nekrós), \"dead body\", and μαντεία (manteía), \"divination by means of\"; this compound form was first used by Origen of Alexandria in the 3rd century AD. The Classical Greek term was ἡ νέκυια (nekyia), from the episode of the Odyssey in which Odysseus visits the realm of the dead souls and νεκρομαντεία in Hellenistic Greek, rendered as necromantīa in Latin, and as necromancy in 17th-century English.\n\n\n== Antiquity ==\n\nEarly necromancy was related to – and most likely evolved from – shamanism, which calls upon spirits such as the ghosts of ancestors. Classical necromancers addressed the dead in \"a mixture of high-pitch squeaking and low droning\", comparable to the trance-state mutterings of shamans.\nNecromancy was prevalent throughout antiquity with records of its practice in ancient Egypt, Babylonia, Greece and Rome. In his Geographica, Strabo refers to νεκρομαντία (nekromantia), or \"diviners by the dead\", as the foremost practitioners of divination among the people of Persia, and it is believed to have also been widespread among the peoples of Chaldea (particularly the Sabians, or \"star-worshipers\"), Etruria and Babylonia. The Babylonian necromancers were called manzazuu or sha'etemmu, and the spirits they raised were called etemmu.\nThe oldest literary account of necromancy is found in Homer's Odyssey. Under the direction of Circe, a powerful sorceress, Odysseus travels to the underworld (katabasis) in order to gain insight about his impending voyage home by raising the spirits of the dead through the use of spells which Circe has taught him. He wishes to invoke and question the shade of Tiresias in particular; however, he is unable to summon the seer's spirit without the assistance of others. The Odyssey's passages contain many descriptive references to necromantic rituals: rites must be performed around a pit with fire during nocturnal hours, and Odysseus has to follow a specific recipe, which includes the blood of sacrificial animals, to concoct a libation for the ghosts to drink while he recites prayers to both the ghosts and gods of the underworld.Practices such as these, varying from the mundane to the grotesque, were commonly associated with necromancy. Rituals could be quite elaborate, involving magic circles, wands, talismans, and incantations. The necromancer might also surround himself with morbid aspects of death, which often included wearing the deceased's clothing and consuming foods that symbolized lifelessness and decay such as unleavened black bread and unfermented grape juice. Some necromancers even went so far as to take part in the mutilation and consumption of corpses. These ceremonies could carry on for hours, days, or even weeks, leading up to the eventual summoning of spirits. Frequently they were performed in places of interment or other melancholy venues that suited specific guidelines of the necromancer. Additionally, necromancers preferred to summon the recently departed based on the premise that their revelations were spoken more clearly. This timeframe was usually limited to the twelve months following the death of the physical body; once this period elapsed, necromancers would evoke the deceased's ghostly spirit instead.While some cultures considered the knowledge of the dead to be unlimited, ancient Greeks and Romans believed that individual shades knew only certain things. The apparent value of their counsel may have been based on things they knew in life or knowledge they acquired after death. Ovid writes in his Metamorphoses of a marketplace in the underworld where the dead convene to exchange news and gossip.\nThere are also several references to necromancers – called \"bone-conjurers\" among Jews of the later Hellenistic period – in the Bible. The Book of Deuteronomy (18:9–12) explicitly warns the Israelites against engaging in the Canaanite practice of divination from the dead: 9When thou art come into the land which the LORD thy God giveth thee, thou shalt not learn to do according to the abominations of those nations. 10There shall not be found among you any one who maketh his son or his daughter to pass through the fire, or who useth divination, or an observer of times, or an enchanter, or a witch, 11or a charmer, or a consulter with familiar spirits, or a wizard, or a necromancer. 12For all who do these things are an abomination unto the LORD, and because of these abominations the LORD thy God doth drive them out from before thee (KJV). Though Mosaic Law prescribed the death penalty to practitioners of necromancy (Leviticus 20:27), this warning was not always heeded. One of the foremost examples is when King Saul had the Witch of Endor invoke the spirit of Samuel, a judge and prophet, from Sheol using a ritual conjuring pit (1 Samuel 28:3–25).  However, the so-called witch was shocked at the presence of the real spirit of Samuel for in I Sam 28:12 it says, \"when the woman saw Samuel, she cried out in a loud voice.\" Samuel questioned his reawakening asking, \"Why hast thou disquieted me?\"  Saul did not receive a death penalty (his being the highest authority in the land) but he did receive it from God himself as prophesied by Samuel during that conjuration – within a day he died in battle along with his son Jonathan.\nSome Christian writers later rejected the idea that humans could bring back the spirits of the dead and interpreted such shades as disguised demons instead, thus conflating necromancy with demon summoning. Caesarius of Arles entreats his audience to put no stock in any demons or gods other than the Christian God, even if the working of spells appears to provide benefit. He states that demons only act with divine permission and are permitted by God to test Christian people. Caesarius does not condemn man here; he only states that the art of necromancy exists, although it is prohibited by the Bible.\n\n\n== Early and High Middle Age ==\nMany medieval writers believed that actual resurrection required the assistance of God. They saw the practice of necromancy as conjuring demons who took the appearance of spirits. The practice became known explicitly as maleficium, and the Catholic Church condemned it. Though the practitioners of necromancy were linked by many common threads, there is no evidence that these necromancers ever organized as a group. One noted commonality among practitioners of necromancy was usually the utilization of certain toxic and hallucinogenic plants from the nightshade family such as black henbane, jimson weed, belladonna or mandrake, usually in magic salves or potions.Medieval necromancy is believed to be a synthesis of astral magic derived from Arabic influences and exorcism derived from Christian and Jewish teachings. Arabic influences are evident in rituals that involve moon phases, sun placement, day and time. Fumigation and the act of burying images are also found in both astral magic and necromancy. Christian and Jewish influences appear in the symbols and in the conjuration formulas used in summoning rituals.Practitioners were often members of the Christian clergy, though some nonclerical practitioners are recorded. In some instances, mere apprentices or those ordained to lower orders dabbled in the practice. They were connected by a belief in the manipulation of spiritual beings – especially demons – and magical practices. These practitioners were almost always literate and well educated. Most possessed basic knowledge of exorcism and had access to texts of astrology and of demonology. Clerical training was informal and university-based education rare. Most were trained under apprenticeships and were expected to have a basic knowledge of Latin, ritual and doctrine. This education was not always linked to spiritual guidance and seminaries were almost non-existent. This situation allowed some aspiring clerics to combine Christian rites with occult practices despite its condemnation in Christian doctrine.Medieval practitioners believed they could accomplish three things with necromancy: will manipulation, illusions, and knowledge:\n\nWill manipulation affects the mind and will of another person, animal, or spirit. Demons are summoned to cause various afflictions on others, \"to drive them mad, to inflame them to love or hatred, to gain their favor, or to constrain them to do or not do some deed.\"\nIllusions involve reanimation of the dead or conjuring food, entertainment, or a mode of transportation.\nKnowledge is allegedly discovered when demons provide information about various things. This might involve identifying criminals, finding items, or revealing future events.The act of performing medieval necromancy usually involved magic circles, conjurations, and sacrifices such as those shown in the Munich Manual of Demonic Magic:\n\nCircles were usually traced on the ground, though cloth and parchment were sometimes used. Various objects, shapes, symbols, and letters may be drawn or placed within that represent a mixture of Christian and occult ideas. Circles were believed to empower and protect what was contained within, including protecting the necromancer from the conjured demons.\nConjuration is the method of communicating with the demons to have them enter the physical world. It usually employs the power of special words and stances to call out the demons and often incorporated the use of Christian prayers or biblical verses. These conjurations may be repeated in succession or repeated to different directions until the summoning is complete.\nSacrifice was the payment for summoning; though it may involve the flesh of a human being or animal, it could sometimes be as simple as offering a certain object. Instructions for obtaining these items were usually specific. The time, location, and method of gathering items for sacrifice could also play an important role in the ritual.The rare confessions of those accused of necromancy suggest that there was a range of spell casting and related magical experimentation. It is difficult to determine if these details were due to their practices, as opposed to the whims of their interrogators. John of Salisbury is one of the first examples related by Richard Kieckhefer, but as a Parisian ecclesiastical court record of 1323 shows, a \"group who were plotting to invoke the demon Berich from inside a circle made from strips of cat skin\" were obviously participating in what the Church would define as \"necromancy\".Herbert Stanley Redgrove claims necromancy as one of three chief branches of medieval ceremonial magic, alongside black magic and white magic. This does not correspond to contemporary classifications, which often conflate \"nigromancy\" (\"black-knowledge\") with \"necromancy\" (\"death-knowledge\").\n\n\n== Late Middle Ages to Renaissance ==\n\nIn the wake of inconsistencies of judgment, necromancers and other practitioners of the magic arts were able to utilize spells featuring holy names with impunity, as any biblical references in such rituals could be construed as prayers rather than spells. As a consequence, the necromancy that appears in the Munich Manual is an evolution of these theoretical understandings. It has been suggested that the authors of the Manual knowingly designed the book to be in discord with ecclesiastical law. The main recipe employed throughout the Manual used the same religious language and names of power alongside demonic names. An understanding of the names of God derived from apocryphal texts and the Hebrew Torah required that the author of such rites have at least a casual familiarity with these sources.\nWithin the tales related in occult manuals are found connections with stories from other cultures' literary traditions. For instance, the ceremony for conjuring a horse closely relates to the Arabic One Thousand and One Nights and French romances; Chaucer's The Squire's Tale also bears marked similarities. This becomes a parallel evolution of spells to foreign gods or demons that were once acceptable, and frames them into a new Christian context, albeit demonic and forbidden. As the material for these manuals was apparently derived from scholarly magical and religious texts from a variety of sources in many languages, the scholars who studied these texts likely manufactured their own aggregate sourcebook and manual with which to work spells or magic.\nIn the notebooks of Leonardo da Vinci, it is stated that \"Of all human opinions that is to be reputed the most foolish which deals with the belief in Necromancy, the sister of Alchemy, which gives birth to simple and natural things.\"\n\n\n== Modern era ==\nIn the present day, necromancy is more generally used as a term to describe manipulation of death and the dead, or the pretense thereof, often facilitated through the use of ritual magic or some other kind of occult ceremony. Contemporary séances, channeling and Spiritualism verge on necromancy when supposedly invoked spirits are asked to reveal future events or secret information. Necromancy may also be presented as sciomancy, a branch of theurgic magic.\nBecause of their themes of spirit contact, the long-running show Supernatural Chicago and the annual Harry Houdini séance, both of which are held at the Excalibur nightclub in Chicago, Illinois, dub their lead performer \"Neil Tobin, Necromancer\".\nAs to the practice of necromancy having endured in one form or another throughout the millennia, An Encyclopædia of Occultism states: The art is of almost universal usage. Considerable difference of opinion exists among modern adepts as to the exact methods to be properly pursued in the necromantic art, and it must be borne in mind that necromancy, which in the Middle Ages was called sorcery, shades into modern spiritualistic practice. There is no doubt, however, that necromancy is the touch-stone of occultism, for if, after careful preparation the adept can carry through to a successful issue, the raising of the soul from the other world, he has proved the value of his art.\n\n\n== In popular culture ==\nNecromancy appears in many works of fantasy fiction, often by villains who use it to raise armies of zombies that the heroes must slay.\n\n\"The Necromancer\" by the Canadian rock group Rush from their 1975 album \"Caress of Steel\"Necromancy is a popular plot element in computer and video game franchise series, such as Bioshock, Borderlands, Diablo, The Elder Scrolls, Warcraft, Magic the Gathering, Gothic and Mortal Kombat, as well as in the tabletop role-playing game Dungeons & Dragons.\nThe Dark Lord Sauron adopts a guise known as the Necromancer in the 1937 novel The Hobbit.\nIn the film Army of Darkness (1992) the protagonist Ash fights a skeletal army raised by the Necronomicon.\nWarhammer 40,000, The Mummy Returns, Yu-Gi-Oh! GX and Man of Steel feature antagonists who are trying to revive their own people that have been dead for a long time, specifically Necrons, Anubis, Camula and General Zod, respectively.\nNecromancer is the main protagonist of Tony Vilgotsky's novel Shepherd of the Dead.\nNecromancer was the title of a song on the Al Stewart 1993 album Famous Last Words (Al Stewart album); the name comes from the song's lyric, \"oh, the necromancer inside us all!\", with further lyrics referencing commonly associated themes of black magic and the supernatural.\nNecromancer was the title of a song on the Van der Graaf Generator 1969 album The Aerosol Grey Machine, in which the lyrics describe an unnamed, benevolent necromancer.\nNecromancy Cottage, or, the Black Art of Gnawing on Bones, a literary fantasy novel written by Rebecca Maye Holiday during her dual studies of law and occult magic at Dalhousie University and University of King's College, followed a necromancer, Desmond Trauer, and his unwilling apprentice, Holly Nemov, who are both made to question the intent of their magic when an outsider visits their secluded island. Holly, an indentured boy and a sea demon, betrays Desmond and has his apprenticeship disavowed.\nFirestarter (novel) by horror author Stephen King featured Necromancer as the name of a horse that main character Charlie McGee enjoys riding during her time spent trapped at a secret government agency. In the 1984 adaptation of Firestarter (film), antagonist John Rainbird explains to Charlie that a necromancer is \"some kind of a wizard\".\nIn the band Sundara Karma's second album “Ufilitas’ Alphabet” there is a song entitled “Duller Days” which includes the line “A Necromance as common as the flu”.\nIn the 2018 horror comedy anime Zombie Land Saga, idol producer and supporting character named Kotaro Tatsumi (who happens to be a necromancer) resurrected six \"legendary\" girls, including the main protagonist Sakura Minamoto, to form an all-zombie idol group known as \"Franchouchou\" in order to help revitalize Saga Prefecture.\nIn Sheri S. Tepper's True Game series, necromancy is one of the primary Talents that may be possessed by Gamesmen.\nIn the A Certain Magical Index spinoff manga A Certain Scientific Accelerator, the character Esther Rosenthal belongs to a line of necromancers, in which she is the current head.\nIn the MMORPG Wizard101 the term necromancer is used for a character that practices death school magic.\nIn Ridley Scott's Raised by Wolves series, the underlying type of android for a certain character in the show.\nThe Sorceress from the 2013 fantasy beat-em-up Dragon's Crown is a necromancer who can reanimate skeletons found in dungeons to fight as her ally.\nThe film Mythica: A Quest for Heroes and its sequels has the protagonist Marek, a young woman capable of doing necromancy (here an ability to control the dead, plus drain people's life force) along with the villain. Here it is not portrayed as inherently evil, but an addictive, corrupting practicing which Marek must struggle with.\n\"The Bone Witch\", a young adult fantasy novel by author Rin Chupeco, follows a girl named Tea whose necromantic magic is scorned; the book was marketed largely using a line from the text regarding a scene where Tea uses necromancy to resurrect her deceased brother.\nPet Sematary by Stephen King explores the story of Louis Creed, a doctor whose elderly neighbor shows him how to use an old Mi'kmaq burial ground to resurrect dead animals, and eventually people. This miracle turns out to be more of a curse, as everything resurrected from the burial ground becomes violent and sadistic.\nAn episode of Ghost Stories (Japanese TV series) titled \"The Corpse That Roams in the Night - Shirotabi\" features an eccentric young schoolgirl with an affinity for animals, who unexpectedly uses supernatural forces to resurrect a pet rabbit from the dead, which emerges as a violent monster. The infamous tongue-in-cheek English dub of the anime series largely followed the same plot, but to more comedic ends.\n\"The Necromancer's Apprentice\" by R.M. Prioleau was a small horror novella originally written as an attempt for National Novel Writing Month and later self-published. While receiving poor reviews, the novella, which follows a girl called Jasmine who becomes an apprentice to a necromancer after her parents die, generated a following with readers online.\n\n\n== See also ==\nGastromancy\nGrógaldr\nHaitian Vodou\nList of occult terms\nMacumba\nMagick (Thelema)\nNecromanteion of Acheron\nOuija\nSéance\nSpirit possession\nWitchcraft and divination in the Hebrew Bible\nYūrei\n\n\n== Notes ==\n\n\n== References ==\nCook, D. (1989).  Breault, M (ed.). Player's Handbook. Advanced Dungeons & Dragons, 2nd Edition. Lake Geneva, WI: TSR. ISBN 978-0-88038-716-3.\nGuiley, R. E. (2006). \"Necromancy\". The Encyclopedia of Magic and Alchemy. New York City, NY: Infobase Publishing. pp. 215–216. ISBN 978-0-8160-6048-1.\nHomer (1900) [c. 700 BCE]. The Odyssey. S. Butler, trans. London, UK: Longmans, Green & Co. OCLC 4862683.\nJohnson, M. M. (2004). \"Necromancy\".  In Golden, R. M (ed.). Encyclopedia of Witchcraft: The Western Tradition. Santa Barbara, CA: ABC-CLIO. pp. 808–809. ISBN 978-1-57607-243-1.\nKieckhefer, R. (1998). Forbidden Rites: A Necromancer's Manual of the Fifteenth Century. University Park, PA: Penn State University Press. ISBN 978-0-271-01751-8.\nKieckhefer, R. (2011). \"Chapter 7: Necromancy in the Clerical Underworld\". Magic in the Middle Ages (2nd ed.). Cambridge, UK: Cambridge University Press. pp. 151–175. ISBN 978-0-521-78576-1.\nKors, A. C. & Peters, E., eds. (2001). Witchcraft in Europe 400–1700: A Documentary History (2nd ed.). Philadelphia, PA: University of Pennsylvania Press. ISBN 978-0-8122-1751-3.\nKurtz, S. (1995).  Forbeck, M (ed.). The Complete Book of Necromancers. Advanced Dungeons & Dragons, 2nd Edition. Lake Geneva, WI: TSR. ISBN 978-0-7869-0106-7.\nLáng, B. (2010). Unlocked Books: Manuscripts of Learned Magic in the Medieval Libraries of Central Europe (New ed.). University Park, PA: Penn State University Press. ISBN 978-0-271-03378-5.\nLeonardo da Vinci (1970) [1452–1519].  Richter, J. P (ed.). The Notebooks of Leonardo da Vinci. New York City, NY: Dover Publications. ISBN 978-0-486-22573-9.\nLewis, J. R. (1999). Witchcraft Today: An Encyclopedia of Wiccan and Neopagan Traditions. Santa Barbara, CA: ABC-CLIO. ISBN 978-1-57607-134-2.\nLuck, G. (2006). Arcana Mundi: Magic and the Occult in the Greek and Roman Worlds—A Collection of Ancient Texts (2nd ed.). Baltimore, MD: Johns Hopkins University Press. ISBN 978-0-8018-8345-3.\nOvid (1717) [8 CE].  Garth, S (ed.). Metamorphoses. J. Addison, W. Congreve, S. Croxall, J. Dryden, L. Eusden, J. Gay, A. Maynwaring & N. Tate, trans. London, UK: Jacob Tonson. OCLC 85877585.\nRedgrove, H. S. (1920). \"Chapter 7: Ceremonial Magic in Theory and Practice\". Bygone Beliefs: Being a Series of Excursions in the Byways of Thought. London, UK: W. Rider & Son. pp. 87–110. OCLC 2784604.\nRowling, J. K. (2008). The Tales of Beedle the Bard. London, UK: Children's High Level Group. ISBN 978-0-545-12828-5.\nRuickbie, L. (2004). Witchcraft Out of the Shadows: A Complete History. London, UK: Robert Hale. ISBN 978-0-7090-7567-7.\nSiembieda, K.; Long, K. & Rosenstein, J. (1993). Rifts World Book Four: Africa. Taylor, MI: Palladium Books. ISBN 978-0-916211-58-5.\nSiembieda, K.; Sumimoto, M. & Cartier, R. (1998). Rifts World Book 18: Mystic Russia. Taylor, MI: Palladium Books. ISBN 978-1-57457-011-3.\nSiembieda, K.; Wujcik, E.; Cartier, R.; Marciniszyn, A.; Jacques, C. & McCall, R. (1996). Palladium Fantasy Role-Playing Game Book III: Adventures on the High Seas (2nd ed.). Taylor, MI: Palladium Books. ISBN 978-0-916211-17-2.\nSpence, L. (1920). \"Necromancy\". An Encyclopædia of Occultism. London, UK: Routledge. pp. 286–290. OCLC 264589119.\nStrabo (1889–1893) [20 BCE – 23 CE].  Hamilton, H. C.; Falconer, W (eds.). Geography. London, UK: George Bell & Sons. OCLC 693763975.\nTweet, J.; Cook, M. & Williams, S. (2003).  Martin, J. & Rateliff, J (eds.). Player's Handbook: Core Rulebook I. Dungeons & Dragons v3.5. Renton, WA: Wizards of the Coast. ISBN 978-0-7869-2886-6.\n\n\n== Further reading ==\nBacon, R. (1988) [c. 1260–1280].  MacDonald, M (ed.). De Nigromancia. Berkeley Heights, NJ: Heptangle Books. ISBN 978-0-935214-10-9. Archived from the original on 2014-08-23.\nDubray, C. (1911). \"Necromancy\". Catholic Encyclopedia. New York City, NY: Robert Appleton Company.\nGodwin, W. (1834). Lives of the Necromancers. London, UK: F. J. Mason. OCLC 2657815.\nHalliday, W. R. (1913). \"Chapter XI: Necromancy\". Greek Divination: A Study of Its Methods and Principles. London, UK: Macmillan. pp. 235–245. OCLC 25019974.\nMonroe, A.; Edwards, T., eds. (2010) [1907]. Full Guide to Becoming a Real Wizard, Witch or Necromancer; from \"The Scripts of Osari the Wise\". New York City, NY: Library Tales/CreateSpace. ISBN 978-1-4499-6763-5.\nOgden, D. (2001). Greek and Roman Necromancy. Princeton, NJ: Princeton University Press. ISBN 978-0-691-00904-9.\nVulliaud, P. (1923). La Kabbale Juive: Histoire et Doctrine—Essai Critique (in French). Paris, France: Émile Nourry. OCLC 22318758.\nWendell, L. (1991). The Necromantic Ritual Book. Opelousas, LA: Westgate Publications. ISBN 978-0-944087-03-9.\n\n\n== External links =="