"I. Bernard Cohen (1 March 1914 – 20 June 2003) was the Victor S. Thomas Professor of the history of science at Harvard University and the author of many books on the history of science and, in particular, Isaac Newton. \nCohen was a Harvard undergraduate ('37) and then a Harvard PhD student and protégé of George Sarton who was the founder of Isis and the History of Science Society. Cohen was the first American to receive a PhD in history of science and taught at Harvard from 1942 until his death. During his tenure, he developed Harvard's program in the history of science.  He succeeded Sarton as editor of Isis (1952-1958) and, later, served as president of the Society (1961-1962). Cohen was also a president of the International Union of the History and Philosophy of Science. \nCohen was an internationally recognized Newton scholar; his interests were encyclopedic, ranging from science and public policy to the history of computers, with several decades as a special consultant for history of computing with IBM. Among his hundreds of publications were such major books as Franklin and Newton (1956), The Birth of a New Physics (1959), The Newtonian Revolution (1980), Revolution in Science (1985), Science and the Founding Fathers (1995), Howard Aiken: Portrait of a Computer Pioneer (1999), and his last book, The Triumph of Numbers (2005), not to mention two jointly authored contributions, the variorum edition and new English translation of Newton's Principia. \nCohen's April 1955 interview with Albert Einstein was the last Einstein gave before his death, in that same month. It was published that July in Scientific American, which also published Cohen's 1984 essay on Florence Nightingale.\nIn 1974 he was awarded the Sarton Medal by the History of Science Society. Many consider Cohen's most important work to be his 1999 translation, with the late Anne Whitman, of Newton's Principia.  This 974-page work took Cohen over 15 years to fully translate.\nCohen supervised the doctoral dissertations of Lorraine Daston, Judith Grabiner, Kenneth Manning, Uta Merzbach, and Joan L. Richards. Among Cohen's other students (and protégés) were the Islamic philosopher Seyyed Hosein Nasr; Tufts University professor George E. Smith; Bucknell University professor Martha Verbrugge; Allen G. Debus; and Jeremy Bernstein.\nHe died of a bone marrow disorder.\n\n\n== Publications ==\n1953 – Benjamin Franklin: His Contribution to the American Tradition\n1956 – Franklin and Newton: An Inquiry into Speculative Newtonian Experimental Science and Franklin's Work in Electricity as an Example thereof\n1960 – The Birth of a New Physics (LoC 60-5918, Science Study Series S10, Anchor Books, Doubleday)\n1971 – Introduction to Newton's Principia (1999 ed: ISBN 1-58348-601-1)\n1981 – The Newtonian Revolution (ISBN 0-521-22964-2)\n1981 – Studies on William Harvey (ISBN 0-405-13866-0)\n1984 – \"Florence Nightingale\". Scientific American. 250 (3): 128–37. Bibcode:1984SciAm.250c.128C. doi:10.1038/scientificamerican0384-128. PMID 6367033. (alternative pagination depending on country of sale: 98–107)\n1985 – Revolution in Science (ISBN 0-674-76777-2)\n1985 – Album of Science: From Leonardo to Lavoisier, 1450-1800 (ISBN 0-684-15377-7)\n1985 – The Birth of a New Physics (ISBN 0-393-01994-2)\n1990 – Benjamin Franklin's Science (ISBN 0-674-06658-8)\n1994 – Interactions: Some Contacts between the Natural Sciences and the Social Sciences (ISBN 0-262-03223-6)\n1995 – Science and the Founding Fathers: Science in the Political Thought of Jefferson, Franklin, Adams, and Madison (ISBN 0-393-03501-8)\n1996 – Newton: Texts Backgrounds Commentaries (Norton Critical Editions) (ISBN 0-393-95902-3)\n1999 – Howard Aiken: Portrait of a Computer Pioneer (History of Computing) (ISBN 0-262-03262-7)\n1999 – Makin’ Numbers: Howard Aiken and the Computer (co-Editor with Gregory Welch) (ISBN 0-262-03263-5)\n1999 – The Principia: Mathematical Principles of Natural Philosophy (Translator) (ISBN 0-520-08816-6)\n2000 – Isaac Newton's Natural Philosophy (Editor) (ISBN 0-262-02477-2)\n2002 – The Cambridge Companion to Newton (Editor) (ISBN 0-521-65177-8\n2005 – The Triumph of Numbers: How Counting Shaped Modern Life (ISBN 0-393-05769-0)\n\n\n== References ==\n\nDauben, Joseph W; Gleason Mary Louise; Smith George E (March 2009). \"Seven decades of history of science: I. Bernard Cohen (1914-2003), second editor of Isis\". Isis. United States. 100 (1): 4–35. doi:10.1086/597575. ISSN 0021-1753. PMID 19554868.\n\n\n== External links =="