"Resignation syndrome (also called traumatic withdrawal syndrome or traumatic refusal; Swedish: uppgivenhetssyndrom) is a catatonic condition that induces a state of reduced consciousness, first described in Sweden in the 1990s. The condition affects predominately psychologically traumatized children and adolescents in the midst of a strenuous and lengthy migration process.Young people reportedly develop depressive symptoms, become socially withdrawn, and become motionless and speechless as a reaction to stress and hopelessness. In the worst cases, children reject any food or drink and have to be fed by feeding tube; the condition can persist for years. Recovery ensues within months to years and is claimed to be dependent on the restoration of hope to the family.\nMore recently, this phenomenon has been called into question, with two children witnessing that they were forced by their parents to act apathetic in order to increase chances of being granted residence permits.  As evidenced by medical records, healthcare professionals were aware of this scam, and witnessed parents who actively refused aid for their children but remained silent at the time.  Later Sveriges Television, Sweden's national public television broadcaster, were severely critiqued by investigative journalist Janne Josefsson for failing to uncover the truth.  In March 2020, a report citing the Swedish Agency for Medical and Social Evaluation, SBU, said \"There are no scientific studies that answer how to diagnose abandonment syndrome, nor what treatment works.\"\n\n\n== Signs and symptoms ==\nAffected individuals (predominantly children and adolescents) first exhibit symptoms of anxiety and depression (in particular apathy, lethargy), then withdraw from others and care for themselves. Eventually their condition might progress to stupor, i.e. they stop walking, eating, talking, and grow incontinent. In this stage patients are seemingly unconscious and tube feeding is life-sustaining. The condition could persist for months or even years. Remission happens after life circumstances improve and ensues with gradual return to what appears to be normal function.\n\n\n== Nosology ==\nRS and pervasive refusal syndrome shares common features and etiologic factors; however, the former is more clearly associated with trauma and adverse life circumstances. Neither is included in the standard psychiatric classification systems.\nPervasive refusal syndrome (also called pervasive arousal-withdrawal syndrome) has been conceptualised in a variety of ways, including a form of post-traumatic stress disorder, learned helplessness, ‘lethal mothering’, loss of the internal parent, apathy or the ‘giving-up’ syndrome, depressive devitalisation, primitive ‘freeze’, severe loss of activities of daily living and ‘manipulative’ illness, such as parents drugging children for increased chance of being granted asylum. It was also suggested to be on the 'refusal-withdrawal-regression spectrum'.Acknowledging its social importance and relevance, the Swedish National Board of Health and Welfare recognized the novel diagnostic entity resignation syndrome in 2014.  While others argue that already-existing diagnostic entities should be used and are sufficient in the majority of cases, i.e. severe major depressive disorder with psychotic symptoms or catatonia, or conversion/dissociation disorder.Currently, diagnostic criteria are undetermined, pathogenesis is uncertain, and effective treatment is lacking.\n\n\n== Causes ==\nResignation syndrome appears to be a very specialized response to the trauma of refugee limbo, in which families, many of whom have escaped dangerous circumstances in their home countries, wait to be granted legal permission to stay in their new country, often undergoing numerous refusals and appeals over a period of years.\nExperts proposed multifactorial explanatory models involving individual vulnerability, traumatization, migration, culturally conditioned reaction patterns and parental dysfunction or pathological adaption to a caregiver’s expectations to interplay in pathogenesis. Some differential diagnoses to be excluded include severe depression, dissociative disorders and conversion disorders.However, the currently prevailing stress hypothesis fails to account for the regional distribution (see Epidemiology) and contributes little to treatment. An asserted “questioning attitude”, in particular within the health care system, it has been claimed, may constitute a “perpetuating retraumatization possibly explaining the endemic” distribution. Furthermore, Sweden’s experience raises concerns about \"contagion\". Researchers argue that culture-bound psychogenesis can accommodate the endemic distribution because children may learn that dissociation is a way to deal with trauma.\nA proposed neurobiological model of the disorder suggests that the impact of overwhelming negative expectations are directly causative of the down-regulation of higher order and lower order behavioral systems in particularly vulnerable individuals.\n\n\n== Epidemiology ==\nDepicted as a culture-bound syndrome, it was first observed and described in Sweden among children of asylum seekers from former Soviet and Yugoslav countries. In Sweden, hundreds of migrant children, facing the possibility of deportation, have been diagnosed since the 1990s. For example, 424 cases were reported between 2003 and 2005; and 2.8% of all 6547 asylum applications submitted for children were diagnosed in 2004.It has also been observed in refugee children transferred from Australia to the Nauru Regional Processing Centre. The Economist wrote in 2018 that Doctors without Borders (MSF) refused to say how many of the children on Nauru may be suffering from traumatic withdrawal syndrome.  A report published in August 2018 suggested there were at least 30.  The National Justice Project, a legal centre, has brought 35 children from Nauru this year.  It estimates that seven were suffering from RS, and three were psychotic.\n\n\n== See also ==\nAsylum seekers with apathetic refugee children\nLife Overtakes Me\nMass psychogenic illness\n\n\n== References =="