"Onomatopoeia (also onomatopeia in American English), is the process of creating a word that phonetically imitates, resembles, or suggests the sound that it describes. Such a word itself is also called an onomatopoeia. Common onomatopoeias include animal noises such as oink, meow (or miaow), roar and chirp. Onomatopoeia can differ between languages: it conforms to some extent to the broader linguistic system; hence the sound of a clock may be expressed as tick tock in English, tic tac in Spanish and Italian (shown in the picture), dī dā in Mandarin, katchin katchin in Japanese, or tik-tik in Hindi.\nAlthough in the English language the term onomatopoeia means 'the imitation of a sound', the compound word onomatopoeia (ὀνοματοποιία) in the Greek language means 'making or creating names'. For words that imitate sounds, the term ὴχομιμητικό (ēchomimētico) or echomimetic) is used. The word ὴχομιμητικό (ēchomimētico) derives from ὴχώ, meaning 'echo' or 'sound', and μιμητικό, meaning 'mimetic' or 'imitating'.\n\n\n== Uses ==\n\nIn the case of a frog croaking, the spelling may vary because different frog species around the world make different sounds: Ancient Greek brekekekex koax koax (only in Aristophanes' comic play The Frogs) probably for marsh frogs; English ribbit for species of frog found in North America; English verb croak for the common frog.Some other very common English-language examples are hiccup, zoom, bang, beep, moo, and splash. Machines and their sounds are also often described with onomatopoeia: honk or beep-beep for the horn of an automobile, and vroom or brum for the engine. In speaking of a mishap involving an audible arcing of electricity, the word zap is often used (and its use has been extended to describe non-auditory effects generally connoting the same sort of localized but thorough interference or destruction similar to that produced in short-circuit sparking).\nHuman sounds sometimes provide instances of onomatopoeia, as when mwah is used to represent a kiss.For animal sounds, words like quack (duck), moo (cow), bark or woof (dog), roar (lion), meow/miaow or purr (cat), cluck (chicken) and baa (sheep) are typically used in English (both as nouns and as verbs).\nSome languages flexibly integrate onomatopoeic words into their structure. This may evolve into a new word, up to the point that the process is no longer recognized as onomatopoeia. One example is the English word bleat for sheep noise: in medieval times it was pronounced approximately as blairt (but without an R-component), or blet with the vowel drawled, which more closely resembles a sheep noise than the modern pronunciation.\nAn example of the opposite case is cuckoo, which, due to continuous familiarity with the bird noise down the centuries, has kept approximately the same pronunciation as in Anglo-Saxon times and its vowels have not changed as they have in the word furrow.\nVerba dicendi ('words of saying') are a method of integrating onomatopoeic words and ideophones into grammar.\nSometimes, things are named from the sounds they make. In English, for example, there is the universal fastener which is named for the sound it makes: the zip (in the UK) or zipper (in the U.S.) Many birds are named after their calls, such as the bobwhite quail, the weero, the morepork, the killdeer, chickadees and jays, the cuckoo, the chiffchaff, the whooping crane, the whip-poor-will, and the kookaburra. In Tamil and Malayalam, the word for crow is kaakaa. This practice is especially common in certain languages such as Māori, and so in names of animals borrowed from these languages.\n\n\n=== Cross-cultural differences ===\nAlthough a particular sound is heard similarly by people of different cultures, it is often expressed through the use of different consonant strings in different languages. For example, the snip of a pair of scissors is cri-cri in Italian, riqui-riqui in Spanish, terre-terre or treque-treque in Portuguese, krits-krits in modern Greek, cëk-cëk in Albanian, and katr-katr in Hindi. Similarly, the \"honk\" of a car's horn is ba-ba (Han: 叭叭) in Mandarin, tut-tut in French, pu-pu in Japanese, bbang-bbang in Korean, bært-bært in Norwegian, fom-fom in Portuguese and bim-bim in Vietnamese.\n\n\n=== Onomatopoeic effect without onomatopoeic words ===\nAn onomatopoeic effect can also be produced in a phrase or word string with the help of alliteration and consonance alone, without using any onomatopoeic words. The most famous example is the phrase \"furrow followed free\" in Samuel Taylor Coleridge's The Rime of the Ancient Mariner. The words \"followed\" and \"free\" are not onomatopoeic in themselves, but in conjunction with \"furrow\" they reproduce the sound of ripples following in the wake of a speeding ship. Similarly, alliteration has been used in the line \"as the surf surged up the sun swept shore ...\" to recreate the sound of breaking waves in the poem \"I, She and the Sea\".\n\n\n== Comics and advertising ==\n\nComic strips and comic books make extensive use of onomatopoeia. Popular culture historian Tim DeForest noted the impact of writer-artist Roy Crane (1901–1977), the creator of Captain Easy and Buz Sawyer:\n\nIt was Crane who pioneered the use of onomatopoeic sound effects in comics, adding \"bam,\" \"pow\" and \"wham\" to what had previously been an almost entirely visual vocabulary. Crane had fun with this, tossing in an occasional \"ker-splash\" or \"lickety-wop\" along with what would become the more standard effects. Words as well as images became vehicles for carrying along his increasingly fast-paced storylines.In 2002, DC Comics introduced a villain named Onomatopoeia, an athlete, martial artist, and weapons expert, who often speaks pure sounds.\nAdvertising uses onomatopoeia for mnemonic purposes, so that consumers will remember their products, as in Alka-Seltzer's \"Plop, plop, fizz, fizz. Oh, what a relief it is!\" jingle, recorded in two different versions (big band and rock) by Sammy Davis, Jr.\nRice Krispies (US and UK) and Rice Bubbles (AU) make a \"snap, crackle, pop\" when one pours on milk. During the 1930s, the illustrator Vernon Grant developed Snap, Crackle and Pop as gnome-like mascots for the Kellogg Company.\nSounds appear in road safety advertisements: \"clunk click, every trip\" (click the seatbelt on after clunking the car door closed; UK campaign) or \"click, clack, front and back\" (click, clack of connecting the seat belts; AU campaign) or \"click it or ticket\" (click of the connecting seat belt, with the implied penalty of a traffic ticket for not using a seat belt; US DOT (Department of Transportation) campaign).\nThe sound of the container opening and closing gives Tic Tac its name.\n\n\n=== Manner imitation ===\n\nIn many of the world's languages, onomatopoeic-like words are used to describe phenomena beyond the purely auditive. Japanese often uses such words to describe feelings or figurative expressions about objects or concepts. For instance, Japanese barabara is used to reflect an object's state of disarray or separation, and shiiin is the onomatopoetic form of absolute silence (used at the time an English speaker might expect to hear the sound of crickets chirping or a pin dropping in a silent room, or someone coughing). In Albanian, tartarec is used to describe someone who is hasty. It is used in English as well with terms like bling, which describes the glinting of light on things like gold, chrome or precious stones. In Japanese, kirakira is used for glittery things.\n\n\n== Examples in media ==\nJames Joyce in Ulysses (1922) coined the onomatopoeic tattarrattat for a knock on the door. It is listed as the longest palindromic word in The Oxford English Dictionary.\nWhaam! (1963) by Roy Lichtenstein is an early example of pop art, featuring a reproduction of comic book art that depicts a fighter aircraft striking another with rockets with dazzling red and yellow explosions.\nIn the 1960s TV series Batman, comic book style onomatopoeic words such as wham!, pow!, biff!, crunch! and zounds! appear onscreen during fight scenes.\nUbisoft's XIII employed the use of comic book onomatopoeic words such as bam!, boom! and noooo! during gameplay for gunshots, explosions and kills, respectively. The comic-book style is apparent throughout the game and is a core theme, and the game is an adaptation of a comic book of the same name.\nThe chorus of American popular songwriter John Prine's song \"Onomatopoeia\" cleverly incorporates onomatopoeic words: \"Bang! went the pistol. | Crash! went the window. | Ouch! went the son of a gun. | Onomatopoeia | I don't wanna see ya | Speaking in a foreign tongue.\"\nThe marble game KerPlunk has an onomatopoeic word for a title, from the sound of marbles dropping when one too many sticks has been removed.\nThe Nickelodeon cartoon's title KaBlam! is implied to be onomatopoeic to a crash.\nEach episode of the TV series Harper's Island is given an onomatopoeic name which imitates the sound made in that episode when a character dies. For example, in the episode titled \"Bang\" a character is shot and fatally wounded, with the \"Bang\" mimicking the sound of the gunshot.\nMad Magazine cartoonist Don Martin, already popular for his exaggerated artwork, often employed comic-book style onomatopoeic sound effects in his drawings (for example, thwizzit is the sound of a sheet of paper being yanked from a typewriter). Fans have compiled The Don Martin Dictionary, cataloguing each sound and its meaning.\n\n\n== Cross-linguistic examples ==\n\n\n== In linguistics ==\nA key component of language is its arbitrariness and what a word can represent, as a word is a sound created by humans with attached meaning to said sound. No one can determine the meaning of a word purely by how it sounds. However, in onomatopoeic words, these sounds are much less arbitrary; they are connected in their imitation of other objects or sounds in nature. Vocal sounds in the imitation of natural sounds doesn't necessarily gain meaning, but can gain symbolic meaning. An example of this sound symbolism in the English language is the use of words starting with sn-. Some of these words symbolize concepts related to the nose (sneeze, snot, snore). This does not mean that all words with that sound relate to the nose, but at some level we recognize a sort of symbolism associated with the sound itself. Onomatopoeia, while a facet of language, is also in a sense outside of the confines of language.In linguistics, onomatopoeia is described as the connection, or symbolism, of a sound that is interpreted and reproduced within the context of a language, usually out of mimicry of a sound. It is a figure of speech, in a sense. Considered a vague term on its own, there are a few varying defining factors in classifying onomatopoeia. In one manner, it is defined simply as the imitation of some kind of non-vocal sound using the vocal sounds of a language, like the hum of a bee being imitated with a \"buzz\" sound. In another sense, it is described as the phenomena of making a new word entirely.\nOnomatopoeia works in the sense of symbolizing an idea in a phonological context, not necessarily constituting a direct meaningful word in the process. The symbolic properties of a sound in a word, or a phoneme, is related to a sound in an environment, and are restricted in part by a language's own phonetic inventory, hence why many languages can have distinct onomatopoeia for the same natural sound. Depending on a language's connection to a sound's meaning, that language's onomatopoeia inventory can differ proportionally. For example, a language like English generally holds little symbolic representation when it comes to sounds, which is the reason English tends to have a smaller representation of sound mimicry then a language like Japanese that overall has a much higher amount of symbolism related to the sounds of the language.\n\n\n== The evolution of language ==\nIn ancient Greek philosophy, onomatopoeia was used as evidence for how natural a language was: it was theorized that language itself was derived from natural sounds in the world around us. Symbolism in sounds was seen as deriving from this. Some linguists hold that onomatopoeia may have been the first form of human language.\n\n\n== Role in early language acquisition ==\nWhen first exposed to sound and communication, humans are biologically inclined to mimic the sounds they hear, whether they are actual pieces of language or other natural sounds. Early on in development, an infant will vary his/her utterances between sounds that are well established within the phonetic range of the language(s) most heavily spoken in their environment, which may be called \"tame\" onomatopoeia, and the full range of sounds that the vocal tract can produce, or \"wild\" onomatopoeia. As one begins to acquire one's first language, the proportion of \"wild\" onomatopoeia reduces in favor of sounds which are congruent with those of the language they are acquiring.\nDuring the native language acquisition period, it has been documented that infants may react strongly to the more wild-speech features to which they are exposed, compared to more tame and familiar speech features. But the results of such tests are inconclusive.\nIn the context of language acquisition, sound symbolism has been shown to play an important role. The association of foreign words to subjects and how they relate to general objects, such as the association of the words takete and baluma with either a round or angular shape, has been tested to see how languages symbolize sounds.\n\n\n== In other languages ==\n\n\n=== Japanese ===\n\nThe Japanese language has a large inventory of ideophone words that are symbolic sounds. These are used in contexts ranging from day to day conversation to serious news. These words fall into four categories:\n\nGiseigo: mimics humans and animals. (e.g. wanwan for a dog's bark)\nGiongo: mimics general noises in nature or inanimate objects. (e.g. zaazaa for rain on a roof)\nGitaigo: describes states of the external world\nGijōgo: describes psychological states or bodily feelings.The two former correspond directly to the concept of onomatopoeia, while the two latter are similar to onomatopoeia in that they are intended to represent a concept mimetically and performatively rather than referentially, but different from onomatopoeia in that they aren't just imitative of sounds. For example, shiinto represents something being silent, just as how an anglophone might say \"clatter, crash, bang!\" to represent something being noisy. That \"representative\" or \"performative\" aspect is the similarity to onomatopoeia.\nSometimes Japanese onomatopoeia produces reduplicated words.\n\n\n=== Hebrew ===\nAs in Japanese, onomatopoeia in Hebrew sometimes produces reduplicated verbs:\nשקשק shikshék \"to make noise, rustle\".\nרשרש rishrésh \"to make noise, rustle\".\n\n\n=== Malay ===\nThere is a documented correlation within the Malay language of onomatopoeia that begin with the sound bu- and the implication of something that is rounded, as well as with the sound of -lok within a word conveying curvature in such words like lok, kelok and telok ('locomotive', 'cove', and 'curve' respectively).\n\n\n=== Arabic ===\nThe Qur'an, written in Arabic, documents instances of onomatopoeia. Of about 77,701 words, there are nine words that are onomatopoeic: three are animal sounds (e.g., \"mooing\"), two are sounds of nature (e.g.; \"thunder\"), and four that are human sounds (e.g., \"whisper\" or \"groan\").\n\n\n=== Albanian ===\nThere is wide array of objects and animals in the Albanian language that have been named after the sound they produce. Such onomatopoeic words are shkrepse (matches), named after the distinct sound of friction and ignition of the match head; take-tuke (ashtray) mimicking the sound it makes when placed on a table; shi (rain) resembling the continuous sound of pouring rain; kukumjaçkë (Little owl) after its \"cuckoo\" hoot; furçë (brush) for its rustling sound; shapka (slippers and flip-flops); pordhë (loud flatulence) and fëndë (silent flatulence).\n\n\n=== Urdu ===\nIn Urdu, onomatopoeic words like bak-bak, churh-churh are used to indicate silly talk. Other examples of onomatopoeic words being used to represent actions are fatafat (to do something fast), dhak-dhak (to represent fear with the sound of fast beating heart), tip-tip (to signify a leaky tap) etc. Movement of animals or objects is also sometimes represented with onomatopoeic words like bhin-bhin (for a housefly) and sar-sarahat (the sound of a cloth being dragged on or off a piece of furniture).\n\n\n== See also ==\n\n\n== References ==\n\n\n=== Notes ===\n\n\n=== General references ===\nCrystal, David (1997). The Cambridge Encyclopedia of Language (2nd ed.). Cambridge University Press. ISBN 0-521-55967-7.\nSmyth, Herbert Weir (1920). Greek Grammar. Cambridge MA: Harvard University Press. p. 680. ISBN 0-674-36250-0.\n\n\n== External links ==\nDerek Abbott's Animal Noise Page\nOver 300 Examples of Onomatopoeia\nBBC Radio 4 show discussing animal noises\nTutorial on Drawing Onomatopoeia for Comics and Cartoons (using fonts)\nWrittenSound, onomatopoeic word list\nExamples of Onomatopeia"