"Malebolgia (also referred to at times as the Malebolgia ) is a fictional supervillain appearing as the original main antagonist in comic books featuring the superhero Spawn and later reprise the role in the later issues. Created by writer/artist Todd McFarlane, the character first appeared in Spawn #1 (May 1992). The name Malebolgia is derived from the term in Dante's Inferno used to describe Malebolge, the ditches (bolge) in the eighth circle of Hell, where humans who committed the sin Fraud are punished. He is Spawn's former master who serves as one of the major Lords of Hell.\n\n\n== Fictional character biography ==\nThought to be the equivalent of Satan in the Bible, he is responsible for the creation of Spawn. It is eventually revealed that Malebolgia is one of Hell's many rulers, a being from the \"Eighth Circle of Hell\" who has been around for approximately 70,000 years, forming an army in his war against Heaven and God. It has been noted that Malebolgia is constantly at war with the rulers of the other spheres of Hell, as well as at odds with Mammon.\nMalebolgia was the creation of the previous ruler of the Eighth Sphere of Hell named Leviathan. Whom he created from a substance also of his creation called Necroplasm. Eventually Malebolgia killed his master and took over as ruler of the Eighth Sphere.\nMalebolgia is one of the few characters from the Spawn universe who has made an appearance or a cameo in other Image books outside the core Spawn title and its spin-offs. He is notably absent, but as mentioned, during Chapel's rise to power in Hell when he usurps control of Hell away from Lucifer and becomes Lord Chapel as part of a large Image crossover including Prophet, Supreme, and the groups Youngblood and Brigade. Lucifer also appears in the Angela mini-series, quite different from the Lucifer in the Liefeld-laden crossover. That leaves Malebolgia and Mammon as the highest-ranking devil-like characters in Spawn canon until the actual appearance of Satan in the Spawn Comics.\n\n\n=== Death ===\nMalebolgia is slain by Spawn in issue #100. Spawn is offered the crown of the Eighth Circle, and though he declines, Spawn still receives vastly enhanced powers and command over Hell itself. It has become known that Mammon is a far more commanding presence in Hell than Malebolgia and later on Satan himself being the true ruler of Hell. Though Malebolgia is given self-determination and rule over a level of Hell, he is far from the most powerful being in The Pit.\n\n\n=== Return ===\nAs Spawn issue #199 ends, the now-returned \"Freak\" from early Spawn canon is attacked by Clown, who rips the Freak's arms off.  The Freak laughs it off and lets Clown know that he is not scared of him or any other of the Spawns because they are all \"his.\"  Clown quickly shies away as the Freak begins to transform. After reattaching his arm, the Freak transports Violator to Hell. Upon returning to Hell, Violator regains his full strength, as well as his senses. The Freak reveals his true identity to be Malebolgia. After being defeated by Al Simmons, the Lords of Hell cut off Malebolgia's power and set up \"roadblocks\" to ensure that he never returned. Betrayed, Malebolgia swears to regain his true power and form and kill all those who tried to prevent his return, including the Violator who had sided with Malebolgia's greatest rival, Mammon, after Malebolgia's fall. Malebolgia orders Violator to spread the word of his return in order to spread fear. Malebolgia would be later defeated by Leetha, who took over Downing, destroying the Freak's body, seemingly killing him. Presumably, Malebolgia is still around trying to reform himself in some other way.\n\n\n== Powers and abilities ==\nMalebolgia is respected and feared as one of the rulers of Hell, and thus the de facto grandmaster of Hell. His powers include Necro Energies like raising the dead, matter manipulation, super strength, recuperative abilities, and abilities to morph and induce hallucinations. His standing in Hell's hierarchy gives him vast power while in the 8th Sphere. His mastery of necroplasm gives him the exclusive ability to create Hellspawn and during his rule, he creates an army larger and more powerful than anything Heaven or he himself could handle.\n\n\n== In other media ==\nMalebolgia appears in the 1997 film adaptation of Spawn, voiced by Frank Welker.\nDespite his major role and frequent appearances in the comic during its early run, Malebolgia ironically does not appear in the Spawn television series; his name, however, is mentioned frequently throughout the show, and his presence and influence is greatly apparent, with frequent allusions and mentions of him; notably, in the episode 4, a brief glimpse of Malebolgia's face and his lair was seen.\nMalebolgia appears in Spawn: In the Demon's Hand, voiced by Tony Daniels.\nMalebolgia appears in Spawn: Armageddon, voiced by David Sobolov.\nAppears in the Robot Chicken episode \"Celebutard Mountain\", voiced by Tom Root. He and Spawn compete in a fiddle contest reminiscent of \"The Devil Went Down to Georgia\" by the Charlie Daniels Band.\nHe appears in Soulcalibur II for the Xbox, sending Spawn after Soul Edge. Spawn also mentions Malebolgia in a victory pose by saying, \"Malebolgia, just you wait!\"\nHe is the main subject in the song \"The Last Laugh\" from Iced Earth's The Dark Saga, a concept album based on Spawn.\nMalebolgia is the name of a death metal band from Greensboro, North Carolina.\nMalebolgia is the name of the newest state in the US in the Big Finish production \"Minuet in Hell\".\nMalebolgia appears in Mortal Kombat 11 as part of one of Spawn's victory poses and as a cameo in Spawn's arcade ending. In the game, he is apparently revealed to be Shinnok's & Cetrion's cousin.\n\n\n== References =="