"Otranto (UK: , US: , Italian: [ˈɔːtranto]; Salentino: Uṭṛàntu; Griko: Δερεντό, romanized: Derentò; Ancient Greek: Ὑδροῦς, romanized: Hudroûs; Latin: Hydruntum) is a town and comune in the province of Lecce (Apulia, Italy), in a fertile region once famous for its breed of horses.\nIt is located on the east coast of the Salento peninsula. The Strait of Otranto, to which the city gives its name, connects the Adriatic Sea with the Ionian Sea and separates Italy from Albania. The harbour is small and has little trade.\nThe lighthouse Faro della Palascìa, at approximately 5 kilometres (3 miles) southeast of Otranto, marks the most easterly point of the Italian mainland.\nAbout 50 kilometres (31 mi) south lies the promontory of Santa Maria di Leuca (so called since ancient times from its white cliffs, leukos being Greek for white), the southeastern extremity of Italy, the ancient Promontorium lapygium or Sallentinum. The district between this promontory and Otranto is thickly populated and very fertile.\nThe area that is in between Otranto and Santa Maria di Leuca is part of the Regional Natural Coastal Park of \"Costa Otranto - Santa Maria di Leuca e Bosco di Tricase\" wanted by the Apulia Region in 2008. This territory has numerous natural and historical attractions such as Ciolo, which is a rocky cove.\n\n\n== History ==\n\nOtranto occupies the site of the ancient Greek city Hydrus (in Greek: Ὑδροῦς) or Hydruntum (in Latin), also known as Hydrunton, Hydronton, or Hydruntu. Otranto was a town of Messapian (Illyrian) origin, which, in the wars of Pyrrhus and of Hannibal sided against Rome.\nIn Roman times it was a city. As it is the nearest port to the eastern coast of the Adriatic Sea, it was perhaps more important than Brundisium (present Brindisi), under the Roman emperors as a point of embarkation for the East, as the distance to Apollonia, (in present Albania) was less than from Brundisium.\nIn the 8th century, it was for some time in the possession of duke Arechis II of Benevento. It remained in the hands of the Byzantine emperors until it was among the last cities of Apulia to surrender to the Norman Robert Guiscard in 1068, and then became part of the Principality of Taranto. In the Middle Ages the Jews had a school there.\n\n\n=== Ottoman invasion ===\n\nIn 1480, Mehmet the Conqueror sent an Ottoman fleet to invade Rome under the command of Gedik Ahmed Pasha. This force reached the shores of Apulia on 28 July 1480 and the city was captured in two weeks on 11 August 1480. All of the male inhabitants were slaughtered by the victorious Ottomans. Of the 22,000 inhabitants there were only 10,000 that were left alive. Some 800 citizens, known as the \"Martyrs of Otranto,\" were beheaded after refusing to convert to Islam. They were canonized by Pope Francis on 12 May 2013.  Archbishop Stefano Pendinelli was also martyred.\nBetween August and September 1480, the Italian and European kingdoms failed to help King Ferdinand of Naples, except his cousin Ferdinand the Catholic, the Kingdom of Sicily and, later, the Republic of Genoa. In 1481, the Pope, in panic, called for a crusade to be led by King Ferdinand of Naples, and was joined by troops of Hungarian king Matthias Corvinus. The Turks controlled the city for 13 months. Mehmet II died on his way to capture the rest of Italy. His successor, Bayezid II, ordered Gedik Ahmed Pasha to be hanged and on 11 September 1481 the Turks abandoned the city.\nIn 1537, the famous Turkish corsair and Ottoman admiral Barbarossa recaptured Otranto and the Fortress of Castro, but the Turks were again repulsed from the city and from the rest of Apulia.\n\n\n=== Napoleonic Wars ===\nIn 1804, the city was obliged to harbour a French garrison that was established there to watch the movements of the English fleet. Under the French name of Otrante it was created a duché grand-fief de l'Empire in the Napoleonic kingdom of Naples for Joseph Fouché, Napoleon's minister of Police (1809), the ancestor of Margareta Fouché. The family used the title of  duc d'Otrante after Joseph Fouché's death.\n\n\n=== World War I ===\nDuring WWI the allied Italian-French-British Fleet organized the Otranto Barrage to control the Austro-Hungarian Fleet in the Adriatic Sea. The Austro-Hungarian Fleet led by captain Miklós Horthy attacked the Barrage (13 -15 May 1917) breaking it and sinking some British drifters (Battle of the Strait of Otranto (1917)).\n\n\n=== World War II ===\nDuring WWII the British fleet raided the Otranto Channel (11-12 November 1940) as a diversionary manoeuvre (Battle of the Strait of Otranto (1940) from the contemporary main attack on Taranto (Battle of Taranto)\n\n\n== Geography ==\n\n\n=== Climate ===\nOtranto experiences a humid subtropical climate (Köppen climate classification Cfa) with long, hot summers and short, cool winters.\n\n\n== Main sights ==\n\nOtranto main sights include:\n\nThe Castello Aragonese (Castle), reinforced by Emperor Frederick II and rebuilt by Alphonso II of Naples in 1485–98. It has an irregular plan with five sides, with a moat running along the entire perimeter. In origin it had a single entrance, reachable through a draw-bridge. Towers include three cylindrical ones and a bastion called Punta di Diamante (\"Diamond's Head\"). The entrance sports the coat of arms of Emperor Charles V.\nThe Cathedral, consecrated in 1088, a work of Count Roger I adorned later (about 1163), by Bishop Jonathas, with a mosaic floor; it has a rose window and side portal of 1481. The interior, a basilica with nave and two aisles, contains columns said to come from a temple of Minerva and a fine mosaic pavement of 1166, with interesting representations of the months, Old Testament subjects and others. Bones and relics of the Martyrs of Otranto, who perished in the 15th-century siege surround the high altar.  The church has a crypt supported by 42 marble columns. The same Count Roger also founded a Basilian monastery here, which, under Abbot Nicetas, became a place of study; its library was nearly all bought by Bessarion.\nThe church of San Pietro, with Byzantine frescoes.\nThe catacombs of Torre Pinta.\nIdro, a small river which the toponym Otranto stems from.\n\n\n== Culture ==\nOtranto is the setting of Horace Walpole's book The Castle of Otranto, which is generally held to be the first Gothic novel. Walpole had chosen the town from a map of the Kingdom of Naples because the name was \"well-sounding\"; he was not aware that Otranto had a castle until 1786, some twenty-two years after the novel was first published under a pseudonym. The principal model for the castle was his villa in Strawberry Hill, London.Otranto is also mentioned in Bram Stoker's novel The Lady of the Shroud.\n\n\n== International relations ==\n\n\n=== Twin towns – Sister cities ===\nOtranto is twinned  with:\n\n Sarandë, Albania\n\n\n== See also ==\nBishopric of Otranto\nOtranto Tragedy\nOttoman invasion of Otranto\n\n\n== Sources and references ==\n This article incorporates text from a publication now in the public domain: Chisholm, Hugh, ed. (1911). \"Otranto\". Encyclopædia Britannica (11th ed.). Cambridge University Press.\n This article incorporates text from a publication now in the public domain: Herbermann, Charles, ed. (1913). \"Otranto\". Catholic Encyclopedia. New York: Robert Appleton Company.\nHeraldica.org- Napoleonic\nGigaCatholic\n\n\n== External links ==\narchdiocsan website (in Italian)\nAdrian Fletcher’s Paradoxplace – Otranto Cathedral Mosaics Photo Page\nOtrano Video in English\n\n\n== References =="