"France (French: [fʁɑ̃s] ), officially the French Republic (French: République française), is a country primarily located in Western Europe, consisting of metropolitan France and several overseas regions and territories. The metropolitan area of France extends from the Rhine to the Atlantic Ocean and from the Mediterranean Sea to the English Channel and the North Sea. The overseas territories include French Guiana in South America and several islands in the Atlantic, Pacific and Indian Oceans. France borders Belgium, Luxembourg and Germany to the northeast, Switzerland, Monaco and Italy to the east, Andorra and Spain to the south, as well as the Netherlands, Suriname and Brazil in the Americas. The country's eighteen integral regions (five of which are situated overseas) span a combined area of 643,801 km2 (248,573 sq mi) and a total population of 67.4 million (as of April 2021). France is a unitary semi-presidential republic with its capital in Paris, the country's largest city and main cultural and commercial centre. Other major urban areas include Lyon, Marseille, Toulouse, Bordeaux, Lille and Nice. France, including its overseas territories, has the most time zones of any country, with a total of twelve.\nDuring the Iron Age, what is now metropolitan France was inhabited by the Gauls. The area was annexed by Rome in 51 BC, developing a distinct Gallo-Roman culture that laid the foundation of the French language. The Germanic Franks arrived in 476 and formed the Kingdom of Francia, which became the heartland of the Carolingian Empire. The Treaty of Verdun of 843 partitioned the empire, with West Francia becoming the Kingdom of France in 987.\nIn the High Middle Ages, France was a highly decentralized feudal kingdom in which the authority of the king was barely felt. King Philip Augustus achieved remarkable success in the strengthening of royal power and the expansion of his realm, doubling its size and defeating his rivals. By the end of his reign, France had emerged as the most powerful state in Europe. In the mid-14th century, French monarchs were embroiled in a series of dynastic conflicts with their English counterparts, collectively known as the Hundred Years' War, from which they ultimately emerged victorious. Disputes with Spain and the Holy Roman Empire soon followed during the Renaissance. Meanwhile, French culture flourished and a global colonial empire was established, which by the 20th century would become the second largest in the world. The second half of the 16th century was dominated by religious civil wars between Catholics and Protestants (Huguenots), which severely weakened the country. But France once again emerged as Europe's dominant cultural, political, and military power in the 17th century under Louis XIV following the Thirty Years' War. Despite the wealth of the nation, an inadequate financial model and inequitable taxation system coupled with endless and costly wars meant that the kingdom was left in a precarious economic situation by the end of the 18th century. Especially costly were the Seven Years' War and American War of Independence. The French Revolution in 1789 saw the fall of the absolute monarchy that characterized the Ancien Régime and from its ashes, rose one of modern history's earliest republics, which drafted the Declaration of the Rights of Man and of the Citizen. The declaration expresses the nation's ideals to this day.\nFollowing the revolution, France reached its political and military zenith in the early 19th century under Napoleon Bonaparte, subjugating much of continental Europe and establishing the First French Empire. The French Revolutionary and Napoleonic Wars shaped the course of European and world history. After the collapse of the empire and a relative decline, France endured a tumultuous succession of governments culminating in the establishment of the French Third Republic in 1870 in the midst of the Franco-Prussian War. France was one of the prominent participants of World War I, from which it emerged victorious, and was one of the Allied powers in World War II, but came under occupation by the Axis in 1940. Following liberation in 1944, a Fourth Republic was established and later dissolved in the course of the Algerian War. The Fifth Republic, led by Charles de Gaulle, was formed in 1958 and remains to this day. Algeria and nearly all other French colonies became independent in the 1960s, with most retaining close economic and military connections with France.\nFrance retains its centuries-long status as a global centre of art, science, and philosophy. It hosts the world's fifth-largest number of UNESCO World Heritage Sites and is the leading tourist destination, receiving over 89 million foreign visitors in 2018. France is a developed country with the world's seventh-largest economy by nominal GDP, and the ninth-largest by PPP. In terms of aggregate household wealth, it ranks fourth in the world. France performs well in international rankings of education, health care, life expectancy, and human development. It remains a great power in global affairs, being one of the five permanent members of the United Nations Security Council and an official nuclear-weapon state. France is a founding and leading member of the European Union and the Eurozone, and a member of the Group of 7, North Atlantic Treaty Organization (NATO), Organisation for Economic Co-operation and Development (OECD), the World Trade Organization (WTO), and La Francophonie."