"Neroli oil is an essential oil produced from the blossom of the bitter orange tree (Citrus aurantium subsp. amara or Bigaradia). Its scent is sweet, honeyed and somewhat metallic with green and spicy facets. Orange blossom is also extracted from the same blossom and both extracts are extensively used in perfumery. Orange blossom can be described as smelling sweeter, warmer and more floral than neroli. The difference between how neroli and orange blossom smell and why they are referred to with different names, is a result of the process of extraction that is used to obtain the oil from the blooms. Neroli is extracted by steam distillation and orange blossom is extracted via a process of enfleurage (rarely used nowadays due to prohibitive costs) or solvent extraction.\n\n\n== Production ==\nThe blossoms are gathered, usually by hand, in late April to early May. The oil is extracted by steam distillation. Tunisia, Morocco, and Egypt are the leading producers of Neroli.\n\n\n== History ==\nBy the end of the 17th century, Anne Marie Orsini, duchess of Bracciano and princess of Nerola, Italy, introduced the essence of bitter orange tree as a fashionable fragrance by using it to perfume her gloves and her bath. Since then, the term \"neroli\" has been used to describe this essence. Neroli has a refreshing and distinctive, spicy aroma with sweet and flowery notes.\n\n\n== Use ==\n\nNeroli is one of the most widely used floral oils in perfumery. Like many raw materials, neroli can cause sensitisation due to a high content of aromatic terpenes; e.g., linalool, limonene, farnesol, geraniol and citral.  It blends well with any citrus oil, various floral absolutes, and most of the synthetic components available on the market. \nIt also has a limited use in flavorings. Neroli oil is reportedly one of the ingredients in the closely guarded secret recipe for the Coca-Cola soft drink. It is a flavoring ingredient of open source cola recipes, although some variants consider it as optional, owing to the high cost.\n\n\n== See also ==\nCitrus × aurantium\nNerol\nOrange flower water\nOrange oil\nPetitgrain oil\n\n\n== References ==\n\n\n== External links ==\nEntry in the British Pharmaceutical Codex from 1911"