"A Ballad About Green Wood (Czech: Balada o zeleném dřevu) is a 1983 Czechoslovak short film written and directed by Jiří Barta. It is also known as The Ballad of Green Wood. It tells a story about spring and renewal, portrayed with animated pieces of firewood. It is inspired by the Legend of Vesna from Slavic folklore.\n\n\n== Plot ==\nA man chops firewood in the winter and leaves the wood in the snow. One of the split pieces has a woman's face. As the snow melts, the wood pieces begin to dance. Water flows and plants sprout around them. A raven attacks and eats the piece with a woman's face. The raven's body turns into a piece of wood with a distorted carved face. Plants die and the snow returns. The raven flies into a cave and goes to sleep. The sun rises and shines into the cave. The raven awakens and sees a piece of wood that looks like a knight on horseback. The knight charges and kills the raven with its lance. The firewoods place the raven's body on a pile of twigs, from which greenery grows and covers it. The raven transforms into a piece of firewood with a woman's face, and grows green twigs of its own, as the other firewoods dance around it. Back at the original location, the man picks up the firewoods and rips off the green twigs before he goes inside. Smoke comes out of his chimney.\n\n\n== Themes ==\nThe film celebrates the cyclical renewal of life in the spring. According to Barta, humans are always subject to the flow of the natural world. His own ambition, which is reflected in the film, is to be attentive to nature and follow its rhythm. The film scholar Adam Whybray describes the film as a series of movements between anthropocentric rational time and the natural world's natural or traditional time. Natural time becomes ecstatic in the spring, is frozen during the winter, and then renewed the next spring. Jenny Jediny of Not Coming to a Theater Near You writes that the \"fondness for the ancient and mythological\" foreshadows Barta's 1986 film The Pied Piper\".\n\n\n== Production ==\nThe story is based on a folk tale about the Sun Prince and the virgin Vesna. The film was originally conceived in the 1970s and was to be directed by František Vláčil, but due to other commitments Vláčil abandoned it. Barta revived the project and changed its artistic direction.The film was shot in the Bohemian Forest, the High Tatras, the Koněprusy Caves and at Studio Jiřího Trnky in Prague. Barta chose to make it outdoors because he was determined that a film about nature should depict real nature. This proved demanding due to the heavy reliance on stop-motion puppet animation, performed by the animator Milan  Svatoš, and the impact of the weather. Clouds and the sun's position created strict time limits, wind would blow over the meticulously positioned puppets, and rain caused halts in the production. The depiction of thaw was achieved by pouring water over a snowpack for several hours. The musical score was composed by Vladimír Merta.\n\n\n== Reception ==\nReviewing the DVD Jiri Barta: Labyrinth of Darkness in 2006, Jamie S. Rich of DVD Talk described the film as \"more visually stunning than illuminating, but cool all the same\". He wrote that the video quality was poor; \"probably the worst looking of the set\"; and the audio \"mixed a little low, as well\". In Animation: A World History (2016), the scholars Giannalberto Bendazzi and Tommaso Iannini call it \"a simple, short film of great impact\".\n\n\n== See also ==\nList of films based on Slavic mythology\n\n\n== References ==\n\n\n=== Notes ===\n\n\n=== Sources ===\n\n\n== External links ==\nA Ballad About Green Wood at IMDb\nCatalogue entry at Krátký film Praha"