"Moses Sithole  (born 17 November 1964) is a South African serial killer and rapist who committed the ABC Murders, so named because they began in Atteridgeville, continued in Boksburg and finished in Cleveland, a suburb of Johannesburg. Sithole murdered at least 38 people between 16 July 1994 and 6 November 1995.\n\n\n== Early life ==\nMoses Sithole was born on 17 November 1964 in Vosloorus, a township near Boksburg, Transvaal Province (now known as Gauteng). When he was five years old, his father died, and his mother abandoned the family. Sithole and his siblings spent the next three years in an orphanage, where he later said they were mistreated. By his own account, Sithole was arrested for rape in his teens and spent seven years in prison. He later blamed his imprisonment for turning him into a murderer. He explained his crimes by saying that the women he murdered all reminded him of the women who had falsely accused him of rape years before.\n\n\n== Murders ==\nSithole appeared to be a mild-mannered individual to those around him. At the time of his crimes, he was managing a shell organization, Youth Against Human Abuse, ostensibly devoted to the eradication of child abuse. After committing murders in Atteridgeville, near Pretoria, Sithole moved his focus to Boksburg and eventually to Cleveland. By 1995, he had claimed over thirty victims, sparking nationwide panic. In some cases, he would later phone the victims' families for no other apparent reason than to taunt them. At one point, President Nelson Mandela visited Boksburg in person to appeal for public assistance in apprehending the killer.\n\n\n=== Methods ===\nSithole targeted black women between the ages of 19 and 45 years old. Most of his victims were being interviewed for positions with Sithole's ersatz charity. Sithole would take them to remote fields, where he would beat, rape, and murder them. They were generally strangled with their own underwear. He once inflicted a head wound on the two-year-old son of one of his victims and left him to die from exposure.\n\n\n== Capture ==\nIn August 1995, Sithole was identified as having been seen with one of the victims, but he disappeared shortly after SAPS investigators learned details of his previous rape conviction. In October 1995, Sithole contacted South African journalist Tamsen de Beer and identified himself as the wanted murderer. During a phone conversation with de Beer, he indicated that the killings were carried out in revenge for his unjust imprisonment and claimed 76 victims, twice as many as those reported. Finally, in order to prove his identity, Sithole gave directions to where one of the bodies had been left. Local authorities subsequently cornered Sithole in Johannesburg, shooting the suspect when he attacked a constable with a hatchet. Sithole was driven to the hospital, where he was found to be HIV positive.\n\n\n== Trial and imprisonment ==\nOn 5 December 1997, Sithole was sentenced to 50 years' imprisonment for each of the 38 murders, twelve years' imprisonment for each of the 40 rapes, and five years' imprisonment for each of six robberies. Since his sentences run consecutively, his total effective sentence is 2,410 years. Justice David Carstairs ordered that Sithole would be required to serve at least 930 years before being eligible for parole. The judge also told Sithole that had capital punishment not been abolished, he would have been sentenced to death. Sithole was incarcerated in C-Max, the maximum security section of Pretoria Central Prison. He is currently incarcerated in Mangaung Correctional Centre in Bloemfontein.\n\n\n== Victims ==\nFull list of Sithole's victims\n\n\n== See also ==\nElias Xitavhudzi (serial killer in Atteridgeville)\nList of serial killers by country\nList of serial killers by number of victims\n\n\n== References ==\n\nNewton, Michael (2000). The Encyclopedia of Serial Killers. New York: Checkmark Books. p. 207. ISBN 0-8160-3979-8.\nStröhm, Martin. \"Graveyard\". Crime Library. Retrieved 26 October 2008.\nvon Nekerk, Philip (October 2000). \"A Time to Kill\". Maxim. maximonline.com. Archived from the original on 17 December 2007.\n\n\n== External links ==\nMoses Sithole: The South African Strangler at IMDb (Documentary)"