"A drum set – also called a drum kit, trap set (an abbreviation of the word \"contraption\") or simply drums – is a collection of drums, cymbals and other percussion instruments, which are set up on stands to be played by a single player, with drumsticks held in both hands and the feet operating pedals that control the hi-hat cymbal and the beater for the bass drum. A drum kit consists of a mix of drums (categorized classically as membranophones, Hornbostel-Sachs high-level classification 2) and idiophones ⁠– ⁠most significantly cymbals, but can also include the woodblock and cowbell (classified as Hornbostel-Sachs high-level classification 1). In the 2020s, some kits also include electronic instruments (Hornbostel-Sachs classification 53). Also, both hybrid (mixing acoustic instruments and electronic drums) and entirely electronic kits are used.\nA standard modern kit (for a right-handed player), as used in popular music and taught in music schools, contains:\n\nA snare drum, mounted on a stand, placed between the player's knees and played with drum sticks (which may include rutes or brushes)\nA bass drum, played by a pedal operated by the right foot, which moves a felt-covered beater\nTwo or more toms, played with sticks or brushes.\nA hi-hat (two cymbals mounted on a stand), played with the sticks, opened and closed with left foot pedal (it can also produce sound with the foot alone)\nOne or more cymbals, mounted on stands, played with the sticksAll of these are classified as non-pitched percussion, allowing the music to be scored using percussion notation, for which a loose semi-standardized form exists for both the drum kit and electronic drums. The drum kit is usually played while seated on a stool known as a throne. While many instruments like the guitar or piano are capable of performing melodies and chords, most drum kits are unable to achieve this as they produce sounds of indeterminate pitch. The drum kit is a part of the standard rhythm section, used in many types of popular and traditional music styles, ranging from rock and pop to blues and jazz. Other standard instruments used in the rhythm section include the piano, electric guitar, electric bass, and keyboards.\n\nMany drummers extend their kits from this basic configuration, adding more drums, more cymbals, and many other instruments including pitched percussion. In some styles of music, particular extensions are normal. For example, some rock and heavy metal drummers make use of double bass drums, which can be achieved with either a second bass drum or a remote double foot pedal. Some progressive drummers may include orchestral percussion such as gongs and tubular bells in their rig. Some performers, such as some rockabilly and funk drummers, play small kits that omit elements from the basic setup."