"Industrial music is a genre of music that draws on harsh, transgressive or provocative sounds and themes. AllMusic defines industrial music as the \"most abrasive and aggressive fusion of rock and electronic music\" that was \"initially a blend of avant-garde electronics experiments (tape music, musique concrète, white noise, synthesizers, sequencers, etc.) and punk provocation\". The term was coined in the mid-1970s with the founding of Industrial Records by members of Throbbing Gristle and Monte Cazazza. While the genre name originated with Throbbing Gristle's emergence in the United Kingdom, concentrations of artists and labels vital to the genre also emerged in the United States, mainly Lou Reed's Metal Machine Music.\nThe first industrial artists experimented with noise and aesthetically controversial topics, musically and visually, such as fascism, sexual perversion, and the occult. Prominent industrial musicians include Throbbing Gristle, Monte Cazazza, SPK, Boyd Rice, Cabaret Voltaire, and Z'EV. On Throbbing Gristle's 1977 debut album The Second Annual Report, they coined the slogan \"industrial music for industrial people\". Chicago-based independent label Wax Trax Records featured a heavy roster of industrial music acts. The precursors that influenced the development of the genre included acts such as German electronic groups Faust, Neu! and Kraftwerk, experimental rock acts such as Pink Floyd and Frank Zappa, psychedelic rock artists such as Jimi Hendrix, and composers such as John Cage. Musicians also cite writers such as William S. Burroughs, and philosophers such as Friedrich Nietzsche as influences.\nWhile the term was self-applied by a small coterie of groups and individuals associated with Industrial Records in the late 1970s, it was broadened to include artists influenced by the original movement or using an \"industrial\" aesthetic. Over time, the genre's influence spread into and blended with styles including ambient, synth music and rock such as Front 242, Front Line Assembly, KMFDM, and Sister Machine Gun from the Chicago-based Wax Trax Records. Electro-industrial music is a primary subgenre that developed in the 1980s, with the most notable bands in the genre being Front Line Assembly and Skinny Puppy. The two other most notable hybrid genres are industrial rock and industrial metal, which include bands such as Nine Inch Nails, Ministry, Rammstein, and Fear Factory, the first three of which released platinum-selling albums in the 1990s."