"Toccata (from Italian toccare, literally, \"to touch\", with \"toccata\" being the action of touching) is a virtuoso piece of music typically for a keyboard or plucked string instrument featuring fast-moving, lightly fingered or otherwise virtuosic passages or sections, with or without imitative or fugal interludes, generally emphasizing the dexterity of the performer's fingers. Less frequently, the name is applied to works for multiple instruments (the opening of Claudio Monteverdi's opera L'Orfeo being a notable example).\n\n\n== History ==\n\n\n=== Renaissance ===\nThe form first appeared in the late Renaissance period. It originated in northern Italy. Several publications of the 1590s include toccatas, by composers such as Claudio Merulo, Andrea and Giovanni Gabrieli, Adriano Banchieri, and Luzzasco Luzzaschi. These are keyboard compositions in which one hand, and then the other, performs virtuosic runs and brilliant cascading passages against a chordal accompaniment in the other hand. Among the composers working in Venice at this time was the young Hans Leo Hassler, who studied with the Gabrielis; he brought the form back with him to Germany. It was in Germany where it underwent its highest development, culminating in the work of Johann Sebastian Bach more than a hundred years later.\n\n\n=== Baroque ===\nThe Baroque toccata, beginning with Girolamo Frescobaldi, is more sectional and increased in length, intensity and virtuosity from the Renaissance version, reaching heights of extravagance equivalent to the overwhelming detail seen in the architecture of the period. It often featured rapid runs and arpeggios alternating with chordal or fugal parts. Sometimes there was a lack of regular tempo and almost always an improvisational feel.\nOther Baroque composers of toccatas, in the period before Bach, include Johann Pachelbel, Michelangelo Rossi, Johann Jakob Froberger, Jan Pieterszoon Sweelinck, Alessandro Scarlatti, and Dieterich Buxtehude.\nBach's toccatas are among the most famous examples of the form, and his Toccata and Fugue in D minor, BWV 565 is one of the most popular organ works today, although its authorship is disputed by some authorities. His toccatas for organ are improvisatory compositions, and are often followed by an independent fugue movement. In such cases, the toccata is used in place of the usually more stable prelude. Bach's toccatas for harpsichord are multi-sectional works which include fugal writing as part of their structure.\n\n\n=== After the Baroque ===\nBeyond the Baroque period, toccatas are found less frequently. There are a few notable examples, however. From the Romantic period, Robert Schumann and Franz Liszt each wrote a piano toccata. Schumann's ambitious Toccata in C major is considered one of the most technically difficult works in the repertoire and the foremost representative of the genre in the 1800s. The Liszt toccata is a very short and austere composition from his late period, and is practically a toccata only by name. Smaller-scale toccatas are sometimes called \"toccatina\": Liszt's contemporary and well-known virtuoso in his day Charles-Valentin Alkan composed a brief toccatina as his last published work (Op. 75).\nFrom the early 20th century, Prokofiev and Aram Khachaturian each wrote a toccata for solo piano, as did French composers Maurice Ravel as part of Le Tombeau de Couperin, Jules Massenet, Claude Debussy in his suite Pour le piano and also \"Jardins sous la pluie\" (which is a toccata but not in name), Pierre Sancan and York Bowen's Toccata Op. 155. Kaikhosru Shapurji Sorabji wrote four toccatas for solo piano, while Moises Moleiro wrote two. George Enescu's Piano Suite No. 2, Op. 10, opens with a toccata. The first movement of Benjamin Britten's Piano Concerto is a toccata, as is the first movement of Nikolai Medtner's 2nd piano concerto.\nThe toccata form was of great importance in the French romantic organ school, something of which Jacques-Nicolas Lemmens laid the foundation with his Fanfare. Toccatas in this style usually consist of rapid chord progressions combined with a powerful tune (often played in the pedal). The most famous examples are the ending movement of Charles-Marie Widor's Symphony No. 5, and the Finale of Louis Vierne's Symphony No. 1.\nMore recently, John Rutter wrote Toccata in Seven, so called because of its time signature. Toccatas occasionally make appearances in works for full orchestra; a notable example is the final movement of the Eighth Symphony of Ralph Vaughan Williams. As for toccatas written for string instruments, the final movement of John Adams' Violin Concerto is entitled \"Toccare,\" a possible reference to the origins of the word toccata; and the first movement (Schnelle halbe) of Paul Hindemith's fifth Kammermusik (a viola concerto) is written as a toccata. Another contemporary composer who has written many toccatas is Emma Lou Diemer. In addition to several toccatas for organ, she has written three for piano (the one written in 1979 is frequently played), one for flute chorus, one for violin and piano, one for solo timpani and one for six mallet percussion. Russian jazz composer Nikolai Kapustin composed two toccatina; one as part of his Eight Concert Etudes, Op. 40 and another Opus 36. Evgeny Kissin wrote a jazz-inspired toccata as part of his Four Piano Pieces, Op. 1.\n\n\n== Literature ==\nRobert Browning used the motif or concept of a toccata by Baldassare Galuppi to evoke thoughts of human transience in his poem \"A Toccata of Galuppi's\" (although Galuppi did not actually write any piece with the name 'Toccata').\n\n\n== References ==\n\n\n== External links ==\nRobert Browning, \"A Toccata of Galuppi's\" published 1855 e-text"