"The Worshipful Company of Mercers is the premier Livery Company of the City of London and ranks first in the order of precedence of the Companies. It is the first of the Great Twelve City Livery Companies. Although of even older origin, the company was incorporated under a Royal Charter in 1394, the company's earliest extant Charter. The company's aim was to act as a trade association for general merchants, and especially for exporters of wool and importers of velvet, silk and other luxurious fabrics (mercers). By the 16th century many members of the company had lost any connection with the original trade. Today, the Company exists primarily as a charitable institution, supporting a variety of causes. The company's motto is Honor Deo, Latin for \"Honour to God\".\n\n\n== Etymology ==\nThe word \"mercer\" derives from the Latin merx, mercis, \"merchandise\" from which root also derives the word \"merchant\". The words mercero and mercier, still used in Spanish and French respectively, have meanings similar to haberdasher, although the medieval mercers would not have recognised any relationship to that trade which was covered by the separate Worshipful Company of Haberdashers.\n\n\n== Mercer foundations ==\nIn education, the company has administered St Paul's School since 1509 (and its prep school St Paul's Juniors), St Paul's Girls' School since 1904, two prep schools in London, The Hall School and Bute House, and retains close links with Collyer's College, Dauntsey's School, Abingdon School, Peter Symonds College and Gresham College, all founded by mercers. In recent times the company has founded a City Technology College (Thomas Telford School) and two City Academies (Walsall Academy and Sandwell Academy).\nThere was also a Mercers' School which was granted its first charter in 1447, and closed in 1959 when pupil numbers fell. The school was most recently based in Barnard's Inn in Holborn, now the home of Gresham College.\nIn 2011, the Mercers co-sponsored a new academy school, Hammersmith Academy, specialising in creative and digital media and information technology, located in Hammersmith.\nThe school was established in a new building, with support from the Mercers and the Worshipful Company of Information Technologists.\n\n\n== Mercers' Hall ==\n\nThe Mercers' Company is based at Mercers' Hall, 6 Frederick's Place in the City of London. From the 14th century onwards the Company held its meetings in the Hospital of St. Thomas of Acon on Cheapside. Between 1517 and 1524 the Company built the Mercer's Chapel on this land, with the first Mercers' Hall above it, fronting Cheapside. The building was destroyed in the Great Fire of London in 1666. The second Hall, designed by Edward Jarman and John Oliver, opened in May 1676. The Hall was extensively refurbished during the period 1877 to 1881 (the porch of the 1676 building is now incorporated into the facade of Swanage Town Hall). The frontage was remodelled by George Barnes Williams and the interiors were redesigned by John Gregory Crace, the renowned Victorian designer. The Hall was destroyed by fire in 1941 during the Blitz. The third and present Mercers' Hall was opened in May 1958. The architect was E. Noel Clifton of Gunton and Gunton. The Hall incorporates fittings from the old Hall, including some 17th-century woodwork and Victorian stained glass. The Mercers' Company is the only City Livery Company to have its own private chapel.\n\n\n== Membership ==\nChildren whose father or mother was a member of the Company at the time of their birth have an automatic right to become Mercers by 'patrimony'.\nMost other members have a family connection to the company and obtain their Freedom by Redemption. Under this process applicants are recommended for membership after an interview and, if approved, they pay a sum of money called a 'fine'.\nOther people can also become Members by Redemption. Membership is sometimes granted because the Company wishes to honour the individual. Notable Members who joined the company by Redemption are Thomas More and Winston Churchill.\nOne other route to membership is by apprenticeship, but this has not happened recently. In the early days this was a very usual route; an apprentice would be 'bound' to a Member for a term of about seven years but in exchange the member was required to teach the apprentice such that he was worthy of membership by the end of the term, when he became a 'Freeman', for he was no longer bound. Freemen of a Livery Company are also Freemen of the City of London, which used to carry certain privileges, such as the right to drive a flock of sheep without charge over London Bridge.\n\n\n== Coat of arms ==\n\nThe origin of the \"Mercers' Maiden\", the heraldic emblem of the company, is not known. Unlike most of the City livery companies, the Mercers had no early grant of arms but the 1425 charter granted a common seal. A few impressions of the early seal survive showing a greatly simplified version of the present coat of arms. The fifteenth century Wardens' Accounts reveal that, even then, the Company required the device of the Maid's Head to be displayed on its property. In 1530 the Company stated to the College of Heralds that they had no arms but only a Maid's Head for their common seal and in 1568 the Heralds registered the seal as the company's arms.\nIn 1911 the College of Arms confirmed the arms and granted the company a crest and motto, 'Honor Deo' (Honour to God). The grant blazons the arms: Gules, issuant from a bank of clouds a figure of the Virgin couped at the shoulders proper vested in a crimson robe adorned with gold the neck encircled by a jeweled necklace crined or and wreathed about the temples with a chaplet of roses alternately argent and of the first and crowned with a celestial crown the whole within a bordure of clouds also proper.\n\n\n== Current activities ==\nEvery year the Mercers' Company publishes an annual review of their activities. The property portfolio includes 90 residential flats in Covent Garden. In an average year they might give away £7m, about one-sixth of the total charitable contributions for the 110 livery companies.\n\n\n== Mercers ==\n\nAmong famous Mercers were:\n\nWilliam Caxton, printer\nSir John Thynne (c. 1513–1580), builder of Longleat\nJohn Dee (1527–1608), mathematician and astrologer\nLionel Duckett (1511–1587), Sheriff of London (1565), Lord Mayor of London (1572)\nRichard Whittington, Mayor of the City of London\nSir John Gresham, Mayor of the City of London\nSir Richard Gresham, merchant and Mayor of the City of London\nSir Thomas Gresham, merchant, financier and founder of Gresham College\nJohn Roysse (1500/01–1571), merchant and benefactor\nRoundell Palmer, 1st Earl of Selborne (1812–1895), Lord Chancellor\nWilliam Palmer, 2nd Earl of Selborne KG GCMG PC (1859–1942), politician and High Commissioner of South Africa\nCecil Clementi (1875–1947), Governor of Hong Kong\nHarry Hodson, economist, editor of The Sunday Times (1950–61)\nRobert Baden-Powell, 1st Baron Baden-Powell, founder of the Scout movement\nEarl Jellicoe, Lord Privy Seal (1970–73).\nSir Alexander Graham, Lord Mayor of the City of London\nSir Ralph Verney, (1410–1478), Lord Mayor of the City of London\nJohn Colet (1467–1519), founder of St Paul's School, London and dean of St Paul's Cathedral\n\n\n== See also ==\nKilrea, Mercers plantation settlement in Northern Ireland.\n\n\n== References ==\n\n\n== Further reading ==\nSutton, Anne F., The Mercery of London: Trade, Goods and People, 1130–1578, Aldershot, 2005\n\n\n== External links ==\nThe Mercers' Company"