"Plants are mainly multicellular organisms, predominantly photosynthetic eukaryotes of the kingdom Plantae. Historically, plants were treated as one of two kingdoms including all living things that were not animals, and all algae and fungi were treated as plants. However, all current definitions of Plantae exclude the fungi and some algae, as well as the prokaryotes (the archaea and bacteria). By one definition, plants form the clade Viridiplantae (Latin name for \"green plants\"), a group that includes the flowering plants, conifers and other gymnosperms, ferns and their allies, hornworts, liverworts, mosses, and the green algae, but excludes the red and brown algae.\nGreen plants obtain most of their energy from sunlight via photosynthesis by primary chloroplasts that are derived from endosymbiosis with cyanobacteria. Their chloroplasts contain chlorophylls a and b, which gives them their green color. Some plants are parasitic or mycotrophic and have lost the ability to produce normal amounts of chlorophyll or to photosynthesize, but still have flowers, fruits, and seeds. Plants are characterized by sexual reproduction and alternation of generations, although asexual reproduction is also common.\nThere are about 320,000 species of plants, of which the great majority, some 260–290 thousand, produce seeds. Green plants provide a substantial proportion of the world's molecular oxygen, and are the basis of most of Earth's ecosystems. Plants that produce grain, fruit, and vegetables also form basic human foods and have been domesticated for millennia. Plants have many cultural and other uses, as ornaments, building materials, writing material and, in great variety, they have been the source of medicines and psychoactive drugs. The scientific study of plants is known as botany, a branch of biology.\n\n\n== Definition ==\nAll living things were traditionally placed into one of two groups, plants and animals. This classification may date from Aristotle (384 BC – 322 BC), who made the distinction between plants, which generally do not move, and animals, which often are mobile to catch their food. Much later, when Linnaeus (1707–1778) created the basis of the modern system of scientific classification, these two groups became the kingdoms Vegetabilia (later Metaphyta or Plantae) and Animalia (also called Metazoa). Since then, it has become clear that the plant kingdom as originally defined included several unrelated groups, and the fungi and several groups of algae were removed to new kingdoms. However, these organisms are still often considered plants, particularly in popular contexts.The term \"plant\" generally implies the possession of the following traits: multicellularity, possession of cell walls containing cellulose, and the ability to carry out photosynthesis with primary chloroplasts.\n\n\n=== Current definitions of Plantae ===\nWhen the name Plantae or plant is applied to a specific group of organisms or taxon, it usually refers to one of four concepts. From least to most inclusive, these four groupings are:\n\nAnother way of looking at the relationships between the different groups that have been called \"plants\" is through a cladogram, which shows their evolutionary relationships. These are not yet completely settled, but one accepted relationship between the three groups described above is shown below. Those which have been called \"plants\" are in bold (some minor groups have been omitted).\n\nThe way in which the groups of green algae are combined and named varies considerably between authors.\n\n\n=== Algae ===\n\nAlgae comprise several different groups of organisms which produce food by photosynthesis and thus have traditionally been included in the plant kingdom. The seaweeds range from large multicellular algae to single-celled organisms and are classified into three groups, the green algae, red algae and brown algae. There is good evidence that the brown algae evolved independently from the others, from non-photosynthetic ancestors that formed endosymbiotic relationships with red algae rather than from cyanobacteria, and they are no longer classified as plants as defined here.The Viridiplantae, the green plants – green algae and land plants – form a clade, a group consisting of all the descendants of a common ancestor. With a few exceptions, the green plants have the following features in common; primary chloroplasts derived from cyanobacteria containing chlorophylls a and b, cell walls containing cellulose, and food stores in the form of starch contained within the plastids. They undergo closed mitosis without centrioles, and typically have mitochondria with flat cristae. The chloroplasts of green plants are surrounded by two membranes, suggesting they originated directly from endosymbiotic cyanobacteria.\nTwo additional groups, the Rhodophyta (red algae) and Glaucophyta (glaucophyte algae), also have primary chloroplasts that appear to be derived directly from endosymbiotic cyanobacteria, although they differ from Viridiplantae in the pigments which are used in photosynthesis and so are different in colour. These groups also differ from green plants in that the storage polysaccharide is floridean starch and is stored in the cytoplasm rather than in the plastids. They appear to have had a common origin with Viridiplantae and the three groups form the clade Archaeplastida, whose name implies that their chloroplasts were derived from a single ancient endosymbiotic event. This is the broadest modern definition of the term 'plant'.\nIn contrast, most other algae (e.g. brown algae/diatoms, haptophytes, dinoflagellates, and euglenids) not only have different pigments but also have chloroplasts with three or four surrounding membranes. They are not close relatives of the Archaeplastida, presumably having acquired chloroplasts separately from ingested or symbiotic green and red algae. They are thus not included in even the broadest modern definition of the plant kingdom, although they were in the past.\nThe green plants or Viridiplantae were traditionally divided into the green algae (including the stoneworts) and the land plants. However, it is now known that the land plants evolved from within a group of green algae, so that the green algae by themselves are a paraphyletic group, i.e. a group that excludes some of the descendants of a common ancestor. Paraphyletic groups are generally avoided in modern classifications, so that in recent treatments the Viridiplantae have been divided into two clades, the Chlorophyta and the Streptophyta (including the land plants and Charophyta).The Chlorophyta (a name that has also been used for all green algae) are the sister group to the Charophytes, from which the land plants evolved. There are about 4,300 species, mainly unicellular or multicellular marine organisms such as the sea lettuce, Ulva.\nThe other group within the Viridiplantae are the mainly freshwater or terrestrial Streptophyta, which consists of the land plants together with the Charophyta, itself consisting of several groups of green algae such as the desmids and stoneworts. Streptophyte algae are either unicellular or form multicellular filaments, branched or unbranched. The genus Spirogyra is a filamentous streptophyte alga familiar to many, as it is often used in teaching and is one of the organisms responsible for the algal \"scum\" on ponds. The freshwater stoneworts strongly resemble land plants and are believed to be their closest relatives. Growing immersed in fresh water, they consist of a central stalk with whorls of branchlets.\n\n\n=== Fungi ===\n\nLinnaeus' original classification placed the fungi within the Plantae, since they were unquestionably neither animals or minerals and these were the only other alternatives. With 19th century developments in microbiology, Ernst Haeckel introduced the new kingdom Protista in addition to Plantae and Animalia, but whether fungi were best placed in the Plantae or should be reclassified as protists remained controversial.  In 1969, Robert Whittaker proposed the creation of the kingdom Fungi. Molecular evidence has since shown that the most recent common ancestor (concestor), of the Fungi was probably more similar to that of the Animalia than to that of Plantae or any other kingdom.Whittaker's original reclassification was based on the fundamental difference in nutrition between the Fungi and the Plantae. Unlike plants, which generally gain carbon through photosynthesis, and so are called autotrophs, fungi do not possess chloroplasts and generally obtain carbon by breaking down and absorbing surrounding materials, and so are called heterotrophic saprotrophs. In addition, the substructure of multicellular fungi is different from that of plants, taking the form of many chitinous microscopic strands called hyphae, which may be further subdivided into cells or may form a syncytium containing many eukaryotic nuclei. Fruiting bodies, of which mushrooms are the most familiar example, are the reproductive structures of fungi, and are unlike any structures produced by plants.\n\n\n== Diversity ==\nThe table below shows some species count estimates of different green plant (Viridiplantae) divisions. About 85–90% of all plants are flowering plants. Several projects are currently attempting to collect all plant species in online databases, e.g. the World Flora Online and World Plants both list about 350,000 species.\n\nThe naming of plants is governed by the International Code of Nomenclature for algae, fungi, and plants and International Code of Nomenclature for Cultivated Plants (see cultivated plant taxonomy).\n\n\n=== Evolution ===\n\nThe evolution of plants has resulted in increasing levels of complexity, from the earliest algal mats, through bryophytes, lycopods, ferns to the complex gymnosperms and angiosperms of today. Plants in all of these groups continue to thrive, especially in the environments in which they evolved.\nAn algal scum formed on the land 1,200 million years ago, but it was not until the Ordovician Period, around 450 million years ago, that land plants appeared. However, new evidence from the study of carbon isotope ratios in Precambrian rocks has suggested that complex photosynthetic plants developed on the earth over 1000 m.y.a. For more than a century it has been assumed that the ancestors of land plants evolved in aquatic environments and then adapted to a life on land, an idea usually credited to botanist Frederick Orpen Bower in his 1908 book The Origin of a Land Flora. A recent alternative view, supported by genetic evidence, is that they evolved from terrestrial single-celled algae, and that even the common ancestor of red and green algae, and the unicellular freshwater algae glaucophytes, originated in a terrestrial environment in freshwater biofilms or microbial mats. Primitive land plants began to diversify in the late Silurian Period, around 420 million years ago, and the results of their diversification are displayed in remarkable detail in an early Devonian fossil assemblage from the Rhynie chert. This chert preserved early plants in cellular detail, petrified in volcanic springs. By the middle of the Devonian Period most of the features recognised in plants today are present, including roots, leaves and secondary wood, and by late Devonian times seeds had evolved. Late Devonian plants had thereby reached a degree of sophistication that allowed them to form forests of tall trees. Evolutionary innovation continued in the Carboniferous and later geological periods and is ongoing today. Most plant groups were relatively unscathed by the Permo-Triassic extinction event, although the structures of communities changed. This may have set the scene for the evolution of flowering plants in the Triassic (~200 million years ago), which exploded in the Cretaceous and Tertiary. The latest major group of plants to evolve were the grasses, which became important in the mid Tertiary, from around 40 million years ago. The grasses, as well as many other groups, evolved new mechanisms of metabolism to survive the low CO2 and warm, dry conditions of the tropics over the last 10 million years.\nA 1997 proposed phylogenetic tree of Plantae, after Kenrick and Crane, is as follows, with modification to the Pteridophyta from Smith et al. The Prasinophyceae are a paraphyletic assemblage of early diverging green algal lineages, but are treated as a group outside the Chlorophyta: later authors have not followed this suggestion.\n\nA newer proposed classification follows Leliaert et al. 2011 and modified with Silar 2016 for the green algae clades and Novíkov & Barabaš-Krasni 2015 for the land plants clade. Notice that the Prasinophyceae are here placed inside the Chlorophyta.\n\nLater, a phylogeny based on genomes and transcriptomes from 1,153 plant species was proposed. The placing of algal groups is supported by phylogenies based on genomes from the Mesostigmatophyceae and Chlorokybophyceae that have since been sequenced. The classification of Bryophyta is supported both by Puttick et al. 2018, and by phylogenies involving the hornwort genomes that have also since been sequenced.\n\n\n=== Embryophytes ===\n\nThe plants that are likely most familiar to us are the multicellular land plants, called embryophytes. Embryophytes include the vascular plants, such as ferns, conifers and flowering plants. They also include the bryophytes, of which mosses and liverworts are the most common.\nAll of these plants have eukaryotic cells with cell walls composed of cellulose, and most obtain their energy through photosynthesis, using light, water and carbon dioxide to synthesize food. About three hundred plant species do not photosynthesize but are parasites on other species of photosynthetic plants. Embryophytes are distinguished from green algae, which represent a mode of photosynthetic life similar to the kind modern plants are believed to have evolved from, by having specialized reproductive organs protected by non-reproductive tissues.\nBryophytes first appeared during the early Paleozoic. They mainly live in habitats where moisture is available for significant periods, although some species, such as Targionia, are desiccation-tolerant. Most species of bryophytes remain small throughout their life-cycle. This involves an alternation between two generations: a haploid stage, called the gametophyte, and a diploid stage, called the sporophyte. In bryophytes, the sporophyte is always unbranched and remains nutritionally dependent on its parent gametophyte. The embryophytes have the ability to secrete a cuticle on their outer surface, a waxy layer that confers resistant to desiccation. In the mosses and hornworts a cuticle is usually only produced on the sporophyte. Stomata are absent from liverworts, but occur on the sporangia of mosses and hornworts, allowing gas exchange.\nVascular plants first appeared during the Silurian period, and by the Devonian had diversified and spread into many different terrestrial environments. They developed a number of adaptations that allowed them to spread into increasingly more arid places, notably the vascular tissues xylem and phloem, that transport water and food throughout the organism. Root systems capable of obtaining soil water and nutrients also evolved during the Devonian. In modern vascular plants, the sporophyte is typically large, branched, nutritionally independent and long-lived, but there is increasing evidence that Paleozoic gametophytes were just as complex as the sporophytes. The gametophytes of all vascular plant groups evolved to become reduced in size and prominence in the life cycle.\nIn seed plants, the microgametophyte is reduced from a multicellular free-living organism to a few cells in a pollen grain and the miniaturised megagametophyte remains inside the megasporangium, attached to and dependent on the parent plant. A megasporangium enclosed in a protective layer called an integument is known as an ovule. After fertilisation by means of sperm produced by pollen grains, an embryo sporophyte develops inside the ovule. The integument becomes a seed coat, and the ovule develops into a seed. Seed plants can survive and reproduce in extremely arid conditions, because they are not dependent on free water for the movement of sperm, or the development of free living gametophytes.\nThe first seed plants, pteridosperms (seed ferns), now extinct, appeared in the Devonian and diversified through the Carboniferous. They were the ancestors of modern gymnosperms, of which four surviving groups are widespread today, particularly the conifers, which are dominant trees in several biomes. The name gymnosperm comes from the Greek γυμνόσπερμος, a composite of γυμνός (gymnos lit. 'naked') and σπέρμα (sperma lit. 'seed'), as the ovules and subsequent seeds are not enclosed in a protective structure (carpels or fruit), but are borne naked, typically on cone scales.\n\n\n=== Fossils ===\n\nPlant fossils include roots, wood, leaves, seeds, fruit, pollen, spores, phytoliths, and amber (the fossilized resin produced by some plants). Fossil land plants are recorded in terrestrial, lacustrine, fluvial and nearshore marine sediments. Pollen, spores and algae (dinoflagellates and acritarchs) are used for dating sedimentary rock sequences. The remains of fossil plants are not as common as fossil animals, although plant fossils are locally abundant in many regions worldwide.\nThe earliest fossils clearly assignable to Kingdom Plantae are fossil green algae from the Cambrian. These fossils resemble calcified multicellular members of the Dasycladales. Earlier Precambrian fossils are known that resemble single-cell green algae, but definitive identity with that group of algae is uncertain.\nThe earliest fossils attributed to green algae date from the Precambrian (ca. 1200 mya). The resistant outer walls of prasinophyte cysts (known as phycomata) are well preserved in fossil deposits of the Paleozoic (ca. 250–540 mya). A filamentous fossil (Proterocladus) from middle Neoproterozoic deposits (ca. 750 mya) has been attributed to the Cladophorales, while the oldest reliable records of the Bryopsidales, Dasycladales) and stoneworts are from the Paleozoic.The oldest known fossils of embryophytes date from the Ordovician, though such fossils are fragmentary. By the Silurian, fossils of whole plants are preserved, including the simple vascular plant Cooksonia in mid-Silurian and the much larger and more complex lycophyte Baragwanathia longifolia in late Silurian. From the early Devonian Rhynie chert, detailed fossils of lycophytes and rhyniophytes have been found that show details of the individual cells within the plant organs and the symbiotic association of these plants with fungi of the order Glomales. The Devonian period also saw the evolution of leaves and roots, and the first modern tree, Archaeopteris. This tree with fern-like foliage and a trunk with conifer-like wood was heterosporous producing spores of two different sizes, an early step in the evolution of seeds.The Coal measures are a major source of Paleozoic plant fossils, with many groups of plants in existence at this time. The spoil heaps of coal mines are the best places to collect; coal itself is the remains of fossilised plants, though structural detail of the plant fossils is rarely visible in coal. In the Fossil Grove at Victoria Park in Glasgow, Scotland, the stumps of Lepidodendron trees are found in their original growth positions.\nThe fossilized remains of conifer and angiosperm roots, stems and branches may be locally abundant in lake and inshore sedimentary rocks from the Mesozoic and Cenozoic eras. Sequoia and its allies, magnolia, oak, and palms are often found.\nPetrified wood is common in some parts of the world, and is most frequently found in arid or desert areas where it is more readily exposed by erosion. Petrified wood is often heavily silicified (the organic material replaced by silicon dioxide), and the impregnated tissue is often preserved in fine detail. Such specimens may be cut and polished using lapidary equipment. Fossil forests of petrified wood have been found in all continents.\nFossils of seed ferns such as Glossopteris are widely distributed throughout several continents of the Southern Hemisphere, a fact that gave support to Alfred Wegener's early ideas regarding Continental drift theory.\n\n\n== Structure, growth, and development ==\n\nMost of the solid material in a plant is taken from the atmosphere. Through the process of photosynthesis, most plants use the energy in sunlight to convert carbon dioxide from the atmosphere, plus water, into simple sugars. These sugars are then used as building blocks and form the main structural component of the plant. Chlorophyll, a green-colored, magnesium-containing pigment is essential to this process; it is generally present in plant leaves, and often in other plant parts as well. Parasitic plants, on the other hand, use the resources of their host to provide the materials needed for metabolism and growth.\nPlants usually rely on soil primarily for support and water (in quantitative terms), but they also obtain compounds of nitrogen, phosphorus, potassium, magnesium and other elemental nutrients from the soil. Epiphytic and lithophytic plants depend on air and nearby debris for nutrients, and carnivorous plants supplement their nutrient requirements, particularly for nitrogen and phosphorus, with insect prey that they capture. For the majority of plants to grow successfully they also require oxygen in the atmosphere and around their roots (soil gas) for respiration. Plants use oxygen and glucose (which may be produced from stored starch) to provide energy. Some plants grow as submerged aquatics, using oxygen dissolved in the surrounding water, and a few specialized vascular plants, such as mangroves and reed (Phragmites australis), can grow with their roots in anoxic conditions.\n\n\n=== Factors affecting growth ===\nThe genome of a plant controls its growth. For example, selected varieties or genotypes of wheat grow rapidly, maturing within 110 days, whereas others, in the same environmental conditions, grow more slowly and mature within 155 days.Growth is also determined by environmental factors, such as temperature, available water, available light, carbon dioxide and available nutrients in the soil. Any change in the availability of these external conditions will be reflected in the plant's growth and the timing of its development.Biotic factors also affect plant growth. Plants can be so crowded that no single individual produces normal growth, causing etiolation and chlorosis. Optimal plant growth can be hampered by grazing animals, suboptimal soil composition, lack of mycorrhizal fungi, and attacks by insects or plant diseases, including those caused by bacteria, fungi, viruses, and nematodes.\n\nSimple plants like algae may have short life spans as individuals, but their populations are commonly seasonal. Annual plants grow and reproduce within one growing season, biennial plants grow for two growing seasons and usually reproduce in second year, and perennial plants live for many growing seasons and once mature will often reproduce annually. These designations often depend on climate and other environmental factors. Plants that are annual in alpine or temperate regions can be biennial or perennial in warmer climates. Among the vascular plants, perennials include both evergreens that keep their leaves the entire year, and deciduous plants that lose their leaves for some part of it. In temperate and boreal climates, they generally lose their leaves during the winter; many tropical plants lose their leaves during the dry season.The growth rate of plants is extremely variable. Some mosses grow less than 0.001 millimeters per hour (mm/h), while most trees grow 0.025–0.250 mm/h. Some climbing species, such as kudzu, which do not need to produce thick supportive tissue, may grow up to 12.5 mm/h.Plants protect themselves from frost and dehydration stress with antifreeze proteins, heat-shock proteins and sugars (sucrose is common). LEA (Late Embryogenesis Abundant) protein expression is induced by stresses and protects other proteins from aggregation as a result of desiccation and freezing.\n\n\n==== Effects of freezing ====\nWhen water freezes in plants, the consequences for the plant depend very much on whether the freezing occurs within cells (intracellularly) or outside cells in intercellular spaces. Intracellular freezing, which usually kills the cell regardless of the hardiness of the plant and its tissues, seldom occurs in nature because rates of cooling are rarely high enough to support it. Rates of cooling of several degrees Celsius per minute are typically needed to cause intracellular formation of ice. At rates of cooling of a few degrees Celsius per hour, segregation of ice occurs in intercellular spaces. This may or may not be lethal, depending on the hardiness of the tissue. At freezing temperatures, water in the intercellular spaces of plant tissue freezes first, though the water may remain unfrozen until temperatures drop below −7 °C (19 °F). After the initial formation of intercellular ice, the cells shrink as water is lost to the segregated ice, and the cells undergo freeze-drying. This dehydration is now considered the fundamental cause of freezing injury.\n\n\n=== DNA damage and repair ===\nPlants are continuously exposed to a range of biotic and abiotic stresses.  These stresses often cause DNA damage directly, or indirectly via the generation of reactive oxygen species. Plants are capable of a DNA damage response that is a critical mechanism for maintaining genome stability. The DNA damage response is particularly important during seed germination, since seed quality tends to deteriorate with age in association with DNA damage accumulation. During germination repair processes are activated to deal with this accumulated DNA damage. In particular, single- and double-strand breaks in DNA can be repaired. The DNA checkpoint kinase ATM has a key role in integrating progression through germination with repair responses to the DNA damages accumulated by the aged seed.\n\n\n=== Plant cells ===\n\nPlant cells are typically distinguished by their large water-filled central vacuole, chloroplasts, and rigid cell walls that are made up of cellulose, hemicellulose, and pectin. Cell division is also characterized by the development of a phragmoplast for the construction of a cell plate in the late stages of cytokinesis. Just as in animals, plant cells differentiate and develop into multiple cell types. Totipotent meristematic cells can differentiate into vascular, storage, protective (e.g. epidermal layer), or reproductive tissues, with more primitive plants lacking some tissue types.\n\n\n== Physiology ==\n\n\n=== Photosynthesis ===\n\nPlants are photosynthetic, which means that they manufacture their own food molecules using energy obtained from light. The primary mechanism plants have for capturing light energy is the pigment chlorophyll. All green plants contain two forms of chlorophyll, chlorophyll a and chlorophyll b. The latter of these pigments is not found in red or brown algae.\nThe simple equation of photosynthesis is as follows:\n\n  \n    \n      \n        \n          6\n          \n          \n            CO\n            \n              2\n            \n            \n              \n            \n          \n          \n\n          \n          +\n          6\n          \n          \n            H\n            \n              2\n            \n            \n              \n            \n          \n          O\n          \n\n          \n          \n            \n              →\n              \n                \n                  light\n                \n              \n            \n          \n          \n            C\n            \n              6\n            \n            \n              \n            \n          \n          \n            H\n            \n              12\n            \n            \n              \n            \n          \n          \n            O\n            \n              6\n            \n            \n              \n            \n          \n          \n\n          \n          +\n          6\n          \n          \n            O\n            \n              2\n            \n            \n              \n            \n          \n          \n\n          \n        \n      \n    \n    {\\displaystyle {\\ce {6CO2{}+6H2O{}->[{\\text{light}}]C6H12O6{}+6O2{}}}}\n  \n\n\n=== Immune system ===\n\nBy means of cells that behave like nerves, plants receive and distribute within their systems information about incident light intensity and quality. Incident light that stimulates a chemical reaction in one leaf, will cause a chain reaction of signals to the entire plant via a type of cell termed a bundle sheath cell. Researchers, from the Warsaw University of Life Sciences in Poland, found that plants have a specific memory for varying light conditions, which prepares their immune systems against seasonal pathogens. Plants use pattern-recognition receptors to recognize conserved microbial signatures. This recognition triggers an immune response. The first plant receptors of conserved microbial signatures were identified in rice (XA21, 1995) and in Arabidopsis thaliana (FLS2, 2000). Plants also carry immune receptors that recognize highly variable pathogen effectors. These include the NBS-LRR class of proteins.\n\n\n=== Internal distribution ===\n\nVascular plants differ from other plants in that nutrients are transported between their different parts through specialized structures, called xylem and phloem. They also have roots for taking up water and minerals. The xylem moves water and minerals from the root to the rest of the plant, and the phloem provides the roots with sugars and other nutrient produced by the leaves.\n\n\n== Genomics ==\nPlants have some of the largest genomes among all organisms. The largest plant genome (in terms of gene number) is that of wheat (Triticum asestivum), predicted to encode ≈94,000 genes and thus almost 5 times as many as the human genome. The first plant genome sequenced was that of Arabidopsis thaliana which encodes about 25,500 genes. In terms of sheer DNA sequence, the smallest published genome is that of the carnivorous bladderwort (Utricularia gibba) at 82 Mb (although it still encodes 28,500 genes) while the largest, from the Norway Spruce (Picea abies), extends over 19,600 Mb (encoding about 28,300 genes).\n\n\n== Ecology ==\n\nThe photosynthesis conducted by land plants and algae is the ultimate source of energy and organic material in nearly all ecosystems. Photosynthesis, at first by cyanobacteria and later by photosynthetic eukaryotes, radically changed the composition of the early Earth's anoxic atmosphere, which as a result is now 21% oxygen. Animals and most other organisms are aerobic, relying on oxygen; those that do not are confined to relatively rare anaerobic environments. Plants are the primary producers in most terrestrial ecosystems and form the basis of the food web in those ecosystems. Many animals rely on plants for shelter as well as oxygen and food. Plants form about 80% of the world biomass at about 450 gigatonnes (4.4×1011 long tons; 5.0×1011 short tons) of carbon.Land plants are key components of the water cycle and several other biogeochemical cycles. Some plants have coevolved with nitrogen fixing bacteria, making plants an important part of the nitrogen cycle. Plant roots play an essential role in soil development and the prevention of soil erosion.\n\n\n=== Distribution ===\nPlants are distributed almost worldwide. While they inhabit a multitude of biomes and ecoregions, few can be found beyond the tundras at the northernmost regions of continental shelves. At the southern extremes, plants of the Antarctic flora have adapted tenaciously to the prevailing conditions.Plants are often the dominant physical and structural component of habitats where they occur. Many of the Earth's biomes are named for the type of vegetation because plants are the dominant organisms in those biomes, such as grasslands, taiga and tropical rainforest.\n\n\n=== Ecological relationships ===\n\nNumerous animals have coevolved with plants. Many animals pollinate flowers in exchange for food in the form of pollen or nectar. Many animals disperse seeds, often by eating fruit and passing the seeds in their feces. Myrmecophytes are plants that have coevolved with ants. The plant provides a home, and sometimes food, for the ants. In exchange, the ants defend the plant from herbivores and sometimes competing plants. Ant wastes provide organic fertilizer.\nThe majority of plant species have various kinds of fungi associated with their root systems in a kind of mutualistic symbiosis known as mycorrhiza. The fungi help the plants gain water and mineral nutrients from the soil, while the plant gives the fungi carbohydrates manufactured in photosynthesis. Some plants serve as homes for endophytic fungi that protect the plant from herbivores by producing toxins. The fungal endophyte, Neotyphodium coenophialum, in tall fescue (Festuca arundinacea) does tremendous economic damage to the cattle industry in the U.S. Many legume plants have nitrogen fixing bacteria in the genus Rhizobium, found in nodules of their roots, that fix nitrogen from the air for the plant to use. In exchange, the plants supply sugars to the bacteria.Various forms of parasitism are also fairly common among plants, from the semi-parasitic mistletoe that merely takes some nutrients from its host, but still has photosynthetic leaves, to the fully parasitic broomrape and toothwort that acquire all their nutrients through connections to the roots of other plants, and so have no chlorophyll. Some plants, known as myco-heterotrophs, parasitize mycorrhizal fungi, and hence act as epiparasites on other plants.\nMany plants are epiphytes, meaning they grow on other plants, usually trees, without parasitizing them. Epiphytes may indirectly harm their host plant by intercepting mineral nutrients and light that the host would otherwise receive. The weight of large numbers of epiphytes may break tree limbs. Hemiepiphytes like the strangler fig begin as epiphytes but eventually set their own roots and overpower and kill their host. Many orchids, bromeliads, ferns and mosses often grow as epiphytes. Bromeliad epiphytes accumulate water in leaf axils to form phytotelmata that may contain complex aquatic food webs.Approximately 630 plants are carnivorous, such as the Venus Flytrap (Dionaea muscipula) and sundew (Drosera species). They trap small animals and digest them to obtain mineral nutrients, especially nitrogen and phosphorus.\n\n\n=== Competition ===\nCompetition occurs when members of the same species, or several different species, compete for shared resources in a given habitat. According to the competitive exclusion principle, when environmental resources are limited, species cannot occupy nor be supported by identical niches. Eventually, one species will out-compete the other, which will push the disadvantaged species to extinction.In regard to plants, competition tends to negatively affect their growth when competing for shared resources. These shared resources commonly include space for growth, sunlight, water and nutrients. Light is an important resource because it is necessary for photosynthesis. Plants use their leaves to shade other plants from sunlight and grow quickly to maximize their own expose. Water is also important for photosynthesis, and plants have different root systems to maximize water uptake from soil. Some plants have deep roots that are able to locate water stored deep underground, and others have shallower roots that are capable of extending longer distances to collect recent rainwater.Minerals are also important for plant growth and development, where deficiencies can occur if nutrient needs are not met. Common nutrients competed for amongst plants include nitrogen and phosphorus. Space is also extremely important for a growing and developing plant. Having optimal space makes it more likely that leaves are exposed to sufficient amounts of sunlight and are not overcrowded in order for photosynthesis to occur. In the event that an old tree dies, competition arises amongst a number of trees to replace it. Those that are less effective competitors are less likely to contribute to the next generation of offspring.Contrary to the belief that plants are always in competition, new research has found that in a harsh environment mature plants sheltering seedlings help the smaller plant survive.\n\n\n== Importance ==\n\n\n=== Cultivation ===\nThe study of plant uses by people is called economic botany or ethnobotany. Human cultivation of plants is part of agriculture, which is the basis of human civilization. Plant agriculture is subdivided into agronomy, horticulture and forestry.\n\n\n==== Food ====\n\nHumans depend on plants for food, either directly or as feed for domestic animals. Agriculture deals with the production of food crops, and has played a key role in the history of world civilizations. Agriculture includes agronomy for arable crops, horticulture for vegetables and fruit, and forestry for timber. About 7,000 species of plant have been used for food, though most of today's food is derived from only 30 species. The major staples include cereals such as rice and wheat, starchy roots and tubers such as cassava and potato, and legumes such as peas and beans. Vegetable oils such as olive oil provide lipids, while fruit and vegetables contribute vitamins and minerals to the diet.\n\n\n==== Medicines ====\n\nMedicinal plants are a primary source of organic compounds, both for their medicinal and physiological effects, and for the industrial synthesis of a vast array of organic chemicals. Many hundreds of medicines are derived from plants, both traditional medicines used in herbalism and chemical substances purified from plants or first identified in them, sometimes by ethnobotanical search, and then synthesised for use in modern medicine. Modern medicines derived from plants include aspirin, taxol, morphine, quinine, reserpine, colchicine, digitalis and vincristine. Plants used in herbalism include ginkgo, echinacea, feverfew, and Saint John's wort. The pharmacopoeia of Dioscorides, De Materia Medica, describing some 600 medicinal plants, was written between 50 and 70 AD and remained in use in Europe and the Middle East until around 1600 AD; it was the precursor of all modern pharmacopoeias.\n\n\n==== Nonfood products ====\n\nPlants grown as industrial crops are the source of a wide range of products used in manufacturing, sometimes so intensively as to risk harm to the environment. Nonfood products include essential oils, natural dyes, pigments, waxes, resins, tannins, alkaloids, amber and cork. Products derived from plants include soaps, shampoos, perfumes, cosmetics, paint, varnish, turpentine, rubber, latex, lubricants, linoleum, plastics, inks, and gums. Renewable fuels from plants include firewood, peat and other biofuels. The fossil fuels coal, petroleum and natural gas are derived from the remains of aquatic organisms including phytoplankton in geological time.Structural resources and fibres from plants are used to construct dwellings and to manufacture clothing. Wood is used not only for buildings, boats, and furniture, but also for smaller items such as musical instruments and sports equipment. Wood is pulped to make paper and cardboard. Cloth is often made from cotton, flax, ramie or synthetic fibres such as rayon and acetate derived from plant cellulose. Thread used to sew cloth likewise comes in large part from cotton.\n\n\n==== Aesthetic uses ====\n\nThousands of plant species are cultivated for aesthetic purposes as well as to provide shade, modify temperatures, reduce wind, abate noise, provide privacy, and prevent soil erosion. Plants are the basis of a multibillion-dollar per year tourism industry, which includes travel to historic gardens, national parks, rainforests, forests with colorful autumn leaves, and festivals such as Japan's and America's cherry blossom festivals.\n\nWhile some gardens are planted with food crops, many are planted for aesthetic, ornamental, or conservation purposes. Arboretums and botanical gardens are public collections of living plants. In private outdoor gardens, lawn grasses, shade trees, ornamental trees, shrubs, vines, herbaceous perennials and bedding plants are used. Gardens may cultivate the plants in a naturalistic state, or may sculpture their growth, as with topiary or espalier. Gardening is the most popular leisure activity in the U.S., and working with plants or horticulture therapy is beneficial for rehabilitating people with disabilities.Plants may also be grown or kept indoors as houseplants, or in specialized buildings such as greenhouses that are designed for the care and cultivation of living plants. Venus Flytrap, sensitive plant and resurrection plant are examples of plants sold as novelties. There are also art forms specializing in the arrangement of cut or living plant, such as bonsai, ikebana, and the arrangement of cut or dried flowers. Ornamental plants have sometimes changed the course of history, as in tulipomania.Architectural designs resembling plants appear in the capitals of Ancient Egyptian columns, which were carved to resemble either the Egyptian white lotus or the papyrus. Images of plants are often used in painting and photography, as well as on textiles, money, stamps, flags and coats of arms.\n\n\n=== Scientific and cultural uses ===\n\nBasic biological research has often been done with plants. In genetics, the breeding of pea plants allowed Gregor Mendel to derive the basic laws governing inheritance, and examination of chromosomes in maize allowed Barbara McClintock to demonstrate their connection to inherited traits. The plant Arabidopsis thaliana is used in laboratories as a model organism to understand how genes control the growth and development of plant structures. NASA predicts that space stations or space colonies will one day rely on plants for life support.Ancient trees are revered and many are famous. Tree rings themselves are an important method of dating in archeology, and serve as a record of past climates.Plants figure prominently in mythology, religion and literature. They are used as national and state emblems, including state trees and state flowers. Plants are often used as memorials, gifts and to mark special occasions such as births, deaths, weddings and holidays. The arrangement of flowers may be used to send hidden messages.\n\n\n=== Negative effects ===\nWeeds are unwanted plants growing in managed environments such as farms, urban areas, gardens, lawns, and parks. People have spread plants beyond their native ranges and some of these introduced plants become invasive, damaging existing ecosystems by displacing native species, and sometimes becoming serious weeds of cultivation.Plants may cause harm to animals, including people. Plants that produce windblown pollen invoke allergic reactions in people who suffer from hay fever. A wide variety of plants are poisonous. Toxalbumins are plant poisons fatal to most mammals and act as a serious deterrent to consumption. Several plants cause skin irritations when touched, such as poison ivy. Certain plants contain psychotropic chemicals, which are extracted and ingested or smoked, including nicotine from tobacco, cannabinoids from Cannabis sativa, cocaine from Erythroxylon coca and opium from opium poppy. Smoking causes damage to health or even death, while some drugs may also be harmful or fatal to people. Both illegal and legal drugs derived from plants may have negative effects on the economy, affecting worker productivity and law enforcement costs.\n\n\n== See also ==\n\n\n== References ==\n\n\n== Further reading ==\nGeneral\nEvans, L.T. (1998). Feeding the Ten Billion – Plants and Population Growth. Cambridge University Press. Paperback, 247 pages. ISBN 0-521-64685-5.\nKenrick, Paul & Crane, Peter R. (1997). The Origin and Early Diversification of Land Plants: A Cladistic Study. Washington, D.C.: Smithsonian Institution Press. ISBN 1-56098-730-8.\nRaven, Peter H.; Evert, Ray F.; & Eichhorn, Susan E. (2005). Biology of Plants (7th ed.). New York: W.H. Freeman and Company. ISBN 0-7167-1007-2.\nTaylor, Thomas N. & Taylor, Edith L. (1993). The Biology and Evolution of Fossil Plants. Englewood Cliffs, NJ: Prentice Hall. ISBN 0-13-651589-4.\nTrewavas A (2003). \"Aspects of Plant Intelligence\". Annals of Botany. 92 (1): 1–20. doi:10.1093/aob/mcg101. PMC 4243628. PMID 12740212.Species estimates and counts\nInternational Union for Conservation of Nature and Natural Resources (IUCN) Species Survival Commission (2004). IUCN Red List The IUCN Red List of Threatened Species.\nPrance G.T. (2001). \"Discovering the Plant World\". Taxon. 50 (2, Golden Jubilee Part 4): 345–359. doi:10.2307/1223885. JSTOR 1223885.\n\n\n== External links ==\nJones, T.M.; Reid, C.S.; Urbatsch, L.E. \"Visual study of divisional Plantae\".  (requires Microsoft Silverlight)\nChaw, S.-M.;  et al. (1997). \"Molecular Phylogeny of Extant Gymnosperms and Seed Plant Evolution: Analysis of Nuclear 18s rRNA Sequences\" (PDF). Mol. Biol. Evol. 14 (1): 56–68. doi:10.1093/oxfordjournals.molbev.a025702. PMID 9000754. Archived from the original (PDF) on 24 January 2005.\nIndex Nominum Algarum\nInteractive Cronquist classification\nPlant Resources of Tropical Africa\nTree of LifeBotanical and vegetation databasesAfrican Plants Initiative database\nAustralia\nChilean plants at Chilebosque\ne-Floras (Flora of China, Flora of North America and others)\nFlora Europaea\nFlora of Central Europe (in German)\nFlora of North America\nList of Japanese Wild Plants Online\nMeet the Plants-National Tropical Botanical Garden\nLady Bird Johnson Wildflower Center – Native Plant Information Network at University of Texas, Austin\nThe Plant List\nUnited States Department of Agriculture not limited to continental US species"