"Pierre Teilhard de Chardin  (French: [pjɛʁ tɛjaʁ də ʃaʁdɛ̃] (listen ); 1 May 1881 – 10 April 1955) was a French Jesuit priest, scientist, paleontologist, theologian, philosopher and teacher. He was Darwinian in outlook and the author of several influential theological and philosophical books.\nHe took part in the discovery of Peking Man. He conceived the vitalist idea of the Omega Point. With Vladimir Vernadsky he developed the concept of the noosphere.\nIn 1962, the Congregation for the Doctrine of the Faith condemned several of Teilhard's works based on their alleged ambiguities and doctrinal errors. Some eminent Catholic figures, including Pope Benedict XVI and Pope Francis, have made positive comments on some of his ideas since. The response to his writings by scientists has been mostly critical.\n\n\n== Life ==\n\n\n=== Early years ===\nPierre Teilhard de Chardin was born in the Château of Sarcenat, Orcines, some four km (2.5 mi) north-west of Clermont-Ferrand, Auvergne, French Third Republic, on 1 May 1881, as the fourth of eleven children of librarian Emmanuel Teilhard de Chardin (1844–1932) and Berthe-Adèle, née de Dompierre d'Hornoys of Picardy, a great-grandniece of Voltaire. He inherited the double surname from his father, who was descended on the Teilhard side from an ancient family of magistrates from Auvergne originating in Murat, Cantal, ennobled under Louis XVIII of France.His father, a graduate of the Ecole Nationale des Chartes, served as a regional librarian and was a keen naturalist. He collected rocks, insects and plants and encouraged nature studies in the family. Pierre Teilhard's spirituality was awakened by his mother. When he was twelve, he went to the Jesuit college of Mongré in Villefranche-sur-Saône, where he completed the Baccalauréat in philosophy and mathematics. In 1899, he entered the Jesuit novitiate in Aix-en-Provence. In October 1900, he began his junior studies at the Collégiale Saint-Michel de Laval. On 25 March 1901, he made his first vows. In 1902, Teilhard completed a licentiate in literature at the University of Caen.\nThat same year the Emile Combes premiership took over from Pierre Waldeck-Rousseau in pursuit of an anti-clerical agenda. As a result, religious associations had to submit their properties to state control, which obliged the Jesuits to go into exile in the United Kingdom. Theilhard continued his philosophical studies on the island of Jersey until 1905. Strong in Science subjects, he was despatched to teach physics at the Collège de la Sainte Famille in Cairo, Khedivate of Egypt until 1908. From there he wrote in a letter: \"[I]t is the dazzling of the East foreseen and drunk greedily ... in its lights, its vegetation, its fauna and its deserts.\"For the next four years he was a Scholastic at Ore Place in Hastings, East Sussex where he acquired his theological formation. There he synthesized his scientific, philosophical and theological knowledge in the light of evolution. At that time he read Creative Evolution by Henri Bergson, about which he wrote that \"the only effect that brilliant book had upon me was to provide fuel at just the right moment, and very briefly, for a fire that was already consuming my heart and mind.\" Bergson's ideas were influential on his views on matter, life, and energy. On 24 August 1911, aged 30, he was ordained priest.\n\n\n== Academic career ==\n\n\n=== Paleontology ===\nFrom 1912 to 1914, Teilhard worked in the paleontology laboratory of the National Museum of Natural History, France, studying the mammals of the middle Tertiary period. Later he studied elsewhere in Europe. In June 1912 he formed part of the original digging team, with Arthur Smith Woodward and Charles Dawson, at the Piltdown site, after the discovery of the first fragments of the fraudulent \"Piltdown Man\". Some have suggested he participated in the hoax. Marcellin Boule, a specialist in Neanderthal studies, who as early as 1915 had recognized the non-hominid origins of the Piltdown finds, gradually guided Teilhard towards human paleontology. At the museum's Institute of Human Paleontology, he became a friend of Henri Breuil and in 1913 took part with him in excavations at the prehistoric painted  Cave of El Castillo in northwest Spain.\n\n\n=== Service in World War I ===\nMobilized in December 1914, Teilhard served in World War I as a stretcher-bearer in the 8th Moroccan Rifles. For his valor, he received several citations, including the Médaille militaire and the Legion of Honor.\nDuring the war, he developed his reflections in his diaries and in letters to his cousin, Marguerite Teillard-Chambon, who later published a collection of them. (See section below) He later wrote: \"...the war was a meeting ... with the Absolute.\" In 1916, he wrote his first essay: La Vie Cosmique (Cosmic life), where his scientific and philosophical thought was revealed just as his mystical life. While on leave from the military he pronounced his solemn vows as a Jesuit in Sainte-Foy-lès-Lyon on 26 May 1918. In August 1919, in Jersey, he wrote Puissance spirituelle de la Matière (The Spiritual Power of Matter).\nAt the University of Paris, Teilhard pursued three unit degrees of natural science: geology, botany, and zoology. His thesis treated the mammals of the French lower Eocene and their stratigraphy. After 1920, he lectured in geology at the Catholic Institute of Paris and after earning a science doctorate in 1922 became an assistant professor there.\n\n\n=== Research in China ===\nIn 1923 he traveled to China with Father Émile Licent, who was in charge of a significant laboratory collaboration between the National Museum of Natural History and Marcellin Boule's laboratory in Tianjin. Licent carried out considerable basic work in connection with missionaries who accumulated observations of a scientific nature in their spare time.\nTeilhard wrote several essays, including La Messe sur le Monde (the Mass on the World), in the Ordos Desert. In the following year, he continued lecturing at the Catholic Institute and participated in a cycle of conferences for the students of the Engineers' Schools. Two theological essays on original sin were sent to a theologian at his request on a purely personal basis:\n\nJuly 1920: Chute, Rédemption et Géocentrie (Fall, Redemption and Geocentry)\nSpring 1922: Notes sur quelques représentations historiques possibles du Péché originel (Note on Some Possible Historical Representations of Original Sin) (Works, Tome X)The Church required him to give up his lecturing at the Catholic Institute in order to continue his geological research in China.\nTeilhard traveled again to China in April 1926. He would remain there for about twenty years, with many voyages throughout the world. He settled until 1932 in Tianjin with Émile Licent, then in Beijing. Teilhard made five geological research expeditions in China between 1926 and 1935. They enabled him to establish a general geological map of China.\nThat same year, Teilhard's superiors in the Jesuit Order forbade him to teach any longer.\nIn 1926–27, after a missed campaign in Gansu, Teilhard traveled in the Sanggan River Valley near Kalgan (Zhangjiakou) and made a tour in Eastern Mongolia. He wrote Le Milieu Divin (The Divine Milieu). Teilhard prepared the first pages of his main work Le Phénomène Humain (The Phenomenon of Man). The Holy See refused the Imprimatur for Le Milieu Divin in 1927. \n\nHe joined the ongoing excavations of the Peking Man Site at Zhoukoudian as an advisor in 1926 and continued in the role for the Cenozoic Research Laboratory of the China Geological Survey following its founding in 1928. Teilhard resided in Manchuria with Emile Licent, staying in western Shanxi and northern Shaanxi with the Chinese paleontologist Yang Zhongjian and with Davidson Black, Chairman of the China Geological Survey.\nAfter a tour in Manchuria in the area of Greater Khingan with Chinese geologists, Teilhard joined the team of American Expedition Center-Asia in the Gobi Desert, organized in June and July by the American Museum of Natural History with Roy Chapman Andrews. Henri Breuil and Teilhard discovered that the Peking Man, the nearest relative of Anthropopithecus from Java, was a faber (worker of stones and controller of fire). Teilhard wrote L'Esprit de la Terre (The Spirit of the Earth).\nTeilhard took part as a scientist in the Croisière Jaune (Yellow Cruise) financed by André Citroën in Central Asia. Northwest of Beijing in Kalgan, he joined the Chinese group who joined the second part of the team, the Pamir group, in Aksu City. He remained with his colleagues for several months in Ürümqi, capital of Xinjiang.\nIn 1933, Rome ordered him to give up his post in Paris. Teilhard subsequently undertook several explorations in the south of China. He traveled in the valleys of the Yangtze and Sichuan in 1934, then, the following year, in Guangxi and Guangdong. The relationship with Marcellin Boule was disrupted; the museum cut its financing on the grounds that Teilhard worked more for the Chinese Geological Service than for the museum.During all these years, Teilhard contributed considerably to the constitution of an international network of research in human paleontology related to the whole of eastern and southeastern Asia. He would be particularly associated in this task with two friends, Davidson Black and the Scot George Brown Barbour. Often he would visit France or the United States, only to leave these countries for further expeditions.\n\n\n=== World travels ===\n\nFrom 1927 to 1928, Teilhard based himself in Paris. He journeyed to Leuven, Belgium, and to Cantal and Ariège, France. Between several articles in reviews, he met new people such as Paul Valéry and Bruno de Solages, who were to help him in issues with the Catholic Church.\nAnswering an invitation from Henry de Monfreid, Teilhard undertook a journey of two months in Obock, in Harar in the Ethiopian Empire, and in Somalia with his colleague Pierre Lamarre, a geologist, before embarking in Djibouti to return to Tianjin. While in China, Teilhard developed a deep and personal friendship with Lucile Swan.During 1930–1931, Teilhard stayed in France and in the United States. During a conference in Paris, Teilhard stated: \"For the observers of the Future, the greatest event will be the sudden appearance of a collective humane conscience and a human work to make.\" From 1932 to 1933, he began to meet people to clarify issues with the Congregation for the Doctrine of the Faith regarding Le Milieu divin and L'Esprit de la Terre. He met Helmut de Terra, a German geologist in the International Geology Congress in Washington, D.C.\nTeilhard participated in the 1935 Yale–Cambridge expedition in northern and central India with the geologist Helmut de Terra and Patterson, who verified their assumptions on Indian Paleolithic civilisations in Kashmir and the Salt Range Valley. He then made a short stay in Java, on the invitation of Dutch paleontologist Gustav Heinrich Ralph von Koenigswald to the site of Java Man. A second cranium, more complete, was discovered. Professor von Koenigswald had also found a tooth in a Chinese apothecary shop in 1934 that he believed belonged to a three-meter-tall ape, Gigantopithecus, which lived between one hundred thousand and around a million years ago. Fossilized teeth and bone (dragon bones) are often ground into powder and used in some branches of traditional Chinese medicine.In 1937, Teilhard wrote Le Phénomène spirituel (The Phenomenon of the Spirit) on board the boat Empress of Japan, where he met the Sylvia Brett, Ranee of Sarawak The ship conveyed him to the United States. He received the Mendel Medal granted by Villanova University during the Congress of Philadelphia, in recognition of his works on human paleontology. He made a speech about evolution, the origins and the destiny of man. The New York Times dated 19 March 1937 presented Teilhard as the Jesuit who held that man descended from monkeys. Some days later, he was to be granted the Doctor Honoris Causa distinction from Boston College. Upon arrival in that city, he was told that the award had been cancelled.Rome banned his work L’Énergie Humaine in 1939. By this point Teilhard was based again in France, where he was immobilized by malaria. During his return voyage to Beijing he wrote L'Energie spirituelle de la Souffrance (Spiritual Energy of Suffering) (Complete Works, tome VII).\nIn 1941, Teilhard submitted to Rome his most important work, Le Phénomène Humain. By 1947, Rome forbade him to write or teach on philosophical subjects. The next year, Teilhard was called to Rome by the Superior General of the Jesuits who hoped to acquire permission from the Holy See for the publication of Le Phénomène Humain. However, the prohibition to publish it that was previously issued in 1944 was again renewed. Teilhard was also forbidden to take a teaching post in the Collège de France. Another setback came in 1949, when permission to publish Le Groupe Zoologique was refused.\nTeilhard was nominated to the French Academy of Sciences in 1950. He was forbidden by his Superiors to attend the International Congress of\nPaleontology in 1955. The Supreme Authority of the Holy Office, in a decree dated 15 November 1957, forbade the works of de Chardin to be retained in libraries, including those of religious institutes. His books were not to be sold in Catholic bookshops and were not to be translated into other languages.\n\nFurther resistance to Teilhard's work arose elsewhere. In April 1958, all Jesuit publications in Spain (\"Razón y Fe\", \"Sal Terrae\",\"Estudios de Deusto\", etc.) carried a notice from the Spanish Provincial of the Jesuits that Teilhard's works had been published in Spanish without previous ecclesiastical examination and in defiance of the decrees of the Holy See. A decree of the Holy Office dated 30 June 1962, under the authority of Pope John XXIII, warned:[I]t is obvious that in philosophical and theological matters, the said works [Teilhard's] are replete with ambiguities or rather with serious errors which offend Catholic doctrine. That is why... the Rev. Fathers of the Holy Office urge all Ordinaries, Superiors, and Rectors... to effectively protect, especially the minds of the young, against the dangers of the works of Fr. Teilhard de Chardin and his followers.\nThe Diocese of Rome on 30 September 1963 required Catholic booksellers in Rome to withdraw his works as well as those that supported his views.\n\n\n=== Death ===\n\nTeilhard died in New York City, where he was in residence at the Jesuit Church of St. Ignatius Loyola, Park Avenue. On 15 March 1955, at the house of his diplomat cousin Jean de Lagarde, Teilhard told friends he hoped he would die on Easter Sunday. On the evening of Easter Sunday, 10 April 1955, during an animated discussion at the apartment of Rhoda de Terra, his personal assistant since 1949, Teilhard suffered a heart attack and died. He was buried in the cemetery for the New York Province of the Jesuits at the Jesuit novitiate, St. Andrew-on-Hudson, in Hyde Park, New York. With the moving of the novitiate, the property was sold to the Culinary Institute of America in 1970.\n\n\n== Teachings ==\nTeilhard de Chardin wrote two comprehensive works, The Phenomenon of Man and The Divine Milieu.His posthumously published book, The Phenomenon of Man, set forth a sweeping account of the unfolding of the cosmos and the evolution of matter to humanity, to ultimately a reunion with Christ. In the book, Teilhard abandoned literal interpretations of creation in the Book of Genesis in favor of allegorical and theological interpretations. The unfolding of the material cosmos is described from primordial particles to the development of life, human beings and the noosphere, and finally to his vision of the Omega Point in the future, which is \"pulling\" all creation towards it. He was a leading proponent of orthogenesis, the idea that evolution occurs in a directional, goal-driven way. Teilhard argued in Darwinian terms with respect to biology, and supported the synthetic model of evolution, but argued in Lamarckian terms for the development of culture, primarily through the vehicle of education. Teilhard made a total commitment to the evolutionary process in the 1920s as the core of his spirituality, at a time when other religious thinkers felt evolutionary thinking challenged the structure of conventional Christian faith. He committed himself to what the evidence showed.Teilhard made sense of the universe by assuming it had a vitalist evolutionary process. He interprets complexity as the axis of evolution of matter into a geosphere, a biosphere, into consciousness (in man), and then to supreme consciousness (the Omega Point). Jean Houston's story of meeting Teilhard illustrates this point.Teilhard's unique relationship to both paleontology and Catholicism allowed him to develop a highly progressive, cosmic theology which took into account his evolutionary studies. Teilhard recognized the importance of bringing the Church into the modern world, and approached evolution as a way of providing ontological meaning for Christianity, particularly creation theology. For Teilhard, evolution was \"the natural landscape where the history of salvation is situated.\"Teilhard's cosmic theology is largely predicated on his interpretation of Pauline scripture, particularly Colossians 1:15-17 (especially verse 1:17b) and 1 Corinthians 15:28. He drew on the Christocentrism of these two Pauline passages to construct a cosmic theology which recognizes the absolute primacy of Christ. He understood creation to be \"a teleological process towards union with the Godhead, effected through the incarnation and redemption of Christ, 'in whom all things hold together' (Col. 1:17).\" He further posited that creation would not be complete until each \"participated being is totally united with God through Christ in the Pleroma, when God will be 'all in all' (1Cor. 15:28).\"Teilhard's life work was predicated on his conviction that human spiritual development is moved by the same universal laws as material development. He wrote, \"...everything is the sum of the past\" and \"...nothing is comprehensible except through its history. 'Nature' is the equivalent of 'becoming', self-creation: this is the view to which experience irresistibly leads us. ... There is nothing, not even the human soul, the highest spiritual manifestation we know of, that does not come within this universal law.\" The Phenomenon of Man represents Teilhard's attempt at reconciling his religious faith with his academic interests as a paleontologist. One particularly poignant observation in Teilhard's book entails the notion that evolution is becoming an increasingly optional process. Teilhard points to the societal problems of isolation and marginalization as huge inhibitors of evolution, especially since evolution requires a unification of consciousness. He states that \"no evolutionary future awaits anyone except in association with everyone else.\" Teilhard argued that the human condition necessarily leads to the psychic unity of humankind, though he stressed that this unity can only be voluntary; this voluntary psychic unity he termed \"unanimization\". Teilhard also states that \"evolution is an ascent toward consciousness\", giving encephalization as an example of early stages, and therefore, signifies a continuous upsurge toward the Omega Point which, for all intents and purposes, is God.\nTeilhard also used his perceived correlation between spiritual and material to describe Christ, arguing that Christ not only has a mystical dimension but also takes on a physical dimension as he becomes the organizing principle of the universe—that is, the one who \"holds together\" the universe (Col. 1:17b). For Teilhard, Christ forms not only the eschatological end toward which his mystical/ecclesial body is oriented, but he also \"operates physically in order to regulate all things\" becoming \"the one from whom all creation receives its stability.\" In other words, as the one who holds all things together, \"Christ exercises a supremacy over the universe which is physical, not simply juridical. He is the unifying center of the universe and its goal. The function of holding all things together indicates that Christ is not only man and God; he also possesses a third aspect—indeed, a third nature—which is cosmic.\" In this way, the Pauline description of the Body of Christ is not simply a mystical or ecclesial concept for Teilhard; it is cosmic. This cosmic Body of Christ \"extend[s] throughout the universe and compris[es] all things that attain their fulfillment in Christ [so that] ... the Body of Christ is the one single thing that is being made in creation.\" Teilhard describes this cosmic amassing of Christ as \"Christogenesis\". According to Teilhard, the universe is engaged in Christogenesis as it evolves toward its full realization at Omega, a point which coincides with the fully realized Christ. It is at this point that God will be \"all in all\" (1Cor. 15:28c).\n\nOur century is probably more religious than any other. How could it fail to be, with such problems to be solved? The only trouble is that it has not yet found a God it can adore.\nTielhard has been criticized as incorporating common notions of Social Darwinism and scientific racism into his work, along with support for eugenics, though he has also been defended by theologian John Haught.\n\n\n== Relationship with the Catholic Church ==\nIn 1925, Teilhard was ordered by the Superior General of the Society of Jesus, Włodzimierz Ledóchowski, to leave his teaching position in France and to sign a statement withdrawing his controversial statements regarding the doctrine of original sin. Rather than leave the Society of Jesus, Teilhard signed the statement and left for China.This was the first of a series of condemnations by a range of ecclesiastical officials that would continue until after Teilhard's death. The climax of these condemnations was a 1962 monitum (warning) of the Congregation for the Doctrine of the Faith cautioning on Teilhard's works. It said:\nSeveral works of Fr. Pierre Teilhard de Chardin, some of which were posthumously published, are being edited and are gaining a good deal of success. Prescinding from a judgement about those points that concern the positive sciences, it is sufficiently clear that the above-mentioned works abound in such ambiguities and indeed even serious errors, as to offend Catholic doctrine. For this reason, the most eminent and most revered Fathers of the Holy Office exhort all Ordinaries as well as the superiors of Religious institutes, rectors of seminaries and presidents of universities, effectively to protect the minds, particularly of the youth, against the dangers presented by the works of Fr. Teilhard de Chardin and of his followers.\nThe Holy Office did not, however, place any of Teilhard's writings on the Index Librorum Prohibitorum (Index of Forbidden Books), which existed during Teilhard's lifetime and at the time of the 1962 decree.\nShortly thereafter, prominent clerics mounted a strong theological defense of Teilhard's works. Henri de Lubac (later a Cardinal) wrote three comprehensive books on the theology of Teilhard de Chardin in the 1960s. While de Lubac mentioned that Teilhard was less than precise in some of his concepts, he affirmed the orthodoxy of Teilhard de Chardin and responded to Teilhard's critics: \"We need not concern ourselves with a number of detractors of Teilhard, in whom emotion has blunted intelligence\". Later that decade Joseph Ratzinger, a German theologian who became Pope Benedict XVI, spoke glowingly of Teilhard's Christology in Ratzinger's Introduction to Christianity:\nIt must be regarded as an important service of Teilhard de Chardin's that he rethought these ideas from the angle of the modern view of the world and, in spite of a not entirely unobjectionable tendency toward the biological approach, nevertheless on the whole grasped them correctly and in any case made them accessible once again.\nOver the next several decades prominent theologians and prelates, including leading cardinals all wrote approvingly of Teilhard's ideas. In 1981, Cardinal Agostino Casaroli, wrote on the front page of the Vatican newspaper, l'Osservatore Romano:\n\nWhat our contemporaries will undoubtedly remember, beyond the difficulties of conception and deficiencies of expression in this audacious attempt to reach a synthesis, is the testimony of the coherent life of a man possessed by Christ in the depths of his soul. He was concerned with honoring both faith and reason, and anticipated the response to John Paul II's appeal: \"Be not afraid, open, open wide to Christ the doors of the immense domains of culture, civilization, and progress\". \nOn 20 July 1981, the Holy See stated that, after consultation of Cardinal Casaroli and Cardinal Franjo Šeper, the letter did not change the position of the warning issued by the Holy Office on 30 June 1962, which pointed out that Teilhard's work contained ambiguities and grave doctrinal errors.\nCardinal Ratzinger in his book The Spirit of the Liturgy incorporates Teilhard's vision as a touchstone of the Catholic Mass:And so we can now say that the goal of worship and the goal of creation as a whole are one and the same—divinization, a world of freedom and love. But this means that the historical makes its appearance in the cosmic. The cosmos is not a kind of closed building, a stationary container in which history may by chance take place. It is itself movement, from its one beginning to its one end. In a sense, creation is history. Against the background of the modern evolutionary world view, Teilhard de Chardin depicted the cosmos as a process of ascent, a series of unions. From very simple beginnings the path leads to ever greater and more complex unities, in which multiplicity is not abolished but merged into a growing synthesis, leading to the \"Noosphere\" in which spirit and its understanding embrace the whole and are blended into a kind of living organism. Invoking the epistles to the Ephesians and Colossians, Teilhard looks on Christ as the energy that strives toward the Noosphere and finally incorporates everything in its \"fullness\". From here Teilhard went on to give a new meaning to Christian worship: the transubstantiated Host is the anticipation of the transformation and divinization of matter in the christological \"fullness\". In his view, the Eucharist provides the movement of the cosmos with its direction; it anticipates its goal and at the same time urges it on.\nCardinal Avery Dulles said in 2004:\nIn his own poetic style, the French Jesuit Teilhard de Chardin liked to meditate on the Eucharist as the first fruits of the new creation. In an essay called The Monstrance he describes how, kneeling in prayer, he had a sensation that the Host was beginning to grow until at last, through its mysterious expansion, \"the whole world had become incandescent, had itself become like a single giant Host\". Although it would probably be incorrect to imagine that the universe will eventually be transubstantiated, Teilhard correctly identified the connection between the Eucharist and the final glorification of the cosmos.\nCardinal Christoph Schönborn wrote in 2007:\nHardly anyone else has tried to bring together the knowledge of Christ and the idea of evolution as the scientist (paleontologist) and theologian Fr. Pierre Teilhard de Chardin, S.J., has done. ...  His fascinating vision ... has represented a great hope, the hope that faith in Christ and a scientific approach to the world can be brought together. ...  These brief references to Teilhard cannot do justice to his efforts. The fascination which Teilhard de Chardin exercised for an entire generation stemmed from his radical manner of looking at science and Christian faith together.\nIn July 2009, Vatican spokesman Federico Lombardi said, \"By now, no one would dream of saying that [Teilhard] is a heterodox author who shouldn't be studied.\"Pope Francis refers to Teilhard's eschatological contribution in his encyclical Laudato si'.The philosopher Dietrich von Hildebrand criticized severely the work of Teilhard. According to this philosopher, in a conversation after a lecture by Teilhard: \"He (Teilhard) ignored completely the decisive difference between nature and supernature. After a lively discussion in which I ventured a criticism of his ideas, I had an opportunity to speak to Teilhard privately. When our talk touched on St. Augustine, he exclaimed violently: 'Don’t mention that unfortunate man; he spoiled everything by introducing the supernatural.'\" Von Hildebrand writes that Teilhardism is incompatible with Christianity, substitutes efficiency for sanctity, dehumanizes man, and describes love as merely cosmic energy.\n\n\n== Evaluations by scientists ==\nJulian Huxley, the evolutionary biologist, in the preface to the 1955 edition of The Phenomenon of Man, praised the thought of Teilhard de Chardin for looking at the way in which human development needs to be examined within a larger integrated universal sense of evolution, though admitting he could not follow Teilhard all the way. Theodosius Dobzhansky, writing in 1973, drew upon Teilhard's insistence that evolutionary theory provides the core of how man understands his relationship to nature, calling him \"one of the great thinkers of our age\".According to Daniel Dennett (1995), \"it has become clear to the point of unanimity among scientists that Teilhard offered nothing serious in the way of an alternative to orthodoxy; the ideas that were peculiarly his were confused, and the rest was just bombastic redescription of orthodoxy.\"Steven Rose wrote that \"Teilhard is revered as a mystic of genius by some, but amongst most biologists is seen as little more than a charlatan.\"In 1961, British immunologist and Nobel laureate Peter Medawar wrote a scornful review of The Phenomenon Of Man for the journal Mind: \"the greater part of it [...] is nonsense, tricked out with a variety of metaphysical conceits, and its author can be excused of dishonesty only on the grounds that before deceiving others he has taken great pains to deceive himself\". Evolutionary biologist Richard Dawkins called Medawar's review \"devastating\" and The Phenomenon of Man \"the quintessence of bad poetic science\".George Gaylord Simpson felt that if Teilhard were right, the lifework \"of Huxley, Dobzhansky, and hundreds of others was not only wrong, but meaningless\", and was mystified by their public support for him. He considered Teilhard a friend and his work in paleontology extensive and important, but expressed strongly adverse views of his contributions as scientific theorist and philosopher.In 2019, evolutionary biologist David Sloan Wilson praised Teilhard's book The Phenomenon of Man as  \"scientifically prophetic in many ways\", and considers his own work as an updated version of it, commenting that \"[m]odern evolutionary theory shows that what Teilhard meant by the Omega Point is achievable in the foreseeable future.\"\n\n\n== Legacy ==\nBrian Swimme wrote \"Teilhard was one of the first scientists to realize that the human and the universe are inseparable. The only universe we know about is a universe that brought forth the human.\"Pierre Teilhard de Chardin is honored with a feast day on the Calendar of saints of the Episcopal Church on 10 April. George Gaylord Simpson named the most primitive and ancient genus of true primate, the Eocene genus Teilhardina.\nTeilhard and his work continue to influence the arts and culture. Characters based on Teilhard appear in several novels, including Jean Telemond in Morris West's The Shoes of the Fisherman (mentioned by name and quoted by Oskar Werner playing Fr. Telemond in the movie version of the novel). In Dan Simmons' 1989–97 Hyperion Cantos, Teilhard de Chardin has been canonized a saint in the far future. His work inspires the anthropologist priest character, Paul Duré. When Duré becomes Pope, he takes Teilhard I as his regnal name.  Teilhard appears as a minor character in the play Fake by Eric Simonson, staged by Chicago's Steppenwolf Theatre Company in 2009, involving a fictional solution to the infamous Piltdown Man hoax.\nReferences range from occasional quotations—an auto mechanic quotes Teilhard in Philip K. Dick's A Scanner Darkly—to serving as the philosophical underpinning of the plot, as Teilhard's work does in Julian May's 1987–94 Galactic Milieu Series.  Teilhard also plays a major role in Annie Dillard's 1999 For the Time Being. Teilhard is mentioned by name and the Omega Point briefly explained in Arthur C. Clarke's and Stephen Baxter's The Light of Other Days.\nThe title of the short-story collection Everything That Rises Must Converge by Flannery O'Connor is a reference to Teilhard's work. The American novelist Don DeLillo's 2010 novel Point Omega borrows its title and some of its ideas from Teilhard de Chardin. Robert Wright, in his book Nonzero: The Logic of Human Destiny, compares his own naturalistic thesis that biological and cultural evolution are directional and, possibly, purposeful, with Teilhard's ideas.\nTeilhard's work also inspired philosophical ruminations by Italian laureate architect Paolo Soleri and Mexican writer Margarita Casasús Altamirano, artworks such as French painter Alfred Manessier's L'Offrande de la terre ou Hommage à Teilhard de Chardin and American sculptor Frederick Hart's acrylic sculpture The Divine Milieu: Homage to Teilhard de Chardin.  A sculpture of the Omega Point by Henry Setter, with a quote from Teilhard de Chardin, can be found at the entrance to the Roesch Library at the University of Dayton. The Spanish painter Salvador Dalí was fascinated by Teilhard de Chardin and the Omega Point theory. His 1959 painting The Ecumenical Council is said to represent the \"interconnectedness\" of the Omega Point.Edmund Rubbra's 1968 Symphony No. 8 is titled Hommage à Teilhard de Chardin.\nThe Embracing Universe an oratorio for choir and 7 instruments composed by Justin Grounds to a libretto by Fred LaHaye saw its first performance in 2019. It is based on the life and thought of Teilhard de Chardin.Several college campuses honor Teilhard.  A building at the University of Manchester is named after him, as are residence dormitories at Gonzaga University and Seattle University.\nThe De Chardin Project, a play celebrating Teilhard's life, ran from 20 November to 14 December 2014 in Toronto, Canada. The Evolution of Teilhard de Chardin, a documentary film on Teilhard's life, was scheduled for release in 2015.Founded in 1978, George Addair based much of Omega Vector on Teilhard's work.\nThe American physicist Frank J. Tipler has further developed Teilhard's Omega Point concept in two controversial books, The Physics of Immortality and the more theologically based Physics of Christianity. While keeping the central premise of Teilhard's Omega Point (i.e. a universe evolving towards a maximum state of complexity and consciousness) Tipler has supplanted some of the more mystical/ theological elements of the OPT with his own scientific and mathematical observations (as well as some elements borrowed from Freeman Dyson's eternal intelligence theory).In 1972, the Uruguayan priest Juan Luis Segundo, in his five-volume series A Theology for Artisans of a New Humanity, wrote that Teilhard \"noticed the profound analogies existing between the conceptual elements used by the natural sciences — all of them being based on the hypothesis of a general evolution of the universe.\"\n\n\n=== Influence of his cousin, Marguerite ===\nMarguerite Teillard-Chambon, (alias Claude Aragonnès) was a French writer who edited and had published three volumes of correspondence with her cousin, Pierre Teilhard de Chardin, \"La genèse d'une pensée\" (\"The Making of a Mind\") being the last, after her own death in 1959. She furnished each with an introduction. Marguerite, a year older than Teilhard, was considered among those who knew and understood him best. They had shared a childhood in Auvergne; she it was who encouraged him to undertake a doctorate in science at the Sorbonne; she eased his entry into the Catholic Institute, through her connection to Emmanuel de Margerie and she introduced him to the intellectual life of Paris. Throughout the First World War, she corresponded with him, acting as a \"midwife\" to his thinking, helping his thought to emerge and honing it. In September 1959 she participated in a gathering organised at Saint-Babel, near Issoire, devoted to Teilhard's philosophical contribution. On the way home to Chambon-sur-Lac, she was fatally injured in a road traffic accident. Her sister, Alice, completed the final preparations for the publication of the final volume of her cousin Teilhard's wartime letters.\n\n\n=== Influence on the New Age movement ===\nTeilhard has had a profound influence on the New Age movements and has been described as \"perhaps the man most responsible for the spiritualization of evolution in a global and cosmic context\".Teilhard's words about likening the discovery of the power of love to the second time man will have discovered the power of fire, were quoted in the sermon of the Most Reverend Michael Curry, Presiding Bishop of the Episcopal Church, during the wedding of Prince Harry and Meghan Markle on 20 May 2018.\n\n\n== Bibliography ==\nThe dates in parentheses are the dates of first publication in French and English. Most of these works were written years earlier, but Teilhard's ecclesiastical order forbade him to publish them because of their controversial nature.  The essay collections are organized by subject rather than date, thus each one typically spans many years.\n\nLe Phénomène Humain (1955), written 1938–40, scientific exposition of Teilhard's theory of evolution.\nThe Phenomenon of Man (1959), Harper Perennial 1976: ISBN 0-06-090495-X. Reprint 2008: ISBN 978-0-06-163265-5.\nThe Human Phenomenon (1999), Brighton: Sussex Academic, 2003: ISBN 1-902210-30-1.\nLetters From a Traveler (1956; English translation 1962), written 1923–55.\nLe Groupe Zoologique Humain (1956), written 1949, more detailed presentation of Teilhard's theories.\nMan's Place in Nature (English translation 1966).\nLe Milieu Divin (1957), spiritual book written 1926–27, in which the author seeks to offer a way for everyday life, i.e. the secular, to be divinized.\nThe Divine Milieu (1960) Harper Perennial 2001: ISBN 0-06-093725-4.\nL'Avenir de l'Homme (1959) essays written 1920–52, on the evolution of consciousness (noosphere).\nThe Future of Man (1964) Image 2004: ISBN 0-385-51072-1.\nHymn of the Universe (1961; English translation 1965) Harper and Row: ISBN 0-06-131910-4, mystical/spiritual essays and thoughts written 1916–55.\nL'Energie Humaine (1962), essays written 1931–39, on morality and love.\nHuman Energy (1969) Harcort Brace Jovanovich ISBN 0-15-642300-6.\nL'Activation de l'Energie (1963), sequel to Human Energy, essays written 1939–55 but not planned for publication, about the universality and irreversibility of human action.\nActivation of Energy (1970), Harvest/HBJ 2002: ISBN 0-15-602817-4.\nJe M'Explique (1966) Jean-Pierre Demoulin, editor ISBN 0-685-36593-X, \"The Essential Teilhard\" — selected passages from his works.\nLet Me Explain (1970) Harper and Row ISBN 0-06-061800-0, Collins/Fontana 1973: ISBN 0-00-623379-1.\nChristianity and Evolution, Harvest/HBJ 2002: ISBN 0-15-602818-2.\nThe Heart of the Matter, Harvest/HBJ 2002: ISBN 0-15-602758-5.\nToward the Future, Harvest/HBJ 2002: ISBN 0-15-602819-0.\nThe Making of a Mind: Letters from a Soldier-Priest 1914–1919, Collins (1965), Letters written during wartime.\nWritings in Time of War, Collins (1968) composed of spiritual essays written during wartime.  One of the few books of Teilhard to receive an imprimatur.\nVision of the Past, Collins (1966) composed of mostly scientific essays published in the French science journal Etudes.\nThe Appearance of Man, Collins (1965) composed of mostly scientific writings published in the French science journal Etudes.\nLetters to Two Friends 1926–1952, Fontana (1968). Composed of personal letters on varied subjects including his understanding of death. See Letters to Two Friends 1926–1952. Helen Weaver (translation). 1968. ISBN 9780853911432. OCLC 30268456.CS1 maint: others (link)\nLetters to Léontine Zanta, Collins (1969).\nCorrespondence / Pierre Teilhard de Chardin, Maurice Blondel, Herder and Herder (1967) This correspondence also has both the imprimatur and nihil obstat.\nde Chardin, P T (1952). \"On the zoological position and the evolutionary significance of Australopithecines\". Transactions of the New York Academy of Sciences (published March 1952). 14 (5): 208–10. doi:10.1111/j.2164-0947.1952.tb01101.x. PMID 14931535.\nde Terra, H; de Chardin, PT; Paterson, TT (1936). \"Joint geological and prehistoric studies of the Late Cenozoic in India\". Science (published 6 March 1936). 83 (2149): 233–236. Bibcode:1936Sci....83..233D. doi:10.1126/science.83.2149.233-a. PMID 17809311.\n\n\n== See also ==\n\n\n== References ==\n\n\n== Further reading ==\n\n\n== External links ==\n\n\n=== Pro ===\nWorks by or about Pierre Teilhard de Chardin at Internet Archive\nTeilhard de Chardin (A site devoted to the ideas of Teilhard de Chardin)\nThe Teilhard de Chardin Foundation\nThe American Teilhard Association\nTeilhard de Chardin A personal website\n\n\n=== Contra ===\nWarning Regarding the Writings of Father Teilhard de Chardin The Sacred Congregation of the Holy Office, 1962\nMedawar, Peter (1961). \"A review of The Phenomenon of Man\". Mind. 70: 99–106. doi:10.1093/mind/LXX.277.99.\nMcCarthy, John F. ♦ A review of Teilhardism and the New Religion by Wolfgang Smith 1989\n\n\n=== Other ===\nWorks by or about Pierre Teilhard de Chardin in libraries (WorldCat catalog)\nWeb pages and timeline about the Piltdown forgery hosted by the British Geological Survey\n\"Teilhard de Chardin: His Importance in the 21st Century\" - Georgetown University - June 23, 2015"