"A seraph (, \"the burning one\"; plural seraphim ) is a type of celestial or heavenly being originating in Ancient Judaism. The term plays a role in subsequent Judaism, Christianity, and Islam.Tradition places seraphim in the highest rank in Christian angelology and in the fifth rank of ten in the Jewish angelic hierarchy. A seminal passage in the Book of Isaiah (Isaiah 6:1–8) used the term to describe six-winged beings that fly around the Throne of God crying \"holy, holy, holy\". This throne scene, with its triple invocation of holiness, profoundly influenced subsequent theology, literature and art. Its influence is frequently seen in works depicting angels, heaven and apotheosis. Seraphim are mentioned as celestial beings in the non-canonical Book of Enoch and the canonical Book of Revelation.\n\n\n== Origins and development ==\n\nIn Hebrew, the word saraph means \"burning\", and is used 7 times throughout the text of the Hebrew Bible as a noun, usually to denote \"serpent\", twice in the Book of Numbers, once in the Book of Deuteronomy, and four times in the Book of Isaiah (6:2–6, 14:29, 30:6). The reason why the word for \"burning\" was also used to denote a serpent is not universally agreed upon; it may be due to a certain snake's fiery colors, or perhaps the burning sensation left by its venomous bite. Regardless, its plural form, seraphim, occurs in both Numbers and Isaiah, but only in Isaiah is it used to denoting an angelic being; likewise, these angels are referred to only as the plural seraphim – Isaiah later uses the singular saraph to describe a \"fiery flying serpent\", in line with the other uses of the term throughout the Tanakh.\nThere is emerging consensus that the motifs used to display seraphs in Hyksos-era Canaan had their original sources in Egyptian uraeus iconography. In Egyptian iconography, the uraeus was used as a symbol of sovereignty, royalty, divinity and divine authority, and later iconography often showed uraei with wings. In the early monarchic period of Israel and Judah, Egyptian motifs were evidently borrowed by the Israelites en masse, as a plethora of personal seals belonging to classes ranging from commonfolk to royalty have been discovered, which incorporate several pieces of ancient Egyptian iconography, including the winged sun, ankh, the hedjet and deshret crowns of Upper and Lower Egypt, scarabs, and the uraeus cobra. These uraei often had four wings, as opposed to the Egyptian standard which only gave them two. These images have been connected with the seraphim angels associated with Isaiah's visions, or perhaps more directly to the aforementioned \"fiery flying serpent\", but this continues to be debated – and an image of serpentine seraphim clashes with Isaiah's own vision, which clearly envisioned seraphim with heads, legs, and arms.\nThe vision in Isaiah Chapter 6 of seraphim in an idealized version of Solomon's Temple represents the sole instance in the Hebrew Bible of this word being used to describe celestial beings. \"... I saw also the Lord sitting upon a throne, high and lifted up, and his train filled the temple. Above it stood the seraphim: each one had six wings; with twain he covered his face, and with twain he covered his feet, and with twain he did fly.\" (Isaiah 6:1–3) And one cried to another, \"Holy, holy, holy, is YHWH of hosts: the whole earth is full of His glory.\" (verses 2–3) One seraph carries out an act of ritual purification for the prophet by touching his lips with a live coal from the altar (verses 6–7) \"And he laid it upon my mouth, and said, Lo, this hath touched thy lips; and thine iniquity is taken away, and thy sin purged.\"\nThe text describes the \"seraphim\" as winged celestial beings with a fiery passion for doing God's good work. Notwithstanding the wording of the text itself, at least one Hebrew scholar claims that in the Hebrew Bible the seraphim do not have the status of angels, and that it is only in later sources (like De Coelesti Hierarchia or Summa Theologiae) that they are considered to be a division of the divine messengers.Seraphim appear in the 2nd-century BC Book of Enoch, where they are mentioned, in conjunction with cherubim, as the heavenly creatures standing nearest to the throne of God. In non-biblical sources they are sometimes called the Akyəst (Ge'ez: አክይስት \"serpents\", \"dragons\"; an alternate term for Hell).In the Second Book of Enoch, two classes of celestial beings are mentioned alongside the seraphim and cherubim, known as the phoenixes and the chalkydri (Ancient Greek: χαλκύδραι khalkýdrai, compound of χαλκός khalkós \"brass, copper\" + ὕδρα hýdra \"hydra\", \"water-serpent\"—lit. \"brazen hydras\", \"copper serpents\"). Both are described as \"flying elements of the sun\" that reside in either the 4th or 6th heaven, who have twelve wings and burst into song at sunrise.In the Book of Revelation (4:4–8), the beasts are described as being forever in God's presence and praising him: \"[A]nd they rest not day and night, saying, 'Holy, holy, holy, Lord God Almighty, which was, and is, and is to come.\" This account differs slightly from the account of Isaiah, stating in the eighth verse, \"And the four beasts had each of them six wings about him; and they were full of eyes within\". They appear also in the Gnostic text, On the Origin of the World.\n\n\n== In Judaism ==\n\nThe 12th-century scholar Maimonides placed the seraphim in the fifth of ten ranks of angels in his exposition of the Jewish angelic hierarchy. In Kabbalah, the seraphim are the higher angels of the World of Beriah (\"Creation\", first created realm, divine understanding), whose understanding of their distance from the absolute divinity of Atziluth causes their continual \"burning up\" in self-nullification. Through this they ascend to God, and return to their place. Below them in the World of Yetzirah (\"Formation\", archetypal creation, divine emotions) are the Hayot angels of Ezekiel's vision, who serve God with self-aware instinctive emotions (\"face of a lion, ox, eagle\"). Seraphim are part of the angelarchy of modern Orthodox Judaism. Isaiah's vision is repeated several times in daily Jewish services, including at Kedushah prayer as part of the repetition of the Amidah, and in several other prayers as well. Conservative Judaism retains the traditional doctrines regarding angels and includes references to them in the liturgy, although a literal belief in angels is by no means universal among adherents. Adherents of Reform Judaism and Reconstructionist Judaism generally take images of angels as symbolic.\nA Judean seal from the 8th century BCE depicts them as flying asp (snake), yet having human characteristics, as encountered by Isaiah in his commissioning as a prophet.\n\n\n== In Christianity ==\n\nMedieval Christian theology places seraphim in the highest choir of the angelic hierarchy. They are the caretakers of God's throne, continuously singing \"holy, holy, holy\". Pseudo-Dionysius the Areopagite in his Celestial Hierarchy (vii), drew upon the Book of Isaiah in fixing the fiery nature of seraphim in the medieval imagination. Seraphim in his view helped the Deity maintain perfect order and are not limited to chanting the trisagion. Taking his cue as well from writings in the Rabbinic tradition, the author gave an etymology for the Seraphim as \"those who kindle or make hot\"\n\nThe name seraphim clearly indicates their ceaseless and eternal revolution about Divine Principles, their heat and keenness, the exuberance of their intense, perpetual, tireless activity, and their elevative and energetic assimilation of those below, kindling them and firing them to their own heat, and wholly purifying them by a burning and all-consuming flame; and by the unhidden, unquenchable, changeless, radiant and enlightening power, dispelling and destroying the shadows of darkness\nOrigen wrote in On First Principles that the Seraphim, in the Book of Isaiah, are the physical representation of the Christ and the Holy Spirit. His rationale comes from the idea that nothing \"can wholly know the beginnings of all things and the ends of the universe\" aside from God. Origen concludes this section in writing about the Seraphim as beings that have the knowledge of God revealed to them which elevates the role of the Seraphim to divine levels:\n\nNevertheless whatever it is that these powers may have learned through the revelation of the Son of God and of the Holy Spirit-and they will certainly be able to acquire a great deal of knowledge, and the higher ones much more than the lower-still it is impossible for them to comprehend everything; for it is written, 'The more part of God's works are secret.  This quote suggests that Origen believed the Seraphim are revealed this knowledge because of their anointed status as Son of God and the Holy Spirit. He was later criticized for making such claims and labeled a heretic by the Christian church. However, his theory about the Seraphim, as referred to in Isaiah, would be reflected in other early Christian literature, as well as early Christian belief through the second century. \nThomas Aquinas in his Summa Theologiae offers a description of the nature of seraphim:\n\nThe name \"Seraphim\" does not come from charity only, but from the excess of charity, expressed by the word ardor or fire. Hence Dionysius (Coel. Hier. vii) expounds the name \"Seraphim\" according to the properties of fire, containing an excess of heat. Now in fire we may consider three things.\nFirst, the movement which is upwards and continuous. This signifies that they are borne inflexibly towards God.\nSecondly, the active force which is \"heat,\" which is not found in fire simply, but exists with a certain sharpness, as being of most penetrating action, and reaching even to the smallest things, and as it were, with superabundant fervor; whereby is signified the action of these angels, exercised powerfully upon those who are subject to them, rousing them to a like fervor, and cleansing them wholly by their heat.\n\nThirdly we consider in fire the quality of clarity, or brightness; which signifies that these angels have in themselves an inextinguishable light, and that they also perfectly enlighten others.\nThe seraphim took on a mystic role in Giovanni Pico della Mirandola's Oration on the Dignity of Man (1487), the epitome of Renaissance humanism. Pico took the fiery Seraphim—\"they burn with the fire of charity\"—as the highest models of human aspiration: \"impatient of any second place, let us emulate dignity and glory. And, if we will it, we shall be inferior to them in nothing\", the young Pico announced, in the first flush of optimistic confidence in the human capacity that is the coinage of the Renaissance. \"In the light of intelligence, meditating upon the Creator in His work, and the work in its Creator, we shall be resplendent with the light of the Cherubim. If we burn with love for the Creator only, his consuming fire will quickly transform us into the flaming likeness of the Seraphim.\"\nBonaventure, a Franciscan theologian who was a contemporary of Aquinas, uses the six wings of the seraph as an important analogical construct in his mystical work The Journey of the Mind to God.\nChristian theology developed an idea of seraphim as beings of pure light who enjoy direct communication with God.\n\n\n== In Islam ==\nThe Bearers of the Throne (ḥamlat al-arsh) are comparable to seraphim, described with six wings and four faces. In a book called Book of the Wonders of Creation and the peculiarities of Existing Things, these angels rank the highest, followed by the spirit, the archangels and then the cherubim. The Bearers of the Throne are entrusted with continuously worshipping God. Unlike the messenger angels, they remain in the heavenly realm and do not enter the world.Seraphim (Sarufiyyun or Musharifin) are directly mentioned in a hadith from Al-Tirmidhi about a conversation between Muhammad and God, during the Night Journey, concerning what is between the Heavens and the Earth, often interpreted as a reference to the \"Exalted assembly\" disputing the creation of Adam in Surah 38:69.Specific archangels, like Jibrāʾīl and Israfil, are sometimes identified as seraphim. Robert Southey also noted an Islamic narration about angels commanded to prostrate before Adam, whereupon Iblis refused as he boasted about himself being a \"seraph created from celestial fire, more excellent than Adam\".\nTheir affiliation is not always clear and sometimes they are also identified with cherubim.\n\n\n== In culture ==\n\n\n=== Arts, entertainment, and media ===\nSeraphim are the name of a species within Tales of Zestiria. The main character, Sorey, is heavily implied to become one by the end.\nThe second phase of Dogma, from The Binding of Isaac: Rebirth, resembles a seraph, being a being with many wings that also uses light attacks. Dogma is formed from the static from a TV that is used to watch Christian broadcasts. \"Seraphim\" is also the name of one of the attainable transformations in the game (gained by gathering a certain quantity of specific items), although it does not resemble a seraph aesthetically.\nGaleem, from the Super Smash Bros. Ultimate single-player campaign \"World of Light\", resembles a seraph. It is an ethereal being of light with six wings. Also, Galeem attempted to destroy everything in existence and turn everyone (except the fighters) into spirits.\nIn The Bastard Executioner, the Order of Seraphim are charged with preserving and protecting Jesus Christ's nine-volume, handwritten Libro Nazareni (New Testament) from the Church, which, as Annora and Ventrishire's manor priest, Father Ruskin, discuss in episodes 7 (\"Behold the Lamb / Gweled yr Oen\") and 8 (\"Broken Things / Pethau Toredig\"), and 9 (\"The Bernadette Maneuver / Cynllwyn Bernadette\"), could be toppled by the book's release to the public. For that reason, the Church's leaders, such as Robinus, the Archdeacon of Windsor, and their  Knights of the Rosebud/Rosula, have targeted both the book and its protectors to be hunted and destroyed. In episode 3, some young Welsh people who want to earn credibility with the rebels against the government unwisely masquerade as members of the Order of Seraphim, by adorning themselves with seraphim face paint and attack the Baroness' wagon and its knights, which causes repercussions throughout the season for those captured, for their village, and for those affected by escalated hunts for rebels and for members of the Order of Seraphim.\nIn Doom (2016 video game), it is mentioned that a Seraph blesses the Doom Slayer with great strength and speed. In Doom Eternal, it is confirmed that the character Samuel Hayden is in fact the Seraphim who blessed the Doom Slayer.\nFrom the Street Fighter series, the character Gill uses a move called Seraphic Wing, in which he reveals six wings and unleashes godly energy that does several hits. In Street Fighter III, it is the strongest move in the game and can one-hit KO an opponent if they are not blocking. In, Street Fighter V, it is his critical art. While it cannot instantly defeat an opponent like before, it deals a lot of damage.\nSeraphs also appear in the \"CW\" TV show Supernatural. They are shown as more powerful angels, but still weaker than an Archangel. When the angel Castiel (originated from \"Cassiel\") dies, he is brought back as a Seraph, although he still does not possess the power to go up against the archangel who killed him, Raphael.\nSeraph is a supporting character in the second and third films of The Matrix Trilogy. Seraph is an exile program who is seen acting as a \"guardian angel\" of the Oracle, and is described as the personification of a sophisticated challenge-handshake authentication protocol which guards the Oracle.\nIn the Armored Core series, the villain Nine-Ball is featured as a recurring antagonist. Its second and most powerful form, debuting in Armored Core: Master of Arena, is known as Nine-Ball Seraph.\nThe term Seraph is applied to the mysterious Beings of Light in various Battlestar Galactica comics.\nIn Mega Man Zero, Copy X transforms into a Seraph-like appearance in his second form.\nIn the voxel-based video game Vintage Story, the species of the main character are called Seraphs.\nSeraph is also the name of the first Jewish superhero who debuted in Super Friends # 7 by E. Nelson Bridwell, Ramona Fradon, and Bob Smith in 1977.\nMultiocular O (ꙮ) is an exotic glyph variant of the Cyrillic letter O. This glyph variant can be found in certain manuscripts in the Old Church Slavonic phrase \"серафими многоꙮчитїи\" (serafimi mnogoočitii, \"many-eyed seraphim\").\n\n\n=== Logos and mascots ===\nSeveral Catholic schools use a seraph or a seraph-related symbol as their mascot:\nKoinonia Academy, Plainfield, New Jersey, United States\nMater Dei Catholic Preparatory School, Middletown, New Jersey, United States\nSt. Bonaventure High School, Ventura, California, United States\nSt. Madeleine Sophie Catholic School, Bellevue, Washington, United States\nKingswood College in Randles Hill, Kandy, Sri Lanka, a public school, claims the seraph as its mascot.\nThe University of Pisa, Italy, features a seraph as its logo, despite referring to it as \"cherubino\" (cherub).\nSeveral Rolls-Royce models use a \"Flying Lady\" symbol or moniker, which some equate to a seraph.\n\n\n== See also ==\nBearers of the Throne\nFiery flying serpent\nGreat chain of being\nRoyal Order of the Seraphim\nSerpents in the Bible\nTetramorph\nThrones\n\n\n== Notes ==\n\n\n== References ==\n\n\n== External links ==\nJewish Encyclopedia: \"Seraphim\"\nThe Seraphim Mosaic in Hagia Sophia\nHerbermann, Charles, ed. (1913). \"Seraphim\" . Catholic Encyclopedia. New York: Robert Appleton Company."