"The grapefruit  (Citrus × paradisi) is a subtropical citrus tree known for its relatively large, sour to semisweet, somewhat bitter fruit. The interior flesh is segmented and varies in color from pale yellow to dark pink.\nGrapefruit is a citrus hybrid originating in Barbados as an accidental cross between the sweet orange (C. sinensis) and the pomelo or shaddock (C. maxima), both of which were introduced from Asia in the 17th century. When found, it was called the forbidden fruit. In the past it was referred to as the pomelo, but that term is now the common name for Citrus maxima.In 2019, world production of grapefruits (combined with pomelos) was 9.3 million tonnes, of which 53% was in China. Other significant producers include Vietnam, United States and Mexico.\n\n\n== Description ==\n\nThe evergreen grapefruit trees usually grow to around 5–6 m (16–20 ft) tall, although they may reach 13–15 m (43–49 ft). The leaves are glossy, dark green, long (up to 15 cm (5.9 in)), and thin. It produces 5 cm (2 in) white four-petaled flowers. The fruit is yellow-orange skinned and generally, an oblate spheroid in shape; it ranges in diameter from 10 to 15 cm (3.9 to 5.9 in). The flesh is segmented and acidic, varying in color depending on the cultivars, which include white, pink, and red pulps of varying sweetness (generally, the redder varieties are the sweetest). The 1929 U.S. 'Ruby Red' (of the 'Redblush' variety) was the first grapefruit patent.\n\n\n== History ==\nGrapefruit originated as a natural hybrid. One ancestor of the grapefruit was the Jamaican sweet orange (Citrus sinensis), itself an ancient hybrid of Asian origin; the other was the Indonesian pomelo (C. maxima). Both C. sinensis and C. maxima were present in the West Indies by 1692. One story of the fruit's origin is that a certain \"Captain Shaddock\" brought pomelo seeds to Jamaica and bred the first fruit, which were then called shaddocks. This apparently referred to a captain who traded in the West Indies in the 17th century. The grapefruit then probably originated as a naturally occurring hybrid between the two plants some time after they had been introduced there.\n\nA hybrid fruit, called forbidden fruit, was first documented in 1750 (along with 14 other citrus fruits including the guiney orange) by a Welshman, Rev. Griffith Hughes, who described specimens from Barbados in The Natural History of Barbados. However, Hughes's forbidden fruit may have been a plant distinct from grapefruit although still closely related to it.In 1814, naturalist John Lunan published the term grapefruit to describe a similar Jamaican citrus plant. Lunan reported that the name was due to its similarity in taste to the grape (Vitis vinifera). An alternative explanation offered by Tussac (1824) is that this name may allude to clusters of the fruit on the tree, which often appear similar to bunches of grapes. After this, authors of the period used both terms forbidden fruit and grapefruit as synonyms.In 1830, the Jamaican version of the plant was given the botanical name Citrus paradisi by botanist James Macfadyen. Macfadyen identified two varieties – one called forbidden fruit, the other called Barbadoes Grape Fruit. Macfadyen distinguished between the two plants by fruit shape with the Barbadoes Grape Fruit being piriform while the forbidden fruit was \"maliformis.\" Macfadyen's and Hughes's description differ, so it is not clear that the two reports are describing the same plant. Kumamoto et al. (1987) suggest that Hughes's golden orange was actually a grapefruit while his forbidden fruit was a different plant that had since became extinct and frequently confused with grapefruits. Later, Kim (1990) found a different citrus called forbidden fruit or shaddette in Saint Lucia that is closely related to grapefruits and may be the plant described by Hughes and Macfadyen.The name grape-fruit was used more and more during the 19th century to refer to pomelos, to the consternation of some.\n\nThe grapefruit was brought to Florida by Count Odet Philippe in 1823, in what is now known as Safety Harbor. Further crosses have produced the tangelo (1905), the Minneola tangelo (1931), and the oroblanco (1984).Its true origins were not determined until the 1940s. This led to the official name being altered to Citrus × paradisi, the × identifying its hybrid origin.An early pioneer in the American citrus industry was Kimball Atwood, a wealthy entrepreneur who founded the Atwood Grapefruit Company in the late 19th century. The Atwood Grove became the largest grapefruit grove in the world, with a yearly output of 80,000 boxes of fruit. There, pink grapefruit was first discovered in 1906.\n\n\n== Varieties ==\nThe varieties of Texas and Florida grapefruit include: 'Duncan', 'Flame', 'Henderson', 'Hudson', 'Marsh', 'Oro Blanco', 'Pink', 'Pummelo HB', 'Ray', 'Rio Star', 'Ruby Red', 'Star Ruby', 'Thompson', 'Triumph', 'Walters', 'White Marsh'.\n\nThe 1929 'Ruby Red' (or 'Redblush') patent was associated with real commercial success, which came after the discovery of a red grapefruit growing on a pink variety. It was a limb sport of a 'Thompson' grapefruit selected by A.E. Henninger. The 'Thompson' was a limb sport from a 'Marsh' grapefruit selected in 1913.Using radiation to trigger mutations, new varieties were developed to retain the red tones that typically faded to pink. The 'Rio Red' variety is a 2007 Texas grapefruit with registered trademarks Rio Star and Ruby-Sweet, also sometimes promoted as Reddest and Texas Choice. The 'Rio Red' is a mutation-bred variety that was developed by treatment of bud sticks with thermal neutrons. Its improved attributes of mutant variety are fruit and juice color, deeper red, and wide adaptation.The 'Star Ruby' is the darkest of the red varieties. Developed from an irradiated 'Hudson' grapefruit ('Hudson' being a limb sport of 'Foster', itself a limb sport of the 'Walters'), it has found limited commercial success because it is more difficult to grow than other varieties.\n\n\n== Production ==\nIn 2019, world production of grapefruits (combined with pomelos) was 9.3 million tonnes, led by China with 53% of the world total. Secondary producers were Vietnam, the United States, and Mexico.\n\n\n== Parasites ==\nGrapefruits are one of the most common hosts for fruit flies such as A. suspensa, which lay their eggs in overripe or spoiled grapefruits. The larvae of these flies then consume the fruit to gain nutrients until they can proceed into the pupae stage. This parasitism has led to millions in economic costs for nations in Central America and southern North America.\n\n\n== Colors and flavors ==\n\nGrapefruit varieties are differentiated by the flesh color of fruit they produce. Common varieties are yellow and pink pulp colors. Flavors range from highly acidic and somewhat sour to sweet and tart, resulting from composition of sugars (mainly sucrose), organic acids (mainly citric acid), and monoterpenes and sesquiterpenes providing aromas.Grapefruit mercaptan, a sulfur-containing terpene, is one of the aroma compounds influencing taste and odor of grapefruit, compared with other citrus fruits.\n\n\n== Drug interactions ==\n\nGrapefruit and grapefruit juice have been found to interact with numerous drugs and in many cases, to result in adverse direct and/or side effects (if dosage is not carefully adjusted).This happens in two very different ways. In the first, the effect is from natural furanocoumarins such as bergamottin and 6',7'-dihydroxybergamottin, which occur in both grapefruit flesh and peel. Furanocoumarins inhibit the CYP3A4 enzyme, including the P450 enzyme family responsible for metabolizing 90% of drugs. The action of the CYP3A4 enzyme itself is to metabolize many medications. If the drug's breakdown for removal is lessened, then the level of the drug in the blood may become too high or stay too long, leading to adverse effects. On the other hand, some drugs must be broken down to become active, and inhibiting CYP3A4 may lead to reduced drug effects.The other effect is that grapefruit can block the absorption of drugs in the intestine. If the drug is not absorbed, then not enough of it is in the blood to have a therapeutic effect. Each affected drug has either a specific increase of effect or decrease.One whole grapefruit, or a glass of 200 ml (7 US fl oz) of grapefruit juice may cause drug overdose toxicity. Typically, drugs that are incompatible with grapefruit are so labeled on the container or package insert. People taking drugs should ask their health-care provider or pharmacist questions about grapefruit and drug interactions.\n\n\n== Nutrition ==\nRaw grapefruit is 90% water, 8% carbohydrates, 1% protein, and negligible fat (table). In a 100 gram reference amount, raw grapefruit provides 33 kilocalories and is a rich source of vitamin C (40% of the Daily Value), with no other micronutrients in significant content.\nGrapefruit juice contains about half the citric acid of lime or lemon juice, and about 50% more citric acid than orange juice.\n\n\n== Cuisine ==\nIn Costa Rica, especially in Atenas, grapefruit are often cooked to remove their sourness, rendering them as sweets; they are also stuffed with dulce de leche, resulting in a dessert called toronja rellena (stuffed grapefruit). In Haiti, grapefruit is used primarily for its juice (jus de Chadèque), but also is used to make jam (confiture de Chadèque).\n\n\n== Related citruses ==\n\nGrapefruit is a pomelo backcross, a hybrid of pomelo and sweet orange, which is in turn a pomelo × mandarin hybrid.\nThe grapefruit is a parent to many hybrids:\n\nA tangelo is any hybrid of a tangerine and either a pomelo or a grapefruit\n'Minneola': 'Duncan' grapefruit × 'Dancy' tangerine\nOrlando (formerly Take): Bowen grapefruit × 'Dancy' tangerine (pollen parent)'Fairchild' is a clementine × 'Orlando' hybrid\n'Seminole': 'Bowen' grapefruit × 'Dancy' tangerine\n'Thornton': tangerine × grapefruit, unspecified\n'Ugli': mandarin × grapefruit, probable (wild seedling)\n'Nova' is a second-generation hybrid: clementine × 'Orlando' tangelo cross\nThe 'Oroblanco' and 'Melogold' grapefruits are hybrids between pomelo (C. maxima) and the grapefruit\nThe 'Triumph' grapefruit is thought to be a hybrid between a grapefruit and one of either an orange, a mandarin orange, or a pomeloRelated citrus fruits include:\n\nCommon sweet orange: pomelo × mandarin hybrid\nBitter orange: a different pomelo × mandarin hybrid\nMandelos: pomelo × mandarin\nHyuganatsu may also be a pomelo hybrid\nForbidden fruit: pomelo × orange hybrid found in Saint Lucia closely related to and historically confused with grapefruits\n\n\n== See also ==\n\nGrapefruit knife – Knife designed specifically for cutting grapefruit\nGrapefruit spoon – Kind of spoon intended for use with citrus fruit\nGrapefruit–drug interactions – Drug interactions with grapefruit juice\nNaringenin\n\n\n== References ==\n\n\n== External links ==\n Data related to Citrus paradisi at Wikispecies"