"Scumdogs of the Universe is the second album by satirical shock rock heavy metal band Gwar. The album is their first album on Metal Blade Records and was released on January 8, 1990. To date, it is the band's best-selling album.A deluxe 30th anniversary box set of Scumdogs was released in August 2020, with remixed and remastered audio by producer Ronan Chris Murphy, as well as an exclusive cassette containing rehearsal demos and previously unreleased tracks. Those that pre-ordered the box set received a digital download of the remastered album on August 7, 2020, with the first single, \"Maggots\", being made publicly available the same day. The remaster saw a wide release on October 30, 2020.\n\n\n== Overview ==\nAs the title implies, it is a concept album about the Scumdogs' (Gwar) reign of terror on planet Earth (the song \"Death Pod\" explains exactly how they came to Earth to begin with). The production is very refined compared to the independent, rushed first attempt (with each successive album sounding more and more refined). Gwar began to experiment with samples to some degree (e.g. in the song, \"Maggots\").  The songs are more socially relevant in this album as well. Examples include \"Slaughterama\" (which involves Gwar killing hippies and nazi-skinheads in a game show-style fashion) and the opening track, \"The Salaminizer\", in which the first verse was inspired by/based on \"Gangsta, Gangsta\", a song by the breakthrough rap group N.W.A. Other references include history (Vlad the Impaler) and Lovecraft mythology (Horror of Yig).\nMost of the album is centered on twisted jokes about insane medical practices and sexual perversion. This album is viewed by many of Gwar's fans (as well as Gwar themselves) as their ultimate masterpiece. Thus the band will play more songs from Scumdogs than any other album (\"Sick of You\" is the most frequently played song in concert, generally the grand finale).\nThis is the first Gwar album on which more than two people sing lead (Hell-O had Oderus Urungus and Techno Destructo): \"Slaughterama\" features Sleazy P. Martini, Sexecutioner sings his namesake song, and the album's CD exclusive closer, \"Cool Place To Park,\" debuts bassist Beefcake the Mighty as a vocalist. All other songs featured Oderus.\nAdditionally, Danielle Stampe (Slymenstra Hymen), Michael Derks (Balsac the Jaws of Death), Chuck Varga (Sexecutioner), and Brad Roberts (Jizmak Da Gusha) make their debuts on this album.\n\n\n== Reception ==\nIn 2016, Scumdogs of the Universe was ranked #90 on Loudwire's Top 90 Hard Rock + Metal Albums of the 1990s lists.\n\n\n== Track listing ==\nNote\n\nThe tracks \"The Years Without Light\" and \"Cool Place to Park\" do not appear on versions released under the Master label, only versions released under Metal Blade label. For the original 1990 Metal Blade release of the album, \"Cool Place to Park\" is a CD only track.Note\n\nThe 30th anniversary track order has been changed to match the remastered vinyl release, while the pre-order download version featured the tracks numbered to match the 1990 release order. The remastered CD's track listing erroneously omits \"Sexecutioner\", with the numbering jumping from track 8 to track 10, similar to censored versions of This Toilet Earth.Note\n\nThe demo cassette contains an unlisted hidden track after \"Jellyfish\", a studio demo of \"Horror of Yig\" that was originally intended to be released through Sub Pop's Singles Club program.\n\n\n== Personnel ==\nDave Brockie (Oderus Urungus) - lead vocals\nDewey Rowell (Flattus Maximus) - lead guitar, backing vocals\nMike Derks (Balsac the Jaws of Death) - rhythm guitar, backing vocals\nMichael Bishop (Beefcake the Mighty) - bass, backing vocals; lead vocals on \"Cool Place to Park\"\nBrad Roberts (Jizmak Da Gusha) - drums\nDanielle Stampe (Slymenstra Hymen) - backing vocals\nChuck Varga (Sexecutioner) -  vocals on \"Sexecutioner\"\nDon Drakulich (Sleazy P. Martini) - vocals on \"Slaughterama\"\n\n\n== References =="