"Natural history is a domain of inquiry involving organisms, including animals, fungi, and plants, in their natural environment, leaning more towards observational than experimental methods of study. A person who studies natural history is called a naturalist or natural historian.\nNatural history encompasses scientific research but is not limited to it. It involves the systematic study of any category of natural objects or organisms. So while it dates from studies in the ancient Greco-Roman world and the mediaeval Arabic world, through to European Renaissance naturalists working in near isolation, today's natural history is a cross-discipline umbrella of many specialty sciences; e.g., geobiology has a strong multidisciplinary nature.\n\n\n== Definitions ==\n\n\n=== Before 1900 ===\nThe meaning of the English term \"natural history\" (a calque of the Latin historia naturalis) has narrowed progressively with time, while, by contrast, the meaning of the related term \"nature\" has widened (see also History below).\nIn antiquity, \"natural history\" covered essentially anything connected with nature, or  used materials drawn from nature, such as Pliny the Elder's encyclopedia of this title, published c. 77 to 79 AD, which covers astronomy, geography, humans and their technology, medicine, and superstition, as well as animals and plants.\nMedieval European academics considered knowledge to have two main divisions: the humanities (primarily what is now known as classics) and divinity, with science studied largely through texts rather than observation or experiment. The study of nature revived in the Renaissance, and quickly became a third branch of academic knowledge, itself divided into descriptive natural history and  natural philosophy, the analytical study of nature. In modern terms, natural philosophy roughly corresponded to modern physics and chemistry, while natural history included the biological and geological sciences. The two were strongly associated. During the heyday of the gentleman scientists, many people contributed to both fields, and early papers in both were commonly read at professional science society meetings such as the Royal Society and the French Academy of Sciences—both founded during the 17th century.\nNatural history had been encouraged by practical motives, such as Linnaeus' aspiration to improve the economic condition of Sweden. Similarly, the Industrial Revolution prompted the development of geology to help find useful mineral deposits.\n\n\n=== Since 1900 ===\n\nModern definitions of natural history come from a variety of fields and sources, and many of the modern definitions emphasize a particular aspect of the field, creating a plurality of definitions with a number of common themes among them. For example, while natural history is most often defined as a type of observation and a subject of study, it can also be defined as a body of knowledge, and as a craft or a practice, in which the emphasis is placed more on the observer than on the observed.Definitions from biologists often focus on the scientific study of individual organisms in their environment, as seen in this definition by Marston Bates: \"Natural history is the study of animals and Plants—of organisms. ... I like to think, then, of natural history as the study of life at the level of the individual—of what plants and animals do, how they react to each other and their environment, how they are organized into larger groupings like populations and communities\" and this more recent definition by D.S. Wilcove and T. Eisner: \"The close observation of organisms—their origins, their evolution, their behavior, and their relationships with other species\".This focus on organisms in their environment is also echoed by H.W. Greene and J.B. Losos: \"Natural history focuses on where organisms are and what they do in their environment, including interactions with other organisms. It encompasses changes in internal states insofar as they pertain to what organisms do\".Some definitions go further, focusing on direct observation of organisms in their environments, both past and present, such as this one by G.A. Bartholomew: \"A student of natural history, or a naturalist, studies the world by observing plants and animals directly. Because organisms are functionally inseparable from the environment in which they live and because their structure and function cannot be adequately interpreted without knowing some of their evolutionary history, the study of natural history embraces the study of fossils as well as physiographic and other aspects of the physical environment\".A common thread in many definitions of natural history is the inclusion of a descriptive component, as seen in a recent definition by H.W. Greene: \"Descriptive ecology and ethology\". Several authors have argued for a more expansive view of natural history, including S. Herman, who defines the field as \"the scientific study of plants and animals in their natural environments. It is concerned with levels of organization from the individual organism to the ecosystem, and stresses identification, life history, distribution, abundance, and inter-relationships.\nIt often and appropriately includes an esthetic component\", and T. Fleischner, who defines the field even more broadly, as \"A practice of intentional, focused attentiveness and receptivity to the more-than-human world, guided by honesty and accuracy\". These definitions explicitly include the arts in the field of natural history, and are aligned with the broad definition outlined by B. Lopez, who defines the field as the \"Patient interrogation of a landscape\" while referring to the natural history knowledge of the Eskimo (Inuit).A slightly different framework for natural history, covering a similar range of themes, is also implied in the scope of work encompassed by many leading natural history museums, which often include elements of anthropology, geology, paleontology, and astronomy along with botany and zoology, or include both cultural and natural components of the world.The plurality of definitions for this field has been recognized as both a weakness and a strength, and a range of definitions has recently been offered by practitioners in a recent collection of views on natural history.\n\n\n== History ==\n\n\n=== Ancient ===\n\nNatural history begins with Aristotle and other ancient philosophers who analyzed the diversity of the natural world. Natural history was understood by Pliny the Elder to cover anything that could be found in the world, including living things, geology, astronomy, technology, art, and humanity.De Materia Medica was written between 50 and 70 AD by Pedanius Dioscorides, a Roman physician of Greek origin. It was widely read for more than 1,500 years until supplanted in the Renaissance, making it one of the longest-lasting of all natural history books.\nFrom the ancient Greeks until the work of Carl Linnaeus and other 18th-century naturalists, a major concept of natural history was the scala naturae or Great Chain of Being, an arrangement of minerals, vegetables, more primitive forms of animals, and more complex life forms on a linear scale of supposedly increasing perfection, culminating in our species.\n\n\n=== Medieval ===\nNatural history was basically static through the Middle Ages in Europe—although in the Arabic and Oriental world, it proceeded at a much brisker pace. From the 13th century, the work of Aristotle was adapted rather rigidly into Christian philosophy, particularly by Thomas Aquinas, forming the basis for natural theology. During the Renaissance, scholars (herbalists and humanists, particularly) returned to direct observation of plants and animals for natural history, and many began to accumulate large collections of exotic specimens and unusual monsters. Leonhart Fuchs was one of the three founding fathers of botany, along with Otto Brunfels and Hieronymus Bock. Other important contributors to the field were Valerius Cordus, Konrad Gesner (Historiae animalium), Frederik Ruysch, and Gaspard Bauhin. The rapid increase in the number of known organisms prompted many attempts at classifying and organizing species into taxonomic groups, culminating in the system of the Swedish naturalist Carl Linnaeus.The British historian of Chinese science Joseph Needham calls Li Shizhen \"the 'uncrowned king' of Chinese naturalists\", and his Bencao gangmu \"undoubtedly the greatest scientific achievement of the Ming\". His works translated to many languages direct or influence many scholars and researchers.\n\n\n=== Modern ===\n\nA significant contribution to English natural history was made by parson-naturalists such as Gilbert White, William Kirby, John George Wood, and John Ray, who wrote about plants, animals, and other aspects of nature. Many of these men wrote about nature to make the natural theology argument for the existence or goodness of God. Since early modern times, however, a great number of women made contributions to natural history, particularly in the field of botany, be it as authors, collectors, or illustrators.In modern Europe, professional disciplines such as botany, geology, mycology, palaeontology, physiology, and zoology were formed. Natural history, formerly the main subject taught by college science professors, was increasingly scorned by scientists of a more specialized manner and relegated to an \"amateur\" activity, rather than a part of science proper. In Victorian Scotland,  the study of natural history was believed to contribute to good mental health. Particularly in Britain and the United States, this grew into specialist hobbies such as the study of birds, butterflies, seashells (malacology/conchology), beetles, and wildflowers; meanwhile, scientists tried to define a unified discipline of biology (though with only partial success, at least until the modern evolutionary synthesis). Still, the traditions of natural history continue to play a part in the study of biology, especially ecology (the study of natural systems involving living organisms and the inorganic components of the Earth's biosphere that support them), ethology (the scientific study of animal behavior), and evolutionary biology (the study of the relationships between life forms over very long periods of time), and re-emerges today as integrative organismal biology.\nAmateur collectors and natural history entrepreneurs played an important role in building the world's large natural history collections, such as the Natural History Museum, London, and the National Museum of Natural History in Washington, DC.\nThree of the greatest English naturalists of the 19th century, Henry Walter Bates, Charles Darwin, and Alfred Russel Wallace—who knew each other—each made natural history travels that took years, collected thousands of specimens, many of them new to science, and by their writings both advanced knowledge of \"remote\" parts of the world—the Amazon basin, the Galápagos Islands, and the Malay archipelago, among others—and in so doing helped to transform biology from a descriptive to a theory-based science.\nThe understanding of \"Nature\" as \"an organism and not as a mechanism\" can be traced to the writings of Alexander von Humboldt (Prussia, 1769–1859). Humboldt's copious writings and research were seminal influences for Charles Darwin, Simón Bolívar, Henry David Thoreau, Ernst Haeckel, and John Muir.\n\n\n== Museums ==\n\nNatural history museums, which evolved from cabinets of curiosities, played an important role in the emergence of professional biological disciplines and research programs. Particularly in the 19th century, scientists began to use their natural history collections as teaching tools for advanced students and the basis for their own morphological research.\n\n\n== Societies ==\n\nThe term \"natural history\" alone, or sometimes together with archaeology, forms the name of many national, regional, and local natural history societies that maintain records for animals (including birds (ornithology), insects (entomology) and mammals (mammalogy)), fungi (mycology), plants (botany), and other organisms. They may also have geological and microscopical sections.\nExamples of these societies in Britain include the Natural History Society of Northumbria founded in 1829, London Natural History Society (1858), Birmingham Natural History Society (1859), British Entomological and Natural History Society founded in 1872, Glasgow Natural History Society, Manchester Microscopical and Natural History Society established in 1880, Whitby Naturalists' Club founded in 1913, Scarborough Field Naturalists' Society and the Sorby Natural History Society, Sheffield, founded in 1918. The growth of natural history societies was also spurred due to the growth of British colonies in tropical regions with numerous new species to be discovered. Many civil servants took an interest in their new surroundings, sending specimens back to museums in the Britain. (See also: Indian natural history)\nSocieties in other countries include the American Society of Naturalists and Polish Copernicus Society of Naturalists.\n\n\n== See also ==\n\nEvolutionary history of life\nHistory of evolutionary thought\nNaturalism (philosophy)\nNature documentary\nNature study\nNature writing\nRussian naturalists\nTimeline of natural history\n\n\n== References ==\n\n\n== Further reading ==\n\n\n== External links ==\nA History of the Ecological Sciences by Frank N. Egerton"