"Michael Joseph Ryan (born 1965) is an Irish epidemiologist  and former trauma surgeon, specialising in infectious disease and public health. He is executive director of the World Health Organization's Health Emergencies Programme, leading the team responsible for the international containment and treatment of COVID-19. Ryan has held leadership positions and has worked on various outbreak response teams in the field to eradicate the spread of diseases including bacillary dysentery, cholera, Crimean–Congo hemorrhagic fever, Ebola, Marburg virus disease, measles, meningitis, relapsing fever, Rift Valley fever, SARS, and Shigellosis.\n\n\n== Early life and education ==\nRyan is from the townland of Curry, near Tubbercurry, in County Sligo, Ireland. He grew up in the town of Charlestown in County Mayo. His father worked as a merchant sailor.Ryan trained in medicine at the National University of Ireland in Galway. He received training in orthopaedics in Scotland. Ryan has a Masters of Public Health from University College Dublin. He later completed specialist training in communicable disease control, public health and infectious disease at the Health Protection Agency in London. Ryan also completed the European Programme for Intervention Epidemiology Training (EPIET).\n\n\n== Career ==\n\n\n=== Early career ===\nIn July 1990, Ryan moved to Iraq with his girlfriend, later his wife, to train Iraqi doctors. Very shortly after his arrival the Invasion of Kuwait happened, which suspended his work and meant he and his wife were made to work as doctors under captivity, often working under duress. A military convoy ran a vehicle Ryan was in off the road, crushing multiple vertebrae. Eventually Ryan and his wife were allowed to leave Iraq due to their injuries. Ryan's severe back injury prohibited him from working as a surgeon. He made a shift into the fields of public health and infectious disease.Ryan worked with the Bill & Melinda Gates Foundation on their efforts to stamp out infectious diseases in Africa.\n\n\n=== Career at WHO ===\nIn 1996, Ryan joined the World Health Organization to work in a newly opened unit that focused on epidemics and infectious diseases under the direction of the infectious disease expert, David L. Heymann. He developed measles outbreak response guidelines as part of the Expanded Programme on Immunization (EPI) team who implemented surveillance for acute flaccid paralysis, which is how polio is eradicated.From 2000 to 2003, Ryan was coordinator of Epidemic Response at the WHO. In 2001, he was based in Uganda where he was head of a team of international experts involved in the containment of the Ebola epidemic. During this time, he was in areas of conflict like the Democratic Republic of the Congo, where aid workers were often attacked and murdered. In 2003, he also worked as an Operational Coordinator on the SARS outbreak.From 2005 to 2011, Ryan was Director of Global Alert and Response Operations for the WHO. During this time he worked on the development of the WHO's Strategic Health Operations Centre and Event Management System. He worked on the implementation of the International Health Regulations (IHR), among other duties to do with infectious disease and emergency responses to pathogens and epidemics.In 2011, Ryan left the WHO and returned to Galway, Ireland, to work on the Global Polio Eradication Initiative (GPEI) in Pakistan, Afghanistan, and the Middle East, where he worked until 2017 and re-joined the WHO.In the early days of the Ebola crisis, Ryan was a field epidemiologist, field coordinator, operational coordinator or director during the majority of the reported Ebola outbreaks in Africa. From 2014 to 2015, he served as a senior advisor to the UN Mission for Ebola Emergency Response (UNMEER) in West Africa. He worked in the field in Guinea, Liberia and Sierra Leone.From 2013 to 2017, Ryan worked in the Middle East as Senior Advisor on Polio Eradication and Emergencies for the World Health Organization's Global Polio Eradication Initiative (GPEI). The goal was to eradicate polio from  Pakistan and Afghanistan. He coordinated operational and technical support to polio outbreak response activities in the region which included Syria and Iraq. In 2014, Director General Margaret Chan appointed Ryan to the WHO Advisory Group on the Ebola Virus Disease Response, which was co-chaired by Sam Zaramba and David L. Heymann. During this time he was based in Islamabad, Pakistan at the National Emergency Operations Centre (NEOC), where he liaised with the Government of Pakistan.From 2017 to 2019, Ryan served as Assistant Director-General for Emergency Preparedness and Response in WHO's Health Emergencies Programme. In 2019, he was part of the leadership that created the Global Preparedness Report for the Global Preparedness Monitoring Board (GPMB).In 2019, Ryan became Executive Director of the World Health Organization's Health Emergencies Programme replacing Peter Salama in an internal reshuffle.As part of his work with the World Health Organization, Ryan appears in regular press conferences by the WHO regarding the 2019-2020 COVID-19 pandemic. Ryan has provided answers to common questions about strategies to combat the COVID-19 pandemic and find a vaccine. Based on his experience in the Democratic Republic of the Congo with Ebola, Ryan has said that while physical distancing, lock-downs, and movement restrictions will stop the spread of COVID-19, eradicating the virus will require large scale public health interventions with a focus on the central tenets of containment: community-based surveillance, contact tracing, isolation, and quarantine.In addition to his activities at WHO, Ryan has worked as a Professor of International Health at University College Dublin. He has taught and lectured on medicine and public health on the undergraduate and post graduate level.\n\n\n== Other activities ==\nGlobal Outbreak Alert and Response Network (GOARN), Founding Member\nInformal Advisory Group on the Ebola Virus Disease Response, Member\nWHO Health Emergencies Programmes, Independent Oversight and Advisory Committee (2016-2017)\n\n\n== Personal life ==\nIn 1988, Ryan met his wife, Máire Connolly, in medical school in Galway. They were married in 1997. Connolly is also a doctor and author who has specialized in infectious disease by training and also worked at the World Health Organization. She is a professor of health security and infectious disease at National University of Ireland Galway. They have three children.Ryan is currently based in Geneva, Switzerland.\n\n\n== Selected works and publications ==\nGrein, Thomas (April 2000). \"Rumors of Disease in the Global Village: Outbreak Verification\". Emerging Infectious Diseases. 6 (2): 97–102. doi:10.3201/EID0602.000201. PMC 2640857. PMID 10756142.  Wikidata ()\nMcNabb, Scott JN; Chungong, Stella; Ryan, Mike; Wuhib, Tadesse; Nsubuga, Peter; Alemu, Wondi; Carande-Kulis, Vilma; Rodier, Guenael (2002-01-29). \"Conceptual framework of public health surveillance and action and its application in health sector reform\". BMC Public Health. 2 (1): 2. doi:10.1186/1471-2458-2-2. PMC 65598. PMID 11846889.  Wikidata ()\nWoods, Christopher W. (February 2002). \"An Outbreak of Rift Valley Fever in Northeastern Kenya, 1997-98\". Emerging Infectious Diseases. 8 (2): 138–144. doi:10.3201/EID0802.010023. PMC 2732454. PMID 11897064.  Wikidata ()\nRoth, C. E. (2003-02-22). \"WHO advocates investment in global infrastructure for outbreaks such as smallpox\". BMJ. 326 (7386): 447. doi:10.1136/BMJ.326.7386.447. PMC 1125323. PMID 12595391.  Wikidata ()\nGuerin, Philippe J; Brasher, Christopher; Baron, Emmanuel; Mic, Daniel; Grimont, Francine; Ryan, Mike; Aavitsland, Preben; Legros, Dominique (August 2003). \"Shigella dysenteriae serotype 1 in west Africa: intervention strategy for an outbreak in Sierra Leone\". The Lancet. 362 (9385): 705–706. doi:10.1016/S0140-6736(03)14227-4. hdl:10144/18240. PMID 12957094.  Wikidata ()\nConnolly, Máire A; Gayer, Michelle; Ryan, Michael J; Salama, Peter; Spiegel, Paul; Heymann, David L (November 2004). \"Communicable diseases in complex emergencies: impact and challenges\" (PDF). The Lancet. 364 (9449): 1974–1983. doi:10.1016/S0140-6736(04)17481-3. PMID 15567014.  Wikidata ()\nMackenzie, John S.; Drury, Patrick; Arthur, Ray R.; Ryan, Michael J.; Grein, Thomas; Slattery, Raphael; Suri, Sameera; Domingo, Christine Tiffany; Bejtullahu, Armand (2014-09-04). \"The Global Outbreak Alert and Response Network\". Global Public Health. 9 (9): 1023–1039. doi:10.1080/17441692.2014.951870. PMC 4205922. PMID 25186571.  Wikidata ()\nHeymann, David L; Rodier, Guenael R; Ryan, Michael J (May 2015). \"Ebola vaccines: keep the clinical trial protocols on the shelf and ready to roll out\". The Lancet. 385 (9980): 1913–1915. doi:10.1016/S0140-6736(15)60645-6. PMC 7133714. PMID 25843891.  Wikidata ()\nMbaeyi, Chukwuma; Ryan, Michael J.; Smith, Philip; Mahamud, Abdirahman; Farag, Noha; Haithami, Salah; Sharaf, Magdi; Jorba, Jaume C.; Ehrhardt, Derek (2017-03-03). \"Response to a Large Polio Outbreak in a Setting of Conflict — Middle East, 2013–2015\". MMWR. Morbidity and Mortality Weekly Report. 66 (8): 227–231. doi:10.15585/MMWR.MM6608A6. PMC 5657899. PMID 28253229.  Wikidata ()\nMercer, Laina D.; Safdar, Rana M.; Ahmed, Jamal; Mahamud, Abdirahman; Khan, M. Muzaffar; Gerber, Sue; O’Leary, Aiden; Ryan, Mike; Salet, Frank; Kroiss, Steve J.; Lyons, Hil; Upfill-Brown, Alexander; Chabot-Couture, Guillaume (2017-10-11). \"Spatial model for risk prediction and sub-national prioritization to aid poliovirus eradication in Pakistan\". BMC Medicine. 15 (1): 180. doi:10.1186/S12916-017-0941-2. PMC 5635525. PMID 29017491.  Wikidata ()\nBarry, Ahmadou; Ahuka-Mundeke, Steve; Ali Ahmed, Yahaya; Allarangar, Yokouide; Anoko, Julienne; Archer, Brett Nicholas; Aruna Abedi, Aaron; Bagaria, Jayshree; Belizaire, Marie Roseline Darnycka; Bhatia, Sangeeta; Bokenge, Théophile; Bruni, Emanuele; Cori, Anne; Dabire, Ernest; Diallo, Amadou Mouctar; Diallo, Boubacar; Donnelly, Christl Ann; Dorigatti, Ilaria; Dorji, Tshewang Choden; Escobar Corado Waeber, Aura Rocio; Fall, Ibrahima Socé; Ferguson, Neil M; FitzJohn, Richard Gareth; Folefack Tengomo, Gervais Leon; Formenty, Pierre Bernard Henri; Forna, Alpha; Fortin, Anne; Garske, Tini; Gaythorpe, Katy AM; Gurry, Celine; Hamblion, Esther; Harouna Djingarey, Mamoudou; Haskew, Christopher; Hugonnet, Stéphane Alexandre Louis; Imai, Natsuko; Impouma, Benido; Kabongo, Guylain; Kalenga, Oly Ilunga; Kibangou, Emerencienne; Lee, Theresa Min-Hyung; Lukoya, Charles Okot; Ly, Ousmane; Makiala-Mandanda, Sheila; Mamba, Augustin; Mbala-Kingebeni, Placide; Mboussou, Franck Fortune Roland; Mlanda, Tamayi; Mondonge Makuma, Vital; Morgan, Oliver; Mujinga Mulumba, Anastasie; Mukadi Kakoni, Patrick; Mukadi-Bamuleka, Daniel; Muyembe, Jean-Jaques; Bathé, Ndjoloko Tambwe; Ndumbi Ngamala, Patricia; Ngom, Roland; Ngoy, Guillaume; Nouvellet, Pierre; Nsio, Justus; Ousman, Kevin Babila; Peron, Emilie; Polonsky, Jonathan Aaron; Ryan, Michael J.; Touré, Alhassane; Towner, Rodney; Tshapenda, Gaston; Van De Weerdt, Reinhilde; Van Kerkhove, Maria; Wendland, Annika; Yao, N'Da Konan Michel; Yoti, Zabulon; Yuma, Etienne; Kalambayi Kabamba, Guy; Lukwesa Mwati, Jean de Dieu; Mbuy, Gisele; Lubula, Leopold; Mutombo, Anny; Mavila, Oscar; Lay, Yyonne; Kitenge, Emma (July 2018). \"Outbreak of Ebola virus disease in the Democratic Republic of the Congo, April–May, 2018: an epidemiological study\" (PDF). The Lancet. 392 (10143): 213–221. doi:10.1016/S0140-6736(18)31387-4. PMID 30047375.  Wikidata ()\n\n\n== See also ==\nTedros Adhanom – Director-General of the World Health Organization, former Minister in Ethiopia\nBruce Aylward – Canadian physician-epidemiologist and co-lead of the WHO-China Joint Mission on COVID-19\nMaria Van Kerkhove – American infectious disease epidemiologist\nIbrahima Socé Fall - Assistant Director-General for Emergency Response at the World Health Organization (WHO)\n\n\n== References ==\n\n\n== External links ==\nDr. Mike Ryan at World Health Organization"