"The Chicago Defender is a Chicago-based online African-American newspaper. It was founded in 1905 by Robert S. Abbott and was once considered the \"most important\" newspaper of its kind.  Abbott's newspaper reported and campaigned against Jim Crow-era violence and urged black people in the American South to come north in what became the Great Migration. Abbott worked out an informal distribution system with Pullman porters who surreptitiously (and sometimes against southern state laws and mores) took his paper by rail far beyond Chicago, especially to African American readers in the Southern United States. Under his nephew and chosen successor, John H. Sengstacke, the paper took on segregation, especially in the U.S. military, during World War II. Copies of the paper were passed along in communities, and it is estimated that at its most successful, each copy made its way into the hands of four out of five African-Americans.In 1919–1922, the Defender attracted the writing talents of Langston Hughes; from the 1940s through 1960s Hughes also wrote an opinion column for the paper. Washington D.C and international correspondent Ethel Payne,  poet Gwendolyn Brooks, author Willard Motley, journalists Ida B. Wells, L. Alex Wilson and Louis Lomax wrote for the paper at different times.  During the height of the civil rights movement era, it was published as The Chicago Daily Defender, a daily newspaper, beginning in 1956.  It returned to a weekly paper in 2008.In 2019, its publisher, Real Times Media Inc., announced that the Defender would cease its print edition but continue as an online publication.  The editorial board of the Chicago Tribune, noting the impact The Defender has had in its 114 years, praised the continuation of the publication in its new form.\n\n\n== Foundation and social impact, role in the Great Migration ==\n\nThe Chicago Defender's editor and founder Robert Sengstacke Abbott played a major role in influencing the Great Migration of African Americans from the rural South to the urban North by means of strong, moralistic rhetoric in his editorials and political cartoons, the promotion of Chicago as a destination, and the advertisement of successful black individuals as inspiration for blacks in the South.\nThe rhetoric and art exhibited in the Defender demanded equality of the races and promoted a northern migration. Abbott published articles that were exposés of southern crimes against blacks. The Defender consistently published articles describing lynchings in the South, with vivid descriptions of gore and the victims' deaths. Lynchings were at a peak at the turn of the century, in the period when southern state legislatures passed new constitutions and laws to disenfranchise most blacks and exclude them from the political system. Legislatures dominated by conservative white Democrats established racial segregation and Jim Crow.\nAbbott openly blamed the lynching violence on the white mobs who were typically involved, forcing readers to accept that these crimes were \"systematic and unremitting\". The newspaper's intense focus on these injustices implicitly laid the groundwork upon which Abbott would build his explicit critiques of society. At the same time, the NAACP was publicizing the toll of lynching at its offices in New York City.\nThe art in the Defender, particularly its political cartoons by Jay Jackson and others, explicitly addressed race issues and advocated northern migration of blacks.\nAfter the movement of southern blacks northward became a quantifiable phenomenon, the Defender took a particular interest in sensationalizing migratory stories, often on the front page. Abbott positioned his paper as a primary influence of these movements before historians would, for he used the Defender to initiate and advertise a \"Great Northern Drive\" day, set for May 15, 1917. The movement to northern and midwestern cities, and to the West Coast at the time of World War I, became known as the Great Migration, in which 1.5 million blacks moved out of the rural South in early 20th century years up to 1940, and another 5 million left towns and rural areas from 1940 to 1970.\nAbbott used the Defender to promote Chicago as an attractive destination for southern blacks. Abbott presented Chicago as a promised-land with abundant jobs, as he included advertisements \"clearly aimed at southerners,\" that called for massive numbers of workers wanted in factory positions. The Defender was filled with advertisements for desirable commodities, beauty products and technological devices. Abbott's paper was the first black newspaper to incorporate a full entertainment section. Chicago was portrayed as a lively city where blacks commonly went to the theaters, ate out at fancy restaurants, attended sports events, including \"cheering for the American Black Giants, black America's favorite baseball team\", and could dance all night in the hottest night clubs.The Defender featured letters and poetry submitted by successful recent migrants; these writings \"served as representative anecdotes, supplying readers with prototype examples ... that characterized the migration campaign\".  To supplement these first-person accounts, Abbott often published small features on successful blacks in Chicago. The well-known African American mentalist Princess Mysteria had from 1920 to her death in 1930 a weekly column on the Defender, called \"Advise to the Wise and Otherwise.\"\n\nIn 1923, Abbott and editor Lucius Harper created the Bud Billiken Club for black children through the \"Junior Defender\" page of the paper. The club encouraged the children's proper development, and reading The Defender.  In 1929 the organization began the Bud Billiken Parade and Picnic, which is still held annually in Chicago in early August. In the 1950s, under Sengstacke's direction, the Bud Billiken Parade expanded and emerged as the largest single event in Chicago. Today, it attracts more than one million attendance with more than 25 million television viewers, making it one of the largest parades in the country.In 1928, for the first time, The Defender refused to endorse a Republican Party presidential candidate.  Throughout the election it ran a series of articles critical of the party, its failures to advance black civil rights, and what it saw as Republican's embrace or acquiescence in segregationism, party support in a revitalized Ku Klux Klan, and the Republican's Lily White Movement.  The paper's final pre-election editorial read in part: “We want justice in America and we mean to get it. If 50 years of support to the Republican Party doesn’t get us justice, then we must of necessity shift our allegiance to new quarters.”  For a variety of reasons, in the coming years, black support for the Republican Party fell rapidly.\n\n\n== Sengstacke era ==\nAbbott took a special interest in his nephew, John H. Sengstacke (1912–1997), paying for his education and grooming him to take over the Defender, which he did in 1940 after working with his uncle for several years. He urged integration of the armed forces. In 1948, he was appointed by President Harry S. Truman to the commission to study this and plan the process, which was initiated by the military in 1949.\nSengstacke also brought together for the first time major black newspaper publishers and created the National Negro Publishers Association, later renamed the National Newspaper Publishers Association (NNPA). In the early 21st century, the NNPA consists of more than 200 member black newspapers. Two days following the publishers' first meeting in Chicago, Abbott died.\nOne of Sengstacke's most striking accomplishments occurred on February 6, 1956, when the Defender became a daily newspaper and changed its name to the Chicago Daily Defender, the nation's second black daily newspaper. It immediately became the largest black-owned daily in the nation. It published as a daily until 2003, when new owners converted the Defender back to a weekly. The Defender was one of only three African-American dailies in the United States; the other two are the Atlanta Daily World, the first black newspaper founded as a daily in 1928, and the New York Daily Challenge, founded in 1971.  In 1965 Sengstacke created a chain of newspapers, which also included the Pittsburgh Courier, the Memphis Tri-State Defender, and the Michigan Chronicle.In a 1967 editorial, the Defender decried anti-Semitism in the community, reminding readers of the role of Jews in the civil rights movement. \"These powerful voices,\" the Defender wrote, \"which have been lifted on behalf of the Negro peoples' cause, should not be forgotten when resolutions are passed by the black power hierarchy. Jews and Negroes have problems in common. They can ill-afford to be at one another's throats.\"\n\n\n== Real Times Inc. ==\nControl of the Chicago Defender and her sister publications was transferred to a new ownership group named Real Times Inc. in January 2003. Real Times, Inc. was organized and led by Thom Picou, and Robert (Bobby) Sengstacke, John H. Sengstacke's surviving child and father of the beneficiaries of the Sengstacke Trust. In effect, Picou, then chairman and CEO of Real Times, Inc., led what was then labeled a \"Sengstacke family-led\" deal to facilitate trust beneficiaries and other Sengstacke family shareholders to agree to the sale of the company. Picou recruited Sam Logan, former publisher of the Michigan Chronicle, who then recruited O'Neil Swanson, Bill Pickard, Ron Hall and Gordon Follmer, black businessman from Detroit, Michigan (the \"Detroit Group\"), as investors in Real Times. Chicago investors included Picou, Bobby Sengstacke, David M. Milliner (who served as publisher of the Chicago Defender from 2003 to 2004), Kurt Cherry and James Carr.\nIn July 2019,  the Chicago Defender reported that recent print runs had numbered 16,000 but that its digital edition reached almost half a million unique monthly visitors.\n\n\n== See also ==\n\nChicago Defender Building\nAfrican American Newspapers\nLongview Race Riot\nBessye J. Bearden\nRoscoe Simmons\n\n\n== References ==\n\n\n== Further reading ==\nMichaeli, Ethan (2016). The Defender: How the Legendary Black Newspaper Changed America. Houghton Mifflin Harcourt. ISBN 9780547560694.\nWashburn, Patrick S. The African American Newspaper: Voice of Freedom (Northwestern University Press, 2006); covers 1827-1900; emphasis on Pittsburgh Courier and the Chicago Defender\n\n\n== External links ==\nOfficial website\n\"Chicago Defender celebrates 100 years in business\" - Karen E. Pride, Chicago Defender, May 5, 2005\n\"Chicago Defender photo exhibit looks back to the future\" - Coverage of star-studded opening for exhibition of Defender photography\nPBS: Chicago Defender\nThe Chicago Defender’s Standing Dealers List (map, 1919)\nSamples of a few of the comic strips created for the Defender Page 1 Page 2"