"The Dungeon Master's Guide (DMG or DM's Guide; in earlier editions, the Dungeon Masters Guide or Dungeon Master Guide) is a book of rules for the fantasy role-playing game Dungeons & Dragons. The Dungeon Master's Guide contains rules concerning the arbitration and administration of a game, and is intended for use by the game's Dungeon Master. The original Dungeon Master's Guide was published in 1979 and gave Dungeon Masters everything they needed to run a D&D game campaign.It is a companion book to the Player's Handbook, which contains all of the basic rules of gameplay, and the Monster Manual, which is a reference book of statistics for various animals and monsters. The Player's Handbook, Dungeon Master's Guide, and Monster Manual are collectively referred to as the \"core rules\" of the Dungeons & Dragons game. Both the Dungeon Master's Guide and the Player's Handbook give advice, tips, and suggestions for various styles of play.While all players, including the Dungeon Master, are expected to have at their disposal a copy of the Player's Handbook, only the Dungeon Master is expected to refer to the Dungeon Master's Guide or Monster Manual during gameplay.\n\n\n== Advanced Dungeons & Dragons ==\nThe original AD&D Dungeon Masters Guide (sic) was written by Gary Gygax and published by TSR in 1979 as a 232-page hardcover with a cover by David C. Sutherland III. The 1983 printing featured a new cover by Jeff Easley.Like other volumes of Dungeons & Dragons handbooks, the Dungeon Masters Guide has gone through several versions through the years. The original edition was written by Gary Gygax and edited by Mike Carr, who also wrote the foreword. The original cover art was by David C. Sutherland III, and interior illustrations were provided by Sutherland, D. A. Trampier, Darlene Pekul, Will McLean, David S. LaForce, and Erol Otus.\nThe first edition Dungeon Masters Guide covered the essential rules for the Dungeon Master: creating and maintaining player characters and managing non-player characters, handling combat, and running adventures and multi-session campaigns. The book also included descriptions of magic items and treasure, random monster encounters, and statistics for the basic monsters and creatures of the game. New magic items were introduced.\nThe Dungeon Masters Guide contains scores of tables and charts for figuring damage and resolving encounters in a typical adventure, tables and rules for creating characters, and lists of the various abilities of the different classes of characters.\nOne supplement to the Guide was the Dungeon Masters Screen: two heavy-duty tri-fold boards with the most frequently used tables printed on them for easy reference. The 1979 second edition of the screen describes its purpose as \"useful for shielding maps and other game materials from the players when placed upright, and also provide[s] instant reference to the charts and tables most commonly used during play.\" The Advanced Dungeons & Dragons Second Edition screen came packaged with a brief adventure; later editions of that screen, and screens produced for later editions, have instead included character sheets and general reference booklets.\nA feature of the first edition Dungeon Masters Guide was the random dungeon generator. The generator allowed the Dungeon Master, by the rolling of dice, to generate a dungeon adventure \"on the fly\". A dungeon complete with passageways, rooms, treasure, monsters, and other encounters could easily and randomly be constructed as the player progressed. It could be used with several people or a single player. The generator was not included in subsequent editions of the Dungeon Master's Guide but made a re-appearance in the fifth edition Dungeon Master's Guide.\nThe original Dungeon Masters Guide was reviewed by Don Turnbull in issue #16 of the magazine White Dwarf (December 1979/January 1980). Turnbull commented mostly on the size of the book, \"I would say that only the most severe critic could point at a minor omission, let alone a serious one.\"The 1st edition Dungeon Masters Guide was reproduced as a premium reprint on July 17, 2012.\n\n\n=== Reviews ===\nCasus Belli #39 (Aug 1987)\n\n\n== Advanced Dungeons & Dragons 2nd edition ==\nThe AD&D 2nd Edition Dungeon Master Guide was released in 1989. This 192-page hardcover book was designed by David \"Zeb\" Cook, with cover art by Jeff Easley. The book featured interior illustrations by Easley, Clyde Caldwell, John and Laura Lakey, David Dorman, Douglas Chaffee, and Jean E. Martin.\nThis Dungeon Master Guide featured revised second edition rules for the Dungeon Master, totally reorganized and streamlined. The book detailed options for character creation, handling alignment, new money and equipment rules, treasure and magical items, encounters, time and movement, and handling non-player characters. The book is indexed, and contains many full-page color illustrations.The second edition Dungeon Master Guide is an ORIGINS and Gamer's Choice award-winner. In his 1991 book Heroic Worlds, Lawrence Schick commented that this book contained \"lots of excellent new advice on how to run AD&D\". A new version of the Dungeon Master Guide, with new art and layout but the same text, was released in 1995, as part of TSR's 25th anniversary.The 2nd edition Dungeon Master Guide was reproduced as a premium reprint on May 21, 2013.\n\n\n== Dungeons & Dragons 3rd edition ==\nThe 3rd edition D&D Dungeon Master's Guide was published in 2000.\nMonte Cook, Jonathan Tweet, and Skip Williams all contributed to the 3rd edition Player's Handbook, Dungeon Master's Guide, and Monster Manual, and then each designer wrote one of the books based on those contributions. Cook is credited with the book's design. Cover art is by Henry Higginbotham, with interior art by Lars Grant-West, Scott Fischer, John Foster, Todd Lockwood, David Martin, Arnie Swekel, Kevin Walker, Sam Wood, and Wayne Reynolds. Dungeon Master's Guide was republished in 2001 as a slightly revised edition, correcting a few errors in the first edition.\nIn 2003, the Dungeon Master's Guide was revised for the 3.5 edition. David Noonan and Rich Redman are credited for the Dungeon Master's Guide 3.5 revision. Cover art is by Henry Higginbotham, with interior art by Matt Cavotta, Ed Cox, Lars Grant-West, Scott Fischer, John Foster, Jeremy Jarvis, John and Laura Lakey, Todd Lockwood, David Martin, Raven Mimura, Wayne Reynolds, Scott Roller, Brian Snoddy, Arnie Swekel, and Sam Wood.\n\nWhen asked about the changes from the previous Dungeon Master's Guide, Rich Redman said:I think the most immediate, obvious, and dramatic change is the reorganization. When the 3rd Edition books came out, the adventure game was supposed to teach you about D&D (including both playing and DMing) and the adventure path modules were supposed to help you learn more about DMing. That meant that the DMG could be, more or less, a catalogue or encyclopedia of rules information, a reference book for DMs. With the demise of the adventure game (which had stopped printing long before we started on 3.5), we needed to focus the 3.5 books much more on introducing the game to players. That meant reorganizing the DMG in particular. Several years of published books that referred to pages and chapters in the DMG meant we could only reorganize so much, but the copies I've seen stayed pretty close to the way I reorganized it.\nThe D&D Dungeon Master's Guide (v.3.5) was reproduced as a premium reprint on September 18, 2012.\n\n\n=== Reviews ===\nBackstab #24\nSF Site\n\n\n== Dungeons & Dragons 4th edition ==\nThe 4th edition D&D Dungeon Master's Guide was released on June 6, 2008, at the same time as its companion volumes. It is a 224-page hardcover written by James Wyatt. The front cover illustration was by Wayne Reynolds and the back cover illustration is by Brian Hagan, with interior illustrations by Rob Alexander, Steve Argyle, Wayne England, Jason Engle, David Griffith, Espen Grundetjern, Brian Hagan, Ralph Horsley, Howard Lyon, Lee Moyer, William O'Connor, Wayne Reynolds, Dan Scott, Ron Spears, Chris Stevens, Anne Stokes, and Eva Widermann. In addition to a comprehensive look at how to DM a 4th Edition campaign or adventure, it contains information on building encounters, aquatic and mounted combat, skill challenges, traps and hazards, rewards, NPC creation, artifacts, monster creation, and template, along with a sample town and short adventure so that DMs can start running their first 4th Edition adventure right away. Although it does contain artifacts, it is the first Dungeon Master's Guide not to contain standard magic items, which were moved into the Player's Handbook for 4th Edition. \nShannon Appelcline, author of Designers & Dragons, highlighted that the book introduced mechanical changes such as a \"new style for adventure encounters\" and a \"skill challenge system\" which were part of the key design philosophies of 4th edition. Appelcline wrote \"besides revamping philosophies and rules, D&D 4e also revamped the game's standard world model and its cosmology\" and \"Wizards also introduced a new world setting that has become most popularly known as 'Nentir Vale' (though that just designates a small part of the world)\".In September 2009, the Dungeon Master's Guide 2 was released. It was written by James Wyatt, with Bill Slavicsek, Mike Mearls, and Robin D. Laws. Appelcline wrote \"the original Dungeon Master's Guide had covered heroic adventuring (levels 1-10), so now the Dungeon Master's Guide 2 detailed paragon adventuring (levels 11-20). However, there is much more in the book too, including storytelling advice, skill challenge and monster customization, and the return of one of D&D's most beloved settings\". The \"fan-favorite setting of Sigil\" was last revisited in depth in the Planescape Campaign Setting (1994) for the 2nd edition.As part of the Essentials line of products, which were intended as an easy entry point for new players, Wizards of the Coast released a Dungeon Master's Kit (2010) that included a digest-sized book for the Dungeon Master containing much of the same material as the 4th edition Dungeon Master's Guide along with a two-part adventure module and a set of cardboard tokens for monsters.\n\n\n== Dungeons & Dragons 5th edition ==\nThe 5th edition Dungeons & Dragons Dungeon Master's Guide was released in 2014 as the last of three core rulebooks for the new edition. On the staggered release schedule, Jeremy Crawford wrote \"our small team couldn’t finish the books at the same time and also ensure their high quality. [...] We could either stagger their releases, or we could sit on the books until all three were finished\". Crawford and Mike Mearls co-lead design for the Fifth Edition of Dungeons & Dragons. Polygon reported that the book \"is by far the densest of the rulebooks yet released, but shares the same cover price — $50 in the US\".\nIn an interview with Escapist Magazine, Mearls said:Basic D&D hits core fantasy, it's stereotypical fantasy adventuring. If you're the DM and you want to do something more exotic, you say \"I want to add technology to my game\" or \"I want to have more detailed rules for a grim and grittier game, more of a horror game.\" That's where the DMG comes in, it's for really fine-tuning your campaign, and creating a different type of experience than your standard fantasy campaign. It's also for expanding the scope of the game. [...] The DMG also has a lot of utilities in it, like for dungeon creation, adventure creation, creating monsters, creating spells, even if you wanted to create a character class. [...] So it's really for getting under the hood of how the system works and building up your campaign.\n\n\n=== Reception ===\nThe book won the 2015 ENnie \"Best Supplement\" Gold award and the 2015 Origins \"Best Role-Playing Game Supplement\" and \"Fan Favorite\" awards.Henry Glasheen, for SLUG Magazine, wrote \"Fifth Edition, to my eyes, is the new gold standard for D20-based tabletop RPGs. It strips away the tedium of systems and statistics and replaces them with the true substance of role playing—deep, immersive stories. I’ve often found that the Dungeon Master’s Guide was the most vestigial of all the D&D manuals, but Fifth Edition has elevated this previously tertiary book into something far more important and useful\".Jonathan Bolding, for Escapist Magazine, wrote \"however, on finishing the book it's clear that while many critics - myself included - thought that this system would hinge on the DMG, the DMG just confirmed what we already knew D&D 5th Edition to be. This is a living history of D&D, a collection of what the game has been so far. Perfection, not innovation. Options, not prescriptions\".Chuck Francisco of mania.com commented: \"Miles of treasure tables escort a wealth of random adventure tables to the ball, where they're resplendent in all of their easy session crafting majesty. The versatility of this tome is nowhere more obvious than amongst the flavor filled side panels, which further detail the lower magical level of the main setting, before explaining all of the variable options a DM has in bringing to life a world of their own.\"\n\n\n=== Reviews ===\nCasus Belli (v4, Issue 13 - Jan/Feb 2015)\n\n\n== References ==\n\n\n== Further reading ==\n\"Advanced Dungeons & Dragons Combat Tables\", White Dwarf #13.\n\"Clerics Turning Undead\", Footprints #7.\n\"Expanded Secondary Skills\", Footprints #8.\n\"Master Encumbrance Guide: Lessening the Burden of Encumbrance\", Footprints #7.\n\"Sneak Preview: AD&D Dungeon Masters Guide\", The Dragon #22.\n\"The Complete Attack and Saving Throw Table\", Footprints #10.\n\n\n== External links ==\nFull list of contents for the AD&D Dungeon Master's Guide\nErrata\nReview of the AD&D Dungeon Master's Guide from RPG.net"