"The Greek citron variety of Citrus medica (Greek: κιτριά, Hebrew: אתרוג קורפו‎ or יְוָנִי) was botanically classified by Adolf Engler as the \"variety etrog\". This is remarking on its major use for the Jewish ritual etrog during Sukkot.It was also called pitima, or the cedro col pigolo (\"citron with a pitom\"), because of its usually persisting pitom (carpel). The last does not only enhance its character, but also adds Halachic promotion.\n\n\n== Description and illustration ==\n\nThe following description is from the Nurenbergische Hesperides (2nd Volume; 8th Chap.) by Johann Christoph Volkamer, titled \"About the Cedro col Pigolo\". He was growing that kind in his botanical garden in Nuremberg, and writes that it can also be called the \"Jewish Citron\", since it is mostly used for the four species.\n''This tree does not become particularly big. The leaves are smaller than those of other citrons, and serrated, oblong, pointed towards the front, mixed with many thorns. The bloom is small and reddish from outside. The fruit blossoms (- ''the [[Gynoecium|carpels]]'') are not less oblong from the beginning, appearing as reddish and dark-green; thereafter they turn entirely green, and when they ripen, straw-yellow, remaining, however, rather small all the time and never growing to a proper size, like other kinds of Citron.\n''Such a fruit as the one shown in the illustration grew one year ago in my garden, and I hope to grow more of those. This fruit is pointed above and has at the top a small long distaff (- ''the pitom''); it has a very pleasant smell, very like that of the Florentine citron described below. It contains very little juice and tastes somewhat sour and also somewhat bitter. As it seems, this plant thrives better in pots, than standing in the ground, for this tree of mine has remained very short in height, and its branches have not overgrown the [supporting] stalk.''\n\n\n== Uses and cultivation ==\nThe variety was initially cultivated in towns near Corfu. The etrogim were under the hashgachah of the Corfu rabbis and were transported to Trieste by way of Corfu, and that is why Jews referred to this as the Corfu etrog.\n\nWhile citron trees are still found on Corfu, and in Naxos, the citron is no longer exported from Greece for the ritual purpose. The Crete citron growers sell it for the candied peel, which is called succade, and in Naxos it is distilled into a special aromatic liqueur called kitron.\n\n\n== Role as etrog ==\n\n\n=== Initial source ===\nAccording to the Romaniotes this variety of citron was in their hands since the times of the Second Temple or earlier, and was always used by them for the religious ritual. Afterwards it was appreciated by the Sephardim who settled in Italy, Greece and Turkey, after their exile from Spain in 1492.\nHistorically speaking, the citron is considered by numerous writers, to be introduced to Europe by the troops of Alexander. It was also described by Theophrastus, who succeeded Aristotle as the curator of the Botanical garden in Athens.\n\n\n=== In Ashkenazi hands ===\nWhen the Corfu etrogim started to be imported into the rest of Europe in 1785, the communities adherent through Ashkenazi tradition to the Genoese variety were very skeptical about it. The Ashkenazim assumed that since the Greek is so much different from the Genoese, it might have been grafted or hybridized. At the beginning of the 19th century, when the Yanova Esrog was ceased due to the battles of Napoleon I of France, it really started to dominate the market.\nRabbi Ephraim Zalman Margolis, in his responsa Bet Ephraim (volume 1;56), confirmed that at the time, none of the so-called Corfu etrogim were from grafted citron trees. He argued that, even if it could not be verified whether the plant was propagated by cuttings of grafted plants since the tradition lineage is missing, it should still be considered kosher. Therefore, he concluded that in case no nice, clean and kosher \"Yanove Esrog\" is to be found, the Corfu etrog may be used instead. This certification, as well as the lenient position of many other authorities, eventually opened doors for the permission of this etrog.\n\n\n=== The new places ===\n\nAlexander Ziskind Mintz, an Ashkenazi merchant, started claiming in 1846 that only those growing in Parga are not grafted, and therefore kosher for the ritual. He claimed that under the previous Ottoman system, citrons could only be planted in Parga under the control of Ali Pasha, who collected all proceeds for the Ottoman empire, and those were thus the only citrons known as kosher and un-grafted through the years. Since the rules have been changed, and farmers are allowed to earn their income and pay only a tax, that's how the plantations have expanded to Agia and Preveza. And since those places are new, no one could not be sure whether those picked from newly planted trees, were grafted or not, at least without careful tree checking upon picking.\nThe local Sephardic rabbis in head of Judah Bibas, the Chief Rabbi of Corfu, kept arguing that all of them are kosher, and that not one grafted tree is to be in the regions of cultivation. Their position was supported by the great Rabbi Chaim Palagi the chief rabbi (Hakham Bashi) of İzmir in neighboring Turkey.\nThe dispute ended up with Rabbi Shlomo Kluger banning all sources including, those of Mintz, which were said to be from Parga, and Rabbi Joseph Saul Nathanson permitting all sources, if they bore a certification from the local rabbis.\n\n\n=== The monopoly and its break ===\n\nThis controversy did not significantly decrease the abundance of the Corfu. In 1875, they incorporated themselves into a cartel and drastically raised the price of each single etrog to six florins, assuming that the Jews would have no choice and pay the price.\nThere was an underlying misconception, that there is a belief by the Jews that whoever doesn't reveal a Corfu etrog for Sukkot will not survive the next year. However, this was not the case. The rabbi of Kovno, Rabbi Yitzchak Elchanan Spektor, intended to stop this record-breaking monopoly, and banned the Corfu etrog until the prices would be lowered, and the status of kashrus clarified. Even the rabbi of Corfu certified in a letter that there were already many grafted trees in the region, and the certification process was very complex. The ban was further supported with signatures of many leading rabbis throughout Eastern Europe.\nThe preferred etrog was now the Balady citron of Israel, which had just started being imported, and they regarded even the Corsican citron above the Corfu, while the most respected Genoese citron was very hard to get.\nEach Jewish etrog merchant committed himself to his local rabbi that he would not buy any etrog from the Greek farmers, since this would result in a record breaking expense for the Jewish community, which was impossible for them to pay. This was a great sacrifice from the local Jewry in Corfu, who went without income for the year.\nThis act severely affected the Greek planters and dealers, who, left with high costs and no revenue, were forced to lower prices.\n\n\n=== The blood libel and pogrom ===\n\nIn the pre-Pesach season of 1891, an unidentified female body was found on a street neighboring the Jewish ghetto. The Greek etrog growers made a blood libel, accusing local Jews of the murder.\nThe local Church officials on Corfu (as well as on the other Ionian Islands) maintained a deliberate neutrality during the anti-semitic events and did not support the government's efforts to reestablish order, unlike the high echelons of the Church, who took measures to limit the anti-Semitic mood. Similarly the Greek press played a role in publicizing the unfairness of the accusations. The culprits were never prosecuted, however.After several days of violence, a short investigation found that the victim was Sarda, a member of a famous Jewish family on the Corfu Island, who was killed in sexual violence. The discovery was too late for the total of 139 dead, and this composed the Jewish saying, \"Rather should the etrog have a 'blatt-flaw', [a flaw similar to apple russet that is presumably caused by a scratch from a leaf, this was common in the different varieties of citron but not in the Greek] but not in any case a 'blood-flaw'\", referring to the blood spilled in Corfu. However, the local Jewry did not necessarily appreciate the ban.\n\n\n=== Partial decline ===\nAs a result, the popularity of the Greek citron drastically declined in the eastern European communities that switched to the Balady etrogs, but was still used elsewhere. After World War II, some European Jews who had relocated to Israel or the United States still continued using the Greek for at least two decades.\nIn 1956, Rabbi Yeshaye Gross, a Satmar from Brooklyn, proceeded to visit the orchards in Calabria, and found out that a large percentage of the trees are actually grafted. From then on he realized that no etrog could be picked off the tree without a careful inspection, which he was allowed and able to do.\nThe Greek growers, in contrast, didn't let any Jewish merchants visit their orchards to inspect their trees, and only sold etrogs on Corfu. This forced many Satmars to switch back to the traditional Yanova citron, even not bearing a pitam. The cultivation of the Greek citron was thereafter on concentrated in Halki, Naxos where there is a small production for distillery.\nIn those years, the Moroccan citron took place and appealed for both traditional purity without any history of grafting, and its bearing a persistent healthy pitam.Still the Skverer rebbe manages to get annually one esrog from Corfu. The esrog is brought from Greece by Meyer Knoblach from New Square.\n\n\n== Introduction to Israel ==\nAt about 1850, Sir Moses Montefiore was instrumental in establishing etrog plantations in the Holy Land, in order to help the Jewish settlers to survive. As the Balady citron had little chance for success – being not so great in shape, color etc., with a persistent style ratio as low as 1;1000 – the Sephardic settlers, who were always positive about the Corfu, planted its seeds in the coastal region of Israel, especially in the vicinity of Jaffa. The transplantation was witnessed as kosher by the local Sephardic Rabbi Yehuda Halevi.\n\nArab farmers imported cuttings from Greece, which they budded onto rootstock of the Palestinian sweet lime for cleansing diseases and for longer life. The Corfu variety, which they called kubbad abu nunia ('citron with persistent style'), did not acclimatize well in Israeli land, so growers started employing the grafting method on a large scale.\nThe great scholar and kabballist Rabbi Aaron Ezrial of the Beit El Synagogue still certified some ungrafted citron orchards in Jaffa by eliminating the plants he found to be grafted. The Greek-Jaffa citron was also promoted by most of the Sephardic and even some Ashkenazic rabbis, who saw a great future in the beautiful and pitamed variety. The permission was based upon inspection of each and every tree prior to picking, just like it is practiced today in Calabria.In the following time, the Greek citron of Jaffa pushed the Balady citron off the market. The Jaffa Rabbi Abraham Isaac Kook founded and headed the \"Atzei Hadar\" union for kosher etrog cultivators and marketers, to prevent grafting the Jaffa etrog unto rootstock of sour orange or sweet lime, but very much promoted intraspecific grafting of the Greek citron upon Balady citron rootstock, which is permitted by Halacha.\nThe act led to the establishment of a beautiful variety in Israel, yet kosher, and saved the economy of Israel for decades. As of today it is the leading variety in Israel, and is a very important article in international trade.\n\n\n=== Suspicions ===\n\nAlthough the graft of Greek citron on Balady rootstock was a great idea from practical and Halachic views, it induced suspicion from customers who wondered why the Israeli citron was suddenly so beautiful with an erect pitam. Suspicion arose in Israel and in the diaspora, and many rumors spread.\nThe late Grand Rabbi of Munkatch, Chaim Elazar Spira, was aware of the change. He speculated that it was the same problem continuously claimed against the Greek in their homeland Greece, namely to be grafted or bred with lemon, which renders it non-kosher.This was not completely false, since those not supervised were grafted also onto bitter orange or limetta. Also, even with supervision it is very hard to detect the rootstock type, while not the same as the scion.\nSuch skeptical views about the beautiful Greek-Israeli citron, were also expressed by the Rabbi Solomon Eliezer Alfandari, and by the former chief rabbi Ovadia Yosef.\nLater an ungrafted tree was found in the backyard of a Shochet in Hadera with the name ordang. Today, most Hasidic communities in Israel, as well as in the diaspora, are using descendants of this strain while planted under rabbinical Hashgacha.\n\n\n== See also ==\nHistory of the Jews in Greece\nIsser Zalman Meltzer\nKehila Kedosha Janina\n\n\n== Notes ==\n\n\n== References ==\n\n\n=== HaLevanon links ===\nThe etrog controversy in the years of 1875–6 was mainly led by the Hebrew newspaper HaLevanon. The newspaper has been digitized and made available online by the Hebrew University of Jerusalem. Some links to it (in Hebrew):\n\nHaLevanon 7 – no 32 – see page 2\nHaLevanon 11 – no 7, no 35, no 36, no 39 The ruling of Rabbi Spektor, no 41, no 44, no 45, no 46 – see also page 6, no 50.\nHaLevanon 12 – no 1 – go to page 3,no 2, no 3, no 4, no 5, no 6, no 7, no 43, no 49, no 50\nHaLevanon 13 – no 3 – see page 4, no 8 – see page 3, no 42, no 47.\n\n\n=== Google Books ===\nOrigin of Cultivated Plants By Alphonse de Candolle\nMansfeld's encyclopedia of agricultural and horticultural crops ..., Volume 4 By Peter Hanelt, Rudolf Mansfeld, R. Büttner\nThe Mediterranean Diets in Health and Disease\nA History of the Jews in Modern Times\n\n\n== External links ==\n\"The Extra-ordinary History of Etrog\"\nEssay by Eliezer Segal\nInnvista page about citrons\nThe Citrus Variety Collection at the University of California Riverside\nCitrus Pages\nRemnants of ancient synagogue in Albania or by Science Daily\nGreek Legends and Stories by M.V. Seton-Williams\n\"Etrog\", \"Corfu\" in The Jewish Encyclopedia\nThe Encyclopedia of Jewish Life Before and During the Holocaust\n\"In the Arboretum Today\"\nFoods and Nutrition Encyclopedia By Audrey H. Ensminger\nViroid infection on Etrog Citron by the USDA"