"The Villanova Wildcats are the athletic teams of Villanova University. They compete in the Big East (NCAA Division I) for every sport; except football where they compete in the Colonial Athletic Association (Football Championship Subdivision, formerly Division I-AA, for football only). On December 15, 2012, Villanova and the other six, non-FBS schools announced that they were departing the Big East for a new conference. This conference assumed the Big East name on July 1, 2013.\n\n\n== Teams ==\n\n\n=== Men's basketball ===\n\nThe Villanova Wildcats compete in the Big East Conference and are coached by Jay Wright. The team has traditionally divided its home schedule between its on-campus arena, the William B. Finneran Pavilion, and the Wells Fargo Center in South Philadelphia, for larger draws. During the 2017–18 season, the team played its entire home schedule that season at the Wells Fargo Center following the reconstruction of the Pavilion scheduled to be completed in time for the 2018–19 school year. Wright has taken the Wildcats to 12 postseason appearances including 7 consecutive trips (2005–2011) and 5 consecutive trips (2013-2017) to the NCAA Tournament. The 2011-12 team struggled and missed postseason but Coach Wright brought a surprising young team back to the 2013 NCAA Tournament. Villanova has appeared in the NIT 17 times, winning in 1994, and won the Big East Tournament in 1995, 2015 and 2017. The Wildcats have appeared in the NCAA Men's Tournament 37 times, the 8th highest total in NCAA history have reached the Elite Eight 13 times. \nThey have been to the Final Four of the NCAA Division I Men's Basketball Tournament on five occasions. The 1939 team coached by Al Severance reached the inaugural NCAA Final Four played at the Palestra for the 1939 NCAA Basketball Tournament. All-American Howard Porter led a Wildcat team coached by Jack Kraft to Final Four of the 1971 NCAA University Division Basketball Tournament. Coach Rollie Massimino took Villanova to a surprising 1985 National Championship. Current Coach Jay Wright reached the Final Four at the 2009 NCAA Division I Men's Basketball Tournament behind Dante Cunningham and Scottie Reynolds. The team most recently won the 2018 NCAA Division I Men's Basketball Tournament for their third National Championship.\nVillanova won the 1985 NCAA Division I Men's Basketball Tournament with a historic 66–64 win over top-seeded Georgetown. The eighth-seeded Wildcats (unranked in the final AP poll) beat Dayton (at Dayton), top-seeded Michigan, Maryland and second-seeded North Carolina to win the Southeast Regional en route to the Final Four in Lexington, Kentucky. After defeating 2-seed Memphis State (now known as Memphis) in the national semifinals, Villanova met defending champion and ten-point-favorite Georgetown, led by Patrick Ewing, in the title game on April 1, 1985. The Wildcat squad remains the lowest overall seed in tournament history to win the championship, and their overall team shooting percentage of 78.6% remains an NCAA tournament record for a single game. This Championship Game is often cited among the greatest upsets in college basketball history. Ed Pinckney, who shot 5-of-7 and had 16 points in the game, was named the NCAA Tournament's Most Outstanding Player.\nOn April 4, 2016, the Wildcats won their second NCAA Championship in Men's Basketball, the first time in 31 years. They beat the North Carolina Tar Heels 77-74 off a buzzer-beater shot by Kris Jenkins with 0.5 seconds remaining in regulation.  Two years later, on April 2, 2018, Villanova earned its third national championship beating the Michigan Wolverines 79–62.\n\n\n=== Women's basketball ===\n\nThe Villanova Wildcats women's basketball team are coached by Harry Perretta, now serving his 34th year as head coach of the team. For the 2017–18 season, they will play their home games at Jake Nevin Field House on the Villanova campus while the future Finneran Pavilion is undergoing $65 million renovations. The Women's basketball program started in 1969 and played under CIAW and AIAW through 1981–82 season before moving to NCAA Division I. In the 81–82 season, the Wildcats posted an outstanding 29–4 record and reached the Final Four of the 1982 AIAW Women's Basketball Tournament before losing to eventual National Champion, Rutgers. \nThrough the 2009–10 season, the Villanova Women have a 669-413 alltime record since the program started in 1969. Previous head coaches include Liz Cawley (1969–70), Jane Sefranek-Stoltz (1970–75) and Joan King (1975–78). \nThe 1982–83 season was the initial season for Villanova Women's basketball to play NCAA Division I and they joined the Big East Conference that same season. Villanova was the Big East regular season and tournament champions in both 1985-86 and 1986-87 behind All-American Shelly Pennefather.\nDuring the 2008–09 season, Coach Perretta led the Wildcats to the NCAA Tournament for the ninth time in his Villanova career. This marked the ninth postseason appearance in the previous 10 years for the Wildcats. After playing in the 2000 WNIT, Villanova went to four consecutive NCAA Tournaments from 2001 to 2004 before playing in the WNIT in 2005, 2006 and 2008. \nThe 2002–03 season was a special one for the Wildcats. In addition to an impressive 28-6 overall record and a 12-4 Big East Conference mark, the Wildcats won their third Big East Conference Tournament championship and first since 1987 with an improbable 52–48 upset over previously unbeaten Connecticut. The win snapped Connecticut's then NCAA Division I women's basketball record of 70-straight victories and ended Connecticut's streak of nine-straight conference tournament championships.\nThe dean of the Big East and Big 5 coaches, Harry Perretta has brought the Wildcats national respect and success during his tenure at Villanova which began in 1978 at the age of 22. Coach Perretta reached a coaching milestone on November 12, 2011 with a win over Iona, representing the 600th win of his career. He is the 35th coach in the history of women's basketball at any level to reach the 600 win plateau, including the 22nd to accomplish the feat at the Division I level. Perretta is only the seventh NCAA Division I coaches to have 600 victories all at one school. On February 8, 2012, Perretta reached another milestone as he became the seventh coach across all NCAA divisions to coach 1,000 games at the same institution. Perretta was named the 2009 Big East Conference Co-Coach of the Year. That was the third time in his career that he has garnered Big East Coach of the Year distinction. He has led the Wildcats to fourteen seasons of 20 wins or more. Since joining the Big East in 1982, Perretta has compiled a 200-175 conference record through 2010.\nShelly Pennefather, was recognized in 1987 as the nation's top women's college basketball player, winning the Margaret Wade Trophy and earning Kodak All-America honors. Pennefather was the first 3-time winner of the Big East Conference Women's Basketball Player of the Year. She is the all-time leading scorer in the history of Villanova basketball with 2408 points. Pennefather was named the best Colorado Girls High school player of all-time and led Bishop Machebeuf Catholic High School to a 96–0 record and 3 State Championships.\n\n\n=== Football ===\n\nThe Wildcats compete in the Colonial Athletic Association and are coached by Mark Ferrente, 2nd season 5–6, who in 2017 succeeded Andy Talley the most successful football coach in school history with over 225 victories and one National championship. \nSince moving to I-AA, Villanova has made 12 appearances in the I-AA/FCS playoffs making trips to the NCAA Semifinal in 2002 and 2010 and winning the 2009 FCS National Championship. The Wildcats played in the NCAA Division I Football Championship game on December 18, 2009 against the Montana Grizzlies. The Wildcats beat the Grizzlies 23–21 to win their first NCAA Division I-AA National Championship.\nVillanova played in bowl games following the 1936, 1947, 1948, 1961, and 1962 college football seasons. After 87 seasons, the Board of Trustees voted to drop Football in April 1981 due to financial losses and poor attendance. In April, 1984, the Board of Trustees agreed to reinstate Football at the Division I-AA, now FBS level as a 65-scholarship program and named Andy Talley as head coach. The restored program began competing in 1985 at the Division III level and returned to full Division I-AA (now Division I FCS) level during the 1988 season.\nVillanova football has sent 36 players to the NFL over the years including Hall of Fame defensive end Howie Long, formerly of the Oakland Raiders and All-Pro running back Brian Westbrook of the Philadelphia Eagles.\nVillanova plays its arch rival the Delaware Fightin' Blue Hens in the \"Battle of the Blue\". Villanova leads the all-time series which was first played in 1895 by the margin of 23-21-1. \nThe Wildcats have a current series where they play the Temple Owls for the Philadelphia \"Mayor's Cup\". Villanova won the inaugural game in September 2009 but dropped the next three games to the FBS school. Villanova still leads the all-time series that started in 1928 by the margin of 16-15-2. In recent seasons the Wildcats also play the Penn Quakers  with many of the games held at historic Franklin Field. Villanova has an 11–6 lead in the series first played in 1905 and most recently in 2015.\n\n\n=== Men's lacrosse ===\n\nThe Villanova Wildcats men's lacrosse team represents Villanova University in National Collegiate Athletic Association (NCAA) Division I men's lacrosse. Villanova currently competes as a member of the Big East Conference and plays their home games at Villanova Stadium in Villanova, Pennsylvania.\nCoach Michael Corrado has taken the team to its only three NCAA appearances in history during his tenure and the school is poised for greater success in upcoming seasons.\nVillanova rose as high as #2 ranking and qualified for an at-large bid in the 2018 NCAA Tournament where they lost to eventual finalist [Duke University] in the first round. In 2011 Villanova rose as high as #7 ranking and qualified for an at-large bid in the NCAA Tournament where they lost to the University of Denver in the first round. During the regular season, the Wildcats drew over 6500 fans to a Big East match-up with Syracuse setting a new on-campus record for Lacrosse. Brian Karalunas became the first USILA First Team All-American in Villanova history.\n Through 2009, Villanova men's lacrosse was a member of the Colonial Athletic Association and won the CAA tournament for their first title in 2009. The fourth-seeded Wildcats were the lowest-seeded championship team in conference history. That season, Villanova also made their first NCAA tournament appearance, where they were routed in the first round by first-seeded Virginia, 18–6.The 2004 team finished 13-3 playing against the stiff competition of the CAA.\n\n\n=== Track and field ===\nVillanova University's Track and field team has a history of athletic success that has spanned from championships in both incarnations of the Big East Conference to NCAA championships.The men's team has produced 69 NCAA championships, 36 indoor and 33 outdoor. The team has had 8 NCAA team championships—4 cross country, 3 indoor ('68, '71, '79), 1 outdoor ('57). Prior to NCAA sponsoring Indoor T&F in 1965, Villanova won 6 ICAAAA Indoor T&F Championships ('57, '58, '60, '62, '63, '64). \nVillanova has produced 28 athletes who have made appearances in the Olympics, 10 of whom have medaled (7 Gold medals, 3 Silver medals). The men's team has also won 112 Penn Relays Championships, which stands as the most wins by any school. \nThe men's current coaches include head coach, Marcus O'Sullivan, and assistant head coach, Anthony Williams.The women's team has also had a multitude of success, producing 10 Big East team Championships and 7 NCAA team Championships. They have also produced 7 Olympians including Vicki Huber, Sonia O'Sullivan, Kim Certain, Kate Fonshell, Jen Rhines, Carmen Douma, and Carrie Tollefson. \nThe Women's team has won 28 Penn Relays Championships, which is the most wins by any women's program. \nThe current women's coaches include head coach, Gina Procaccio, and assistant head coach, Anthony Williams.\nThe Wildcats also hold the NCAA record in the 4 × 800 m relay set at the Penn Relays in 2013\nAt least one Villanova athlete has competed in every Summer Olympics since 1948, winning a total of 13 medals (9 gold, 4 silver).\n\n\n=== Cross country ===\nVillanova Men's and Women's Cross Country teams have a successful history of Big East and NCAA National Championships. Villanova won both the Men's and Women's Big East Cross Country Team Titles in 2011.\nThe 2011 women's Cross Country team finished as national runner-up led by Sheila Reid individual title. In 2010 and 2009, the women's cross country team won the NCAA Women's Cross Country Championship under Coach Gina Procaccio. The 2010 victory was led by individual national champion Sheila Reid of Villanova who repeated her NCAA individual crown in 2011.\nThe Wildcats hold the NCAA Division I record for the most NCAA Team and Individual Women's Cross Country Champions with 9 NCAA Team Championships ('89, '90, '91, '92, '93, '94, '98, '09, '10) and 9 NCAA individual champions, 7 of which coincided.\nNCAA Individual Cross Country Champions\n\nVicki Huber 1989\nSonia O'Sullivan 1990, 1991\nCarole Zajac 1992, 1993\nJennifer Rhines 1994\nCarrie Tollefson 1997\nSheila Reid 2010, 2011The 2011 Villanova Men's Cross Country team finished 13th in the Team competition at NCAA meet. \nVillanova has won 4 NCAA Men's Cross Country Team Championships covering 1966, 1967, 1968 and 1970.\nNCAA Individual Cross Country Champions \n\nVictor Zwolak 1963\nPatrick Tiernan 2016\n\n\n=== Swimming and diving ===\n\nIn its history, Villanova Swimming and Diving has produced several Olympians. Most recently Maddy Crippen competed in the 400m individual medley at the 2000 Olympics. At the 2008 Olympics, Villanova was represented by Kristina Lennox-Silva. Lennox competed for Puerto Rico and swam the 400m freestyle and 200m butterfly.\n\n\n== NCAA team championships ==\nVillanova has 21 NCAA team national championships.\nMen's (12)\nBasketball (3): 1985, 2016, 2018\nCross Country (4): 1966, 1967, 1968, 1970\nFootball (FCS) (1): 2009\nIndoor Track & Field (3): 1968, 1971, 1979\nOutdoor Track & Field (1): 1957\nWomen's (9)\nCross Country (9): 1989, 1990, 1991, 1992, 1993, 1994, 1998, 2009, 2010\nsee also:\nBig East Conference NCAA team championships\nList of NCAA schools with the most NCAA Division I championships\n\n\n== Conference realignment ==\nIn December 2012 the presidents of seven Big East schools which do not sponsor FBS football (also sometimes referred to as the \"Catholic 7\"), including Villanova, voted unanimously to leave the Big East and form a new conference. The new conference, which kept the Big East name, officially began on July 1, 2013.\n\n\n== Notable Non Varsity Sports ==\n\n\n=== Ultimate ===\nVillanova's men's ultimate (sport) (formerly known as ultimate frisbee) team, Main Line Ultimate, has competed in the USA Ultimate Division 1 regular season and Championship Series since 2003 and has existed on campus as a club since the 1980s. The club practices three times a week, competes in 3-5 tournaments a semester, and has a developmental team. Main Line Ultimate is coached by Chris Cruz '15 and assistant Ethan Fortin '17. Tryouts take place every fall semester where the team aims to introduce students to ultimate and find dedicated athletes for the team.  Most new members do not have ultimate experience before tryouts.\n\n\n==== Championship Series Finishes ====\n\n\n==== Individual Awards ====\n\n\n=== Rugby ===\nThe Villanova Rugby Football Club regained its official sanctioning by the University in 2010, after losing this status and being classified as a recreational sport during the 1990s. The college rugby team has been able to develop a roster of over 50 players, due in part to the growing popularity of rugby at the high school level, and the Wildcats are supported by a network of rugby alumni that contribute towards the cost of the rugby program. The Wildcats are led by head coach Jack Foley, a former Villanova RFC athlete, USA 7s player, and a head coach at various programs since 1998.\nRecently, the Wildcats played at the 2013 Collegiate Rugby Championship, the highest profile competition in college rugby, which was broadcast live on NBC from PPL Park in Philadelphia. Currently, Villanova competes in the D1-AA Keystone Conference for both 15s and 7s rugby. The team also schedules out of conference games, such as its preseason wins over Columbia, UPenn, and Lehigh in the fall of 2016. Following its regular spring sevens schedule, the team also competes in the annual Philadelphia Cup at PPL Park which runs concurrent with the CRC. Winning the Philadelphia Cup guarantees the Wildcats a spot in the CRC for the next year.\n\n\n== See also ==\nCollegiate sports in Philadelphia\n\n\n== References ==\n\n\n== External links ==\nOfficial website"