"Vaiśravaṇa (Sanskrit) or Vessavaṇa (Pali; Tibetan: རྣམ་ཐོས་སྲས་, Lhasa dialect: [Namtösé], simplified Chinese: 多闻天王; traditional Chinese: 多聞天王; pinyin: Duōwén Tiānwáng, Japanese: 毘沙門天, romanized: Bishamonten Korean: 비사문천, romanized: Bisamuncheon), is one of the Four Heavenly Kings, and is considered an important figure in Buddhism.\n\n\n== Names ==\nThe name Vaiśravaṇa is a vṛddhi derivative (used, e.g., for patronymics) of the Sanskrit proper name Viśravaṇa from the root vi-śru \"hear distinctly\", (passive) \"become famous\". The name Vaiśravaṇa is derived from the Sanskrit viśravaṇa which means \"son of Vishrava\", a usual epithet of the Hindu god Kubera. Vaiśravaṇa is also known as Kubera and Jambhala in Sanskrit and Kuvera in Pāli.Other names include:\n\ntraditional Chinese: 多聞天; simplified Chinese: 多闻天; pinyin: Duōwén Tiān; Japanese: 多聞天 (Tamonten); Korean: 다문천 (Damuncheon); Vietnamese: Đa Văn Thiên, a calque of Sanskrit Vaiśravaṇa\ntraditional Chinese: 毗沙門天; simplified Chinese: 毗沙门天; pinyin: Píshāmén Tiān; Japanese: 毘沙門天 (Bishamonten); Korean: 비사문천 (Bisamuncheon); Vietnamese: Tỳ Sa Môn Thiên. This was a loanword from Vaiśravaṇa into Middle Chinese with the addition of the word \"heaven, god\"\nTibetan: རྣམ་ཐོས་སྲས, Wylie: rnam thos sras, THL Namthöse, \"Prince All-Hearing\", a calque of Sanskrit Vaiśravaṇa\nMongolian: Баян Намсрай bajn namsrɛ is a loan from Tibetan thos sras, a short form of Tibetan rnam thos sras with the addition of an honorific\nThai: ท้าวกุเวร Thao Kuwen or ท้าวเวสสุวรรณ Thao Wetsuwan is an honorific plus the modern pronunciation of Pali Vessavaṇa.\n\n\n== Characteristics ==\nThe character of Vaiśravaṇa is founded upon the Hindu deity Kubera, but although the Buddhist and Hindu deities share some characteristics and epithets, each of them has different functions and associated myths.  Although brought into East Asia as a Buddhist deity, Vaiśravaṇa has become a character in folk religion and has acquired an identity that is partially independent of the Buddhist tradition (cf. the similar treatment of Guanyin and Yama).\nVaiśravaṇa is the guardian of the northern direction, and his home is in the northern quadrant of the topmost tier of the lower half of Sumeru. He is the leader of all the yakṣas who dwell on the Sumeru's slopes.\nHe is often portrayed with a yellow face. He carries an umbrella or parasol (chatra) as a symbol of his sovereignty.  He is also sometimes displayed with a mongoose, often shown ejecting jewels from its mouth. The mongoose is the enemy of the snake, a symbol of greed or hatred; the ejection of jewels represents generosity.\n\n\n== In Theravāda tradition ==\n\nIn the Pāli Canon of Theravāda Buddhism, Vaiśravaṇa is called Vessavaṇa. Vessavaṇa is one of the Cāturmahārājika deva or \"Four Great Heavenly Kings\", each of whom rules over a specific direction. Vessavaṇa's realm is the northern quadrant of the world, including the land of Uttarakuru.  According to some suttas, he takes his name from a region there called Visāṇa; he also has a city there called Ālakamandā which is a byword for wealth. Vessavaṇa governs the yakshas – beings with a nature between 'fairy' and 'ogre'.\nVessavaṇa's wife is named Bhuñjatī, and he has five daughters, Latā, Sajjā, Pavarā, Acchimatī, and Sutā.  He has a nephew called Puṇṇaka, a yakkha, husband of the nāga woman Irandatī.  He has a chariot called Nārīvāhana.  He is called gadāvudha (Sanskrit: gadāyudha) \"armed with a club\", but he only used it before he became a follower of the Buddha.\nVessavaṇa has the name \"Kuvera\" from a name he had from a past life as a rich Brahmin mill-owner from Sri Lanka, who gave all the produce of one of his seven mills to charity, and provided alms to the needy for 20,000 years. He was reborn in the Cātummahārājikā heaven as a result of this good karma.\nAs with all the Buddhist deities, Vessavaṇa is properly the name of an office (filled for life) rather than a permanent individual.  Each Vessavaṇa is mortal, and when he dies, he will be replaced by a new Vessavaṇa.  Like other beings of the Cātummahārājika world, his lifespan is 90,000 years (other sources say nine million years).  Vessavaṇa has the authority to grant the yakkhas particular areas (e.g., a lake) to protect, and these are usually assigned at the beginning of a Vessavaṇa's reign.\nWhen Gautama Buddha was born, Vessavaṇa became his follower, and eventually attained the stage of sotāpanna, one who has only seven more lives before enlightenment. He often brought the Buddha and his followers messages from the gods and other humans, and protected them.  He presented to the Buddha the Āṭānāṭā verses, which Buddhists meditating in the forest could use to ward off the attacks of wild yakkhas or other supernatural beings who do not have faith in the Buddha.  These verses are an early form of paritta chanting.\nBimbisāra, King of Magadha, after his death was reborn as a yakkha called Janavasabha in the retinue of Vessavaṇa.\nIn the early years of Buddhism, Vessavaṇa was worshipped at trees dedicated to him as shrines.  Some people appealed to him to grant them children.\n\n\n== In Japan ==\n\nIn Japan, Bishamonten (毘沙門天), or just Bishamon (毘沙門) is thought of as an armor-clad god of war or warriors and a punisher of evildoers.  Bishamon is portrayed holding a spear in one hand and a small pagoda in the other hand, the latter symbolizing the divine treasure house, whose contents he both guards and gives away.  In Japanese folklore, he is one of the Seven Lucky Gods.\nBishamon is also called Tamonten (多聞天 lit. \"listening to many teachings\") because he is seen as the guardian of the places where the Buddha preaches. He is believed to live halfway down Mount Sumeru.  He is also associated with Hachiman. Especially in the Shingon tradition that gives some place and worth to this hybrid character of Bishamon although most Mahayana temples have Bishamon and his counterpart as guardians at the entrance gate.\n\n\n== In Tibet ==\n\nIn Tibet, Vaiśravaṇa is considered a lokapāla or dharmapāla in the retinue of Ratnasambhava. He is also known as the King of the North.  As guardian of the north, he is often depicted on temple murals outside the main door.  He is also thought of as a god of wealth.  As such, Vaiśravaṇa is sometimes portrayed carrying a citron, the fruit of the jambhara tree, a pun on another name of his, Jambhala.  The fruit helps distinguish him iconically from depictions of Kuvera. He is sometimes represented as corpulent and covered with jewels. When shown seated, his right foot is generally pendant and supported by a lotus-flower on which is a conch shell. His mount is a snow lion. Tibetan Buddhists consider Jambhala's sentiment regarding wealth to be providing freedom by way of bestowing prosperity, so that one may focus on the path or spirituality rather than on the materiality and temporality of that wealth.\n\n\n== In Thailand ==\nIn Thailand, he resolves the dispute that arose in the legend of Nang Ai and Phadaeng.\n\n\n== In popular culture ==\nThe 2011 manga Noragami, which revolves around Japanese mythology, depicts this deity's Japanese iteration Bishamonten as a lady possessing similar traits and equipped with modern weapons.\n\n\n== See also ==\nBuddhism and violence\nFour Heavenly Kings\nIron Man, Tibetan sculpture of Vaiśravaṇa carved from a meteorite\nLi Jing\nPañcika, commander-in-chief, or general, of Vaiśravaṇa's Yakṣa army\nSeven Lucky Gods\nUesugi Kenshin\nVasudhara\n\n\n== References =="