"Madison Avenue is a north-south avenue in the borough of Manhattan in New York City, United States, that carries northbound one-way traffic. It runs from Madison Square (at 23rd Street) to meet the southbound Harlem River Drive at 142nd Street. In doing so, it passes through Midtown, the Upper East Side (including Carnegie Hill), East Harlem, and Harlem. It is named after and arises from Madison Square, which is itself named after James Madison, the fourth President of the United States.\nMadison Avenue was not part of the original Manhattan street grid established in the Commissioners' Plan of 1811, and was carved between Park Avenue (formerly Fourth) and Fifth Avenue in 1836, due to the effort of lawyer and real estate developer Samuel B. Ruggles, who had previously purchased and developed New York's Gramercy Park in 1831, and convinced the authorities to create Lexington Avenue and Irving Place between Fourth Avenue (now Park Avenue South) and Third Avenue in order to service it.\nThe street's name has been metonymous with the American advertising industry since the 1920s. Thus, the term \"Madison Avenue\" refers specifically to the agencies and methodology of advertising. \"Madison Avenue techniques\" refers, according to William Safire, to the \"gimmicky, slick use of the communications media to play on emotions.\"\n\n\n== Route ==\nMadison Avenue carries one-way traffic uptown (northbound) from East 23rd Street to East 135th Street, with the changeover from two-way traffic taking place on January 14, 1966, at which time Fifth Avenue was changed to one-way downtown (southbound). Between East 135th Street and East 142nd Street, Madison Avenue carries southbound traffic only and runs parallel to the Harlem River Drive.\nThere are numerous structures designated as New York City Landmarks (NYCL), National Historic Landmarks (NHL), and National Register of Historic Places (NRHP) on Madison Avenue. From south to north (in increasing address order), they include:\nMetropolitan Life Insurance Company Tower (NYCL, NHL, NRHP)\nAppellate Division Courthouse of New York State (NYCL, NRHP)\nNew York Life Building (NYCL, NHL, NRHP)\nHotel Seville (NYCL)\nEmmet Building (NYCL)\nColony Club (NYCL, NRHP)\nMadison Belmont Building (NYCL)\nB. Altman and Company Building (NYCL)\nChurch of the Incarnation, Episcopal (NYCL, NRHP)\nMorgan Library & Museum (NYCL, NHL, NRHP)\nJoseph Raphael De Lamar House (NYCL, NRHP)\n275 Madison Avenue (NYCL)\n400 Madison Avenue (NYCL)\nSt. Patrick's Cathedral (NYCL, NHL, NRHP)\nVillard Houses (NYCL, NRHP)\nLook Building (NYCL)\n550 Madison Avenue (NYCL)\nFuller Building (NYCL)\n45 East 66th Street (NYCL)\nGertrude Rhinelander Waldo House (NYCL, NRHP)\n1261 Madison Avenue (NYCL)\n1321 Madison Avenue (NYCL)\nSquadron A Armory (NYCL, NRHP)\nAll Saints Church (NYCL)\n\n\n== Role in advertising industry ==\nThe term \"Madison Avenue\" is often used metonymically to stand for the American advertising industry. Madison Avenue became identified with advertising after that sector's explosive growth in this area in the 1920s.According to \"The Emergence of Advertising in America\", by the year 1861, there were twenty advertising agencies in New York City; and the New York City Association of Advertising Agencies was founded in 1911, predating the establishment of the American Association of Advertising Agencies by several years.Among various depictions in popular culture, the portion of the advertising industry which centers on Madison Avenue serves as a backdrop for the AMC television drama Mad Men, which focuses on industry activities during the 1960s.In recent decades, many agencies have left Madison Avenue, with some moving further downtown and others moving west. The continued presence of large agencies in the city made New York the third-largest job market per capita in the U.S. in 2016, according to a study by marketing recruitment firm MarketPro. Today, several agencies are still located in the old business cluster on Madison Avenue, including StrawberryFrog, TBWA Worldwide, Organic, Inc., and DDB Worldwide. However, the term is still used to describe the agency business as a whole and large, New York–based agencies in particular.\n\n\n== Madison Square Park and Madison Square Garden ==\n\nMadison Square Park is a 6.2-acre (2.5-hectare) public park which runs along Madison Avenue from East 26th Street to East 23rd Street. It is bordered on the west by Fifth Avenue and Broadway as they cross. The park was named for James Madison, fourth President of the United States.Madison Square Garden took its name from the location of the first building of that name, located on the northeast corner of Madison Avenue at 26th Street, across from the Park. The first Garden was a former railroad terminal for the Park Avenue main line, which was converted into an open-air circus venue by P. T. Barnum in 1871 and was renamed \"Madison Square Garden\" in 1879. (The New York Life Insurance Building now occupies that entire city block.) The original Garden was demolished in 1889 and replaced by a new indoor arena designed by Stanford White that opened the following year. The second Garden had a bronze statue of the Roman goddess Diana on the tower of the sports arena. When it moved to a new building at 50th Street and Eighth Avenue in 1925 it kept its old name. Madison Square Garden is now located at Eighth Avenue between 31st and 33rd Street; however, it still retains the name.\n\n\n== Economy ==\nRetail brands with locations on Madison Avenue include: Burberry, Manrico Cashmere, Brooks Brothers, Alexander McQueen, Hermès, Tom Ford, Céline, Proenza Schouler, Lanvin, Valentino, Stuart Weitzman, Damiani, Emporio Armani, Prada, Chloé, Roberto Cavalli, Davidoff, Dolce & Gabbana, Gucci, Calvin Klein, Cartier, Christian Louboutin, La Perla, Jimmy Choo, Jacadi, Mulberry, Victoria's Secret, Barneys New York, Coach, Rolex, Giorgio Armani, Oliver Peoples, Vera Wang, Anne Fontaine, Baccarat, Carolina Herrera, Ralph Lauren and others.\n\n\n== Transportation ==\n\n\n=== Buses and bus lane ===\nMadison Avenue is served by the M1, M2, M3, M4 and Q32 local New York City Transit buses; the BM1, BM2, BM3, BM4, BM5, BxM3, BxM4, BxM6, BxM7, BxM8, BxM9, BxM10, BxM11, BxM18, QM21, SIM4C, SIM6, SIM8, SIM8X, SIM22, SIM25, SIM26, SIM30, SIM31, SIM33C, X27, X28, X37, X38, X63, X64 and X68 express New York City Transit buses; and the BxM4C express Bee Line bus. These buses use a double exclusive bus lane between 42nd and 59th Streets, which comprise the only exclusive bus lane along the avenue.Although no New York City Subway stations are named after Madison Avenue, the Fifth Avenue/53rd Street station on the E and ​M trains has an entrance on Madison Avenue.Pursuant to Section 4-12(m) of the New York City Traffic Rules, driving a vehicle other than a bus in the bus lane on Madison Avenue to turn right during the restricted hours specified by sign between 42nd Street and 59th Street is prohibited, then permitted at 60th Street, but a taxicab carrying a passenger may use the bus lane to turn right at 46th Street. Bikes are excluded from this prohibition.\n\n\n=== Overturned midtown bike ban ===\nIn July 1987, then-New York City Mayor Edward Koch proposed banning bicycling on Fifth, Park and Madison Avenues during weekdays, but many bicyclists protested and had the ban overturned. When the trial was started on Monday, August 24, 1987 for 90 days to ban bicyclists from these three avenues from 31st Street to 59th Street between 10 a.m. and 4 p.m. on weekdays, mopeds would not be banned.\n\n\n== References ==\n\n\n== External links ==\n\n Media related to Madison Avenue at Wikimedia Commons"