"Superheavy elements, also known as transactinide elements, transactinides, or super-heavy elements, are the chemical elements with atomic numbers greater than 103. The superheavy elements are immediately beyond the actinides in the periodic table; the heaviest actinide is lawrencium (atomic number 103). By definition, superheavy elements are also transuranic elements, i.e. having atomic numbers greater than that of uranium (92).\nGlenn T. Seaborg first proposed the actinide concept, which led to the acceptance of the actinide series. He also proposed a transactinide series ranging from element 104 to 121 and a superactinide series approximately spanning elements 122 to 153 (although more recent work suggests the end of the superactinide series to occur at element 157 instead). The transactinide seaborgium was named in his honor.Superheavy elements are radioactive and have only been obtained synthetically in laboratories. None of these elements have ever been collected in a macroscopic sample. Superheavy elements are all named after physicists and chemists or important locations involved in the synthesis of the elements.\nIUPAC defines an element to exist if its lifetime is longer than 10−14 seconds, which is the time it takes for the nucleus to form an electron cloud.The known superheavy elements form part of the 6d and 7p series in the periodic table. Except for rutherfordium and dubnium, even the longest-lasting isotopes of superheavy elements have short half-lives of minutes or less. The element naming controversy involved elements 102–109. Some of these elements thus used systematic names for many years after their discovery had been confirmed. (Usually the systematic names are replaced with permanent names proposed by the discoverers relatively shortly after a discovery has been confirmed.)\n\n\n== Introduction ==\n\n\n=== Synthesis of superheavy nuclei ===\n\nA superheavy atomic nucleus is created in a nuclear reaction that combines two other nuclei of unequal size into one; roughly, the more unequal the two nuclei in terms of mass, the greater the possibility that the two react. The material made of the heavier nuclei is made into a target, which is then bombarded by the beam of lighter nuclei. Two nuclei can only fuse into one if they approach each other closely enough; normally, nuclei (all positively charged) repel each other due to electrostatic repulsion. The strong interaction can overcome this repulsion but only within a very short distance from a nucleus; beam nuclei are thus greatly accelerated in order to make such repulsion insignificant compared to the velocity of the beam nucleus. The energy applied to the beam nuclei to accelerate them can cause them to reach speeds as high as one-tenth of the speed of light. However, if too much energy is applied, the beam nucleus can fall apart.Coming close enough alone is not enough for two nuclei to fuse: when two nuclei approach each other, they usually remain together for approximately 10−20 seconds and then part ways (not necessarily in the same composition as before the reaction) rather than form a single nucleus. This happens because during the attempted formation of a single nucleus, electrostatic repulsion tears apart the nucleus that is being formed. Each pair of a target and a beam is characterized by its cross section—the probability that fusion will occur if two nuclei approach one another expressed in terms of the transverse area that the incident particle must hit in order for the fusion to occur. This fusion may occur as a result of the quantum effect in which nuclei can tunnel through electrostatic repulsion. If the two nuclei can stay close for past that phase, multiple nuclear interactions result in redistribution of energy and an energy equilibrium.\nThe resulting merger is an excited state—termed a compound nucleus—and thus it is very unstable. To reach a more stable state, the temporary merger may fission without formation of a more stable nucleus. Alternatively, the compound nucleus may eject a few neutrons, which would carry away the excitation energy; if the latter is not sufficient for a neutron expulsion, the merger would produce a gamma ray. This happens in approximately 10−16 seconds after the initial nuclear collision and results in creation of a more stable nucleus. The definition by the IUPAC/IUPAP Joint Working Party (JWP) states that a chemical element can only be recognized as discovered if a nucleus of it has not decayed within 10−14 seconds. This value was chosen as an estimate of how long it takes a nucleus to acquire its outer electrons and thus display its chemical properties.\n\n\n=== Decay and detection ===\n\nThe beam passes through the target and reaches the next chamber, the separator; if a new nucleus is produced, it is carried with this beam. In the separator, the newly produced nucleus is separated from other nuclides (that of the original beam and any other reaction products) and transferred to a surface-barrier detector, which stops the nucleus. The exact location of the upcoming impact on the detector is marked; also marked are its energy and the time of the arrival. The transfer takes about 10−6 seconds; in order to be detected, the nucleus must survive this long. The nucleus is recorded again once its decay is registered, and the location, the energy, and the time of the decay are measured.Stability of a nucleus is provided by the strong interaction. However, its range is very short; as nuclei become larger, its influence on the outermost nucleons (protons and neutrons) weakens. At the same time, the nucleus is torn apart by electrostatic repulsion between protons, and its range is not limited. Total binding energy provided by the strong interaction increases linearly with the number of nucleons, whereas electrostatic repulsion increases with the square of the atomic number, i.e. the latter grows faster and becomes increasingly important for heavy and superheavy nuclei. Superheavy nuclei are thus theoretically predicted and have so far been observed to predominantly decay via decay modes that are caused by such repulsion: alpha decay and spontaneous fission. Almost all alpha emitters have over 210 nucleons, and the lightest nuclide primarily undergoing spontaneous fission has 238. In both decay modes, nuclei are inhibited from decaying by corresponding energy barriers for each mode, but they can be tunnelled through.\n\nAlpha particles are commonly produced in radioactive decays because mass of an alpha particle per nucleon is small enough to leave some energy for the alpha particle to be used as kinetic energy to leave the nucleus. Spontaneous fission is caused by electrostatic repulsion tearing the nucleus apart and produces various nuclei in different instances of identical nuclei fissioning. As the atomic number increases, spontaneous fission rapidly becomes more important: spontaneous fission partial half-lives decrease by 23 orders of magnitude from uranium (element 92) to nobelium (element 102), and by 30 orders of magnitude from thorium (element 90) to fermium (element 100). The earlier liquid drop model thus suggested that spontaneous fission would occur nearly instantly due to disappearance of the fission barrier for nuclei with about 280 nucleons. The later nuclear shell model suggested that nuclei with about 300 nucleons would form an island of stability in which nuclei will be more resistant to spontaneous fission and will primarily undergo alpha decay with longer half-lives. Subsequent discoveries suggested that the predicted island might be further than originally anticipated; they also showed that nuclei intermediate between the long-lived actinides and the predicted island are deformed, and gain additional stability from shell effects. Experiments on lighter superheavy nuclei, as well as those closer to the expected island, have shown greater than previously anticipated stability against spontaneous fission, showing the importance of shell effects on nuclei.Alpha decays are registered by the emitted alpha particles, and the decay products are easy to determine before the actual decay; if such a decay or a series of consecutive decays produces a known nucleus, the original product of a reaction can be easily determined. (That all decays within a decay chain were indeed related to each other is established by the location of these decays, which must be in the same place.) The known nucleus can be recognized by the specific characteristics of decay it undergoes such as decay energy (or more specifically, the kinetic energy of the emitted particle). Spontaneous fission, however, produces various nuclei as products, so the original nuclide cannot be determined from its daughters.The information available to physicists aiming to synthesize a superheavy element is thus the information collected at the detectors: location, energy, and time of arrival of a particle to the detector, and those of its decay. The physicists analyze this data and seek to conclude that it was indeed caused by a new element and could not have been caused by a different nuclide than the one claimed. Often, provided data is insufficient for a conclusion that a new element was definitely created and there is no other explanation for the observed effects; errors in interpreting data have been made.\n\n\n== History ==\n\n\n=== Early predictions ===\nThe heaviest element known at the end of the 19th century was uranium, with an atomic mass of approximately 240 (now known to be 238) amu. Accordingly, it was placed in the last row of the periodic table; this fueled speculation about the possible existence of elements heavier than uranium and why A = 240 seemed to be the limit. Following the discovery of the noble gases, beginning with that of argon in 1895, the possibility of heavier members of the group was considered. Danish chemist Julius Thomsen proposed in 1895 the existence of a sixth noble gas with Z = 86, A = 212 and a seventh with Z = 118, A = 292, the last closing a 32-element period containing thorium and uranium. In 1913, Swedish physicist Johannes Rydberg extended Thomsen's extrapolation of the periodic table to include even heavier elements with atomic numbers up to 460, but he did not believe that these superheavy elements existed or occurred in nature.In 1914, German physicist Richard Swinne proposed that elements heavier than uranium, such as those around Z = 108, could be found in cosmic rays. He suggested that these elements may not necessarily have decreasing half-lives with increasing atomic number, leading to speculation about the possibility of some longer-lived elements at Z = 98–102 and Z = 108–110 (though separated by short-lived elements). Swinne published these predictions in 1926, believing that such elements might exist in the Earth's core, in iron meteorites, or in the ice caps of Greenland where they had been locked up from their supposed cosmic origin.\n\n\n=== Discoveries ===\nWork performed from 1964 to 2013 at four laboratories – the Lawrence Berkeley National Laboratory in the US, the Joint Institute for Nuclear Research in the USSR (later Russia), the GSI Helmholtz Centre for Heavy Ion Research in Germany, and RIKEN in Japan – identified and confirmed the elements from rutherfordium to oganesson according to the criteria of the IUPAC–IUPAP Transfermium Working Groups and subsequent Joint Working Parties. These discoveries complete the seventh row of the periodic table. The remaining two transactinides, ununennium (element 119) and unbinilium (element 120), have not yet been synthesized. They would begin an eighth period.\n\n\n=== List of elements ===\n103 Lawrencium, Lr (formerly Lw) (named for Ernest Lawrence)\n104 Rutherfordium, Rf (for Ernest Rutherford)\n105 Dubnium, Db (for the town of Dubna, near Moscow)\n106 Seaborgium, Sg (for Glenn T. Seaborg)\n107 Bohrium, Bh (for Niels Bohr)\n108 Hassium, Hs (for Hassia, where Darmstadt is located)\n109 Meitnerium, Mt (for Lise Meitner)\n110 Darmstadtium, Ds (for Darmstadt)\n111 Roentgenium, Rg (for Wilhelm Conrad Röntgen)\n112 Copernicium, Cn (for Nikolaus Copernicus)\n113 Nihonium, Nh (for Nihon, Japan, where the RIKEN-Institute is located)\n114 Flerovium, Fl (for Russian physicist Georgy Flyorov)\n115 Moscovium, Mc (for Moscow)\n116 Livermorium, Lv (for Lawrence Livermore National Laboratory)\n117 Tennessine, Ts (for Tennessee, location of the Oak Ridge National Laboratory)\n118 Oganesson, Og (for physicist Yuri Oganessian)\n\n\n== Characteristics ==\nDue to their short half-lives (for example, the most stable known isotope of seaborgium has a half-life of 14 minutes, and half-lives decrease gradually going to the right of the group) and the low yield of the nuclear reactions that produce them, new methods have had to be created to determine their gas-phase and solution chemistry based on very small samples of a few atoms each. Relativistic effects become very important in this region of the periodic table, causing the filled 7s orbitals, empty 7p orbitals, and filling 6d orbitals to all contract inwards toward the atomic nucleus. This causes a relativistic stabilization of the 7s electrons and makes the 7p orbitals accessible in low excitation states.Elements 103 to 112, lawrencium through copernicium, may be taken to form the 6d series of transition elements. Experimental evidence shows that elements 103–108 behave as expected for their position in the periodic table, as heavier homologues of lutetium through osmium. They are expected to have ionic radii between those of their 5d transition metal homologs and their actinide pseudohomologs: for example, Rf4+ is calculated to have ionic radius 76 pm, between the values for Hf4+ (71 pm) and Th4+ (94 pm). Their ions should also be less polarizable than those of their 5d homologs. Relativistic effects are expected to reach a maximum at the end of this series, at roentgenium (element 111) and copernicium (element 112). Nevertheless, many important properties of the transactinides are still not yet known experimentally, though theoretical calculations have been performed.Elements 113 to 118, nihonium through oganesson, should form a 7p series, completing the seventh period in the periodic table. Their chemistry will be greatly influenced by the very strong relativistic stabilization of the 7s electrons and a strong spin-orbit coupling effect \"tearing\" the 7p subshell apart into two sections, one more stabilized (7p1/2, holding two electrons) and one more destabilized (7p3/2, holding four electrons). Additionally, the 6d electrons are still destabilized in this region and hence may be able to contribute some transition metal character to the first few 7p elements. Lower oxidation states should be stabilized here, continuing group trends, as both the 7s and 7p1/2 electrons exhibit the inert pair effect. These elements are expected to largely continue to follow group trends, though with relativistic effects playing an increasingly larger role. In particular, the large 7p splitting results in an effective shell closure at flerovium (element 114) and a hence much higher than expected chemical activity for oganesson (element 118).Element 118 is the last element that has been synthesized. The next two elements, elements 119 and 120, should form an 8s series and be an alkali and alkaline earth metal respectively. The 8s electrons are expected to be relativistically stabilized, so that the trend towards higher reactivity down these groups will reverse direction and the elements will behave more like their period 5 homologs, rubidium and strontium. Nevertheless, the 7p3/2 orbital is still relativistically destabilized, potentially giving these elements larger ionic radii and perhaps even being able to participate chemically. In this region, the 8p electrons are also relativistically stabilized, resulting in a ground-state 8s28p1 valence electron configuration for element 121. Large changes are expected to occur in the subshell structure in going from element 120 to element 121: for example, the radius of the 5g orbitals should drop drastically, from 25 Bohr units in element 120 in the excited [Og] 5g1 8s1 configuration to 0.8 Bohr units in element 121 in the excited [Og] 5g1 7d1 8s1 configuration, in a phenomenon called \"radial collapse\". Element 122 should add either a further 7d or a further 8p electron to element 121's electron configuration. Elements 121 and 122 should be similar to actinium and thorium, respectively.At element 121, the superactinide series is expected to begin, when the 8s electrons and the filling 8p1/2, 7d3/2, 6f5/2, and 5g7/2 subshells determine the chemistry of these elements. Complete and accurate calculations are not available for elements beyond 123 because of the extreme complexity of the situation: the 5g, 6f, and 7d orbitals should have about the same energy level, and in the region of element 160 the 9s, 8p3/2, and 9p1/2 orbitals should also be about equal in energy. This will cause the electron shells to mix so that the block concept no longer applies very well, and will also result in novel chemical properties that will make positioning these elements in a periodic table very difficult; element 164 is expected to mix characteristics of the elements of group 10, 12, and 18.\n\n\n== Superheavy elements ==\nIt has been suggested that elements beyond Z = 126 be called beyond superheavy elements.\n\n\n== See also ==\nBose–Einstein condensate (also known as Superatom)\n\n\n== Notes ==\n\n\n== References ==\n\n\n=== Bibliography ===\nAudi, G.; Kondev, F. G.; Wang, M.;  et al. (2017). \"The NUBASE2016 evaluation of nuclear properties\". Chinese Physics C. 41 (3). 030001. Bibcode:2017ChPhC..41c0001A. doi:10.1088/1674-1137/41/3/030001.     pp. 030001-1–030001-17, pp. 030001-18–030001-138, Table I. The NUBASE2016 table of nuclear and decay properties\nBeiser, A. (2003). Concepts of modern physics (6th ed.). McGraw-Hill. ISBN 978-0-07-244848-1. OCLC 48965418.\nHoffman, D. C.; Ghiorso, A.; Seaborg, G. T. (2000). The Transuranium People: The Inside Story. World Scientific. ISBN 978-1-78-326244-1.\nKragh, H. (2018). From Transuranic to Superheavy Elements: A Story of Dispute and Creation. Springer. ISBN 978-3-319-75813-8.\nZagrebaev, V.; Karpov, A.; Greiner, W. (2013). \"Future of superheavy element research: Which nuclei could be synthesized within the next few years?\". Journal of Physics: Conference Series. 420. 012001. doi:10.1088/1742-6596/420/1/012001. ISSN 1742-6588."