"The lap steel guitar, also known as a Hawaiian guitar, is a type of steel guitar without pedals that is typically played with the instrument in a horizontal position across the performer's lap. Unlike the normal manner of playing a traditional acoustic guitar, in which the performer's fingertips press the strings against frets, the pitch of a lap steel guitar is changed by pressing a polished steel bar against plucked strings (from which the name \"steel guitar\" derives). Though the instrument does not have frets, it displays markers that resemble them. Lap steels may differ markedly from one another in external appearance, depending on whether they are acoustic or electric, but in either case, do not have pedals, distinguishing them from pedal steel guitar.\nThe steel guitar was the first \"foreign\" musical instrument to gain a foothold in American pop music. It originated in the Hawaiian Islands about 1885, popularized by an Oahu youth named Joseph Kekuku, who became known for playing a traditional guitar by laying it across his lap and sliding a piece of metal against the strings to change the pitch. The instrument's distinctive portamento sound, characterized by a smooth gliding between notes, became popular throughout the islands. American popular culture became fascinated with Hawaiian music during the first half of the twentieth century – to the degree of becoming a musical fad. Americans were curious about the lap steel instrument featured in its performance, and came to refer to it as a \"Hawaiian guitar\", and the horizontal playing position as \"Hawaiian style\". Hawaiian music began its assimilation into American popular music in the 1910s, but with English lyrics; a combination Hawaiians called hapa haole (half-white). In the 1930s, the invention of electric amplification for the lap steel was a milestone in its evolution. It meant that the instrument could be heard equally with other instruments, that it no longer needed a resonance chamber to produce its sound, and that electrified lap steels could be manufactured in any shape (even a rectangular block), with little or no resemblance to a traditional guitar.\nIn the early twentieth century Hawaiian music and the steel guitar began to meld into other musical styles, including blues, jazz, gospel, country music and, particularly, the country music sub-genres, Western swing, honky-tonk, and bluegrass. Lap steel pioneers include Sol Hoopii, Bob Dunn, Jerry Byrd, Don Helms, Bud Isaacs, Leon McAuliffe, Josh Graves, Pete Kirby, and Darick Campbell.\nConceptually, a lap steel guitar may be likened to playing a guitar with one finger (the bar). This abstraction illustrates one of the instrument's major limitations: its constraint to a single chord that is not changeable during a performance without re-tuning the instrument. An early solution was to build lap steel guitars with two or more necks, each providing a separate set of differently-tuned strings on a single instrument. The performer's hands could move to a different neck at will. Although in the early 1940s, elite players recorded and performed with these multi-neck guitars, most musicians could not afford them. The problem was addressed in 1940 by adding pedals to the lap steel to change the pitch of certain strings easily, making more complex chords available on the same neck. By 1952, this invention revolutionized how the instrument was played, in many ways making it virtually a new instrument, known as a \"pedal steel\". An overwhelming majority of lap steel players adopted the pedal design, and, as a result, the lap steel became largely obsolete by the late 1950s, with only pockets of devotees in country and Hawaiian music remaining.\n\n\n== Early history ==\n\nSpanish guitars were introduced into the Hawaiian Islands as early as the 1830s. The Hawaiians did not embrace the standard guitar tuning that had been in use for centuries. They re-tuned the guitars to make a chord when all the strings were sounded together, known as an \"open tuning\". This was called \"slack-key\", known in Hawaiian as \"kī hōʻalu\", because certain strings were \"slackened\" to achieve it. Hawaiians learned to play fingerstyle this way, creating melodies over the full resonant tones of the open strings, and the genre became known as slack-key guitar. About 1885, after guitar strings made of steel became available, Joseph Kekuku, on the island of Oahu developed and popularized playing an open tuning while seated with the guitar across his knees while pressing a steel bar against the strings. Following Kekuku's lead, other Hawaiians began playing in this new manner, with the guitar laid across the lap, instead of in the traditional way of  holding the instrument against the body. Once the horizontal style became popular throughout the islands, the technique  spread internationally, and was referred to (typically outside of Hawaii) as \"Hawaiian style\".Hawaiian music, with the sound of the steel guitar as a marked featured of it, became a popular musical preoccupation or fad in the United States in the first half of the twentieth century. In 1916, recordings of indigenous Hawaiian music outsold all other U.S. musical genres. This popularity initiated the manufacture of guitars designed specifically to be played horizontally. The archetypal lap steel guitar is the acoustic Hawaiian guitar. Despite incorporating a resonant chamber in their body, these early acoustic versions of the instrument were not loud enough relative to other instruments. However, in the early 1930s a steel guitarist named George Beauchamp invented the electric guitar pickup. Electrification not only allowed the lap steel guitar to be heard better, but it also meant that their resonance chambers were no longer essential, or even required. The result was that steel guitars could be manufactured in any shape – even in the form of a rectangular block bearing little or no resemblance to the traditional guitar shape. This led to table-like instruments in a metal frame on legs called \"console steels\".\n\n\n== Types of lap steel guitars ==\nThere are three categories of lap steel guitars:\n\nAcoustic lap steel guitars: These are traditional acoustic steel-string acoustic guitars modified to be played on the performer's lap. The modification is to raise the strings higher off the fingerboard than a traditional guitar, which can be done by inserting an adapter on the instrument's bridge and its nut. This prevents the steel bar from hitting against the frets.Dobro-type guitars or National guitars: These are typically acoustic steel guitars with a large aluminum cone under the bridge, called a resonator, that increases volume output. Wood-body resonator guitars are called \"Dobros\" and steel bodied ones are called \"Nationals\". The types do not sound the same — the Nationals are brassier and are usually preferred by blues players. Either type offers round necks (Spanish) or square necks (Hawaiian). Square necks are sometimes necessitated both by the use of thicker strings and by the increased force the instrument is subject to as a consequence of its raised strings.\nElectric lap steel guitars: Describes instruments that are specifically designed to be played horizontally and feature an electric pickup so that they do not require any resonance chamber. Guitars in this category may differ markedly from one another in external appearance, and include instruments made from rectangular solid blocks of wood. Some may be small enough to be played on the lap; others may have more than one neck (making the instrument heavier), and may be built on a frame with legs, which is then known as a console steel.\n\n\n== Tunings ==\nOver centuries in Western countries, the traditional Spanish guitar developed a near-universal tuning of ascending fourths (and one major third) consisting of E–A–D–G–B–E; however, no such standard existed for the Hawaiian \"open tunings\" (guitar tuned in a chord). The Hawaiians simply tuned to a chord that suited the singer's voice. Beginning in the days of slack-key guitar in the 1850s, Hawaiian tunings came to be as closely guarded as any trade secret, handed down in families. Many players de-tuned their instruments when they were not playing them to keep others from discovering their tuning.The tuning chosen for these instruments is a crucial foundation on which steel guitar style is built. The tuning used determines the notes that the player has available in a chord, and affects how notes can be played in sequence. Experimenting with different tunings was a widespread practice of the Hawaiian music of the 1930s and provided templates that became a foundation for the playing style of later musicians. Scores of tunings are available for lap steel players. The addition of a sixth interval into a tuning had a dramatic effect on the steel guitar because it created numerous positions and playing pockets which were not accessible in a simple major chord. The C6 was a common tuning for six string lap steels in the 1920s and 1930s. Tunings with a sixth interval are popular in Western swing and jazz, while tunings containing sevenths are often chosen for blues and rock music.A fundamental challenge of lap steel guitar design is the inherent constraint it places on the number of chords and inversions available in any given tuning. To address the meagre array available to them, some early players would simply have a second lap steel at hand, with a different tuning, ready when needed. The later attempted remedy was to increase the number of strings on the instrument (the more strings available, the smaller the pitch intervals between them, and therefore more notes available when the bar is placed straight across the strings). A third strategy was to add additional necks to the same instrument, thus providing separate sets of strings that could each be tuned differently.\n\n\n== The Hawaiian \"craze\" in the United States ==\nIn the U.S. Mainland in the early 20th century, after the 1898 annexation of Hawaii, the Hawaiian \"craze\" was in full force, as evidenced by radio broadcasts, stage shows, and motion pictures featuring Hawaiian music. Hollywood films perpetuated the musical image of an idealized island lifestyle. Hawaiian guitars and lessons for youth were widely available. For example, the Oahu Music Company sold their Oahu-brand guitars and lessons to young people by door-to-door sales, canvassing nearly every city in the United States.The steel guitar was the first \"foreign\" musical instrument to gain a foothold in American pop music. Pioneer lap steel players between 1915 and 1930 included Sol K. Bright Sr., Tau Moe, Dick McIntire, Sam Ku West and Frank Ferera. Ferera was the most-recorded of any lap-style guitarists in that time period. Hawaiian music began to meld into American popular music in the 1910s – a combination Hawaiians called hapa haole (half-white) – which was essentially Hawaiian music, sung in English, intended for white audiences. As an example, Honolulu-born Dick McIntire and his Harmony Hawaiians recorded Hawaiian songs sung by American pop crooner Bing Crosby in 1936. Tin Pan Alley obliged the demand for Hawaiian songs by publishing a large supply of hapa haole music. Many amateur and professional musicians throughout America formed Hawaiian combos in the 1930s and 1940s. The introduction of electrified guitars in the 1930s had a profound effect, boosting commercial Hawaiian music.\n\n\n== Lap steel pioneers ==\nIn the development of lap steel guitar in the early twentieth century, many innovators contributed; among the most prominent were:\n\nSol Hoopii (pronounced Ho-OH-pee-EE) was perhaps the most famous Hawaiian musician whose work spread the sound of instrumental lap steel play worldwide. He was the first steel guitarist to combine Hawaiian music with American jazz. Born in Honolulu in 1902, Hoopii was a gifted talent on lap steel from an early age. When he was a teenager, he stowed away on a Matson liner on its journey from Hawaii to San Francisco. After his arrival in California, he formed a trio and became well known in clubs, theaters, movie appearances and recordings from 1925 to 1950. He combined Hawaiian music with the jazz he heard from clarinet and horn players. He was a trendsetter in his use of the metal-bodied National Tricone guitar and, later, the Rickenbacker Bakelite (see photo above) and Dickerson electric steels.Bob Dunn was the first steel guitarist of renown playing Western swing. Born in 1908 in Fort Gibson, Oklahoma, he quit school in the eighth grade to join traveling musical troupes. Considered a musical revolutionary, according to music writer Michael Ross, Bob Dunn played the first electrified instrument of any type on a commercial recording. It was a Western swing tune released in 1935, performed by Dunn in collaboration with \"Milton Brown and his Musical Brownies.\" The guitar he played was a Rickenbacker A22, nicknamed the \"Frying Pan\". Formerly a trombone player, Dunn's guitar playing introduced horn-like solos, with the staccato phrasing of jazz players, and, according to historian Andy Volk, was of indelible influence on subsequent generations of steel players.\nJerry Byrd was born in Lima, Ohio, in 1920. He is credited with developing the C6 tuning that became the standard of C6 pedal steels. Using tunings with sixths and ninths became common and identifiable with the steel guitar sound. In a career divided between Hawaiian and country music, Byrd helped lay the foundation for the Nashville steel guitar sound. In a 1973 interview on Canada's CBC radio, Byrd said, \"I listened to the Hawaiians because they were really the only ones playing the steel guitar at that time.\" With Hank Williams, Byrd recorded songs like I'm So Lonesome I Could Cry, Lovesick Blues and A Mansion on the Hill. Byrd also recorded with Marty Robbins, Hank Snow, Ernest Tubb and others. After his Nashville career, Byrd made Hawaii his permanent home.\n\n\n== Western Swing ==\n\nIn the early 1930s, the newly electrified lap steel guitar took a prominent position in a type of dance music known as \"Western swing\", a form of jazz swing that combined elements of country music and Hawaiian music. Pioneers of the genre include bandleaders Milton Brown and Bob Wills. Wills in turn hired and nurtured innovative players, who subsequently influenced the genre, including Leon McAuliffe, Noel Boggs, and Herb Remington.\nIn October, 1936, Bob Wills and his Texas Playboys and McAuliffe, performing with a Rickenbacker B–6 lap steel, recorded the remarkably well selling record, \"Steel Guitar Rag\". Due to the need to have different chords or voicings available, the design of the lap steel and the way it was played underwent continual change as the style evolved. McAuliffe had two Rickenbackers, each tuned differently.  The instrument's constraints caused leading steel guitarists to add additional necks with different tunings on the same instrument. Lap steels were the first multi-neck electric instruments. The added size and weight meant that the instrument could no longer be reasonably supported on the player's lap and required placement in a frame with legs known as a \"console\" steel guitar, that is still ostensibly a lap steel. Prominent players of that era, including Herb Remington and Noel Boggs, accommodated by instrument maker Leo Fender, eventually played instruments with four different necks.\n\n\n== Honky-tonk ==\nBy the late 1940s, the steel guitar featured prominently in the emerging \"honky-tonk\" style of country music, developed in Texas and Oklahoma bars and dance halls (called honky-tonks). The style features a simple two-beat sound with a prominent backbeat. Honky-tonk singers who used a lap steel guitar in their musical arrangements included Hank Williams, Lefty Frizzell and Webb Pierce.\nDon Helms (1927–2008), born in New Brockton, Alabama, played a double-neck Gibson lap steel using an E6 and a B11 tuning on recordings by all three of these artists, as well as on more than 100 Hank Williams songs, including Your Cheating Heart, I Can't Help It (If I'm Still in Love with You) and Cold, Cold Heart. Helms' playing style helped move country music away from the hillbilly string-band sound popular in the 1930s and toward the more modern electric style that took over in the 1940s. His guitar intros, leads, and fills have been widely imitated for 50 years. Other classic country recordings featuring Helms' work were \"Walkin' After Midnight\" (Patsy Cline) and \"Blue Kentucky Girl\" (Loretta Lynn). Many recordings of that era (1950s) were made using a steel guitar tuning in a sixth chord, often a C6, which is sometimes called a \"Texas tuning\".\n\n\n== Dobro ==\n\nThe Dobro or resonator guitar is a uniquely American lap steel guitar with a resonator cone designed to make a guitar louder. It was patented by the Dopyera brothers in 1927, but the name \"Dobro\", a portmanteau of DOpyera and BROthers, became a generic term for this type of guitar. The dobro never became popular with blues players, who generally prefer the National guitar, which has a similar resonator design but uses a metal body. In the opinion of music writer Richard Carlin, the dobro probably would have disappeared from the musical scene had it not been for two influential players: Pete Kirby and Uncle Josh Graves (Buck Graves).Beecher \"Pete\" Kirby (1911–1992), known as Bashful Brother Oswald, was born is Sevierville, Tennessee. As a member of Roy Acuff's \"Smoky Mountain Boys\", in 1939 his dobro playing on the Grand Ole Opry helped define country music in its formative years. Kirby introduced the instrument to a nationwide radio audience. He played a Dobro Model 27, and sometimes a steel-bodied National guitar. He was known to perform a comedy act dressed as a yokel, wearing  a wide-brim slouch hat and overalls. His dobro attracted interest and fascination; he said, \"People couldn't understand how I played it and what it was, and they'd always want to come around and look at it.\" He stayed with Acuff for 53 years.Buck \"Josh\" Graves (aka \"Uncle Josh Graves\"), born in 1927, played dobro in the pioneering Bluegrass band \"Flatt and Scruggs\" in 1955. Graves played a role in establishing dobro as a common fixture in a bluegrass band. He honed a style that elevated his dobro skills to rival the prowess of his bandmates. To do so, he abandoned Hawaiian stylings and adopted hammer-on and pull-off notes to combine open strings with fretted notes rapidly; additionally, he adopted a three-finger picking style taught to him by Earl Scruggs. Dozens of other bluegrass groups added a dobro after hearing Graves' lightning-fast solos that fit into the bluegrass instrumental style. He took lap steel guitar to a new level, able to complement the banjo, fiddle, and mandolin.Dobro fell out of favor in mainstream country music until a bluegrass revival in the 1970s brought it back with younger virtuoso players like Jerry Douglas, whose Dobro skills became widely known and emulated.\n\n\n== Sacred steel ==\nThis gospel music tradition, now called \"sacred steel\", began in the 1930s church services in the \"House of God\", a small African-American denomination where the steel guitar emerged as an alternative to the church organ. Darick Campbell (1966–2020) was a lap steel player for the gospel band, The Campbell Brothers, who took the musical tradition from Pentecostal churches to international fame. Campbell played a traditional Hawaiian lap steel: a Fender Stringmaster 8-string (Fender Deluxe-8). He regulated the volume up on top of the guitar with his hand as he played and used a wah pedal. Born in Rochester, New York, Campbell was a master at mimicking the human singing voice with his guitar. He said, \"My method is to always think of my guitar as a voice\". Campbell played many music festivals, but his renown in rock and jazz circles was not well-received by church leaders. The Campbell Brothers parted ways acrimoniously with the Nashville-based House of God Church, Keith Dominion, because the Pentecostal church wanted to keep the band's music within the church walls. Campbell recorded with The Allman Brothers and Medeski Martin and Wood.\n\n\n== Lap slide guitar ==\n\nLap slide guitar is not a specific instrument, but a style of playing lap steel that is typically heard in blues or rock music. Players of these genres typically use the term \"slide\" instead of \"steel\";  they sometimes play the style with a flat pick or with fingers instead of finger picks. Pioneers in lap slide include Buddy Woods, \"Black Ace\" Turner (who used a small medicine bottle as a slide), and Freddie Roulette. Turner played a National Style 2 squareneck Tricone guitar on his lap.Another blues guitar playing style is called \"slide guitar\", a hybrid between steel guitar and conventional guitar. In 1923, Sylvester Weaver, was the first to record this style. It is played with a conventional guitar held flat against the body, fretting the bass strings in the usual way (for rhythm accompaniment), while using a tubular slide (or the neck of a bottle) placed on a finger of the same hand to slide against the treble strings. In the 1940s, blues players like Robert Nighthawk and Earl Hooker popularized electric slide guitar this way, using a traditional guitar in standard tuning. The term \"bottleneck\" was historically used to describe this type of playing. Early blues players used open tunings, but most modern slide players use both standard and open.\n\n\n== Lap steel obsolescence ==\nThe expense of building multiple necks on each guitar made lap steels unaffordable for most players and a more sophisticated solution was needed. Many inventors sought a mechanical linkage to change the pitch of strings on the steel guitar. Gibson introduced a pedal steel guitar as early as 1940, but it never caught on. About 1946, Paul Bigsby created a new design for the pedal action, greatly improving it. Bigsby, working alone in his shop, made guitars for leading players of the day, including Joaquin Murphey and Speedy West. Nashville guitarist Bud Isaacs received one of Bigsby's two-pedal guitars in 1952. It was a wooden double–eight string model. Isaacs experimented with the new pedals in an E9 tuning, trying to imitate the sound of two fiddles playing in harmony. In doing so, he came upon something new – he innovated pushing the pedal while the strings were still sounding. This practice had been strictly avoided by other players of the era, because it was considered poor technique and \"un-Hawaiian\". Isaacs' intent was to use the pedal mechanism itself as a feature of the music. The technique created a triad chord, where two lower notes bend up in glissando counterpoint from below, to harmonize with a third note on top that remains unchanged. The pedal facilitated the move in perfect synchronization and pitch, which was consistent and reliable.Isaacs tried it in a 1953 recording session on a Webb Pierce song called \"Slowly\". The song became one of the most-played country songs of 1954 and was No. 1 on the Billboard's country charts for seventeen weeks. Isaacs' guitar became the first pedal steel guitar on a hit record. More importantly, the sound was immediately recognized by lap steel (non-pedal) guitarists as something both unique and  impossible to produce on a non-pedal lap steel. Dozens of instrumentalists rushed to get pedals on their steel guitars to imitate the unique bending notes they heard in Isaacs' play. In the months and years after this recording, instrument makers and musicians worked to duplicate the innovations of Bigsby and Isaacs. Even though the instrument had been available for over a decade before this recording, the pedal steel guitar emerged as a crucial element in country music after the success of this song. The pedals allowed playing more complex and versatile music than it was possible on lap steel.The pedal steel design was adopted by an overwhelming majority of lap steel players in the early 1950s. The resulting new and distinctive style of playing became a defining characteristic of the country music coming out of Nashville for decades thereafter. In accordance, the non-pedal lap steel became largely obsolete, with only pockets of devotees remaining in country and Hawaiian music.Jimmy Day was an example of an established lap player who was able to make a successful switch to pedals in mid-career. Other prominent lap steel players—including Noel Boggs, Jerry Byrd and Joaquin Murphey—refused to switch. According to music historian Rich Kienzle, this decision hindered Boggs' later career. Speaking about the pedal steel in a 1972 interview, Jerry Byrd said: \"Mechanically, there were a lot of bugs, you couldn't keep them in tune, and that drove me crazy\" ... So I decided to stay with what I had and keep my identity and ride it out... I never made the change-over.\" Joaquin Murphey stayed with the non-pedal lap steel long after his contemporaries had switched over, and with his C6 tuning. He felt that the Nashville-standard E9 was, in his words, a \"gimmick\". He stated in a 1995 interview, \"I can't do all that fancy Nashville stuff and I hate it anyhow\".\n\n\n== See also ==\nSteel guitar\nPedal steel guitar–(Contains a sample of the song \"Slowly\")\nSlack-key guitar\nSlide guitar\n\n\n== Notes ==\n\n\n== References ==\n\n\n== External links ==\nHawaiian Steel Guitar Association – An organization which promotes the development of lap steel guitar with worldwide membership."