"The lap steel guitar, also known as a Hawaiian guitar, is a type of steel guitar without pedals that is typically played with the instrument in a horizontal position across the performer's lap. Unlike the normal manner of playing a traditional acoustic guitar, in which the performer's fingertips press the strings against frets, the pitch of a lap steel guitar is changed by pressing a polished steel bar against plucked strings (from which the name \"steel guitar\" derives). Though the instrument does not have frets, it displays markers that resemble them. Lap steels may differ markedly from one another in external appearance, depending on whether they are acoustic or electric, but in either case, do not have pedals, distinguishing them from pedal steel guitar.\nThe steel guitar was the first \"foreign\" musical instrument to gain a foothold in American pop music. It originated in the Hawaiian Islands about 1885, popularized by an Oahu youth named Joseph Kekuku, who became known for playing a traditional guitar by laying it across his lap and sliding a piece of metal against the strings to change the pitch. The instrument's distinctive portamento sound, characterized by a smooth gliding between notes, became popular throughout the islands. American popular culture became fascinated with Hawaiian music during the first half of the twentieth century – to the degree of becoming a musical fad. Americans were curious about the lap steel instrument featured in its performance, and came to refer to it as a \"Hawaiian guitar\", and the horizontal playing position as \"Hawaiian style\". Hawaiian music began its assimilation into American popular music in the 1910s, but with English lyrics; a combination Hawaiians called hapa haole (half-white). In the 1930s, the invention of electric amplification for the lap steel was a milestone in its evolution. It meant that the instrument could be heard equally with other instruments, that it no longer needed a resonance chamber to produce its sound, and that electrified lap steels could be manufactured in any shape (even a rectangular block), with little or no resemblance to a traditional guitar.\nIn the early twentieth century Hawaiian music and the steel guitar began to meld into other musical styles, including blues, jazz, gospel, country music and, particularly, the country music sub-genres, Western swing, honky-tonk, and bluegrass. Lap steel pioneers include Sol Hoopii, Bob Dunn, Jerry Byrd, Don Helms, Bud Isaacs, Leon McAuliffe, Josh Graves, Pete Kirby, and Darick Campbell.\nConceptually, a lap steel guitar may be likened to playing a guitar with one finger (the bar). This abstraction illustrates one of the instrument's major limitations: its constraint to a single chord that is not changeable during a performance without re-tuning the instrument. An early solution was to build lap steel guitars with two or more necks, each providing a separate set of differently-tuned strings on a single instrument. The performer's hands could move to a different neck at will. Although in the early 1940s, elite players recorded and performed with these multi-neck guitars, most musicians could not afford them. The problem was addressed in 1940 by adding pedals to the lap steel to change the pitch of certain strings easily, making more complex chords available on the same neck. By 1952, this invention revolutionized how the instrument was played, in many ways making it virtually a new instrument, known as a \"pedal steel\". An overwhelming majority of lap steel players adopted the pedal design, and, as a result, the lap steel became largely obsolete by the late 1950s, with only pockets of devotees in country and Hawaiian music remaining."