"Ronald Leslie Numbers (born 1942) is an American historian of science.  He was awarded the 2008 George Sarton Medal by the History of Science Society for \"a lifetime of exceptional scholarly achievement by a distinguished scholar\".\n\n\n== Biography ==\nNumbers is the son of a fundamentalist Seventh-day Adventist preacher, and was raised in the Seventh-day Adventist religion and schools well into college. Regarding religious beliefs, he describes himself as agnostic, and has written, \"I no longer believe in creationism of any kind\". He became a leading scholar in the history of science and religion and an authority on the history of creationism and creation science.\nNumbers received his Ph.D. in history of science from University of California, Berkeley in 1969. Currently he is Hilldale and William Coleman Professor of the History of Science and Medicine at the University of Wisconsin–Madison. From 1989 to 1993 he was editor of Isis, an international journal of the history of science. With David Lindberg, he has co-edited two anthologies on the relationship between religion and science. Also with Lindberg, he is currently editing the eight-volume Cambridge History of Science.\n\n\n== Writings ==\n\n\n=== Prophetess of Health ===\nIn 1976, while still a lecturer at Loma Linda University, he published the book Prophetess of Health. The book is about the relationship between Seventh-day Adventist Church co-founder and prophetess Ellen G. White and popular ideas about health that were fashionable in certain circles in America just prior to the time during which she wrote her books.\n\n\n=== The Creationists ===\nIn 1992, he published The Creationists: The Evolution of Scientific Creationism, a history of the origins of anti-evolutionism. It was revised and expanded in 2006, with the subtitle changed to From Scientific Creationism to Intelligent Design. The book has been described as \"probably the most definitive history of anti-evolutionism\". It has received generally favorable reviews from both the academic and the religious community. Former archbishop of York John Habgood described it, in an article in The Times, as a \"massively well-documented history\" that \"must surely be the definitive study of the rise and growth of\" creationism.\n\n\n=== Galileo Goes to Jail and Other Myths About Science and Religion ===\nIn 2009, he was editor for Galileo Goes to Jail and Other Myths About Science and Religion, where the book focuses on popular misconceptions that are connected between science and religion.Among other things the work seeks to debunk various claims, such as that the medieval Christian Church suppressed science, that medieval Islamic culture was inhospitable to science, that the Church issued a universal ban on human dissection in the Middle Ages, that Galileo Galilei was imprisoned and tortured for advocating Copernicanism, or that the idea of creationism is a uniquely American phenomenon.\n\n\n== Bibliography ==\nThe Warfare Between Science and Religion: The Idea That Wouldn't Die, (Baltimore, MD: Johns Hopkins University Press, 2018) (ed. with Jeff Hardin, Ronald A. Binzley). ISBN 978-1421426181\nScience and Religion Around the World, (New York: Oxford University Press, 2011) (ed. with John Hedley Brooke). ISBN 978-0-195-32819-6\n\"Wrestling with Nature: From Omens to Science\", (Chicago: University of Chicago Press, 2011) (ed.with Peter Harrison and Michael H. Shank). ISBN 9780226317816\nGalileo Goes to Jail, and Other Myths About Science and Religion (ed.) (Cambridge, Massachusetts: Harvard University Press, 2009).  ISBN 0-674-03327-2\nProphetess of Health: A Study of Ellen G. White, 3rd Ed. (Grand Rapids: Eerdmans Publishing, 2008).\nScience and Christianity in Pulpit and Pew, (New York: Oxford University Press, 2007).\nThe Creationists: From Scientific Creationism to Intelligent Design, (Cambridge, Massachusetts: Harvard University Press, 2006), - expanded version of The Creationists, (New York: Alfred A. Knopf, 1992. Reprinted by University of California Press, 1993.)  ISBN 978-0-674-02339-0\nWhen Science and Christianity Meet, (Chicago: University of Chicago Press, 2003). ed. with David C. Lindberg\nDisseminating Darwinism: The Role of Place, Race, Religion, and Gender, (Cambridge: Cambridge University Press, 1999), ed. with John Stenhouse.\nDarwinism Comes to America. (Cambridge, Massachusetts: Harvard University Press, 1998).\nGod and Nature: Historical Essays on the Encounter Between Christianity and Science, (Berkeley: University of California Press, 1986) ed. with David C. Lindberg.  ISBN 978-0-520-05538-4\n\n\n== References ==\n\n\n== External links ==\nPBS Evolution articles\nInterview with Science & Theology News\nBrief treatise on the history of creationism\nInterview in Salon\nBeyond War and Peace: A Reappraisal of the Encounter Between Christianity and Science\nSalon.com interview\nVideo of discussion about creationism/intelligent design with Numbers and creationist Paul Nelson on Bloggingheads.tv"