"A canner participates in canning, the collection and redemption of deposit-marked beverage containers for recycling. Canning is an activity undertaken by individuals or small teams, typically to earn an income. Canning is only possible in nations, states, or municipalities which have enacted container-deposit legislation.\n\n\n== Container deposits ==\nThe primary aim of container-deposit legislation is mitigation of the environmental impact of materials used in the creation of the containers, especially plastic. Another purpose is to facilitate the recycling of container materials such as glass and aluminum, as well as plastic. As there is a wide variety across different political entities which operate container-deposit programs, in terms of infrastructural support and deposit amount, the economic viability of canning as an income-generating activity varies from municipality to municipality. In some places, container-deposit programs have resulted in drastic reductions in street litter and increases in recycling. In 2012, the German Federal Environment Agency reported that 96% of deposit-market containers were returned via their program.\n\n\n== Sociology ==\nCanners, or those who collect and redeem deposit-marked beverage containers, are a familiar sight in many cities, whether combing areas following major events, searching through trash containers, or transporting their collected bottles and cans to redemption sites.Sociologists have made several observations about canning. In a 2014 dissertation, Sebastian J. Moser stated that it is not poverty that unites the \"otherwise very heterogeneous group of bottle collectors, but the longing for a fixed daily structure and a task that is reminiscent of work.\" Canning activity can also be a source of community in a group often characterized by solitary experiences and disconnection. Income from canning varies widely between individuals. In New York City, canning can often bring in over 100 to 200 dollars a day for the canner. In New York City, as many as 8,000 people support themselves through canning. In Germany, canners earn an average of 100 to 150 euros each month. Another study indicated German canners earn around 3 to 10 euros each day. In addition to income, canners have stated that the activity can be a hobby, for pleasure or productivity, as well as done for the purpose of improving the environment.The sociologist Stefan Sell sees lack of income as the primary motivation for canning. In particular, he notes the sharp rise in low-wage jobs, the fall in collective bargaining in many industries and the devaluation of the welfare state model since the early 1990s as causes for the emergence of this employment. In Germany, canners have become symbols of an increasingly poor society.According to the social scientists Catterfeld and Knecht, it is not only expected yields in terms of income which give insight into the phenomenon of canning. Another factor is availability of materials, or the readiness of consumers to leave bottles and cans in places accessible by canners. In Germany, shifts in public perception over time resulted in more material being offered by consumers specifically to canners, and a shift in perceived social stigma of canning as an occupation. These shifts have been attributed to shifts in legislation, as well as the cultural impact of increased canner visibility during the 2006 World Cup.\n\n\n== Demographic of canners ==\nIn New York City, canners are an ethnically diverse community, with the vast majority of them living below the poverty line. Among canners at Sure We Can, a redemption center in Brooklyn, around 25 percent of the canners are over the age of 60, 7 percent are physically disabled, and 5 percent experience chronic homelessness. In Brooklyn, the canners are largely immigrants. About 75 percent of canners at Sure We Can were born outside the United States, with 54 percent of all the canners identifying as Latinx/Hispanic.In Germany, 80-85% of canners are male, and a majority are over the age of 65. The second largest group is young immigrants. Many experience poverty, but homelessness is relatively uncommon.\n\n\n== Canning in the United States ==\n\n\n=== New York City ===\nNew York City is a hotbed of canning activity largely due to the city's high population density mixed with New York state's current deposit laws. Canning remains a contentious issue in NYC with the canners often facing pushback from the city government, the New York City Department of Sanitation, and other recycling collection companies.  Sure We Can, a redemption center co-founded by nun Ana Martinez de Luco, is the only canner friendly redemption center in the city, providing lockers and communal space for the canners to sort their collections of redeemables.\n\n\n== Images of canning ==\n\n\t\t\n\t\t\n\t\t\n\t\t\n\t\t\n\t\t\n\t\t\n\t\t\n\t\t\n\t\t\n\t\t\n\t\t\n\t\t\n\t\t\n\n\n== References =="