"Anise (, ; Pimpinella anisum), also called aniseed or rarely anix, is a flowering plant in the family Apiaceae native to the eastern Mediterranean region and Southwest Asia.The flavor and aroma of its seeds have similarities with some other spices, such as star anise, fennel, and liquorice. It is widely cultivated and used to flavor food, candy, and alcoholic drinks, especially around the Mediterranean.\n\n\n== Etymology ==\nThe name \"anise\" is derived via Old French from the Latin word, anisum, or Greek, anison, referring to dill.\n\n\n== Description ==\n\nAnise is an herbaceous annual plant growing to 90 cm (3 ft) or more. The leaves at the base of the plant are simple, 10–50 mm (3⁄8–2 in) long and shallowly lobed, while leaves higher on the stems are feathery pinnate, divided into numerous small leaflets. The flowers are either white or yellow, approximately 3 mm (1⁄8 in) in diameter, produced in dense umbels. The fruit is an oblong dry schizocarp, 3–6 mm (1⁄8–1⁄4 in)  long, usually called \"aniseed\".Anise is a food plant for the larvae of some Lepidoptera species (butterflies and moths), including the lime-speck pug and wormwood pug.\n\n\n== Cultivation ==\n\nAnise was first cultivated in Egypt and the Middle East, and was brought to Europe for its medicinal value. It has been cultivated in Egypt for approximately 4,000 years.Anise plants grow best in light, fertile, well-drained soil. The seeds should be planted as soon as the ground warms up in spring. Because the plants have a taproot, they do not transplant well after being established, so they should either be started in their final location or be transplanted while the seedlings are still small.\n\n\n== Production ==\nWestern cuisines have long used anise to flavor dishes, drinks, and candies. The word is used for both the species of herb and its licorice-like flavor. The most powerful flavor component of the essential oil of anise, anethole, is found in both anise and an unrelated spice indigenous to northern China called star anise (Illicium verum) widely used in South Asian, Southeast Asian, and East Asian dishes. Star anise is considerably less expensive to produce, and has gradually displaced P. anisum in Western markets. While formerly produced in larger quantities, by 1999 world production of the essential oil of anise was only 8 tons, compared to 400 tons of star anise.\n\n\n== Composition ==\n\nAs with all spices, the composition of anise varies considerably with origin and cultivation method. These are typical values for the main constituents.\nMoisture: 9–13%\nProtein: 18%\nFatty oil: 8–23%\nEssential oil: 2–7%\nStarch: 5%\nN-free extract: 22–28%\nCrude fibre: 12–25%In particular, the anise seeds products should also contain more than 0.2 milliliter volatile oil per 100 grams of spice.\n\n\n=== Essential oil ===\nAnise essential oil can be obtained from the fruits by either steam distillation or extraction using supercritical carbon dioxide. The yield of essential oil is influenced by the growing conditions and extraction process, with supercritical extraction being more efficient. Regardless of the method of isolation the main component of the oil is anethole (80–90%), with minor components including 4-anisaldehyde, estragole and pseudoisoeugenyl-2-methylbutyrates, amongst others. Anethole is responsible for anise's characteristic odor and flavor.\n\n\n== Uses ==\n\n\n=== Culinary ===\n\nAnise is sweet and aromatic, distinguished by its characteristic flavor. The seeds, whole or ground, are used for preparation of teas and tisanes (alone or in combination with other aromatic herbs), as well many regional and ethnic confectioneries, including black jelly beans, British aniseed balls, aniseed twists and \"troach\" drops, Australian humbugs, New Zealand aniseed wheels, Italian pizzelle and biscotti, German Pfeffernüsse and Springerle, Austrian Anisbögen, Dutch muisjes, New Mexican bizcochitos, and Peruvian picarones.The culinary uses of anise are not limited only to sweets and confections, as it is a key ingredient in Mexican atole de anís and champurrado, which is similar to hot chocolate. In India and Pakistan, it is taken as a digestive after meals, used in brines in the Italian region of Puglia, and as a flavoring agent in Italian sausage, pepperoni and other Italian processed meat products. The freshly chopped leaves are added to cheese spreads, dips or salads, while roots and stems impart a mild licorice flavor to soups and stews.The ancient Romans often served spiced cakes with aniseed called mustaceoe at the end of feasts as a digestive.  This tradition of serving cake at the end of festivities is the basis for the tradition of serving cake at weddings.\n\n\n=== Liquor ===\n\nAnise is used to flavor Greek ouzo; Italian sambuca; Bulgarian and Macedonian mastika; French absinthe, anisette, and pastis; Spanish Anís del Mono, Anísado and Herbs de Majorca; Turkish and Armenian rakı; Lebanese, Egyptian, Syrian, Jordanian, and Israeli arak; and Algerian Anisette Cristal. Outside the Mediterranean region, it is found in Colombian aguardiente and Mexican Xtabentún. These liquors are clear, but on addition of water become cloudy, a phenomenon known as the ouzo effect.Anise is used together with other herbs and spices in some root beers, such as Virgil's in the United States.\n\n\n=== Traditional medicine ===\nThe main use of anise in traditional European herbal medicine was for its carminative effect (reducing flatulence), as noted by John Gerard in his Great Herball, an early encyclopedia of herbal medicine:\n\nThe seed wasteth and consumeth winde, and is good against belchings and upbraidings of the stomach, alaieth gripings of the belly, provoketh urine gently, maketh abundance of milke, and stirreth up bodily lust: it staieth the laske (diarrhea), and also the white flux (leukorrhea) in women.\nAccording to Pliny the Elder, anise was used as a cure for sleeplessness, chewed with alexanders and a little honey in the morning to freshen the breath, and, when mixed with wine, as a remedy for asp bites (N.H. 20.72). In 19th-century medicine, anise was prepared as aqua anisi (\"Water of Anise\") in doses of an ounce or more and as spiritus anisi (\"Spirit of Anise\") in doses of 5–20 minims. In Turkish folk medicine, its seeds have been used as an appetite stimulant, tranquilizer, or diuretic.\n\n\n=== Other uses ===\nBuilders of steam locomotives in Britain incorporated capsules of aniseed oil into white metal plain bearings, so the distinctive smell would give warning in case of overheating. Anise can be made into a liquid scent and is used for both drag hunting and fishing. It is put on fishing lures to attract fish.\n\n\n== References ==\n\n\n== Further reading ==\nBaynes, T. S., ed. (1878), \"Anise\" , Encyclopædia Britannica, 2 (9th ed.), New York: Charles Scribner's Sons, pp. 57–58\nChisholm, Hugh, ed. (1911), \"Anise\" , Encyclopædia Britannica, 2 (11th ed.), Cambridge University Press, p. 55"