"A hoop skirt or hoopskirt is a women's undergarment worn in various periods to hold the skirt extended into a fashionable shape.\nIt originated as a modest-sized mechanism for holding long skirts away from one's legs, to stay cooler in hot climates and to keep from tripping on the skirt during various activities.  Small hoops might be worn by farmers and while working in the garden.  Hoops were then adopted as a fashion item, and the size and scale of the hoops grew in grandeur, especially during the mid-nineteenth century transition from the 1850s to the 1860s. As the society of consumerism evolved, the roles of men and women changed and so did their dress. As male dress became tailored, the female costume of the period made women practically immobilized due to the cumbersome amount of petticoats needed to suit the era's style. When the circular crinoline came out in 1856, it was a revelation not only of technology but of convenience for women. By the 1870s, the cage of the crinoline became a cage only at the rear of the woman's undergarments. This is known today as a bustle.  \nHoop skirts typically consist of a fabric petticoat sewn with channels designed to act as casings for stiffening materials, such as rope, osiers, whalebone, steel, or, from the mid-20th century, nylon.Hoop skirts are called by various names in different periods:\n\nFarthingale (Spanish verdugado) (16th century)\nPanniers or \"side hoops\" (18th century)\nCrinoline or crinolette (mid-19th century)Lightweight hoop skirts, usually with nylon hoops, are worn today under very full-skirted wedding gowns. They can sometimes be seen in the gothic fashion scene.  Reproduction hoop skirts are an essential part of living history costuming, especially American Civil War reenactment.\n\n\n== References ==\n\n\n== Sources ==\nArnold, Janet: Patterns of Fashion: the cut and construction of clothes for men and women 1560-1620, Macmillan 1985. Revised edition 1986. ISBN 0-89676-083-9\nArnold, Janet: Patterns of Fashion 1 (cut and construction of women's clothing, 1660-1860), Wace 1964, Macmillan 1972. Revised metric edition, Drama Books 1977. ISBN 0-89676-026-X.\nArnold, Janet: Patterns of Fashion 2: Englishwomen's Dresses and Their Construction c. 1860-1940, Wace 1966, Macmillan 1972. Revised metric edition, Drama Books 1977. ISBN 0-89676-027-8\nArnold, Janet: Queen Elizabeth's Wardrobe Unlock'd, W S Maney and Son Ltd, Leeds 1988. ISBN 0-901286-20-6\nFogg, Marnie: Fashion: The Whole Story, 2013, Prestel, New York, New York, ISBN 978-3-7913-4761-5."