"Fate/stay night is a Japanese adult visual novel developed by Type-Moon and originally released for Windows on January 30, 2004. A version of Fate/stay night rated for ages 15 and up titled Fate/stay night Réalta Nua (Irish for \"new stars\"), which features the Japanese voice actors from the anime series, was released in 2007 for the PlayStation 2 and later for download on Windows as a trilogy covering the three main storylines. Réalta Nua was also ported to the PlayStation Vita, iOS and Android. The plot focuses on a young mage named Shirou Emiya who becomes a warrior in a battle between \"Servants\" known as the Holy Grail War. Through each route, Shirou bonds with a heroine and confronts different mages who participate in the war.\nA manga series adaptation by Datto Nishiwaki has serialized in Kadokawa Shoten's Shōnen Ace magazine between the February 2006 and December 2012 issues. In 2007, the manga was licensed for an English-language release in North America by Tokyopop. A 24-episode anime series created by Studio Deen aired in Japan between January and June 2006. Sentai Filmworks has licensed the television series and re-released the series on DVD and for the first time on Blu-ray Disc. A film adaptation by Studio Deen was released in Japanese theaters on January 23, 2010. A second anime television series, Fate/stay night: Unlimited Blade Works, was produced by Ufotable and aired between October 2014 and June 2015, following the game's second route as opposed to the first. A second manga adaptation began in 2015, focusing solely on the third route. A film trilogy adapted Heaven's Feel route of the visual novel, with the first film, titled presage flower, released in 2017, the second film, titled lost butterfly, released in 2019, and the final film, titled spring song released in late 2020 after postponement due to the COVID-19 pandemic.\nFate/stay night spawned the Fate media franchise, consisting of a number of adaptations and spin-offs in various different media. On October 28, 2005, Type-Moon released a sequel to Fate/stay night, titled Fate/hollow ataraxia. Its plot is set half a year after the events of Fate/stay night. A light novel series titled Fate/Zero, set as a prequel to Fate/stay night, was published from 2006 to 2007, with an anime adaptation by Ufotable airing between October 2011 and June 2012. A spin-off magical girl manga series, Fate/kaleid liner Prisma Illya, began serialization in 2007 and has received multiple anime television series. Three fighting games have been released: Fate/unlimited codes for arcades and PlayStation 2, Fate/tiger colosseum and its sequel Fate/tiger colosseum Upper for PSP. A PSP RPG titled Fate/Extra was released on July 22, 2010, and a sequel and companion game, Fate/Extra CCC, was released on March 28, 2013. An online RPG titled Fate/Grand Order was released on Android on July 29, 2015, followed by an August 12 release on iOS; an anime film adaptation by Lay-duce was released on December 31, 2016, with sequel adaptations by CloverWorks and Production I.G..\n\n\n== Gameplay ==\nFate/stay night's gameplay requires little interaction from the player as most of the game's duration is spent on reading the text that appears, representing either dialogue between the characters, narration, or the inner thoughts of the protagonist. Often, players will come to a \"decision point\" where they are given a chance to choose from options displayed on the screen, typically two to three at a time. The time between these decision points is variable. During these times, gameplay pauses until a choice is made that furthers the plot in a specific direction. There are three main plot lines that the player will have the chance to experience, one for each of the heroines in the story. To view all three plot lines, the player will have to replay the game multiple times and choose different choices during the decision points to progress the plot in an alternate direction. Finishing one route will unlock the next one. When interacting with the heroines with the routes, an \"affection meter\" is created, which is raised by giving them an answer that pleases them. Depending on the affection the player has achieved, a \"True Ending\" can be unlocked.There are multiple ways in which the player can lose the game, including Shirou's death or a decision that causes the heroine to be murdered. Should this happen, the player is taken to an area called the Tiger Dojo (タイガー道場, Taigā Dōjō) where Taiga Fujimura and Illyasviel von Einzbern give the player hints about what they should do to survive in the next attempt to complete the game.\n\n\n== Plot ==\n\nThe story revolves around Shirou Emiya, a hardworking and honest teenager who unwillingly enters a to-the-death tournament called the Fifth Holy Grail War, where combatants fight with magic and Heroes from throughout history for a chance to have their wishes granted. Orphaned and the sole survivor of a massive fire in Fuyuki City as a child, Shirou was taken in by a retired mage named Kiritsugu Emiya, who would die years later. His responsibility to those who died and his salvation through his father formed a strong desire for justice and peace in him. Thus, he earnestly trains his body and minuscule ability with magic to someday greatly help others, even if people often abuse his generosity at his stage. One evening, after seeing two devastatingly powerful beings trading blows at his school with swords and spears, he is attacked, as witnesses to the Holy Grail War are generally supposed to be eliminated. Chased to his home by the spear-wielding warrior Lancer and barely able to avoid his attacks, Shirou is about to be killed when he is saved by Saber. Saber, the personification of a renowned figure in history (Arturia Pendragon in her case), was created to aid participants in the War. In her supposedly accidental summoning and the appearance of the marks on Shirou's hand, his entry as a Master into the Holy Grail War is formalized.\n\n\n=== Fate ===\nThe first of the three heroines, Saber is an agile and powerful warrior who keeps her identity secret, hence her substitute name after her role as a member of the Saber class. She also serves as the route's servant protagonist. She was the victor of the Fourth Holy Grail War with another Master and claimed to be the strongest out of all Servants in the Saber Class. However, Shirou is against Saber's constant aim for conflicts with other servants and instead seeks to ally with Rin. Shirou decides to drop his pacifism when he discovers that his former friend, Shinji Matou, is a Master, with the Servant Rider, aiming to kill all the students from their school to increase Rider's powers. Following Shinji and Rider's defeat, Shirou learns that Saber cannot fight at her full strength without exchanging Mana energy with her master. During a confrontation with Master Illya and her Servant Berserker, Shirou passes Saber his Mana and later assists her in defeating the enemy by projecting one of Arturia's swords in combat. As Shirou seeks to aid to keep Saber in their world, he learns from the priest Kirei Kotomine that the Holy Grail is cursed. It is revealed that Shirou's late guardian, Kiritsugu, once used Saber to destroy the Grail. However, it instead caused the fire where Shirou lost his family. Shirou rejects the idea of accepting his wish of the Holy Grail as he decides to accept his past and not forget Saber. Moved by Shirou, Saber also rejects the Holy Grail, believing she should not change Britain's history. As Kotomine aims to use Illya's body to recreate the Holy Grail, Shirou and Saber confront him and his servant, Gilgamesh. Following Shirou's and Saber's victories, Shirou orders Saber to destroy the Grail. This causes Saber to go back to her last moments before her death. In the Réalta Nua version of the game, a new ending can be unlocked where Shirou becomes a heroic spirit in order to meet Saber in the afterlife of heroes, Avalon.\n\n\n=== Unlimited Blade Works ===\nThe second of the three heroines is Rin Tohsaka, a model student and idol of Shirou's school who is secretly a mage and Master of Archer in the Holy Grail War. Her servant Archer serves as the servant protagonist of the route. She descends from a long, distinguished line of mages. Though she lacks a formal magic education, she is strong and gifted in her own right. Rin is dubbed \"The Ice Queen\" by classmates for her cold, unreachable persona at school; however, this is simply a front to hide her true status as a mage. Her presence in the story is established shortly after Shirou is killed by Lancer at school. Upon seeing him, she revives him due to his connection with Sakura Matou, with whom Rin is closely acquainted. As such, the two decide to become allies in the war, unaware of Archer's true identity as an adult Shirou from one of the series' numerous alternate universes. Shirou loses control of Saber during the story but instead aims to fight with his magical strength to stop the war. Archer betrays Rin and reveals his despondency and bitterness over his past choices to Shirou. He subsequently challenges Shirou to a fight, hoping to destroy his story of being a hero. However, Shirou accepts his future regardless of the regrets and misery, deciding to stick to Kiritsugu's ideals. Gilgamesh tries to kill Archer and Shirou, with the former seemingly sacrificing himself to protect the latter. Later, Rin passes Shirou her Mana to fight Gilgamesh to replicate Archer's powers. As Gilgamesh almost dragged Shirou into their deaths, Archer uses his last strength to save the latter. In the True Ending, Shirou and Rin move to London to study magic, as well as start a romantic relationship.\n\n\n=== Heaven's Feel ===\nThe third and final heroine is Sakura Matou, a first-year high school student and long-time friend of Shirou's, who often visits his home to help him with his daily chores. A quiet, soft-spoken girl, Sakura can be surprisingly stubborn at times and holds a deep, unparalleled affection for Shirou. She is revealed to be Rin's long-lost sister, raised by the Matou family, and has since suffered their abuse while in training as a magus. Sakura is also discovered as the true master of Rider, whom she reasserts control of from Shinji, making Rider the servant protagonist of the route. In the route, Saber and Berserker are consumed by the shadows of Angra Manyu. In the ensuing battle with True Assassin and the corrupted servants, a mortally wounded Archer transplants his left arm to save a dying Shirou. Zouken, Sakura's grandfather, places a shard of the lesser grail from the 4th Holy Grail War in her body, infecting Sakura with Angra Manyu. She becomes Dark Sakura, killing Shinji in his attempt to rape her. Despite the threat Sakura poses to humanity, Shirou, having fallen in love with her, abandons his ideal in favor of saving Sakura, despite Rin's initial objections. Upon learning that Illya is another sacrifice to create the Grail, Shirou teams up with Kotomine and uses Archer's powers to save Illya from Berserker. Rin is injured after finding herself unable to kill Sakura, while Rider and Shirou successfully eliminate Saber Alter. Shirou talks to Sakura and helps her regain her humanity, freeing her from her contract with Angra Mainyu. He then faces Kotomine in a final battle to later destroy the Grail. In True Ending, following Kotomine's death in combat, Illya sacrifices herself to destroy the Grail and transplants Shirou's soul using forbidden magic. Rider later returns to the cave to grab and bring Shirou's soul home, and Rin places it within a puppet body. Shirou, Sakura, and Rider live a peaceful life together while Rin moves to London to study magic.\n\n\n== Development ==\n\nKinoko Nasu first began writing Fate/stay night in college and had not intended it to be a game. Initially, Nasu only wrote what would become the game's Fate storyline,. However, the game went on to have three storylines, the Fate storyline being one of them. In his early drafts, Fate's heroine Saber was a man, and the protagonist was a girl with glasses. This early draft was embodied in the short original video animation (OVA) Fate/Prototype, which was released with the final volume of the Carnival Phantasm OVA series. Nasu set aside the project and went on to found Type-Moon with artist Takashi Takeuchi. After the success of their first visual novel Tsukihime in 2000, Type-Moon transitioned from a dōjin soft organization to a commercial organization. Nasu and Takeuchi decided to turn the old Fate story into a visual novel as Type-Moon's first commercial product. In the beginning, Nasu was worried that because the main character was a girl, the story might not work as a bishōjo game. Artist Takeuchi suggested switching the genders of the protagonist and Saber to fit the game market.Nasu was influenced by the novel Makai Tensho to write a fantasy story in which famous heroic personalities from all over the world would take part. The original idea was limited to the prototype of the Fate arc, where the main characters were the female master and her servant Saber (the embodiment of King Arthur as a man). According to Nasu, this version contained elements of 1980s romance and ideas of transformations to world order, while the final version focuses on changes within people and has other purposes for using the Holy Grail. About a third of the scenario of the future Fate arc (up to the battle with Sasaki Kojiro) was completed at that time, but for several personal reasons, Nasu could not write further for more than ten years.The first two-story arcs completed were Fate and Unlimited Blade Works; the latter was partially presented to the public in a preview booklet at Comiket in December 2001. Unlimited Blade Works was based on the idea of a character's confrontation with himself and his own ideals, something unrealized during the development of Tsukihime for the arc of Yumizuka Satsuki. In 2002, it was found that the content that was already written was nearly equal in length to Tsukihime, leading to proposals to divide the game into two parts. However, due to the high cost of releasing two products at once, the arcs of Illya and Sakura were partially combined, resulting in Heaven's Feel. Nasu original thought of extending the Fate route involving an alternative Fifth Holy Grail War where Shirou fought alongside Saber without a romantic relationship developing between them. Following their separation, Shirou would bond with Rin in a similar way to the true ending of Unlimited Blade Works. The main theme in Fate/stay night is \"conquering oneself\". There are three storylines in the visual novel; each has a different theme. The first one, Fate, is the \"oneself as an ideal.\" The second one, Unlimited Blade Works, is \"struggling with oneself as an ideal.\" The third one, Heaven's Feel, is \"the friction with real and ideal\".According to Nasu, the main theme of the resulting Heaven's Feel arc was chosen to apply the protagonist's ideas in practice. This is in contrast it with Fate and Unlimited Blade Works, which paid most attention to the demonstration of Shirou's ideals. Nasu wanted to portray him as a typical teenager while artist Takashi Takeuchi did not want him to have too much individuality to make players project themselves onto him. In 2002, Takeuchi suggested Gen Urobuchi, a well-known author of Nitroplus visual novels, to connect to the preliminary scenario of the game, but Urobuchi ultimately refused. Afterward, Nasu decided that Fate/stay night would be the most significant work in his life, created by him from beginning to end.\n\n\n=== Release history ===\nAfter translating text into code, editing background images and sprites, and debugging audio-visual effects, on October 21, 2003, the demo version of the game was released on a CD with the magazine Tech Gian from Enterbrain, and on November 1 was posted on Type-Moon's site. Fate/stay night was released in Japan on January 30, 2004, for Windows PCs.A CERO C-rated version of Fate/stay night, titled Fate/stay night Réalta Nua, for the PlayStation 2 was scheduled to be released in late 2006. However, it was postponed until April 19, 2007. This version provided voice acting but the sex scenes were removed due to censorship and the target audience. The updated re-release also provided the true ending to the Fate route. Fate, Unlimited Blade Works, and Heaven's Feel are the three branching storylines found within the game. They were released separately through digital download on Windows (but as the Réalta Nua version) in the beginning of 2012. A PlayStation Vita port of Réalta Nua was released in Japan on November 29, 2012, with three new opening animations by anime studio Ufotable and the option to change the aspect ratio to 4:3, 16:9 or in-between.There have been only small changes to Shirou's physical design since its inception. With red hair and stubborn eyes, Takeuchi aimed for a typical design of a straightforward shōnen manga genre character. He felt that it was too standard, however, so he added more circles in his eyes. Takeuchi has trouble bringing out Shirou's expressions because of his unique eyebrows; as a result, Shirou remains the most difficult Fate/stay night character for him to draw. Their goal of creating \"a protagonist without a face\" to comply with the nature of bishōjo games in the initial release of Fate/stay night is another reason Takeuchi had trouble drawing Shirou, who only appeared in a handful of scenes. In the re-released Réalta Nua version of the visual novel aimed at teenagers rather than just adults, the importance of showing non-adult content was increased. So Takeuchi had to draw Shirou more often.On October 28, 2005, Type-Moon released a sequel to Fate/stay night, titled Fate/hollow ataraxia. Its plot is set half a year after the events of Fate/stay night and features new characters such as Avenger, Bazett Fraga McRemitz, and Caren Ortensia, alongside returning characters such as Shirō Emiya, Saber and Rin Tōsaka.\n\n\n== Adaptations ==\n\n\n=== Manga ===\n\nThe Fate/stay night manga adaptation, illustrated by Datto Nishiwaki, was serialized in Kadokawa Shoten's manga magazine Shōnen Ace between the February 2006 and December 2012 issues. The manga combines the Fate and Unlimited Blade Works scenarios of the visual novel as well as some elements from the Heaven's Feel scenario while ultimately following the Fate scenario. Twenty tankōbon volumes were released in Japan between May 26, 2006, and November 26, 2012. The manga was licensed for an English-language release in North America by Tokyopop in 2007. In April 2011, Tokyopop announced that they were shutting down their North American manga publishing division, and volume 11 became the last volume to be released by Tokyopop. In 2014, Viz Media's Viz Select imprint released the first ten volumes of Fate/stay night manga digitally. A second Fate/stay night manga based entirely on the Heaven's Feel route and illustrated by Task Ohna began serialization in the June 2015 issue of Young Ace.Himuro no Tenchi Fate/School Life is a comedy 4-koma manga revolving around the everyday life at school of the minor characters of Fate/stay night and Fate/Hollow Ataraxia, specifically the character Kane Himuro, a classmate of Fate/stay night protagonist Shirō Emiya. It is serialized in Manga 4-koma Kings Palette from November 25, 2006, and twelve compiled volumes have been published by Ichijinsha.\nA spin-off manga series Fate/kaleid liner Prisma Illya written and illustrated by Hiroyama Hiroshi was first serialized in Comp Ace in 2008 and later released into two bound volumes. The series features Illya as a main character where she lives an alternate life as a schoolgirl. However, she is chosen by the Magical Stick Ruby and is involved in a quarrel between Rin and Luvia. A sequel series titled Fate/Kaleid liner Prisma Illya 2wei! was serialized from 2009 to 2012 and released in five bound volumes. A third manga series titled Fate/Kaleid liner Prisma Illya 3rei!! began serialization in 2012.\n\n\n=== Anime ===\n\nThe original Fate/stay night anime series aired between January 7 and June 17, 2006, containing 24 episodes; the storyline follows mainly the Fate scenario but shows parts of other scenarios. When the anime adaptation was in the planning stages at Studio Deen, they were planning an original story, with Shielder, a heroine later used in Fate/Grand Order, as an important character, instead of adapting the events of the source material. It was produced by the Fate Project, and included Geneon Entertainment, TBS, CREi, Type Moon, and Frontier Works. Kenji Kawai composed the original music for the series.\nThe series later received its international television premieres on the anime television network Animax in 2007, its English-language television premiere occurring on Animax's English networks in Southeast Asia in June as well as its other networks in South Korea, Hong Kong and other regions. Geneon USA also licensed the series for distribution across North America. The English dub was produced at Bang Zoom! Entertainment. On July 3, 2008, Geneon Entertainment and Funimation Entertainment announced an agreement to distribute select titles in North America. While Geneon Entertainment retains the license, Funimation Entertainment assumes exclusive rights to the manufacturing, marketing, sales, and distribution of select titles. Fate/stay night was one of several titles involved in the deal. Sentai Filmworks has since licensed the TV series and re-released the series on DVD and for the first time on Blu-ray Disc in January 2013. Fate/stay night started airing in North America on the Anime Network On Demand channel on February 7, 2013.\nThe television series was re-released in Japan on January 22, 2010, in two 60-minute special edition DVD/Blu-ray volumes to commemorate the release of the film Fate/stay night: Unlimited Blade Works. Fate/stay night TV reproduction I and II each recap 12 episodes from the anime and feature re-edited and re-compiled footage along with new opening and ending animation footage, with new ending songs by Jyukai and Sachi Tainaka. The opening song \"disillusion -2010-\" is a re-recording of the \"disillusion\" theme song from the television series.\nAn animated film based on the storyline of the Unlimited Blade Works route from the visual novel was released in Japanese theaters on January 23, 2010, and produced by Studio Deen. The staff from the anime television series, including director Yūji Yamaguchi, returned to work on the film, with most of the voice cast reprising their roles. The film earned 280 million yen at the Japanese box office. Sentai Filmworks has licensed the Unlimited Blade Works film and released it on DVD and Blu-ray. As with the television series, the film was dubbed at Bang Zoom! The film has been shown on the Anime Network.\nFollowing an anime adaptation of the Fate/Zero novel series, which aired between October 2011 and June 2012, Ufotable produced a second Fate/stay night anime television series based on the Unlimited Blade Works route from the visual novel. The anime is directed by Takahiro Miura and the original Japanese voice cast from the Studio Deen Fate/stay night anime and the Fate/Zero anime reprise their roles in the new anime. The first half of the anime ran from October 4 to December 27, 2014, and the second half ran from April 4 to June 27, 2015. An advanced screening online premiered on September 28, 2014, in several countries across the world, including Japan, the United States, France, Germany, and South Korea. Aniplex of America has acquired streaming and home video rights to the 2014 series for North America, and has also announced an English dub of the first half of the series, which was released on DVD and limited Blu-ray on August 25, 2015. A ten-minute original video animation (OVA) episode was featured on the Blu-ray release of the second half of the series, which was released on October 7, 2015; the episode was based on an alternate ending from the visual novel, titled \"sunny day\".Ufotable also released a film trilogy based on the Heaven's Feel route, the first of which is titled Fate/stay night: Heaven's Feel I. presage flower and was released in Japan on October 14, 2017, and in the United States in November and December 2017. The film was released again in the United States on June 5, 2018, and June 7, 2018, with an English dub. The second film, titled Fate/stay night: Heaven's Feel II. lost butterfly was released in Japan on January 12, 2019. The third film, titled Fate/stay night: Heaven's Feel III. spring song was released in Japan on August 15, 2020.\n\n\n=== Light novels ===\n\nOn November 22, 2006, Type-Moon announced a new installment in the Fate/stay night franchise, titled Fate/Zero, which is a prequel to Fate/stay night, stressing the events of the Fourth Holy Grail War and how its consequences affected the Fifth Holy Grail War. In contrast to Fate/stay night, Fate/Zero is a series of light novels instead of a visual novel, and is told in a third-person narrative that follows the actions of multiple characters. The series is a collaboration between Type-Moon and a fellow developer, Nitroplus, and was written by Gen Urobuchi. The first volume was released on December 29, 2006. The second volume was released on March 31, 2007. The third volume was released on July 27, 2007. The fourth and final volume was released on December 29, 2007, along with the Fate/Zero Original Image Soundtrack \"Return to Zero\". A manga adaptation began serializing in February 2011, followed by an anime adaptation by Ufotable, marking their debut with the franchise.\nA light novel titled Fate/Apocrypha was also released. It revolves around a parallel universe in which the events of Fate/stay night and Fate/Zero never occurred due to the removal of the Holy Grail after the Third War, resulting in a different Holy Grail War. The first volume was released on December 29, 2012. The second volume was released on August 16, 2013. The third volume was released on December 29, 2013. The fourth volume was released on May 30, 2014. The fifth and final volume was released on December 30, 2014. An anime adaptation by A-1 Pictures was announced for July 2017.\n\n\n=== Spin-off series ===\n\nCharacters from the Fate/stay night series appear alongside other Type-Moon characters in the gag manga series Carnival Phantasm, released by Ichijinsha between July 2004 and 2005. An original video animation series produced by Lerche was released between August 12, 2011, and July 7, 2012. A spin-off manga series written by Hiroshi Hiroyama, titled Fate/kaleid liner Prisma Illya, began serialization in Kadokawa Shoten's Comp Ace magazine from September 2007. Set in an alternate universe to the visual novels, the series follows the character Illyasviel von Einzbern as she becomes a magical girl. Several anime series and a film have been produced by Silver Link.\n\n\n=== Video games ===\n\nIn 2007, Fate/tiger colosseum, a 3D fighting game based on Fate/stay night, was released for the PlayStation Portable by Capcom and cavia, inc. in cooperation with TYPE MOON. The characters are all rendered in a super deformed style. A sequel, Fate/tiger colosseum Upper, was released on August 28, 2008.Another fighting game based on the franchise titled Fate/unlimited codes debuted at the 2008 Amusement Machine Operators' Union (AOU) show in Japan. It was developed by Capcom in conjunction with Cavia and Eighting. The game was released in the arcades and had an exclusive PlayStation 2 release on December 18, 2008. A pre-order version was also available, which includes a limited edition Saber Lily figure. Capcom also released a PlayStation Portable version titled Fate/unlimited codes Portable on June 18, 2009. A digital download of the game was released in North America on September 3, 2009. and in Europe on September 10, 2009A dungeon RPG adaptation of the series was announced in Famitsu and is produced by Image Epoch and Marvelous Entertainment titled Fate/Extra. Players take on the role of an unnamed male or female character that the player chooses to be one of seven chosen masters and control servants Saber, Archer, or Caster. The game was released for the PlayStation Portable in both regular and the \"Type-Moon Box\" editions. The limited, Type-Moon Box edition includes a Saber Figma figure from the game itself, a visual book and a limited edition soundtrack. While the original release was set for March 2010, the release date was pushed back to July 22, 2010, for further testing. In July 2011, Aksys Games confirmed it would be publishing Fate/Extra in North America. Saber appears as playable character in the Nitroplus fighting game Nitroplus Blasterz: Heroines Infinite Duel based on her appearance in Fate/Zero. An anime television series adaptation, titled Fate/Extra Last Encore and produced by Shaft, was announced for 2017.An online free-to-play RPG was announced based on the franchise at large, titled Fate/Grand Order. The game is centered around turn-based combat where the player, who takes on an unnamed male or female Master, summons and commands Servants in the battle against enemies. The story narrative is presented in a visual novel format, and each Servant has a scenario which the player explores. Many Servants are featured; some are original, while others return from preceding Fate works. It was first released on July 29, 2015, on Android, with a subsequent release on August 12 on iOS. An anime film adaptation by Lay-duce, titled Fate/Grand Order: First Order, was released on December 31, 2016.\n\n\n== Music ==\nThere is a soundtrack to the game, called Fate/Stay Night Original Sound Track. There is also an arranged soundtrack of the game music, titled Avalon - Fate/Stay Night. It is arranged by WAVE and K. JUNO and features two English arranged versions of \"This Illusion\" titled \"Illusion/Vision\" and \"Illusion/Fate\". The anime original soundtrack was arranged and composed by Kenji Kawai. In addition, there are image albums Wish and WHITE AVALON as well as various remix albums Fate another score, Fate/extended play, and Emiya #0.\nThere are also numerous fanmade arrangements: Exodus: Fake/ever since, Iriya 51, Broken Phantasm, fragments, and 17 Division.\nAside from Fate/stay night, the other games in the series have their soundtracks. There is a Fate/tiger coliseum OST and an imaged soundtrack for Fate/Zero titled Return to Zero.\n\n\n== Reception ==\nWhen released on January 30, 2004, Fate/stay night rapidly became one of the most popular visual novels in history, securing the title of \"highest selling visual novel\" in 2004 of the adult game retailer Getchu.com. Readers of Dengeki G's Magazine ranked the game second in a list of \"most interesting bishōjo games\" in August 2007. The original PC version of the visual novel sold 400,000 copies. On the PlayStation 2, the 2007 release sold 184,558 and the 2009 re-release sold 21,937. On the PlayStation Vita, the game sold 58,157 in 2013, and 86,836 as of 2014. This adds up to total visual novel sales of 751,488 copies. The DVD and Blu-ray releases of the 2006 anime series sold 283,864 units in Japan.In early 2007, the popularity of Fate/stay night and the anime Japanese voice actors led to the launch of the Fate/stay tune internet radio drama, featuring the voice talent of Kana Ueda (Rin) and Ayako Kawasumi (Saber). In 2011, the writers Chris Klug and Josiah Lebowitz in their book Interactive storytelling for video games praised Fate/stay night as a strong example of branching storylines and interactive storytelling, comparing its depth and complexity to that of a traditional novel. In 2019, the franchise took first place in the Comiket event. The spin-off Fate/Grand Order was also a commercial success surpassing the sales of the game franchise Metal Gear in four years.\n\n\n=== Critical response ===\nFate/stay night is, according to various estimates, one of the most famous representatives of its genre. It has also been described as the \"among the most well-received visual novels ever published\".According to some critics, the visual novel is an example of a good mix of traditions of epic literature and the modern fantasy genre  It was also noted that using the heroes of the legends of antiquity can also encourage acquaintance with their sources. Uno Tsunehiro from Kyoto University compared Shirou's traumatic background in regards the city's fire to survivors from the September 11 attacks while also showing different ways the Japanese society used to take care of their lives in such time. As a result, Tsunehiro views Shirou's change in each route as a way to recover from the trauma, grow up and become an independent person. According to Lebowitz and Klug, the authors of the book on the theory of visual novels, the chosen format of the visual novel was optimally used, since the concept of several plot arches stretched the exposition of elements important for a common understanding of the plot and supported reader interest. The researchers also identified branchings that contain differently emotionally colored scenes that made it possible to view the situation or characters from several angles. A large number of sudden deaths, coupled with a sharp effect of losing control over the situation, according to the authors of the monograph, gave the gameplay an additional emotional coloring and motivated players to continue playing the game, aided by well-developed plot twists. Despite the linearity of the passage of the story arches, the option of completely skipping the already known scenes \"warned players of fatigue and again quickly dipped them into the thick of events\". Story twists were called by various observers \"relevant and exciting\". The darker narrative \"Heaven's Feel\" takes in comparison to \"Fate\" and \"Unlimited Blade Works\" resulted in the route being compared to the horror genre.The visual component of the novel and character design were regarded by critics as successful for 2004. Musical accompaniment and audio effects, according to critics, successfully performed their role in creating the right atmosphere during the narration and skillfully emphasized the textual description of the scenes.Critics and scholars praised Shirou. Gamasutra regarded Shirou as an interesting protagonist due to his childish ideals of becoming a hero and continuing this goal while growing up. The site added that the player's in-game choices make Shirou's character arcs change dramatically and allow Nasu to convey a different aspect of his ideal. The novelist Shūsei Sakagami praised how the user can witness Shirou's \"gradual change from a robot to becoming a human\" through the three routes, developing distinctive traits in each one. In his analysis of the magical system and details of the personalities of the characters, Makoto Kuroda sees in the idea of Shirou to become a “champion of justice” a direct analogy with the traditional view of the life of bodhisattvas in Mahayana Buddhism, seeking to save other people at the cost of their own efforts and suffering. In Kuroda's view, Buddhist concepts are opposed to the elements of Christian ethics contained in the plot through the opposition of Shirou and Kirei Kotomine in the form of the main character's rejection of the interpretation of Angra Mainyu as a creature who accepted the sins of others in the name of salvation. In the story aspect, the reviewers considered Shirou's behavior and his attitude to his own ideals as the most interesting and well-developed part of the whole novel. The main character in each of the story arches was placed in different conditions, which gave readers the opportunity to understand the conditions of the setting (\"Fate\"), to conduct a theoretical understanding of the ideals of the character (\"Unlimited Blade Works\"), to face the problems of their implementation (\"Heaven's Feel\") and, having combined this, to understand the details of his image.The images of Rin, Saber, and Sakura received conflicting ratings. Thus, many reviewers recognized that the psychologically deepest arc is \"Heaven's Feel,\" which is largely due to the sharp and versatile disclosure of the image of Sakura Matou, and her romantic line with Shirou is the most \"adult\" among all the heroines. According to Gen Urobouchi, the author of the Fate/Zero prequel, the relationship between the main character and Saber resembled the relationship \"between a boy and a boy who became a girl\" and more \"corresponded to the ancient Greek understanding of love\". The very image of Saber was considered by some reviewers to be \"full of dignity and not falling into banality\", others \"acquiring feminine features with close interaction with Shirou\". According to some reviewers, Rin Tohsaka \"emphasized a different opinion about the ideals of Shirou\", and her romantic line looked \"most realistic\", where Rin and the main character \"compensated for the shortcomings and increased the virtues of each other\". In the book Anime and the Visual Novel: Narrative Structure, Design and Play at the Crossroads of Animation and Computer Games, Dani Cavallaro states that the portrayal of Sakura has a high impact on \"Heaven's Feel\"'s storyline despite her initial limited role.\n\n\n== References ==\n\n\n=== Citations ===\n\n\n=== Sources ===\n\n\n== External links ==\nGamesFate/stay night at Type-Moon (in Japanese)\nFate/stay night [Réalta Nua] PS Vita official website (in Japanese)\nFate/stay night at The Visual Novel DatabaseAnimeFate/stay night film official website (in Japanese)\nFate/stay night (anime) at Anime News Network's encyclopedia"