"Fate/stay night is a Japanese adult visual novel developed by Type-Moon and originally released for Windows on January 30, 2004. A version of Fate/stay night rated for ages 15 and up titled Fate/stay night Réalta Nua (Irish for \"new stars\"), which features the Japanese voice actors from the anime series, was released in 2007 for the PlayStation 2 and later for download on Windows as a trilogy covering the three main storylines. Réalta Nua was also ported to the PlayStation Vita, iOS and Android. The plot focuses on a young mage named Shirou Emiya who becomes a warrior in a battle between \"Servants\" known as the Holy Grail War. Through each route, Shirou bonds with a heroine and confronts different mages who participate in the war.\nA manga series adaptation by Datto Nishiwaki has serialized in Kadokawa Shoten's Shōnen Ace magazine between the February 2006 and December 2012 issues. In 2007, the manga was licensed for an English-language release in North America by Tokyopop. A 24-episode anime series created by Studio Deen aired in Japan between January and June 2006. Sentai Filmworks has licensed the television series and re-released the series on DVD and for the first time on Blu-ray Disc. A film adaptation by Studio Deen was released in Japanese theaters on January 23, 2010. A second anime television series, Fate/stay night: Unlimited Blade Works, was produced by Ufotable and aired between October 2014 and June 2015, following the game's second route as opposed to the first. A second manga adaptation began in 2015, focusing solely on the third route. A film trilogy adapted Heaven's Feel route of the visual novel, with the first film, titled presage flower, released in 2017, the second film, titled lost butterfly, released in 2019, and the final film, titled spring song released in late 2020 after postponement due to the COVID-19 pandemic.\nFate/stay night spawned the Fate media franchise, consisting of a number of adaptations and spin-offs in various different media. On October 28, 2005, Type-Moon released a sequel to Fate/stay night, titled Fate/hollow ataraxia. Its plot is set half a year after the events of Fate/stay night. A light novel series titled Fate/Zero, set as a prequel to Fate/stay night, was published from 2006 to 2007, with an anime adaptation by Ufotable airing between October 2011 and June 2012. A spin-off magical girl manga series, Fate/kaleid liner Prisma Illya, began serialization in 2007 and has received multiple anime television series. Three fighting games have been released: Fate/unlimited codes for arcades and PlayStation 2, Fate/tiger colosseum and its sequel Fate/tiger colosseum Upper for PSP. A PSP RPG titled Fate/Extra was released on July 22, 2010, and a sequel and companion game, Fate/Extra CCC, was released on March 28, 2013. An online RPG titled Fate/Grand Order was released on Android on July 29, 2015, followed by an August 12 release on iOS; an anime film adaptation by Lay-duce was released on December 31, 2016, with sequel adaptations by CloverWorks and Production I.G.."