"This Is Spinal Tap (stylized as This Is Spın̈al Tap: A Rockumentary by Martin Di Bergi) is a 1984 American mockumentary film co-written and directed by Rob Reiner in his directorial debut. It stars Christopher Guest, Michael McKean, and Harry Shearer as members of the fictional English heavy metal band Spinal Tap (who are characterized as \"one of England's loudest bands\"), and Reiner as Martin \"Marty\" Di Bergi, a documentary filmmaker who follows them on their American tour. The film satirizes the behavior and musical pretensions of rock bands and the hagiographic tendencies of rock documentaries such as The Song Remains the Same (1976), and The Last Waltz (1978) and follows the similar All You Need Is Cash (1978) by The Rutles. Most of its dialogue was improvised and dozens of hours were filmed. It produced the 1984 soundtrack album of the same name.\nThis Is Spinal Tap released to critical acclaim, but was only a modest success upon its initial release. However, it found greater success and amassed a cult following after it was released on VHS. In 2002, it was deemed \"culturally, historically, or aesthetically significant\" by the Library of Congress, and was selected for preservation by the National Film Registry. In 2016, film critic and author Jeremy Arnold chose it as one of the \"52 Must-See Movies\", describing it as \"one of the single most influential movies of the past thirty-five years\" and arguing that it \"effectively launched a new genre—the mockumentary\".\n\n\n== Plot ==\nFilmmaker Martin \"Marty\" Di Bergi is creating a documentary that follows the English rock group Spinal Tap on their 1982 United States concert tour to promote their new album Smell the Glove. The band comprises childhood friends David St. Hubbins and Nigel Tufnel on vocals and guitar, bassist Derek Smalls, keyboardist Viv Savage, and drummer Mick Shrimpton. They were known as the Originals until they found out another band had that name so they changed their name to the New Originals. They had a hit as the Thamesmen with their single \"Gimme Some Money\", before changing their name to Spinal Tap and achieving a minor hit with the flower power anthem \"Listen to the Flower People\", and finally transitioning to heavy metal. Several of their previous drummers died in strange circumstances: spontaneous human combustion (Peter James Bond), a \"bizarre gardening accident\" (John \"Stumpy\" Pepys), and choking on vomit (Eric \"Stumpy Joe\" Childs - \"someone else's vomit\"). Segments of Marty's film show David and Nigel to be competent but dimwitted and immature musicians. At one point, Nigel shows Marty a custom-made amplifier that has volume knobs that go up to eleven, believing this would make their output louder.\n\nSeveral of the band's tour shows are canceled because of low ticket sales, and major retailers refuse to sell Smell the Glove because of its sexist cover art. Tensions arise between the band and their manager Ian Faith. David's girlfriend Jeanine, a manipulative yoga and astrology devotee, joins the group on tour and participates in band meetings, influencing their costumes and stage presentation. The band's distributor opts to release Smell the Glove with an entirely black cover without consulting the band. Despite their manager convincing the band that it would have a similar appeal to the White Album, the album fails to draw crowds to autograph sessions with the band.\nNigel suggests staging a lavish show, and asks Ian to order a Stonehenge megalith. However, Nigel, rushing a sketch on a napkin, mislabels its dimensions; the resulting prop is only 18 inches high rather than 18 feet, making the group a laughing stock. The group blames Ian, and when David suggests Jeanine should co-manage the group, Ian quits. The tour continues, rescheduled into smaller and smaller venues. Nigel is marginalized by Jeanine and David. At a gig at a United States Air Force base, Nigel is upset by an equipment malfunction and quits mid-performance. At their next gig, in an amphitheater at an amusement park, the band finds their repertoire is severely limited without Nigel, and improvise an experimental \"Jazz Odyssey\", which is poorly received.\nAt the last show of the tour, David and Derek consider exploring old side projects, such as a musical theatre production about Jack the Ripper. Before they go on stage, Nigel arrives to tell them that their song \"Sex Farm\" has become a major hit in Japan, and that Ian wants to arrange a tour there. As the band performs, David invites Nigel onstage, reuniting them, which excites everyone but Jeanine. With Ian reinstalled as manager, Spinal Tap performs a series of sold-out shows in Japan, despite the loss of drummer Mick, who explodes onstage.\n\n\n== Cast ==\n\n\n== Production ==\n\n\n=== Background ===\nMichael McKean and Christopher Guest met while in college in New York City in the late 1960s, and played music together. They worked with Harry Shearer and Rob Reiner on a TV pilot in 1978 for a sketch comedy show called The TV Show, which featured a parody rock band called Spinal Tap. During production of that sketch (while being burned with oil from on-stage effect) McKean and Guest began to improvise, inventing characters that became David St. Hubbins and Nigel Tufnel.Guest had previously played guitar under the name \"Nigel Tufnel\" on Michael McKean and David Lander's album Lenny and the Squigtones.\n\n\n=== Development ===\nThe entire film was shot in Los Angeles County, over a period of about five weeks. The visit to Elvis Presley's grave was filmed in a park in Altadena, with a mock-up of the grave site. The band sings \"Heartbreak Hotel\" because that was the only Elvis song for which producer Karen Murphy could obtain rights.Rob Reiner procured $60,000 from Marble Arch Productions to write a screenplay with McKean, Guest and Shearer, based on the Spinal Tap characters. They realized after a few days of writing that no script could capture the kind of movie they wanted to make, so they decided instead to shoot a short demo of the proposed film. They shopped the demo around to various studios but had no takers, until television writer-producer Norman Lear decided to back the project.Virtually all dialogue in the film is improvised. Actors were given outlines indicating where scenes would begin and end and character information necessary to avoid contradictions, but everything else came from the actors. As often as possible, the first take was used in the film, to capture natural reactions. Reiner wanted to list the entire cast as writers on the film to acknowledge their contributions, but the Writers' Guild objected, and so only he, Guest, McKean, and Shearer received writing credit.Veteran documentary cameraman Peter Smokler worked as cinematographer on the film. Smokler had great instincts for camera placement on set, according to Reiner, and is responsible for the film's handheld cinéma vérité style—although the cinematographer did not understand what was supposed to be funny about the movie. With Smokler behind the camera, the film was shot not as a feature film, but as a documentary, without a script or traditional shooting schedule. So much footage was filmed (over 100 hours) that it eventually required three editors to complete the film.Inspirations for the film included the documentaries Don't Look Back (1967), which was made about Bob Dylan, and The Last Waltz (1978), which was about The Band. The famous scene where Spinal Tap becomes lost backstage was inspired by a video of Tom Petty at a concert in Germany, walking through a series of doors trying to find the stage, but ending up on an indoor tennis court. Rob Reiner also went to see the English heavy metal band Judas Priest in concert as part of his preparation for the film. He later said, \"It physically hurt my chest. The reverberation in the hall was so strong that I couldn’t stay there any longer.\" According to Harry Shearer in the Criterion edition DVD commentary, keyboard player John Sinclair had just returned from touring with Uriah Heep when principal photography was about to begin, and told them how they had been booked to play an air force base. They subsequently used the story in the film.\nIn post-production, Christopher Guest was very concerned with the verisimilitude of the finger positions on the band's instruments during the concert scenes, and even re-shot some footage after the movie was edited to ensure their hands appeared in sync with the music.The character of Jeanine, David's disruptive girlfriend, was added during the production to provide a story-line to the material—in part to mollify studio executives who worried the movie would be plotless. Actress Victoria Tennant was briefly considered for the role, but June Chadwick won the part, thanks to her chemistry with the cast and her improvisation skills.Robert Bauer played the same character, Moke, in two Rob Reiner movies, The Sure Thing (1985) and this one.\n\n\n== Reception and legacy ==\n\n\n=== Critical reception ===\nSince its release, This Is Spinal Tap has received acclaim from critics and is widely regarded as one of the best films of 1984. The film holds a 95% \"Certified Fresh\" rating on the review aggregation website Rotten Tomatoes based on 66 reviews, with an average rating of 8.60/10. The site's critical consensus reads, \"Smartly directed, brilliantly acted, and packed with endlessly quotable moments, This Is Spinal Tap is an all-time comedy classic.\"Roger Ebert of the Chicago Sun-Times gave the film 4 stars out of 4 and wrote \"This Is Spinal Tap is one of the funniest, most intelligent, most original films of the year. The satire has a deft, wicked touch. Spinal Tap is not that much worse than, not that much different from, some successful rock bands.\" Ebert later placed the film on his ten best list of 1984 and would later include it in his Great Movies list in 2001 where he called it \"one of the funniest movies ever made\". Gene Siskel of the Chicago Tribune also awarded 4 out of 4 stars, writing, \"It is so well done, in fact, that unless you are clued in beforehand, it might take you a while to realize that the rock group under dissection in 'This Is Spinal Tap' does not really exist.\" Janet Maslin of The New York Times praised it as \"a witty, mischievous satire, and it's obviously a labor of love.\" In 2002, This Is Spinal Tap was deemed \"culturally, historically, or aesthetically significant\" by the Library of Congress and was selected for preservation in the United States National Film Registry.Critics praised the film not only for its satire of the rollercoaster lifestyles of rock stars but also for its take on the non-fiction film genre. David Ansen from Newsweek called the film \"a satire of the documentary form itself, complete with perfectly faded clips from old TV shows of the band in its mod and flower-child incarnations\".Even with cameos from Billy Crystal and Patrick Macnee, Spinal Tap still managed to trick many of its moviegoers into believing the band existed. Reiner observed that \"when Spinal Tap initially came out, everybody thought it was a real band... the reason it did go over everybody's head was that it was very close to home\".\n\n\n=== Reactions from musicians ===\n\nThe film resonated with many musicians. Jimmy Page, Robert Plant, Jerry Cantrell, Dee Snider and Ozzy Osbourne all reported that, like Spinal Tap, they had become lost in confusing arena backstage hallways trying to make their way to the stage. When Dokken's George Lynch saw the film he is said to have exclaimed, \"That's us! How'd they make a movie about us?\"Glenn Danzig had a similar reaction when comparing Spinal Tap to his former band The Misfits saying, \"When I first saw Spinal Tap, I was like, 'Hey, this is my old band.'\"Lars Ulrich told a press conference crowd that the Metallica/Guns N' Roses 1992 tour seemed \"so Spinal Tap.\" This tour was in support of Metallica's own \"black album\". Shortly after the tour started, Metallica's James Hetfield suffered third degree burns on his arms after he stood too close to a pyrotechnic device. Earlier in that tour, backstage at The Freddie Mercury Tribute Concert, Metallica met with Spinal Tap and discussed how their \"black album\" was a homage to Spinal Tap's Smell the Glove. This was captured on the Metallica DVD A Year and a Half in the Life of Metallica.\nIn a 1992 interview, Nirvana explain declining the offer to be a part of the film Singles. Kurt Cobain goes on to say, \"There's never really been a good documentary on rock and roll bands.\" Dave Grohl then cuts in saying, \"Except for Spinal Tap, [that] was the only rock movie worth watching,\" which Cobain agreed with, as well as mentioning Dont Look Back, by D.A. Pennebaker.\nAccording to a 1997 interview in Spin magazine with Aerosmith rhythm guitarist Brad Whitford, \"The first time Steven [Tyler] saw it he didn't see any humor in it.\" When the film was released, Aerosmith's most recent album, Rock in a Hard Place, depicted Stonehenge prominently on the cover.\nU2 guitarist The Edge said in the documentary It Might Get Loud that when he first saw Spinal Tap, \"I didn't laugh, I wept,\" because it summed up what a brainless swamp big-label rock music had become.\n\n\n=== Use of Spinal Tap as a descriptive term ===\nIt became a common insult for a pretentious band to be told they were funnier than Spinal Tap. As George Lynch put it, the more seriously a band took themselves, the more they resembled Spinal Tap. After seeing a 1986 performance by metal band Venom, singer Henry Rollins compared them to Spinal Tap. In their respective Behind the Music episodes, Quiet Riot's Rudy Sarzo and Ratt's Robbin Crosby compared their own bands to Spinal Tap to some extent. For example, as a parallel to the \"Shit Sandwich\" incident, Quiet Riot's fourth album Condition Critical was given the two-word review of \"Condition Terminal\" by J. D. Considine in Musician magazine. His review of the short-lived band GTR's eponymous debut LP in the same magazine was \"SHT\". R.E.M.'s Mike Mills described the band's early tours as \"very Spinal Tap\", citing, among other things, they had played at a United States Air Force base.\nJudas Priest, the heavy metal band that Rob Reiner saw in preparation for the film, has had many drummers in its career (eight in total), which the website Ultimate Classic Rock described as \"positively Spinal Tap-worthy\". Marillion guitarist Steve Rothery later described the run of five drummers in a year between his band's first two albums as \"like Spinal Tap\". In the Pearl Jam documentary Pearl Jam Twenty, the members jokingly refer to the fact that while the core lineup of the group has remained unchanged (singer Eddie Vedder, guitarists Mike McCready and Stone Gossard, and bassist Jeff Ament), the band has had five drummers. They describe this as \"very Spinal Tap of us\". In the documentary, a mock silent film called The Drummer Story is shown explaining what happened to their previous drummers. In it, one of them is almost eaten by a sea monster, only to be rescued by Eddie Vedder, playing a lifeguard.\nThe Canadian heavy metal band Anvil, whose drummer is named Robb Reiner, have been called \"the real Spinal Tap\" based on the misadventures depicted in their documentary Anvil! The Story of Anvil.\n\n\n=== Accolades ===\nIn 2008, Empire magazine ranked This Is Spinal Tap number 48 on its list of The 500 Greatest Movies of All Time. The New York Times placed the film on their list of The Best 1000 Movies Ever Made. In January 2010, Total Film placed This Is Spinal Tap on its list of The 100 Greatest Movies of All Time. When Entertainment Weekly compiled their list of The 100 Greatest Movies of All Time, the publication included the film as \"just too beloved to ignore\". In 2011, Time Out London named it the best comedy film of all time. In November 2015, the film was ranked the 11th funniest screenplay by the Writers Guild of America in its list of 101 Funniest Screenplays.This Is Spinal Tap at 35: Tribeca Film Festival (The Guardian)The film is recognized by American Film Institute in this list:\n\n2000: AFI's 100 Years...100 Laughs – #29\n\n\n== Lawsuit ==\nOn October 17, 2016, actor Harry Shearer filed a $125 million fraud and breach of contract lawsuit against both StudioCanal, the successor in interest to Embassy Pictures, and Vivendi, which owns the studio. Shearer claimed that he and the other co-stars of the film received only $179 for sales of merchandise and music over the prior three decades. Shearer's lawsuit was specifically directed at StudioCanal by ordering the studio to terminate the copyright to This Is Spinal Tap. In February 2017, Shearer's co-stars Christopher Guest and Michael McKean, as well as the film's director Rob Reiner, joined the lawsuit against StudioCanal and Vivendi, seeking $400 million in damages. In the same month, Vivendi made an attempt to motion to the court to dismiss the case. In September 2017, a judge dismissed Shearer, Reiner and McKean from the case. In October 2017, Spinal Tap revised their case by adding Universal Music Group (UMG, another division of Vivendi, whose Polydor label released the film's soundtrack) as a defendant, as well as the right to reclaim their copyrights to the film, its songs and characters.In August 2018, Judge Dolly Gee ruled that Guest, Reiner, McKean and Shearer may pursue the fraud claim against Vivendi.The case related to sales of the soundtrack was settled out of court by November 2019, with UMG retaining the distribution rights but with the music rights eventually returning to Shearer, Guest, and McKean in the future. A settlement between Vivendi, StudioCanal, and the cast on the merchandising aspect was reached in September 2020 with final details to be resolved in the following months.\n\n\n== Home media ==\nThis Is Spinal Tap was first released on VHS in 1984 by Embassy Home Entertainment, and in 1994 as part of the Criterion Collection on LaserDisc under the title, This Is Spinal Tap: Special Edition. It has also been released twice on DVD.\nThe first DVD release was a 1998 Criterion edition in letterbox format which used supplemental material from the 1994 Criterion LaserDisc release. It is their only double sided DVD in their catalogue. It included an audio commentary track with Christopher Guest, Michael McKean and Harry Shearer; a second audio commentary track with Rob Reiner, Karen Murphy, Robert Leighton and Kent Beyda; 79 minutes of deleted scenes; Spinal Tap: The Final Tour, the original twenty-minute short they shot to pitch the film; two trailers that feature Rob Reiner showing a film about cheese rolling (because \"Spinal Tap\" itself was still in the editing room); a TV promo, Heavy Metal Memories; and a music video for \"Hell Hole\". Sales of this edition were discontinued after only two years and the DVD has become a valuable collector's item. Much of this material had appeared on a 1994 CD-ROM by The Voyager Company that included the entire film in QuickTime format.\nIn 2000, MGM Home Entertainment released a special edition with more or less the same extras from the Criterion edition, plus a new audio commentary track with Guest, McKean and Shearer performing in character throughout, commenting on the film entirely in their fictional alter-egos, and often disapproving of how the film presents them; 70 minutes of deleted scenes (some of which were not on the Criterion DVD); a new short, Catching Up with Marty Di Bergi (where it is revealed that the members of Spinal Tap were very disappointed in Di Bergi for making a \"hatchet job\" of their film); the Heavy Metal Memories promo and six additional TV promos; music videos for \"Gimme Some Money\", \"Listen to the Flower People\" and \"Big Bottom\"; and segments of Spinal Tap appearing on The Joe Franklin Show. The special features were produced by Automat Pictures. However, this version of the film was missing the subtitles that appear throughout the film (for example, introducing band members, other personnel, and location names) and did not include the commentaries from the Criterion edition. The MGM DVD is missing the subtitles burned into the film; they have been replaced with player generated subtitles.\nA 25th Anniversary Edition Blu-ray Disc release was released on July 28, 2009. It includes all bonus features from the MGM DVD plus an interview with Nigel about Stonehenge and Stonehenge from the band's Live Earth performance. It does not include the commentaries from the Criterion Collection DVD, even though MGM had stated that they would be included in the earliest press release for the Blu-ray version (most likely due to legal issues), and does not feature a \"create your own avatars\" element teased in publicity. However, this version does restore the subtitles that introduce band members/locales/events/etc. that were missing from MGM's DVD. The alternative, Region B, UK edition of this version additionally features a new hour-long documentary featuring famous fans, the \"Bitch School\" promo, the EPK for the \"Back From The Dead\" album, an interview with the late Reg Presley discussing the influence of the Troggs tapes on the film, and the first hour (ending with an abrupt edit) of The Return Of Spinal Tap. It does however lose the Di Bergi short and the Joe Franklin clip.\n\n\n== Appearances in other media ==\n\nHarry Shearer, who played Derek Smalls, went on to become one of the main voice artists on The Simpsons, providing voices for Principal Skinner, Mr. Burns, Waylon Smithers, Ned Flanders and many others. The members of Spinal Tap reprised their roles  in \"The Otto Show\", first playing on a concert attended by Bart and Milhouse which escalates into a riot after the band's early exit, then having their tour bus run off the road by Otto in the school bus.\nThe Internet Movie Database normally only allows users to rate films up to ten stars, but specifically for Spinal Tap, the site allows users to rate the film eleven stars, referencing the \"Up to eleven\" scene. On IGN, This Is Spinal Tap was the only DVD—and seemingly the only thing reviewed on IGN—to get 11 out of 10. This scene was also used in some news reports on the death of James Charles \"Jim\" Marshall, founder of the famous amplifier company whose equipment is featured in the scene. Richard D. Titus, UX&D Controller for the BBC, adopted a Spinal Tap-inspired suggestion from a colleague that the BBC iPlayer should have a volume control that goes to eleven. The term has entered the vernacular, as with an autistic's description of sensory overload vis-à-vis a neurotypical's routine filtering.Fran Drescher reprised the role of Bobbi Flekman during the fifth season of her hit television sitcom The Nanny; it was the season's third episode, titled \"The Bobbi Flekman Story\". In the episode, Flekman is now a record label producer for The Brian Setzer Orchestra, and an ex-business partner of character Maxwell Sheffield (Charles Shaughnessy). Drescher's regular character Fran Fine believes Flekman is attempting to seduce Sheffield, and impersonates her to stop it.Outside the world of music, J. K. Rowling cited Spinal Tap's series of drummers as an inspiration for the Harry Potter series, in which something bad happens to every teacher of Defence against the Dark Arts at Hogwarts, causing them to leave the job without completing a full school year.A biographical comic book was released in 2018, That Was Spinal Tap, telling both the fictional story of the band and the real-life tale of the actors and others who created the characters and music. It was scripted by Rock 'N' Roll Comics co-creator Jay Allen Sanford.\n\n\n== Related works ==\n\"Christmas with the Devil\", 1984 follow-up single.\nInside Spinal Tap (1985), a rare companion book by Peter Occhiogrosso. In 1992 this was revised and expanded exclusively for the UK market.\nBoth Michael McKean and Harry Shearer appeared in character as David St. Hubbins and Derek Smalls as part of the all-star charity group Hear 'n Aid. The group issued the single \"Stars\" in early 1986 which charted in the UK, hitting #26. St. Hubbins and Smalls were two of the dozens of well-known heavy metal artists who participated and were credited on the record, and can be seen in the video.\nBreak Like the Wind (1992), album.\n\"The Otto Show\", a 1992 episode of The Simpsons which features Spinal Tap.\nA two-hour, made-for-TV sequel, The Return of Spinal Tap, was broadcast and released on video in 1992 to promote Break Like the Wind. It consisted mostly of footage from an actual Spinal Tap concert at the Royal Albert Hall. In it the \"Stonehenge\" joke from the original movie is referenced, as the new, large prop is instead too big to get into the venue.\nThis Is Spinal Tap: The Official Companion (ISBN 0-7475-4218-X) was published in 2000. It featured a \"Tapistory\", full transcript of the film (including outtakes), a discography, lyrics and an A–Z of the band. This book largely recycles material from the Peter Occhiogrosso book and Criterion DVD commentaries.\nBack from the Dead, 2009 album and DVD.\nUnplugged and Unwigged, 2009 live DVD of Guest, McKean, and Shearer performing songs from their various works.\nSmalls Change (Meditations on Ageing), 2018 solo album by Shearer as Derek Smalls.\n\n\n== See also ==\n\nThe Big Picture (1989)\n\n\n== References ==\n\n\n== External links ==\nThis Is Spinal Tap at IMDb\nThis Is Spinal Tap at the TCM Movie Database\nThis Is Spinal Tap at AllMovie\nThis Is Spinal Tap an essay by Peter Occhiogrosso at the Criterion Collection"