"Jesus Christ Superstar is a 1970 rock opera with music by Andrew Lloyd Webber and lyrics by Tim Rice. Initially unable to get backing for a stage production, the composers released it as a rock opera album musical. The success of the album led to the show's Broadway on-stage debut in 1971. The musical is sung-through, with no spoken dialogue. The story is loosely based on the Gospels' accounts of the last week of Jesus's life, beginning with the preparation for the arrival of Jesus and his disciples  in Jerusalem and ending with the crucifixion. It depicts political and interpersonal struggles between Judas Iscariot and Jesus that are not present in the Bible.\nThe work interprets the psychology of Jesus and other characters. Much of the plot centres on Judas, who is dissatisfied with the direction in which Jesus is steering his disciples. Contemporary attitudes, sensibilities and slang pervade the rock opera's lyrics, and ironic allusions to modern life are scattered throughout the depiction of political events. Stage and film productions accordingly contain many intentional anachronisms.\nBy 1980, the musical had grossed more than $237 million worldwide.\n\n\n== Plot ==\n\n\n=== Act I ===\nJudas Iscariot, one of the Twelve Apostles, worries that the followers of Jesus are getting out of control and may be seen as a threat by the Roman Empire, who might harshly suppress them (\"Heaven on Their Minds\").\nThe other apostles anticipate going to Jerusalem with Jesus and ask him about his plans, but Jesus tells them not to worry about the future (\"What's the Buzz\"). Mary Magdalene tries to help Jesus relax. Judas tells Jesus that he should not associate with Mary, because a relationship with a sex-worker could be seen as inconsistent with his own teachings and be used against him (\"Strange Thing Mystifying\"). Jesus tells Judas that he should not judge others unless he is without sin. Jesus then reproaches the apostles and complains that none of them truly cares about him. Mary Magdalene tries to reassure Jesus while anointing him with oil (\"Everything's Alright\"). Judas angrily says that the money spent on oil should have been used to help the poor. Jesus answers that they do not have the resources to end poverty, and that they should be glad for what comforts they have.\nMeanwhile, Caiaphas, the High Priest of Israel, assembles the Pharisees and priests. Like Judas they fear that Jesus's followers will be seen as a threat by the Romans, and that many Jews might suffer the consequences. Caiaphas concludes that for the greater good, Jesus must be killed (\"This Jesus Must Die\"). As Jesus and his followers arrive exultantly in Jerusalem, they are confronted by Caiaphas, who demands that Jesus disperse the crowd. Jesus instead greets the happy crowd (\"Hosanna\"). Then Simon the Zealot suggests that Jesus lead his mob in a war against Rome and gain absolute power. Jesus rejects this, stating that none of his followers understand what true power is (\"Simon Zealotes/Poor Jerusalem\").\nPontius Pilate, the governor of Judea, has a dream in which he meets a Galilean and then receives the blame for the man's violent death at the hands of a mob (\"Pilate's Dream\"). Jesus arrives at the Temple and finds that it is being used as a marketplace; angered by this, he drives everyone out (\"The Temple\"). A group of lepers ask Jesus to heal them. Their number increases, and overwhelmed, Jesus rejects them. Mary Magdalene sings him to sleep (\"Everything's Alright (Reprise)\"). While he sleeps, Mary acknowledges that she is in love with him, and it frightens her (\"I Don't Know How to Love Him\").\nConflicted, Judas seeks out the Pharisees and proposes helping them arrest Jesus, believing that Jesus is out of control and that Jesus himself would approve of his action. In exchange for his help, Judas is offered thirty pieces of silver. Judas initially refuses, then accepts when Caiaphas suggests that he can use the money to help the poor (\"Damned for All Time/Blood Money\").\n\n\n=== Act II ===\nAt the Last Supper, Jesus is stung when the others get drunk and pay little attention to him. He remarks that \"for all you care\" the wine they are drinking could be his blood and the bread his body. He asks them to remember him, then frustrated by their lack of understanding, he predicts that Peter will deny him three times that night, and that another one of them will betray him. Judas admits that he is the one who will betray Jesus and, saying that he does not understand why Jesus did not plan things better, leaves (\"The Last Supper\").\nThe remaining apostles fall asleep, and Jesus retreats to the Garden of Gethsemane to pray (\"Gethsemane (I Only Want to Say)\"). He tells God his doubts about whether his mission has had any success, and angrily demands to know why he should continue and suffer the horrible death that awaits him. Receiving no answer, he realises that he cannot defy God's will, and surrenders to God.\nJudas arrives with Roman soldiers and identifies Jesus by kissing him on the cheek (\"The Arrest\"). When Jesus is brought to trial before the Sanhedrin, Caiaphas demands to know if he calls himself the Son of God, and Jesus responds merely \"That's what you say\". Caiaphas says that this is sufficient evidence and sends him to Pilate. Meanwhile, Peter is confronted by three people, to whom he denies that he knows Jesus (\"Peter's Denial\"). Mary observes that Jesus had predicted this.\nPilate asks Jesus if he is the King of the Jews. Jesus again answers \"That's what you say\". Since Jesus is from Galilee, Pilate says that he is not under his jurisdiction and sends him to King Herod (\"Pilate and Christ\"). The flamboyant King Herod asks Jesus to prove his divinity by performing miracles (\"King Herod's Song\"), but Jesus ignores him. Herod angrily sends him back to Pilate. Mary Magdalene, Peter, and the apostles remember when they first began following Jesus, and wish that they could return to a time of peace (\"Could We Start Again, Please?\").\nJudas is horrified at Jesus's harsh treatment. He expresses regret to the Pharisees, fearing that he will forever be remembered as a traitor. Caiaphas and Annas assure him that he has done the right thing. Judas throws down the money he was given and storms out. He curses God for manipulating him, and commits suicide (\"Judas's Death\").\nAt Jesus's trial, Pilate attempts to interrogate Jesus, but is cut off by a bloodthirsty mob which demands that Jesus be crucified. He tells the mob that Jesus has committed no crime and does not deserve to die, but to satisfy the mob he will have Jesus flogged (\"Trial Before Pilate\"). Pilate pleads with Jesus to defend himself, but Jesus says weakly that everything has been determined by God. The crowd still calls for Jesus's death and finally Pilate reluctantly agrees to crucify Jesus.\nAs Jesus awaits crucifixion, the spirit of Judas returns and questions why Jesus chose to arrive in the manner and time that he did, and if it was all part of a divine plan (\"Superstar\"). Jesus is crucified, recites his final words and dies (\"The Crucifixion\"). \n\n\n== Principal roles ==\n\n\n== Musical numbers ==\n\n\n== Production ==\n\nThe songs were first written and conceived as an album musical, before the musical was created and staged. On the original album, the part of Jesus was sung by Ian Gillan, with Murray Head as Judas, Michael d'Abo as King Herod, Yvonne Elliman as Mary Magdalene, and Barry Dennen as Pilate. In July 1971, the first authorised American concert of the rock opera took place in front of an audience of 13,000 people at Pittsburgh, Pennsylvania's Civic Arena with Jeff Fenholt singing the role of Jesus, Carl Anderson as Judas and Elliman repeating as Mary Magdalene.In August 1971, MCA Records executive David Skepner reported that MCA had been investigating and shutting down 21 unauthorised productions in the US to protect the rights of London-based Leeds Music who owned the musical. The biggest violations Skepner found were a theatre troupe from Toronto that had crossed the US–Canada border to perform with the Detroit Symphony Orchestra, with only a few hours prior announcement, and another big production mounted by the Las Vegas Hilton. Other American cities with unauthorised productions included Washington D.C., Boston, Kansas City, Baltimore, San Francisco, Cincinnati, Richmond, Louisville, Cleveland, St. Louis, Memphis, Atlanta, Columbus, Troy, Philadelphia, Los Angeles, New Orleans, Brooklyn in New York City and Hollywood, Florida. Court injunctions were obtained in each of these cities to close the shows. Producer Robert Stigwood, who was assembling an authorised touring company, called these unsanctioned groups \"outright pirates\", stressing that he would continue to protect his rights by \"relentlessly\" pursuing legal action.\n\n\n=== Original Broadway production ===\nThe musical opened on Broadway on 12 October 1971, directed by Tom O'Horgan, at the Mark Hellinger Theatre. It starred Jeff Fenholt as Jesus, Ben Vereen as Judas and Bob Bingham as Caiaphas. Dennen and Elliman played the roles that they had sung on the album. Paul Ainsley was Herod. Anderson replaced Vereen when he fell ill, and the two performers later took turns playing the role. The show closed on 30 June 1973 after 711 performances. The production received mixed reviews; the bold casting of African-Americans as Judas was lauded, but reviewer Clive Barnes from The New York Times said, \"the real disappointment was not in the music ... but in the conception.\"  The show was nominated for five Tony Awards, including Best Score, but won none. Lloyd Webber won a Drama Desk Award as \"Most Promising Composer\", and Vereen won a Theatre World Award.\n\n\n=== Controversy ===\nThe Broadway show and subsequent productions were condemned by some religious groups. Tim Rice was quoted as saying \"It happens that we don't see Christ as God but simply the right man at the right time at the right place.\" Some Christians considered such comments to be blasphemous, the character of Judas too sympathetic and some of his criticisms of Jesus offensive. The musical's lack of allusion to the resurrection of Jesus has resulted in criticism similar to that of fellow musical Godspell, which also did not clearly depict the resurrection.\nAt the same time, some Jews claimed that it bolstered the antisemitic belief that the Jews were responsible for Jesus's death by showing most of the villains as Jewish (Caiaphas and the other priests, Herod) and showing the crowd in Jerusalem calling for the crucifixion. The musical was banned in South Africa for being \"irreligious\". A 1972 production of the play was banned in the Hungarian People's Republic for \"distribution of religious propaganda\".\n\n\n=== Other 1970s and 1980s productions ===\n\nSuperstar opened at the Palace Theatre in London in 1972, starring Paul Nicholas as Jesus, Stephen Tate as Judas and Dana Gillespie as Mary Magdalene. It was directed by Australian Jim Sharman. This production was much more successful than the original production on Broadway, running for eight years and becoming the United Kingdom's longest-running musical at the time. Dmitri Shostakovich attended this production in London just before his death. He regretted that he could not have composed something like it; he lauded especially a rock band underpinning full symphonic strings, brass and woodwind.One of the earliest foreign productions was a five-day run in Sweden at Scandinavium in Gothenburg, opening on 18 February 1972 and playing to 74,000 people (a record at the time). Starring as Mary Magdalene was Agnetha Fältskog. On 16 March 1972 an oratorio version was performed at Memorial Drive Park in Adelaide, South Australia as part of the Adelaide Festival of the Arts. This was followed in May by the first full Australian production, at the Capitol Theatre, Sydney, later moving to the Palais Theatre in Melbourne. Sharman again directed, and the cast included Trevor White as Jesus, Jon English as Judas, and Michele Fawdon (1972–1973) and Marcia Hines (1973–1974) as Mary Magdalene. Hines was the first black woman to play the role. Other cast members included Reg Livermore, John Paul Young, Stevie Wright and Rory O'Donoghue as well as Graham Russell and Russell Hitchcock who met during the production and subsequently formed the band Air Supply. The production ran until February 1974. In June 1972 the show opened in Belgrade, Yugoslavia, in Atelje 212 theatre, in adaptation by Jovan Ćirilov. The role of Jesus Christ was played by Korni Grupa vocalist Zlatko Pejaković, the role of Mary Magdalene by Azra Halinović and the role of Pontius Pilate by Branko Milićević. The premiere was directly broadcast by Radio Television of Belgrade. Bora Đorđević and Srđan Marjanović, at the time little known musicians, also participated as members of the choir. The production was praised by the Yugoslav public.In 1973, the show opened in Paris at the Théâtre de Chaillot in a French adaptation by Pierre Delanoë. The title role was sung by Daniel Beretta, and Mary Magdalena was Anne-Marie David. The critics were unimpressed, and the production stopped after 30 performances. In the same year, Noel Pearson produced the show at the Gaiety Theatre, Dublin, Republic of Ireland, with Luke Kelly giving a critically acclaimed performance as King Herod. In 1974, first Spanish-language production ran in Mexico with the title \"Jesucristo Super Estrella\". Julissa played Mary Magdalen. The musical was seen in 1974 in Peru and Singapore.Robert Stigwood launched two road touring companies in 1971 to cover North America, with Robert Corff and Tom Westerman as Jesus, respectively. The first major US National Tour, however began In 1976, managed by Laura Shapiro Kramer. The tour continued until 1980. In 1977, the show had its first Broadway revival, running from 23 November 1977 to 12 February 1978. It was directed by William Daniel Grey, with choreography by Kelly Carrol and starred William Daniel Grey as Jesus, Patrick Jude as Judas, and Barbara Niles as Mary Magdalene. Regional productions followed.In 1981, Emilio de Soto directed an English-language version in Venezuela, with 163 actors. From 1982 to 1984, an Australian production toured Australia and South-East Asia, directed by Trevor White, who also reprised his role of Jesus. The cast included Doug Parkinson as Judas and Marcia Hines (reprising her role as Mary Magdalene).\n\n\n=== 1990s and 2000s ===\nThe North American touring revival of Superstar in 1992 starred Neeley and Anderson reprising their respective Broadway and 1973 film roles as Jesus and Judas, receiving positive reviews for their performances. This production also starred both Dennis DeYoung as Pilate, and Syreeta and Irene Cara sharing Mary Magdalene. Originally expected to run for three to four months, the tour ended up running for five years. Original cast replacements to this tour included Christine Rea as Mary Magdalene, Jason Raize as Pontius Pilate and Simone as the Maid by the Fire and understudy for Mary. In 1994, a New Zealand production starred Darryl Lovegrove as Jesus, Jay Laga'aia as Judas and Frankie Stevens as Caiaphas. Also in 1994, a stage version titled Jesus Christ Superstar: A Resurrection was performed in Atlanta, Austin and Seattle featuring Amy Ray and Emily Saliers of the Indigo Girls as  Jesus and Mary Magdalene respectively, and Michael Lorant as Judas.\nIn 1996, the musical was revived in London at the Lyceum Theatre and ran for a year and a half. Directed by Gale Edwards, it starred Steve Balsamo and Zubin Varla as Jesus and Judas, and Joanna Ampil as Mary Magdalene and Alice Cooper as King Herod. The production was nominated for an Olivier Award for Best Musical Revival but did not win. It was followed by a UK tour. This production was revived on Broadway at the Ford Center for the Performing Arts in 2000, starring Glenn Carter as Jesus and Tony Vincent as Judas. It opened to mixed reviews and ran for 161 performances. It was nominated for a Tony Award for Best Revival of a Musical but did not win. In 2002, a national tour starred Sebastian Bach as Jesus and Anderson once again as Judas. Bach received mixed reviews while Anderson was again praised. In April 2003, Bach was replaced by Eric Kunze. Anderson left the show later in 2003 after being diagnosed with leukaemia and died in 2004. The tour closed shortly after Anderson's departure.\nIn 2004 a year-long UK tour began, directed by Bob Tomson and Bill Kenwright. Carter reprised his role as Jesus, with James Fox as Judas. In 2005, a successful Scandinavian tour starred Australian Peter Murphy (Jesus), American Kristen Cummings (Mary), Englishman Jon Boydon née Stokes (Judas), Frenchman Jérôme Pradon (King Herod) and Australian Michael-John Hurney (Pilate). A US tour starring Neeley, reprising his role as Jesus, Corey Glover as Judas, and Christine Rea as Mary, began in 2006 and played for five years. A Chilean heavy metal version has played annually in Santiago since 2004. In Boston, Gary Cherone portrayed Jesus in productions in 1994, 1996 and 2003 and Judas in 2000.\n\n\n=== 2010s ===\nA new production of Jesus Christ Superstar was mounted at the Stratford Shakespeare Festival, in Stratford, Ontario, in 2011. Directed by Des McAnuff, the cast starred Paul Nolan as Jesus, Josh Young as Judas, Brent Carver as Pilate, Chilina Kennedy as Mary Magdalene, Bruce Dow as Herod and Melissa O'Neil as Martha. This moved to La Jolla Playhouse later in the year and transferred to the Neil Simon Theatre on Broadway in 2012, with Tom Hewitt taking over the role of Pilate. Reviews were mixed. The revival was nominated for two Tonys: Best Revival and, for Young, Best Actor. Neither award was won, but Young won a Theatre World Award. The revival closed after 116 performances and 24 previews.Through a 2012 ITV competition TV show called Superstar, produced by Andrew Lloyd Webber, the UK public chose Ben Forster for the role of Jesus in an arena tour of the musical, beginning at O2 in September 2012. The production also starred Tim Minchin as Judas, Melanie C as Mary Magdalene and Chris Moyles as King Herod. Lloyd Webber stated, \"The funny thing is that Jesus Christ Superstar [as a rock concert] is what we actually intended it to be. When it is done in a conventional proscenium theatre production it feels shoe-horned in. That is why I wanted to do this.\" The tour resumed in March 2013 in the UK, and an Australian leg of the tour commenced in Perth in May 2013. Andrew O'Keefe played King Herod in Australia, with Jon Stevens as Pilate. Stevens had played Judas in an Australian arena tour in 1992.In 2016, celebrating 45 years since the musical debuted on Broadway, Jesus Christ Superstar returned to London at Regent's Park Open Air Theatre from 15 July to 27 August, directed by Timothy Sheader. The production won the BBC Radio 2 Audience Award for Best Musical at the Evening Standard Theatre Awards, and a Laurence Olivier Award for Best Musical Revival. The production returned to the Open Air Theatre as part of the 2017 season, running from 11 August 2017 to 23 September.  Additionally, the Lyric Opera of Chicago hosted a run of the production from late April 2018 to late May 2018. before returning to London at the Barbican Centre from 9 July to 24 August 2019 prior to a 50th anniversary US tour from October 2019. However due to the COVID-19 pandemic, the US tour was cancelled from March 2020. The production returned to Regent's Park Open Air Theatre in a socially distanced environment in a concert staging titled Jesus Christ Superstar: The Concert from 14 August to 27 September 2020.\n\n\n=== Notable international productions ===\n\nTwo notable Jesuses were Takeshi Kaga, in the 1976 Japanese production, and Camilo Sesto in the 1975 Spanish production. Mary Magdalene was played by Rocío Banquells in a 1981 production in Mexico. A Czech version premiered in 1994 in Prague's Spirála Theatre and ran until 1998, with 1288 performances. In the 2000s, a Venezuelan production ran for two years (2006–2008), directed by Michel Hausmann. A Spanish production produced by Stage Entertainment ran from 2007 to 2009, followed by long-running productions in Italy and Sweden (featuring Ola Salo) and Norway.\nConcerts of the show have been mounted in Vienna, Austria, since 1981, including one on Easter of 2015 starring Drew Sarich in the title role.In 2010, an Australian production presented by Harvest Rain Theatre Company was directed by Tim O'Connor. Luke Kennedy appeared as Jesus, Naomi Price as Mary, Tod Strike as Judas, and Steven Tandy as Herod. A 2017 Professional Australian Production was staged at the Arts Centre Melbourne and starred Rob Mills as Jesus.\nA 2014 production in São Paulo, Brazil starred Igor Rickli as Jesus. Negra Li was Mary Magdalene. A 2014 production in Lima, Peru, at the Sarita Colonia prison, as part of a rehabilitation program for inmates, received some press. Eighty prisoners mounted the production, directed by inmate Freddy Battifora, who also played the role of Jesus. The Catholic Church approved of the production.In 2018 a new production, directed by Michael Hunt was premiered at the Perm Academic Theatre, Russia. Hunt worked closely with The Really Useful Group on a new translation together with the concept for a new staging. This rock opera is very popular in Russia but is the first authorised production to receive the support of the Really Useful Group.\n\n\n== Recordings and radio broadcasts ==\nThe original 1970 concept album was very popular; its 1971 release topped the US Billboard Pop Albums. The 1972 and 1992 Australian cast recordings were also both highly successful.In 1994, a studio recording under the name of Jesus Christ Superstar: A Resurrection was released.\nA 1996 radio production for BBC Radio 2 starred Tony Hadley as Jesus, Roger Daltrey as Judas, Frances Ruffelle as Mary Magdalene and Julian Clary as King Herod; this production was re-broadcast on BBC Radio 4 Extra on 6 August 2016.In May 2018, Aztec Records released a 1973 live recording of the Australian production; previous recordings of that production were released as \"bootleg\" copies.\n\n\n== Films ==\nA film adaptation of Jesus Christ Superstar was released in 1973. The film, directed by Norman Jewison, was shot in Israel and other Middle Eastern locations. Ted Neeley, Carl Anderson and Yvonne Elliman were each nominated for a Golden Globe Award for their portrayals of Jesus, Judas and Mary Magdalene, respectively. Bob Bingham (Caiaphas) and Barry Dennen (Pilate) also reprised their roles. A new song, called \"Then We Are Decided\" and phrased as a dialogue between Caiaphas and Annas, was written for this adaptation.\nA second adaptation was filmed in 1999, and released around the world on video in 2000 and 2001. It starred Glenn Carter as Jesus, Jérôme Pradon as Judas, Reneé Castle as Mary Magdalene, and Rik Mayall as Herod, and was directed by Gale Edwards and Nick Morris. It was released on video in the UK in October 2000. In the U.S. it was released on VHS and DVD in March 2001, and aired on PBS's Great Performances series in April 2001.  It won the International Emmy Award for Best Performing Arts Film in November 2001. The style of the film is more like the stage version than the location-based 1973 adaptation, and it used many of the ideas from the 1996–1999 UK production.The 2012 UK arena tour pro-shot was released on the 19th November 2012. It starred Ben Forster, Tim Minchin, Melanie C.\n\n\n== Television ==\nOn Easter Sunday, 1 April 2018, NBC aired a live concert version of the show featuring John Legend as Jesus, Sara Bareilles as Mary Magdalene, Brandon Victor Dixon as Judas, Alice Cooper as King Herod, Norm Lewis as Caiaphas, Ben Daniels as Pilate, Jin Ha as Annas, Erik Grönwall as Simon Zealotes and Jason Tam as Peter.  Two years later, on Easter Sunday, 12 April 2020, the show was re-broadcast on NBC, with many U.S. households observing Easter at home while practicing social distancing during the COVID-19 pandemic.\n\n\n== Principal roles and casting history ==\n\n\n== Awards and nominations ==\n\n\n=== Original Broadway production ===\n\n\n=== 1996 London revival ===\n\n\n=== 2000 Broadway revival ===\n\n\n=== 2012 Broadway revival ===\n\n\n=== 2016 London revival ===\n\n\n== Further reading ==\nRobert M. Price. Jesus Christ Superstar: The Making of a Modern Gospel. eBookIt. 2011.\nEllis Nassour, Richard Broderick. Rock Opera: The Creation of Jesus Christ Superstar, from Record Album to Broadway Show and Motion Picture. Hawthorn Books, 1973.\n\n\n== References ==\n\n\n== External links ==\nJesus Christ Superstar, official website\nJesus Christ Superstar at the Internet Broadway Database\nReview on \"Cool Album of the Day\" of original London cast recording\nOriginal album cover artwork by Ernie Cefalu\nLargest online community for Jesus Christ Superstar JesusChristSuperstarZone.com\nJesus Christ Superstar, Andrew Lloyd Webber site\nJesus Christ Superstar, timrice.co.uk\nLyrics\nJesus Christ Superstar at Playbill Vault:\n1971 – Original production\n1977 – First revival\n2000 – Second revival\n2012 – Third revival\n\"Jesus Christ Superstar, orchestral score\". Victoria and Albert Museum. Archived from the original on 12 April 2011. Retrieved 24 March 2011.\nJesusmania!The Bootleg Superstar of Gettysburg College, about an illicit amateur production staged in March 1971"