"8 mm film is a motion picture film format in which the film strip is eight millimeters wide. It exists in two main versions – the original standard 8 mm film, also known as regular 8 mm, and Super 8. Although both standard 8 mm and Super 8 are 8 mm wide, Super 8 has a larger image area because of its smaller and more widely spaced perforations.\nThere are also two other varieties of Super 8 – Single 8 mm and Straight-8 – that require different cameras, but produce a final film with the same dimensions.\n\n\n== Standard 8 ==\n\nThe standard 8 mm (also known as regular 8) film format was developed by the Eastman Kodak company during the Great Depression and released to the market in 1932 to create a home movie format that was less expensive than 16 mm.\nDouble 8 spools actually contain a 16 mm film with twice as many perforations along each edge as normal 16 mm film; on its first pass through the camera, the film is exposed only along half of its width. When the first pass is complete, the operator opens the camera and flips and swaps the spools (the design of the spool hole ensures that the operator does this properly) and the same film is subsequently exposed along its other edge, the edge left unexposed on the first pass. After the film is developed, the processor splits it down the middle, resulting in two lengths of 8 mm film, each with a single row of perforations along one edge.  Each frame is half the width and half the height of a 16 mm frame, so there are four times the number of frames in a given film area, which is what makes it cost less. Because of the two passes of the film, the format was sometimes called Double 8. The frame size of regular 8 mm is 4.8 mm × 3.5 mm and 1 meter of film contains 264 pictures. Normally Double 8 is filmed at 16 or 18 frames per second.\nCommon length film spools allowed filming of about 3 to 4+1⁄2 minutes at 12, 15, 16 and 18 frames per second.\n\nKodak ceased sales of standard 8 mm film under its own brand in the early 1990s, but continued to manufacture the film, which was sold via independent film stores. Black-and-white 8 mm film is still manufactured in the Czech Republic, and several companies buy bulk quantities of 16 mm film to make regular 8 mm by re-perforating the stock, cutting it into 25 foot (7.6 m) lengths, and collecting it into special standard 8 mm spools, which they then sell. Re-perforation requires special equipment. Some specialists also produce Super 8 mm film from existing 16 mm, or even 35 mm film stock.\n\n\n=== Sound ===\nWhen Eastman Kodak first conceived the 8 mm format, no provision was made for the addition of a sound track. Nevertheless, in the 1960s, projectors appeared on the market that were capable of recording and replaying sound from a magnetic stripe applied to the film after it had been processed. The only part of the film wide enough to accept such a magnetic stripe was the area between the edge and the perforations. A much narrower stripe was sometimes added to the opposite edge so that the film piled up evenly on the spool, but was never used for sound.  The sound to picture separation was the same dimensionally as 16 mm film and as that format is 28 frames, that meant that the Double-8 system was 56 frames. The proximity of the sound stripe to the perforations caused some problems in keeping the film in close contact with the sound head. There was never an optical system.\nA few sound prints appeared for the use in double 8 projectors.\n\n\n== Super 8 ==\n\nIn 1965, Super-8 film was released and was quickly adopted by many amateur film-makers. It featured a better quality image, and was easier to use mainly due to a cartridge-loading system that did not require reloading and rethreading halfway through. Super 8 was often erroneously criticized, since the film gates in some cheaper Super 8 cameras were plastic, as was the pressure plate built into the cartridge; the standard 8 cameras had a permanent metal film gate that was regarded as more reliable in keeping the film flat and the image in focus.  In reality, this was not the case.  The plastic pressure plate could be moulded to far tighter tolerances than their metal counterparts could be machined.To easily differentiate Super 8 film from Standard 8, projector spools for the former had larger spindle holes.  Therefore, it was not possible to mount a Super 8 spool on a Standard 8 projector, and vice versa.\n\n\n=== Sound ===\nThe Super 8 format was designed from the start to accommodate a sound track (one of the surprisingly few film formats to do so). This track would occupy the area between the edge of the film and the image area. As in the double 8 system, a second stripe was sometimes added between the edge and the perforations. The image to sound distance was much shorter for the Super 8 system at just 18 frames.\nAt first, the magnetic stripe had to be applied after the film was processed and recorded on a suitable projector. In the 1970s, cameras appeared which were able to record live sound directly onto pre-striped film. This film was loaded into oversize cartridges that provided access for the camera's sound recording head. The camera would also accept non sound cartridges, but silent cameras could not accept sound cartridges. One major advantage of the Super 8 system was that as the camera pressure plate was a part of the cartridge, it could be moulded to the profile of the stripe(s)s on the film.\nProjectors also appeared on the market which took advantage of the balance stripe next to the perforations by recording and replaying stereo sound.\nProjectors appeared in the late 1970s that featured the ability to play films with an optical soundtrack. The image-sound separation for the optical format was 22 frames. These were never popular in the English speaking world and are consequently very rare in those countries. But they did enjoy some popularity in the Far East and Europe mainly because optical prints were cheaper.\nSound prints in Super 8 were plentiful and considering that they were very expensive by modern-day standards, sold in appreciable quantities. A two-reel print (running approximately 17 minutes) cost around $50, with feature films costing at least $150-plus. A few prints were also released with stereo sound. In Europe, optical prints were also popular and were appreciated for their often superior sound quality. In theory, magnetic prints should have been superior, but Super 8 magnetic prints were often poorly recorded after the picture was processed, due to high-speed, mass production techniques. An optical track, on the other hand, could be printed at the same time as the image and in equivalent quality.\n\n\n== Single 8 ==\n\nAnother version of Super-8 film, Single-8, was produced by Fuji in Japan. Introduced in 1965 as an alternative to the Kodak Super 8 format, it had the same final film dimensions, but with a different cassette. Unlike the co-axial design of Super 8, the Single 8 cartridge featured one spool above the other.\n\n\n=== Sound ===\nSingle-8's film format being identical to Super-8 means that everything written above regarding projectors for Super-8 applies equally to Single-8.\nCameras also appeared for the Single-8 system that were capable of directly recording to pre-striped film which was presented in an oversize Single-8 cartridge which provided access for the camera's sound recording head, in a similar manner to Super-8. The only difference was that film manufacturers initially had to manufacture the film with a rebated area for the sound stripe. This was because the pressure plate ensuring good film registration was part of the camera and not the cartridge. The sound film had to be the same overall thickness as silent film which the camera could also accept. Although the rebated stock was more expensive to manufacture, a balance stripe on the opposite side of the film was rendered unnecessary and offset the cost. Fuji later developed a thinner film that did not require rebating but the balance stripe was required because the thickness of the sound stripe was almost the same as the film base.\n\n\n== Straight Eight ==\n\nA number of camera companies offered single width 8 mm film in magazines or spools, but the format faded when Kodak introduced Kodachrome, as this was only available in the double 8 mm format. The first single run 8mm film was offered in 1935 with a Bell & Howell movie camera Filmo 127-A called Straight Eight. Single width 8 mm film revived in the United States by Bolsey-8 in 1956, and continued for some time outside the United States, with Germany Agfa Movex 8 between 1937 and 1950's, Soviet Union KOMZ Ekran movie cameras and Svema offering reversal film in 1960's.\n\n\n== UltraPan 8 ==\nIntroduced in 2011 by Nicholas Kovats, and implemented by Jean-Louis Seguin, this format uses Standard 8 film in a modified Bolex (H16 or H8) camera. Similar to the Techniscope cameras of the 1960s, UltraPan 8 achieves wider aspect ratios generally reserved for camera systems with anamorphic lenses through manipulating film negative exposure instead of light capture. The area of film exposed per frame is 10.52 mm × 3.75 mm, having an aspect ratio of 2.8:1. There are effectively two UP8 frames for every one 16 mm frame. The design means there is no waste of film emulsion for the targeted aspect ratio. Earlier versions of this general idea date from the 1950s and exactly the same design occurs in implementations of the 1960s and 1970s. The current implementation of the idea gains impetus from the relative ease with which digital delivery systems can handle what would otherwise have required, in the past, either a dedicated mechanical projector or the transfer to another film format for which projectors were already available.\n\n\n== See also ==\nList of film formats\nList of silent films released on 8 mm or Super 8 mm film\nZapruder film\n\n\n== References ==\n\n\n== External links ==\nFilm formats history"