"Leonard Norman Cohen  (September 21, 1934 – November 7, 2016) was a Canadian singer-songwriter, poet, and novelist. His work explored religion, politics, isolation, depression, sexuality, loss, death and romantic relationships. Cohen was inducted into the Canadian Music Hall of Fame, the Canadian Songwriters Hall of Fame, and the Rock and Roll Hall of Fame. He was invested as a Companion of the Order of Canada, the nation's highest civilian honour. In 2011, Cohen received one of the Prince of Asturias Awards for literature and the ninth Glenn Gould Prize.\nCohen pursued a career as a poet and novelist during the 1950s and early 1960s, and did not begin a music career until 1967 at the age of 33. His first album, Songs of Leonard Cohen (1967), was followed by three more albums of folk music: Songs from a Room (1969), Songs of Love and Hate (1971) and New Skin for the Old Ceremony (1974). His 1977 record Death of a Ladies' Man, co-written and produced by Phil Spector, was a move away from Cohen's previous minimalist sound. In 1979, Cohen returned with the more traditional Recent Songs, which blended his acoustic style with jazz, East Asian, and Mediterranean influences. Cohen's most famous song, \"Hallelujah\", was first released on his studio album Various Positions in 1984. I'm Your Man in 1988 marked Cohen's turn to synthesized productions. In 1992, Cohen released its follow-up, The Future, which had dark lyrics and references to political and social unrest.\nCohen returned to music in 2001 with the release of Ten New Songs, which was a major hit in Canada and Europe. His 11th album, Dear Heather, followed in 2004. Following a successful string of tours between 2008 and 2013, Cohen released three albums in the final four years of his life: Old Ideas (2012), Popular Problems (2014) and You Want It Darker (2016), the last of which was released three weeks before his death. A posthumous album titled Thanks for the Dance was released in November 2019, his fifteenth and final studio album.\n\n\n== Early life ==\nLeonard Cohen was born in the Montreal suburb of Westmount, Quebec on September 21, 1934. His Lithuanian-born mother, Marsha (\"Masha\") Klonitsky (1905–1978), was the daughter of a Talmudic writer, Rabbi Solomon Klonitsky-Kline, and emigrated to Canada in 1927. His paternal grandfather, whose family had moved from Poland to Canada, was Lyon Cohen, the founding president of the Canadian Jewish Congress. His parents gave him the Jewish name Eliezer, which means 'God helps'. His father, Nathan Bernard Cohen (1891–1944), who owned a substantial clothing store, died when Cohen was nine years old. The family observed Orthodox Judaism, and belonged to Congregation Shaar Hashomayim, to which Cohen retained connections for the rest of his life. On the topic of being a kohen, Cohen told Richard Goldstein in 1967, \"I had a very Messianic childhood. I was told I was a descendant of Aaron, the high priest.\"Cohen attended Roslyn Elementary School and completed grades seven through nine at Herzliah High School, where his literary mentor Irving Layton taught, then transferred in 1948 to Westmount High School, where he studied music and poetry. He became especially interested in the poetry of Federico García Lorca. Cohen involved himself actively beyond Westmount's curriculum, in photography, on the yearbook staff, as a cheerleader, in the arts and current events clubs, and even served in the position of president of the Students' Council while \"heavily involved in the school's theater program\". During that time, Cohen taught himself to play the acoustic guitar, and formed a country–folk group that he called the Buckskin Boys. After a young Spanish guitar player taught him \"a few chords and some flamenco\", Cohen switched to a classical guitar. He has attributed his love of music to his mother, who sang songs around the house: \"I know that those changes, those melodies, touched me very much. She would sing with us when I took my guitar to a restaurant with some friends; my mother would come, and we'd often sing all night.Cohen frequented Montreal's Saint Laurent Boulevard for fun and ate at such places as the Main Deli Steak House. According to journalist David Sax, Cohen and one of his cousins would go to the Main Deli to \"watch the gangsters, pimps, and wrestlers dance around the night\". Cohen enjoyed the formerly raucous bars of Old Montreal as well as Saint Joseph's Oratory, which had the restaurant nearest to Westmount, for him and his friend Mort Rosengarten to share coffee and cigarettes. When Cohen left Westmount, he purchased a place on Saint-Laurent Boulevard, in the previously working-class neighbourhood of Little Portugal. He would read his poetry at assorted nearby clubs. In that period and that place, Cohen wrote the lyrics to some of his most famous songs.\n\n\n== Poetry and novels ==\n\nIn 1951, Cohen enrolled at McGill University, where he became president of the McGill Debating Union and won the Chester MacNaghten Literary Competition for the poems \"Sparrows\" and \"Thoughts of a Landsman\". Cohen published his first poems in March 1954 in the magazine CIV/n. The issue also included poems by Cohen's poet–professors (who were also on the editorial board) Irving Layton and Louis Dudek. Cohen graduated from McGill the following year with a B.A. degree. His literary influences during this time included William Butler Yeats, Irving Layton (who taught political science at McGill and became both Cohen's mentor and his friend), Walt Whitman, Federico García Lorca, and Henry Miller. His first published book of poetry, Let Us Compare Mythologies (1956), was published by Dudek as the first book in the McGill Poetry Series the year after Cohen's graduation. The book contained poems written largely when Cohen was between the ages of 15 and 20, and Cohen dedicated the book to his late father. The well-known Canadian literary critic Northrop Frye wrote a review of the book in which he gave Cohen \"restrained praise\".After completing his undergraduate degree, Cohen spent a term in the McGill Faculty of Law and then a year (1956–1957) at the Columbia University School of General Studies. Cohen described his graduate school experience as \"passion without flesh, love without climax\". Consequently, Cohen left New York and returned to Montreal in 1957, working various odd jobs and focusing on the writing of fiction and poetry, including the poems for his next book, The Spice-Box of Earth (1961), which was the first book that Cohen published through the Canadian publishing company McClelland & Stewart. His father's will provided him with a modest trust income sufficient to allow him to pursue his literary ambitions for the time, and The Spice-Box of Earth was successful in helping to expand the audience for Cohen's poetry, helping him reach out to the poetry scene in Canada, outside the confines of McGill University. The book also helped Cohen gain critical recognition as an important new voice in Canadian poetry. One of Cohen's biographers, Ira Nadel, stated that \"reaction to the finished book was enthusiastic and admiring....\"The critic Robert Weaver found it powerful and declared that Cohen was 'probably the best young poet in English Canada right now.'\"Cohen continued to write poetry and fiction throughout the 1960s and preferred to live in quasi-reclusive circumstances after he bought a house on Hydra, a Greek island in the Saronic Gulf. While living and writing on Hydra, Cohen published the poetry collection Flowers for Hitler (1964), and the novels The Favourite Game (1963) and Beautiful Losers (1966). His novel The Favourite Game was an autobiographical bildungsroman about a young man who discovers his identity through writing. Beautiful Losers received a good deal of attention from the Canadian press and stirred up controversy because of a number of sexually graphic passages. Regarding Beautiful Losers, the Boston Globe stated: \"James Joyce is not dead. He is living in Montreal under the name of Cohen.\" In 1966 Cohen also published Parasites of Heaven, a book of poems. Both Beautiful Losers and Parasites of Heaven received mixed reviews and sold few copies.In 1966, CBC-TV producer Andrew Simon produced a local Montreal current affairs program, Seven on Six, and offered Cohen a position as host. \"I decided I'm going to be a songwriter. I want to write songs,\" Simon recalled Cohen telling him.And yet, despite his “disappointing” career, and before ever publishing a song, Cohen was the subject of a 44 minute long short documentary from the National Film Board, called ‘Ladies and Gentlemen... Mr Leonard Cohen’.\nSubsequently, Cohen published less, with major gaps, concentrating more on recording songs. In 1978 he published his first book of poetry in many years, Death of a Lady's Man (not to be confused with the album he released the previous year, the similarly titled Death of a Ladies' Man). It was not until 1984 that Cohen published his next book of poems, Book of Mercy, which won him the Canadian Authors Association Literary Award for Poetry. The book contains 50 prose-poems, influenced by the Hebrew Bible and Zen writings. Cohen himself referred to the pieces as \"prayers\". In 1993 Cohen published Stranger Music: Selected Poems and Songs, and in 2006, after 10 years of delays, additions, and rewritings, Book of Longing. The Book of Longing is dedicated to the poet Irving Layton. Also, during the late 1990s and 2000s, many of Cohen's new poems and lyrics were first published on the fan website The Leonard Cohen Files, including the original version of the poem \"A Thousand Kisses Deep\" (which Cohen later adapted for a song).Cohen's writing process, as he told an interviewer in 1998, was \"like a bear stumbling into a beehive or a honey cache: I'm stumbling right into it and getting stuck, and it's delicious and it's horrible and I'm in it and it's not very graceful and it's very awkward and it's very painful and yet there's something inevitable about it.\"In 2011, Cohen was awarded the Prince of Asturias Award for literature.His books have been translated into multiple languages, including Spanish.\n\n\n== Recording career ==\n\n\n=== 1960s and 1970s ===\nIn 1967, disappointed with his lack of success as a writer, Cohen moved to the United States to pursue a career as a folk music singer–songwriter. During the 1960s, he was a fringe figure in Andy Warhol's \"Factory\" crowd. Warhol speculated that Cohen had spent time listening to Nico in clubs and that this had influenced his musical style.His song \"Suzanne\" became a hit for Judy Collins (who subsequently covered a number of Cohen's other songs as well), and was for many years his most-covered song. Collins recalls that when she first met him, he said he couldn't sing or play the guitar, nor did he think \"Suzanne\" was even a song:\n\nAnd then he played me \"Suzanne\"  ... I said, \"Leonard, you must come with me to this big fundraiser I'm doing\" ... Jimi Hendrix was on it. He'd never sung [in front of a large audience] before then. He got out on stage and started singing. Everybody was going crazy—they loved it. And he stopped about halfway through and walked off the stage. Everybody went nuts. ... They demanded that he come back. And I demanded; I said, \"I'll go out with you.\" So we went out, and we sang it. And of course, that was the beginning.\n\nShe first introduced him to television audiences during one of her shows in 1966, where they performed duets of his songs. Still new to bringing his poetry to music, he once forgot the words to \"Suzanne\" while singing to a different audience. Singers such as Joan Baez have sung it during their tours. Cohen stated that he was duped into giving up the rights for the song, but was glad it happened, as it would be wrong to write a song that was so well loved and to get rich for it also. Collins told Bill Moyers, during a television interview, that she felt Cohen's Jewish background was an important influence on his words and music.After performing at a few folk festivals, he came to the attention of Columbia Records producer John Hammond, who signed Cohen to a record deal. Cohen's first album was Songs of Leonard Cohen (1967). He appeared on BBC TV in 1968 where he sang a duet from the album with Julie Felix. The album became a cult favorite in the US, as well as in the UK, where it spent over a year on the album charts. Several of the songs on that first album were covered by other popular folk artists, including James Taylor and Judy Collins. Cohen followed up that first album with Songs from a Room (1969, featuring the often-recorded \"Bird on the Wire\") and Songs of Love and Hate (1971).\nIn 1971, film director Robert Altman featured the songs \"The Stranger Song\", \"Winter Lady\", and \"Sisters of Mercy\", originally recorded for Songs of Leonard Cohen, in McCabe & Mrs. Miller. The film is now considered a masterpiece by some critics who also note that the songs are integral to the film. Scott Tobias wrote in 2014 that \"The film is unimaginable to me without the Cohen songs, which function as these mournful interstitials that unify the entire movie.\" Tim Grierson wrote in 2016, shortly after Cohen's death, that '\"Altman's and Cohen's legacies would forever be linked by McCabe. The movie is inextricably connected to Cohen's songs. It's impossible to imagine Altman's masterpiece without them.\"In 1970, Cohen toured for the first time, in the US, Canada, and Europe, and appeared at the Isle of Wight Festival. In 1972 he toured again in Europe and Israel. When his performance in Israel didn't seem to be going well, however, he walked off the stage, went to his dressing room, and took some LSD. He then heard the audience clamoring for his reappearance by singing to him in Hebrew, and under the influence of the psychedelic, he returned to finish the show. Additionally, in 1973 he played a special performance for a group of Israeli soldiers in the outposts of Sinai during the Yom Kippur War.In 1973, Columbia Records released \"Leonard Cohen: Live Songs\". Then beginning around 1974, Cohen's collaboration with pianist and arranger John Lissauer created a live sound praised by the critics. They toured together in 1974 in Europe and in US and Canada in late 1974 and early 1975, in support of Cohen's record New Skin for the Old Ceremony. In late 1975 Cohen and Lissauer performed a short series of shows in the US and Canada with a new band, in support of Cohen's Best Of release. The tour included new songs from an album in progress, co-written by Cohen and Lissauer and entitled Songs for Rebecca. None of the recordings from these live tours with Lissauer were ever officially released, and the album was abandoned in 1976.\nIn 1976, Cohen embarked on a new major European tour with a new band and changes in his sound and arrangements, again, in support of his The Best of Leonard Cohen release (in Europe retitled as Greatest Hits). Laura Branigan was one of his backup singers during the tour. From April to July, Cohen gave 55 shows, including his first appearance at the famous Montreux Jazz Festival.\nAfter the European tour of 1976, Cohen again attempted a new change in his style and arrangements: his new 1977 record, Death of a Ladies' Man  was co-written and produced by Phil Spector. One year later, in 1978, Cohen published a volume of poetry with the subtly revised title, Death of a Lady's Man.\n\nIn 1979, Cohen returned with the more traditional Recent Songs, which blended his acoustic style with jazz and East Asian and Mediterranean influences. Beginning with this record, Cohen began to co-produce his albums. Produced by Cohen and Henry Lewy (Joni Mitchell's sound engineer), Recent Songs included performances by Passenger, an Austin-based jazz–fusion band that met Cohen through Mitchell. The band helped Cohen create a new sound by featuring instruments like the oud, the Gypsy violin, and the mandolin. The album was supported by Cohen's major tour with the new band, and Jennifer Warnes and Sharon Robinson on the backing vocals, in Europe in late 1979, and again in Australia, Israel, and Europe in 1980. In 2000, Columbia released an album of live recordings of songs from the 1979 tour, entitled Field Commander Cohen: Tour of 1979.During the 1970s, Cohen toured twice with Jennifer Warnes as a backup singer (1972 and 1979). Warnes would become a fixture on Cohen's future albums, receiving full co-vocals credit on Cohen's 1984 album Various Positions (although the record was released under Cohen's name, the inside credits say \"Vocals by Leonard Cohen and Jennifer Warnes\"). In 1987 she recorded an album of Cohen songs, Famous Blue Raincoat. Cohen said that she sang backup for his 1980 tour, even though her career at the time was in much better shape than his. \"So this is a real friend\", he said. \"Someone who in the face of great derision, has always supported me.\"\n\n\n=== 1980s ===\n\nIn the early 1980s, Cohen co-wrote (with Lewis Furey) the rock musical film Night Magic starring Carole Laure and Nick Mancuso; the LP Various Positions was released in 1984. Cohen supported the release of the album with his biggest tour to date, in Europe and Australia, and with his first tour in Canada and the United States since 1975. The band performed at the Montreux Jazz Festival, and the Roskilde Festival.\nThey also gave a series of highly emotional and politically controversial concerts in Poland, which had been under martial law just two years before, and performed the song \"The Partisan\", regarded as the hymn of the Polish Solidarity movement.In 1987, Jennifer Warnes's tribute album Famous Blue Raincoat helped restore Cohen's career in the US. The following year he released I'm Your Man. Cohen supported the record with a series of television interviews and an extensive tour of Europe, Canada, and the US. Many shows were broadcast on European and US television and radio stations, while Cohen performed for the first time in his career on PBS's Austin City Limits show.\n\n\n==== \"Hallelujah\" ====\n\n\"Hallelujah\" was first released on Cohen's studio album Various Positions in 1984, and he sang it during his Europe tour in 1985. The song had limited initial success but found greater popularity through a 1991 cover by John Cale that was featured in the 2001 animated film, Shrek. On the soundtrack album of the film, the song was performed by Rufus Wainwright. Cale's version formed the basis for a later cover by Jeff Buckley.  \"Hallelujah\" has been performed by almost 200 artists in various languages.The song is the subject of the book The Holy or the Broken: Leonard Cohen, Jeff Buckley & the Unlikely Ascent of 'Hallelujah' (2012) by Alan Light.  In a New York Times review Janet Maslin praised the book and the song, noting that \"Cohen spent years struggling with his song \"Hallelujah\", which eventually became one of the most \"oft-performed songs in American musical history.\"\n\n\n=== 1990s ===\n\nThe album track \"Everybody Knows\" from I'm Your Man and \"If It Be Your Will\" in the 1990 film Pump Up the Volume helped expose Cohen's music to a wider audience. He first introduced the song during his world tour in 1988. The song \"Everybody Knows\" also featured prominently in fellow Canadian Atom Egoyan's 1994 film, Exotica. In 1992, Cohen released The Future, which urges (often in terms of biblical prophecy) perseverance, reformation, and hope in the face of grim prospects. Three tracks from the album – \"Waiting for the Miracle\", \"The Future\" and \"Anthem\" – were featured in the movie Natural Born Killers, which also promoted Cohen's work to a new generation of US listeners.\nAs with I'm Your Man, the lyrics on The Future were dark, and made references to political and social unrest. The title track is reportedly a response to the 1992 Los Angeles riots. Cohen promoted the album with two music videos, for \"Closing Time\" and \"The Future\", and supported the release with the major tour through Europe, United States and Canada, with the same band as in his 1988 tour, including a second appearance on PBS's Austin City Limits. Some of the Scandinavian shows were broadcast live on the radio. The selection of performances, mostly recorded on the Canadian leg of the tour, was released on the 1994 Cohen Live album.\nIn 1993, Cohen also published his book of selected poems and songs, Stranger Music: Selected Poems and Songs, on which he had worked since 1989. It includes a number of new poems from the late 1980s and early 1990s and major revision of his 1978 book Death of a Lady's Man.In 1994, Cohen retreated to the Mt. Baldy Zen Center near Los Angeles, beginning what became five years of seclusion at the center. In 1996, Cohen was ordained as a Rinzai Zen Buddhist monk and took the Dharma name Jikan, meaning \"silence\". He served as personal assistant to Kyozan Joshu Sasaki Roshi.\nIn 1997, Cohen oversaw the selection and release of the More Best of Leonard Cohen album, which included a previously unreleased track, \"Never Any Good\", and an experimental piece \"The Great Event\". The first was left over from Cohen's unfinished mid-1990s album, which was announced to include songs like \"In My Secret Life\" (already recited as a song-in-progress in 1988) and \"A Thousand Kisses Deep\", both later re-worked with Sharon Robinson for the 2001 album Ten New Songs.Although there was a public impression that Cohen would not resume recording or publishing, he returned to Los Angeles in May 1999. He began to contribute regularly to The Leonard Cohen Files fan website, emailing new poems and drawings from Book of Longing and early versions of new songs, like \"A Thousand Kisses Deep\" in September 1998 and Anjani Thomas's story sent on May 6, 1999, the day they were recording \"Villanelle for our Time\" (released on 2004's Dear Heather album). The section of The Leonard Cohen Files with Cohen's online writings has been titled \"The Blackening Pages\".\n\n\n=== 2000s ===\n\n\n==== Post-monastery records ====\nAfter two years of production, Cohen returned to music in 2001 with the release of Ten New Songs, featuring a major influence from producer and co-composer Sharon Robinson. The album, recorded at Cohen's and Robinson's home studios – Still Life Studios, includes the song \"Alexandra Leaving\", a transformation of the poem \"The God Abandons Antony\", by the Greek poet Constantine P. Cavafy. The album was a major hit for Cohen in Canada and Europe, and he supported it with the hit single \"In My Secret Life\" and accompanying video shot by Floria Sigismondi. The album won him four Canadian Juno Awards in 2002: Best Artist, Best Songwriter, Best Pop Album, and Best Video (\"In My Secret Life\"). And the following year he was invested with Canada's highest civilian honor, the Companion of the Order of Canada.In October 2004, Cohen released Dear Heather, largely a musical collaboration with jazz chanteuse (and romantic partner) Anjani Thomas, although Sharon Robinson returned to collaborate on three tracks (including a duet). As light as the previous album was dark, Dear Heather reflects Cohen's own change of mood – he said in a number of interviews that his depression had lifted in recent years, which he attributed to Zen Buddhism. In an interview following his induction into the Canadian Songwriters' Hall of Fame, Cohen explained that the album was intended to be a kind of notebook or scrapbook of themes, and that a more formal record had been planned for release shortly afterwards, but that this was put on ice by his legal battles with his ex-manager.\nBlue Alert, an album of songs co-written by Anjani and Cohen, was released in 2006 to positive reviews. Sung by Anjani, who according to one reviewer \"... sounds like Cohen reincarnated as woman ... though Cohen doesn't sing a note on the album, his voice permeates it like smoke.\"Before embarking on his 2008–2010 world tour, and without finishing the new album that had been in work since 2006, Cohen contributed a few tracks to other artists' albums – a new version of his own \"Tower of Song\" was performed by him, Anjani Thomas and U2 in the 2006 tribute film Leonard Cohen I'm Your Man (the video and track were included on the film's soundtrack and released as the B-side of U2's single \"Window in the Skies\", reaching No 1 in the Canadian Singles Chart). In 2007 he recited \"The Sound of Silence\" on the album Tribute to Paul Simon: Take Me to the Mardi Gras and \"The Jungle Line\" by Joni Mitchell, accompanied by Herbie Hancock on piano, on Hancock's Grammy-winning album River: The Joni Letters, while in 2008, he recited the poem \"Since You've Asked\" on the album Born to the Breed: A Tribute to Judy Collins.\n\n\n==== Lawsuits and financial troubles ====\nIn late 2004, Cohen's daughter Lorca began to suspect Kelley Lynch, Cohen's longtime manager, of financial impropriety. According to Cohen biographer Sylvie Simmons, Lynch \"took care of Leonard's business affairs ... [She was] not simply his manager but a close friend, almost part of the family.\" Cohen discovered that he had unknowingly paid a credit card bill of Lynch's for $75,000, and that most of the money in his accounts was gone, including money from his retirement accounts and charitable trust funds. This had begun as early as 1996, when Lynch started selling Cohen's music publishing rights, despite the fact that Cohen had had no financial incentive to do so.In October 2005, Cohen sued Lynch, alleging that she had misappropriated over US$5 million from Cohen's retirement fund, leaving only $150,000. Cohen was sued in turn by other former business associates. These events placed him in the public spotlight, including a cover feature on him with the headline \"Devastated!\" in Canada's Maclean's magazine. In March 2006, Cohen won a civil suit and was awarded US$9 million by a Los Angeles County superior court. Lynch ignored the suit and did not respond to a subpoena issued for her financial records. NME reported that Cohen might never be able to collect the awarded amount. In 2012, Lynch was jailed for 18 months and five years' probation for harassing Cohen after he dismissed her.\n\n\n==== Book of Longing ====\nCohen published book of poetry and drawings, Book of Longing, in May 2006. In March, a Toronto-based retailer offered signed copies to the first 1,500 orders placed online: all 1,500 sold within hours. The book quickly topped bestseller lists in Canada. On May 13, Cohen made his first public appearance in 13 years, at an in-store event at a bookstore in Toronto. Approximately 3,000 people arrived, causing the streets surrounding the bookstore to be closed. He sang two of his earliest and best-known songs: \"So Long, Marianne\" and \"Hey, That's No Way to Say Goodbye\", accompanied by the Barenaked Ladies and Ron Sexsmith. Appearing with him was Anjani, promoting her new CD along with his book.That same year, Philip Glass composed music for Book of Longing. Following a series of live performances that included Glass on keyboards, Cohen's recorded spoken text, four additional voices (soprano, mezzo-soprano, tenor, and bass-baritone), and other instruments, and as well as screenings of Cohen's artworks and drawings, Glass' label Orange Mountain Music released a double CD of the work, entitled Book of Longing. A Song Cycle based on the Poetry and Artwork of Leonard Cohen.\n\n\n=== 2008–2010 World Tour ===\n\n\n==== 2008 tour ====\n\nTo recoup the money his ex-manager had stolen, Cohen embarked on his first world tour in 15 years. He said that being \"forced to go back on the road to repair the fortunes of my family and myself ... [was] a most fortunate happenstance because I was able to connect… with living musicians. And I think it warmed some part of my heart that had taken on a chill.\"\n\nThe tour began on May 11 in Fredericton, New Brunswick, and was extended until late 2010. The schedule of the first leg in mid-2008 encompassed Canada and Europe, including performances at The Big Chill, the Montreal Jazz Festival, and on the Pyramid Stage at the 2008 Glastonbury Festival on June 29, 2008. His performance at Glastonbury was hailed by many as the highlight of the festival, and his performance of \"Hallelujah\" as the sun went down received a rapturous reception and a lengthy ovation from a packed Pyramid Stage field. He also played two shows in London's O2 Arena.In Dublin, Cohen was the first performer to play an open-air concert at IMMA (Royal Hospital Kilmainham) ground, performing there on June 13, 14 and 15, 2008. In 2009, the performances were awarded Ireland's Meteor Music Award as the best international performance of the year.\nIn September, October and November 2008, Cohen toured Europe, including stops in Austria, Ireland, Poland, Romania, Italy, Germany, France and Scandinavia. In March 2009, Cohen released Live in London, recorded in July 2008 at London's O2 Arena and released on DVD and as a two-CD set. The album contains 25 songs and is more than two and one-half hours long. It was the first official DVD in Cohen's recording career.\n\n\n==== 2009 tour ====\n\nThe third leg of Cohen's World Tour 2008–2009 encompassed New Zealand and Australia from January 20 to February 10, 2009. In January 2009, The Pacific Tour first came to New Zealand, where the audience of 12,000 responded with five standing ovations.On February 19, 2009, Cohen played his first American concert in 15 years at the Beacon Theatre in New York City. The show, showcased as the special performance for fans, Leonard Cohen Forum members and press, was the only show in the whole three-year tour that was broadcast on the radio (NPR) and available as a free podcast.\nThe North American Tour of 2009 opened on April 1, and included the performance at the Coachella Valley Music and Arts Festival on Friday, April 17, 2009, in front of one of the largest outdoor theatre crowds in the history of the festival. His performance of Hallelujah was widely regarded as one of the highlights of the festival, thus repeating the major success of the 2008 Glastonbury appearance.\nIn July 2009, Cohen started his marathon European tour, his third in two years. The itinerary mostly included sport arenas and open air Summer festivals in Germany, UK, France, Spain, Ireland (the show at O2 in Dublin won him the second Meteor Music Award in a row), but also performances in Serbia in the Belgrade Arena, in the Czech Republic, Hungary, Turkey, and again in Romania.\nOn September 18, 2009, on the stage at a concert in Valencia, Spain, Cohen suddenly fainted halfway through performing his song \"Bird on the Wire\", the fourth in the two-act set list; Cohen was brought down backstage by his band members and then admitted to local hospital, while the concert was suspended. It was reported that Cohen had stomach problems, and possibly food poisoning. Three days later, on September 21, his 75th birthday, he performed in Barcelona. The show, last in Europe in 2009 and rumoured to be the last European concert ever, attracted many international fans, who lighted the green candles honouring Cohen's birthday, leading Cohen to give a special speech of thanks for the fans and the Leonard Cohen Forum.\nThe last concert of this leg was held in Tel Aviv, Israel on September 24 at Ramat Gan Stadium. The event was surrounded by public discussion due to a cultural boycott of Israel proposed by a number of musicians. Nevertheless, tickets for the Tel Aviv concert, Cohen's first performance in Israel since 1980, sold out in less than 24 hours. It was announced that the proceeds from the sale of the 47,000 tickets would go into a charitable fund in partnership with Amnesty International and would be used by Israeli and Palestinian peace groups.The sixth leg of the 2008–2009 world tour went again to the US, with 15 shows. The 2009 world tour earned a reported $9.5 million, putting Cohen at number 39 on Billboard magazine's list of the year's top musical \"money makers\".On September 14, 2010, Sony Music released a live CD/DVD album, Songs from the Road, showcasing Cohen's 2008 and 2009 live performances. The previous year, Cohen's performance at the 1970 Isle of Wight Music Festival was released as a CD/DVD combo.\n\n\n==== 2010 tour ====\nCohen's 2008–2009 world tour was prolonged into 2010. Originally scheduled to start in March, it began in September due to his back injury. Officially billed as the \"World Tour 2010\", the tour started on July 25, 2010 in Arena Zagreb, Croatia. The third leg of the 2010 tour started on October 28 in New Zealand and continued in Australia.\n\n\n=== 2010s ===\n\nIn 2011, Cohen's poetical output was represented in Everyman's Library Pocket Poets, in a selection Poems and Songs edited by Robert Faggen. The collection included a selection from all Cohen's books, based on his 1993 books of selected works, Stranger Music, and as well from Book of Longing, with addition of six new song lyrics. Nevertheless, three of those songs, \"A Street\", recited in 2006, \"Feels So Good\", performed live in 2009 and 2010, and \"Born in Chains\", performed live in 2010, were not released on Cohen's 2012 album Old Ideas, with him being unhappy with the versions of the songs in the last moment; the song \"Lullaby\", as presented in the book and performed live in 2009, was completely re-recorded for the album, presenting new lyrics on the same melody.A biography, I'm Your Man: The Life of Leonard Cohen, written by Sylvie Simmons, was published in October 2012. The book is the second major biography of Cohen (Ira Nadel's 1997 biography Various Positions was the first).\n\n\n==== Old Ideas ====\nLeonard Cohen's 12th studio album, Old Ideas, was released worldwide on January 31, 2012, and it soon became the highest-charting album of his entire career, reaching No. 1 positions in Canada, Norway, Finland, Netherlands, Spain, Belgium, Poland, Hungary, Czech Republic, Croatia, New Zealand, and top ten positions in United States, Australia, France, Portugal, UK, Austria, Denmark, Sweden, Ireland, Germany, and Switzerland, competing for number one position with Lana Del Rey's debut album Born to Die, released the same day.The lyrics for the song \"Going Home\" were published as a poem in The New Yorker magazine in January 2012, prior to the record's release. The entire album was streamed online by NPR on January 22 and on January 23 by The Guardian.The album received uniformly positive reviews from Rolling Stone, the Chicago Tribune, and The Guardian. At a record release party for the album in January 2012, Cohen spoke with The New York Times reporter Jon Pareles who states that \"mortality was very much on his mind and in his songs [on this album].\" Pareles goes to characterize the album as \"an autumnal album, musing on memories and final reckonings, but it also has a gleam in its eye. It grapples once again with topics Mr. Cohen has pondered throughout his career: love, desire, faith, betrayal, redemption. Some of the diction is biblical; some is drily sardonic.\"\n\n\n==== 2012–2013 World Tour ====\nOn August 12, 2012, Cohen embarked on a new European tour in support of Old Ideas, adding a violinist to his 2008–2010 tour band, now nicknamed Unified Heart Touring Band, and following the same three-hour set list structure as in 2008–2012 tour, with the addition of a number of songs from Old Ideas. The European leg ended on October 7, 2012, after concerts in Belgium, Ireland (Royal Hospital), France (Olympia in Paris), England (Wembley Arena in London), Spain, Portugal, Germany, Italy (Arena in Verona), Croatia (Arena in Pula), Denmark, Sweden, Norway, Finland, Romania and Turkey.The second leg of the Old Ideas World Tour took place in the US and Canada in November and December, with 56 shows altogether on both legs.Cohen returned to North America in the spring of 2013 with concerts in the United States and Canada. A summer tour of Europe happened shortly afterwards.Cohen then toured Australia and New Zealand in November and December 2013. His final concert was performed at the Vector Arena in Auckland.\n\n\n==== Popular Problems and You Want It Darker ====\nCohen released his 13th album, Popular Problems, on September 24, 2014. The album includes \"A Street\", which he had previously recited in 2006, during promotion of his book of poetry Book of Longing, and later printed twice, as \"A Street\" in the March 2, 2009 issue of The New Yorker magazine, and appeared as \"Party's Over\" in Everyman's Library edition of Poems and Songs in 2011.\nCohen's 14th and final album, You Want It Darker, was released on October 21, 2016. Cohen's son Adam Cohen has a production credit on the album. On February 23, 2017, Cohen's son and his final album collaborator Sammy Slabbinck released a special, posthumous tribute video set to the album track \"Traveling Light\", featuring never before seen archival footage of Cohen from his career. The title track was awarded a Grammy Award for Best Rock Performance in January 2018.\n\n\n==== Thanks for the Dance and other posthumous releases ====\nBefore his death, Cohen had begun working on a new album with his son Adam, a musician and singer-songwriter. The album, titled Thanks for the Dance, was released on November 22, 2019. One posthumous track, \"Necropsy of Love\", appeared on the 2018 compilation album The Al Purdy Songbook and another track named \"The Goal\" was also published on September 20, 2019 on Leonard Cohen's official YouTube channel.\n\n\n== Cultural impact and themes ==\nWriting for AllMusic, critic Bruce Eder assessed Cohen's overall career in popular music by asserting that \"[he is] one of the most fascinating and enigmatic ... singer-songwriters of the late '60s ... Second only to Bob Dylan (and perhaps Paul Simon), he commands the attention of critics and younger musicians more firmly than any other musical figure from the 1960s who continued to work in the 21st century.\" The Academy of American Poets commented more broadly, stating that \"Cohen's successful blending of poetry, fiction, and music is made most clear in Stranger Music: Selected Poems and Songs, published in 1993 ... while it may seem to some that Leonard Cohen departed from the literary in pursuit of the musical, his fans continue to embrace him as a Renaissance man who straddles the elusive artistic borderlines.\" Bob Dylan was an admirer, describing Cohen as the 'number one' songwriter of their time (Dylan described himself as 'number zero'). \"When people talk about Leonard, they fail to mention his melodies, which to me, along with his lyrics, are his greatest genius. ... Even the counterpoint lines--they give a celestial character & melodic lift to his songs. ... no one else comes close to this in modern music. ... I like all of Leonard's songs, early or late. ... they make you think & feel. I like some of his later songs even better than his early ones. Yet there's a simplicity to his early ones that I like, too. ... He's very much a descendant of Irving Berlin. ... Both of them just hear melodies that most of us can only strive for. ... Both Leonard & Berlin are incredibly crafty. Leonard particularly uses chord progressions that are classical in shape. He is a much more savvy musician than you'd think.\"Themes of political and social justice also recur in Cohen's work, especially in later albums. In \"Democracy\", he both acknowledges political problems and celebrates the hopes of reformers: \"from the wars against disorder/ from the sirens night and day/ from the fires of the homeless/ from the ashes of the gay/ Democracy is coming to the USA.\" He made the observation in \"Tower of Song\" that \"the rich have got their channels in the bedrooms of the poor/ And there's a mighty judgment coming.\" In the title track of The Future he recasts this prophecy on a pacifist note: \"I've seen the nations rise and fall/ ... / But love's the only engine of survival.\" In that same song he comments on current topics (abortion, anal sex and the use of drugs): \"Give me crack and anal sex. Take the only tree that's left and stuff it up the hole in your culture\", \"Destroy another fetus now, we don't like children anyhow\". In \"Anthem\", he promises that \"the killers in high places [who] say their prayers out loud/ [are] gonna hear from me.\"\nWar is an enduring theme of Cohen's work that—in his earlier songs and early life—he approached ambivalently. Challenged in 1974 over his serious demeanor in concerts and the military salutes he ended them with, Cohen remarked, \"I sing serious songs, and I'm serious onstage because I couldn't do it any other way ... I don't consider myself a civilian. I consider myself a soldier, and that's the way soldiers salute.\"\n\nDeeply moved by encounters with Israeli and Arab soldiers, he left the country to write \"Lover Lover Lover\". This song has been interpreted as a personal renunciation of armed conflict, and ends with the hope his song will serve a listener as \"a shield against the enemy\". He would later remark, \"'Lover, Lover, Lover' was born over there; the whole world has its eyes riveted on this tragic and complex conflict. Then again, I am faithful to certain ideas, inevitably. I hope that those of which I am in favour will gain.\" Asked which side he supported in the Arab-Israeli conflict, Cohen responded, \"I don't want to speak of wars or sides ... Personal process is one thing, it's blood, it's the identification one feels with their roots and their origins. The militarism I practice as a person and a writer is another thing. ... I don't wish to speak about war.\"In 1991, playwright Bryden MacDonald launched Sincerely, A Friend, a musical revue based on Cohen's music.Cohen is mentioned in the Nirvana song \"Pennyroyal Tea\" from the band's 1993 release, In Utero. Kurt Cobain wrote, \"Give me a Leonard Cohen afterworld/So I can sigh eternally.\" Cohen, after Cobain's suicide, was quoted as saying \"I'm sorry I couldn't have spoken to the young man. I see a lot of people at the Zen Centre, who have gone through drugs and found a way out that is not just Sunday school. There are always alternatives, and I might have been able to lay something on him.\" He is also mentioned in the lyrics of songs by Lloyd Cole &  The Commotions, Mercury Rev and Marillion.Cohen was one of the inspirations for Matt Bissonnette and Steven Clark's 2002 film Looking for Leonard. Centred on a group of small-time criminals in Montreal, one of the film's characters idolizes Cohen as a symbol of her dreams for a better life, obsessively rereading his writings and rewatching Ladies and Gentlemen. Bissonnette followed up in 2020 with Death of a Ladies' Man, a film that uses seven Cohen songs in its soundtrack to illuminate key themes in the film's screenplay.The Leonard Cohen song \"So Long, Marianne\" is the title of the season 4, episode 9 episode of This is Us. The song is played and its meaning is discussed as an important plot point of the episode.\nOn March 26, 2021, the Swedish folk duo First Aid Kit, released a live album consisting of Leonard Cohen covers.\n\n\n== Personal life ==\n\n\n=== Relationships and children ===\nIn September 1960, Cohen bought a house on the Greek island of Hydra with $1,500 that he had inherited from his grandmother. Cohen lived there with Marianne Ihlen, with whom he was in a relationship for most of the 1960s. The song \"So Long, Marianne\" was written to and about her. In 2016, Ihlen died of leukemia three months and nine days before Cohen. His farewell letter to her was read at her funeral, often misquoted by the media and others as \"... our bodies are falling apart and I think I will follow you very soon. Know that I am so close behind you that if you stretch out your hand, I think you can reach mine.\" This  widely circulated version is based on an inaccurate verbal recollection by Ihlen's friend. The letter (actually an email), obtained through the Leonard Cohen estate, reads: Dearest Marianne,\nI'm just a little behind you, close enough to take your hand. This old body has given up, just as yours has too.\n\nI've never forgotten your love and your beauty. But you know that. I don't have to say any more. Safe travels old friend. See you down the road. Endless love and gratitude. \nIn the 1970s, Cohen was in a relationship with artist Suzanne Elrod. She took the cover photograph for Live Songs and is pictured on the cover of the Death of a Ladies' Man. She also inspired the \"Dark Lady\" of Cohen's book Death of a Lady's Man (1978), but is not the subject of one of his best-known songs, \"Suzanne\", which refers to Suzanne Verdal, the former wife of a friend, the Québécois sculptor Armand Vaillancourt. Cohen and Elrod separated in 1979, with him later stating that \"cowardice\" and \"fear\" prevented him from marrying her. Their relationship produced two children: a son, Adam (b. 1972), and a daughter, Lorca (b. 1974), named after poet Federico García Lorca. Adam is a singer–songwriter and the lead singer of pop-rock band Low Millions, while Lorca is a photographer. She shot the music video for Cohen's song \"Because Of\" (2004), and worked as a photographer and videographer for his 2008–10 world tour. Cohen had three grandchildren: grandson Cassius through his son Adam, and granddaughter Viva (whose father is musician Rufus Wainwright) and grandson Lyon through Lorca.Cohen was in a relationship with French photographer Dominique Issermann in the 1980s. They worked together on several occasions: she shot his first two music videos for the songs \"Dance Me to the End of Love\" and \"First We Take Manhattan\" and her photographs were used for the covers of his 1993 book Stranger Music and his album More Best of Leonard Cohen and for the inside booklet of I'm Your Man (1988), which he also dedicated to her. In 2010, she was also the official photographer of his world tour.\nIn the 1990s, Cohen was romantically linked to actress Rebecca De Mornay. De Mornay co-produced Cohen's 1992 album The Future, which is also dedicated to her with an inscription that quotes Rebecca's coming to the well from the Book of Genesis chapter 24 and giving drink to Eliezer's camels, after he prayed for the help; Eliezer (\"God is my help\" in Hebrew) is part of Cohen's Hebrew name (Eliezer ben Nisan ha'Cohen), and Cohen sometimes referred to himself as \"Eliezer Cohen\" or even \"Jikan Eliezer\".\n\n\n=== Religious beliefs and practices ===\nCohen was described as a Sabbath-observant Jew in an article in The New York Times:\n\nMr. Cohen keeps the Sabbath even while on tour and performed for Israeli troops during the 1973 Arab-Israeli war. So how does he square that faith with his continued practice of Zen? \"Allen Ginsberg asked me the same question many years ago\", he said. \"Well, for one thing, in the tradition of Zen that I've practiced, there is no prayerful worship and there is no affirmation of a deity. So theologically there is no challenge to any Jewish belief.\"\nIn his concert in Ramat Gan, Israel on September 24, 2009, Cohen spoke Jewish prayers and blessings to the audience in Hebrew. He opened the show with the first sentence of Ma Tovu. At the middle he used Baruch Hashem, and he ended the concert reciting the blessing of Birkat Cohanim.Cohen had a brief phase around 1970 of being interested in a variety of world views, which he later described as \"from the Communist party to the Republican Party. From Scientology to delusions of me as the High Priest rebuilding the Temple\".Cohen was involved with Buddhism beginning in the 1970s and was ordained a Buddhist priest in 1996; he continued to consider himself Jewish: \"I'm not looking for a new religion. I'm quite happy with the old one, with Judaism.\" Beginning in the late 1970s, Cohen was associated with Buddhist monk and rōshi (venerable teacher) Kyozan Joshu Sasaki, regularly visiting him at Mount Baldy Zen Center and serving him as personal assistant during Cohen's period of reclusion at Mount Baldy monastery in the 1990s. Sasaki appears as a regular motif or addressee in Cohen's poetry, especially in his Book of Longing, and took part in a 1997 documentary about Cohen's monastery years, Leonard Cohen: Spring 1996. Cohen's 2001 album Ten New Songs is dedicated to Joshu Sasaki.\nIn a 1993 interview entitled \"I am the little Jew who wrote the Bible,\" he says, \"at our best, we inhabit a biblical landscape, and this is where we should situate ourselves without apology. ... That biblical landscape is our urgent invitation ... Otherwise, it's really not worth saving or manifesting or redeeming or anything, unless we really take up that invitation to walk into that biblical landscape.\"\nCohen showed an interest in Jesus as a universal figure, saying, \"I'm very fond of Jesus Christ. He may be the most beautiful guy who walked the face of this earth. Any guy who says 'Blessed are the poor. Blessed are the meek' has got to be a figure of unparalleled generosity and insight and madness ... A man who declared himself to stand among the thieves, the prostitutes and the homeless. His position cannot be comprehended. It is an inhuman generosity. A generosity that would overthrow the world if it was embraced because nothing would weather that compassion. I'm not trying to alter the Jewish view of Jesus Christ. But to me, in spite of what I know about the history of legal Christianity, the figure of the man has touched me.\"Speaking about his religion in a 2007 interview for BBC Radio 4's Front Row (partially re-broadcast on November 11, 2016) Cohen said:\n\nMy friend Brian Johnson said of me that I'd never met a religion I didn't like. ... That's why I've tried to correct that impression [that Cohen was looking for another religion besides Judaism] because I very much feel part of that tradition and I practice that and my children practice it, so that was never in question. The investigations that I've done into other spiritual systems have certainly illuminated and enriched my understanding of my own tradition.\n\n\n== Death and tribute ==\n\nCohen died on November 7, 2016, at the age of 82 at his home in Los Angeles; leukemia was a contributing cause. According to his manager, Cohen's death was the result of a fall at his home on the night of November 7, and he subsequently died in his sleep. His death was announced on November 10, the same day as his funeral, which was held in Montreal.\nAs was his wish, Cohen was laid to rest with a Jewish rite, in a simple pine casket, in a family plot in the Congregation Shaar Hashomayim cemetery on Mount Royal.\nTributes were paid by numerous stars and political figures. Citizens and officials in Montreal, where he spent his early life, considered honoring him by naming a street and other locations, including a library, after him.The city of Montreal held a tribute concert to Cohen in December 2016, entitled \"God is Alive, Magic Is Afoot\" after a prose poem in his novel Beautiful Losers. It featured a number of musical performances and readings of Cohen's poetry.A memorial also took place in Los Angeles. Cohen was survived by his two children and three grandchildren.After Cohen's death, two tribute murals were created in the city the following summer. Artist Kevin Ledo painted a nine-story portrait of him near Cohen's home on Montreal's Plateau Mont-Royal, and a 20-story fedora-clad likeness on Crescent Street, commissioned by the city of Montreal and the Montreal Museum of Fine Arts with Montreal artist, Gene Pendon, and L.A. artist, El Mac has dominated the city's downtown.On November 6, 2017, the eve of the first anniversary of Cohen's death, the Cohen family organized a memorial concert entitled \"Tower of Song\" at the Bell Centre in Montreal. Fans and artists from all over the globe came together for an evening of spoken word and song that included performances by k.d. lang, Elvis Costello, Feist, Adam Cohen, Patrick Watson, Sting, Damien Rice, Courtney Love, The Lumineers, Lana Del Rey and more. The star-studded tribute also included Canadian prime minister Justin Trudeau and his wife Sophie Grégoire Trudeau, who appeared on stage to speak about their personal connection with Cohen's music.An interactive exhibit dedicated to the life and career of Leonard Cohen opened on November 9, 2017 at Montreal's contemporary art museum (MAC) entitled \"Leonard Cohen: Une Brèche en Toute Chose / A Crack in Everything\" and ran until April 9, 2018. The exhibit had been in the works for several years prior to Cohen's death, as part of the official program of Montreal's 375th anniversary celebrations and broke the museum's attendance record in its five-month run. The exhibit embarked on an international tour, opening in New York City at the Jewish Museum in April 2019. A bronze statue of Cohen was unveiled in Vilnius, capital of Lithuania, on August 31, 2019.\n\n\n== Discography ==\n\n\n=== Studio albums ===\nAll albums released on Columbia Records.\n\nSongs of Leonard Cohen (1967)\nSongs from a Room (1969)\nSongs of Love and Hate (1971)\nNew Skin for the Old Ceremony (1974)\nDeath of a Ladies' Man (1977)\nRecent Songs (1979)\nVarious Positions (1984)\nI'm Your Man (1988)\nThe Future (1992)\nTen New Songs (2001)\nDear Heather (2004)\nOld Ideas (2012)\nPopular Problems (2014)\nYou Want It Darker (2016)\nThanks for the Dance (2019)\n\n\n== Bibliography ==\n\n\n=== Poetry ===\n\n\n==== Collections ====\nCohen, Leonard (1956). Let Us Compare Mythologies. [McGill Poetry Series]. Drawings by Freda Guttman. Montreal: Contact Press.\nThe Spice-Box of Earth. Toronto: McClelland & Stewart, 1961.\nFlowers for Hitler. Toronto: McClelland & Stewart, 1964.\nLet Us Compare Mythologies. [Reprint]. Drawings by Freda Guttman. Montreal: McClelland and Stewart. 1966.\nParasites of Heaven. Toronto: McClelland & Stewart, 1966.\nSelected Poems 1956–1968. Toronto: McClelland & Stewart, 1968.\nThe Energy of Slaves. Toronto: McClelland and Stewart, 1972. ISBN 0-7710-2204-2 ISBN 0-7710-2203-4 New York: Viking, 1973.\nDeath of a Lady's Man. Toronto: McClelland & Stewart, 1978. ISBN 0-7710-2177-1 London, New York: Viking, Penguin, 1979. – reissued 2010\nBook of Mercy. Toronto: McClelland & Stewart, 1984. – reissued 2010\nStranger Music: Selected Poems and Songs. London, New York, Toronto: Cape, Pantheon, McClelland & Stewart, 1993. ISBN 0-7710-2230-1\nBook of Longing. London, New York, Toronto: Penguin, Ecco, McClelland & Stewart, 2006. (poetry, prose, drawings) ISBN 978-0-7710-2234-0\nLet Us Compare Mythologies. [Reprint]. Drawings by Freda Guttman. Montreal: McClelland and Stewart. 2006.\nLet Us Compare Mythologies. [First US ed.] Drawings by Freda Guttman. New York: Ecco Press. 2007.\nThe Lyrics of Leonard Cohen. London: Omnibus Press, 2009. ISBN 0-7119-7141-2\nPoems and Songs. New York: Random House (Everyman's Library Pocket Poets), 2011.\nFifteen Poems. New York: Everyman's Library/Random House, 2012. (eBook)\nThe Flame. London, New York, Toronto: Penguin, McClelland & Stewart, 2018. (poetry, prose, drawings, journal entries)\n\n\n==== List of poems ====\n\n\n=== Novels ===\nThe Favorite Game. London, New York, Toronto: Secker & Warburg, Viking P, McClelland & Stewart, 1963. Reissued as The Favourite Game. Toronto: McClelland & Stewart [New Canadian Library], 1994. ISBN 978-0-7710-9954-0\nBeautiful Losers. New York, Toronto: Viking Press, McClelland & Stewart, 1966. Toronto: McClelland & Stewart [New Canadian Library], 1991. ISBN 978-0-7710-9875-8 McClelland & Stewart [Emblem], 2003. ISBN 978-0-7710-2200-5\n\n\n== Filmography ==\nLadies and Gentlemen... Mr. Leonard Cohen (1965) – documentary co-directed by Don Owen and Donald Brittain\nAngel (1966), man – experimental animated short directed by Derek May and produced for the National Film Board of Canada\nPoen (1967), narrator – short film featuring four readings of a prose poem from his novel Beautiful Losers\nThe Ernie Game (1967), singer – feature film directed by Don Owen\nI Am a Hotel (1983), resident – 28 minutes made for TV short musical film, written by Cohen and directed by Allan F. Nicholls\nSong of Leonard Cohen (1980) – documentary directed by Harry Rasky for CBC filmed on The Smokey Life Tour. After a phone call from Cohen in 2000, he and Rasky renewed their friendship and Rasky wrote based on his diary notes a book about the film: The Song of Leonard Cohen.\nMiami Vice S2E17 \"French Twist\" (1986), Francois Zolan\nThe Tibetan Book of the Dead Part I: A Way of Life and  The Tibetan Book of the Dead Part II: The Great Liberation (both 1994), narrator – documentary on Bardo Thodol directed by Yukari Hayashi and produced by the National Film Board of Canada in co-operation with NHK Japan. Released on DVD in 2004.\nLeonard Cohen: I'm Your Man (2005) – documentary and concert film directed by Lian Lunson\nLeonard Cohen: Bird on a Wire – documentary directed by Tony Palmer during Cohen's 20-city European tour that started on March 18, 1972 in Dublin and ended on April 21, 1972 in Jerusalem. The original film premiered in 1974 at the Rainbow Theatre and was for decades thought lost. A restored version from footage rediscovered in 2009 was released on DVD in 2010 and the film was re-released theatrically in 2017.\nAl Purdy Was Here (2015) - Canadian documentary film directed by Brian D. Johnson.\nMarianne & Leonard: Words of Love (2019, directed by Nick Broomfield)\n\n\n== Awards and nominations ==\n\n\n== See also ==\n\n\n== Notes ==\n\n\n== References ==\n\n\n== Further reading ==\nBurger, Jeff (2014). 'Leonard Cohen on Leonard Cohen: Interviews and Encounters. Chicago Review Press. ISBN 978-1-61374-758-2.\nHofmann, Philipp (2010). Corporeal Cartographies: The Body in the Novels of Leonard Cohen. Lit Publishing House. ISBN 978-3-643-11035-0.\nNadel, Ira (1997). Various Positions: A Life of Leonard Cohen' (1st ed.). University of Texas Press. ISBN 0-292-71732-6.\nPosner, Michael (2020). Leonard Cohen, the Untold Stories: The Early Years (1st ed.). Simon & Schuster. ISBN 9781982152628.\nQuayle, Teresa (2016). Smudging the Air:The lyrics of Leonard Cohen. ISBN 978-1-5411-6700-1.\nRatcliff, Maurice (1999). The complete guide to the music of Leonard Cohen. Omnibus Press. ISBN 0-7119-7508-6.\nRosemann, Philipp W. (2018). \"Leonard Cohen, Philosopher\". Maynooth Philosophical Papers. 9: 1–20. doi:10.5840/mpp20181091. Retrieved November 4, 2018.\nScobie, Stephen (2000). Intricate preparations: writing Leonard Cohen. ECW Press. ISBN 1-55022-433-6.\nSimmons, Sylvie (2012). I'm Your Man: The Life of Leonard Cohen. HarperCollins. ISBN 9780224090636. Archived from the original on January 25, 2013.\n\n\n== External links ==\n\nOfficial website \nLeonard Cohen at Curlie\nLeonard Cohen at IMDb\nStafford, Jeff (August 21, 2010). \"Bird on a Wire (1972)\". TCM Movie Morlocks. Documentary account of Cohen's European tour\n\"Leonard Cohen\". Rock and Roll Hall of Fame. \nBrittain, Donald; Owen, Don (1965). \"Ladies and Gentlemen ... Mr. Leonard Cohen\" (video). Documentary. National Film Board of Canada (NFB).\n\"Canadian Poetry: Studies/Documents/Reviews\". The Proceedings of the Leonard Cohen Conference (October 22–24, 1993). Red Deer College. 33. Fall 1993. Archived from the original on March 4, 2016. Retrieved March 13, 2011.\nLeonard Cohen at Find a Grave\nLeonard Cohen: A Crack in Everything at the Jewish Museum, New York.\nLeonard Cohen's Prince of Asturias acceptance speech 2011"