"Australian limes are species of the plant genus Citrus that are native to Australia and Papua New Guinea.\nThese species were formerly included in the genera Microcitrus and Eremocitrus. They have been used as a food source by indigenous Australians as well as early settlers and are used in modern Australian cuisine, including marmalade and sauces.Species include:\n\n\n== Species from Australia ==\n\n\n=== Natural species ===\nCitrus australasica (Finger lime), a species from rainforest regions of northern New South Wales and Southern Queensland with elongated yellow-green to purple fruits. \nCitrus australis (Round lime or Dooja), a species from south-eastern Australia with round, green fruits\nCitrus glauca (Desert lime), from arid inland areas of inland Australia. Small round fruits are produced in summer. \nCitrus garrawayi, (Mount White lime) is rare and endemic to the Cook District of Cape York Peninsula.\nCitrus gracilis (Kakadu lime or Humpty Doo lime) grows in eucalypt woodland in the Northern Territory and was first described in the scientific literature in 1998.\nCitrus inodora (Russell River lime or large-leaf Australian wild lime) is rare, and endemic to northern Queensland.\nCitrus maideniana (Maiden's Australian wild lime) may be a subspecies of C. inodora.\n\n\n=== Cultivars ===\n\nA number of cultivars have been developed in recent years. These can be grafted on to standard citrus rootstocks.  They may be grown as ornamental trees in the garden or in containers.\nGrafted standards are available for some varieties. The cultivars include:\n\n'Australian Outback' (or 'Australian Desert'), developed from several desert lime varieties\n'Australian Red Centre' (or 'Australian Blood' or Blood Lime), a cross of finger lime and a mandarin-lemon or mandarin-sweet orange hybrid\n'Australian Sunrise', a hybrid cross of finger lime and a calomondin which is pear shaped and orange inside\n'Rainforest Pearl', a pink-fruited form of finger lime from Bangalow, New South Wales\n'Sunrise Lime ', parentage unknown\n'Outback Lime', a desert lime cultivar\n\n\n== Species from Papua New Guinea ==\nCitrus warburgiana (Kakamadu or New Guinea wild lime) grows on the south coast of the Papuan Peninsula near Alatau (pictures).\nCitrus wakonai (also locally called kakamadu) has been reported from Goodenough Island.\nCitrus wintersii, also known as Citrus papuana (Brown River finger lime) has, as the name suggests, a small, thin fruit, pointed at both ends (pictures, more pictures). It grows near Port Moresby.\nClymenia sp. are native to the Bismarck Archipelago but are cultivated in other areas. Clymenia is now often considered to belong within the citrus genus.Clymenia platypoda\nClymenia polyandra has a lemon-sized round fruit, pointed at one end (pictures).Citrus species in Papua New Guinea have not been extensively studied, and there are likely to be more species than are listed here.\n\n\n== Identification ==\nAn identification key (p. 6 or 338) exists for the known Australian limes (not including species from Papua New Guinea). The leaves of some species broaden dramatically with age.\n\n\n== References =="