"The Nobel Peace Prize is one of the five Nobel Prizes established by the will of Swedish industrialist, inventor, and armaments (military weapons and equipment) manufacturer Alfred Nobel, along with the prizes in Chemistry, Physics, Physiology or Medicine, and Literature. Since March 1901, it has been awarded annually (with some exceptions) to those who have \"done the most or the best work for fraternity between nations, for the abolition or reduction of standing armies and for the holding and promotion of peace congresses\".In accordance with Alfred Nobel's will, the recipient is selected by the Norwegian Nobel Committee, a five-member committee appointed by the Parliament of Norway. Since 2020 the prize is awarded in the Atrium of the University of Oslo, where it was also awarded 1947–1989; the Abel Prize is also awarded in the building. The prize was previously awarded in Oslo City Hall (1990–2019), the Norwegian Nobel Institute (1905–1946), and the Parliament (1901–1904).\nDue to its political nature, the Nobel Peace Prize has, for most of its history, been the subject of numerous controversies. The most recent prize for 2021 was awarded to Maria Ressa and Dmitry Muratov.\n\n\n== Background ==\nAccording to Nobel's will, the Peace Prize shall be awarded to the person who in the preceding year \"shall have done the most or the best work for fraternity between nations, for the abolition or reduction of standing armies and for the holding and promotion of peace congresses\". Alfred Nobel's will further specified that the prize be awarded by a committee of five people chosen by the Norwegian Parliament.\n\nNobel died in 1896 and he did not leave an explanation for choosing peace as a prize category. As he was a trained chemical engineer, the categories for chemistry and physics were obvious choices. The reasoning behind the peace prize is less clear. According to the Norwegian Nobel Committee, his friendship with Bertha von Suttner, a peace activist and later recipient of the prize, profoundly influenced his decision to include peace as a category. Some Nobel scholars suggest it was Nobel's way to compensate for developing destructive forces. His inventions included dynamite and ballistite, both of which were used violently during his lifetime. Ballistite was used in war and the Irish Republican Brotherhood, an Irish nationalist organization, carried out dynamite attacks in the 1880s. Nobel was also instrumental in turning Bofors from an iron and steel producer into an armaments company.\nIt is unclear why Nobel wished the Peace Prize to be administered in Norway, which was ruled in union with Sweden at the time of Nobel's death. The Norwegian Nobel Committee speculates that Nobel may have considered Norway better suited to awarding the prize, as it did not have the same militaristic traditions as Sweden.  It also notes that at the end of the 19th century, the Norwegian parliament had become closely involved in the Inter-Parliamentary Union's efforts to resolve conflicts through mediation and arbitration.\n\n\n== Nomination and selection ==\n\nThe Norwegian Parliament appoints the Norwegian Nobel Committee, which selects the Nobel Peace Prize laureate.\n\n\n=== Nomination ===\nEach year, the Norwegian Nobel Committee specifically invites qualified people to submit nominations for the Nobel Peace Prize. The statutes of the Nobel Foundation specify categories of individuals who are eligible to make nominations for the Nobel Peace Prize. These nominators are:\n\nMembers of national assemblies and governments and members of the Inter-Parliamentary Union\nMembers of the Permanent Court of Arbitration and the International Court of Justice at the Hague\nMembers of Institut de Droit International\nAcademics at the professor or associate professor level in history, social sciences, philosophy, law, and theology, university rectors, university directors (or their equivalents), and directors of peace research and international affairs institutes\nPrevious recipients, including board members of organizations that have received the prize\nPresent and past members of the Norwegian Nobel Committee\nFormer permanent advisers to the Norwegian Nobel Institute\n\nThe working language of the Norwegian Nobel Committee is Norwegian; in addition to Norwegian the committee has traditionally received nominations in French, German and English, but today most nominations are submitted in either Norwegian or English. Nominations must usually be submitted to the committee by the beginning of February in the award year.  Nominations by committee members can be submitted up to the date of the first Committee meeting after this deadline.In 2009, a record 205 nominations were received, but the record was broken again in 2010 with 237 nominations; in 2011, the record was broken once again with 241 nominations. The statutes of the Nobel Foundation do not allow information about nominations, considerations, or investigations relating to awarding the prize to be made public for at least 50 years after a prize has been awarded. Over time, many individuals have become known as \"Nobel Peace Prize Nominees\", but this designation has no official standing, and means only that one of the thousands of eligible nominators suggested the person's name for consideration. Indeed, in 1939, Adolf Hitler received a satirical nomination from a member of the Swedish parliament, mocking the (serious but unsuccessful) nomination of Neville Chamberlain. Nominations from 1901 to 1967 have been released in a database.\n\n\n=== Selection ===\nNominations are considered by the Nobel Committee at a meeting where a shortlist of candidates for further review is created.  This shortlist is then considered by permanent advisers to the Nobel institute, which consists of the institute's Director and the Research Director and a small number of Norwegian academics with expertise in subject areas relating to the prize.  Advisers usually have some months to complete reports, which are then considered by the committee to select the laureate.  The Committee seeks to achieve a unanimous decision, but this is not always possible. The Nobel Committee typically comes to a conclusion in mid-September, but occasionally the final decision has not been made until the last meeting before the official announcement at the beginning of October.\n\n\n== Awarding the prize ==\n\nThe Chairman of the Norwegian Nobel Committee presents the Nobel Peace Prize in the presence of the King of Norway and the Norwegian royal family on 10 December each year (the anniversary of Nobel's death). The Peace Prize is the only Nobel Prize not presented in Stockholm. The Nobel laureate receives a diploma, a medal, and a document confirming the prize amount. As of 2019, the prize was worth 9 million SEK. In 2020 the ceremony returned to its former venue, the Atrium of the University of Oslo Faculty of Law, after being held in Oslo City Hall during the period 1990–2019.From 1947 to 1989, the Nobel Peace Prize ceremony was held in the Atrium of the University of Oslo Faculty of Law, a few hundred meters from Oslo City Hall. Between 1905 and 1946, the ceremony took place at the Norwegian Nobel Institute. From 1901 to 1904, the ceremony took place in the Storting (Parliament).\n\n\n== Criticism ==\nSome commentators have suggested that the Nobel Peace Prize has been awarded in politically motivated ways for more recent or immediate achievements, or with the intention of encouraging future achievements. Some commentators have suggested that to award a peace prize on the basis of the unquantifiable contemporary opinion is unjust or possibly erroneous, especially as many of the judges cannot themselves be said to be impartial observers. Further criticism holds that the Nobel Peace Prize has become increasingly politicized, in which people are awarded for aspiration rather than accomplishment, which has allowed for the prize to be used for political effect but can cause perverse consequences due to the neglect of existing power politics.In 2011, a feature story in the Norwegian newspaper Aftenposten contended that major criticisms of the award were that the Norwegian Nobel Committee ought to recruit members from professional and international backgrounds, rather than retired members of parliament; that there is too little openness about the criteria that the committee uses when they choose a recipient of the prize; and that the adherence to Nobel's will should be more strict. In the article, Norwegian historian Øivind Stenersen argues that Norway has been able to use the prize as an instrument for nation-building and furthering Norway's foreign policy and economic interests.In another 2011 Aftenposten opinion article, the grandson of one of Nobel's two brothers, Michael Nobel, also criticised what he believed to be the politicisation of the award, claiming that the Nobel Committee has not always acted in accordance with Nobel's will.\n\n\n=== Criticism of individual conferments ===\n\nThe awards given to Mikhail Gorbachev, Yitzhak Rabin, Shimon Peres and Yasser Arafat, Lê Đức Thọ, Henry Kissinger, Jimmy Carter, Al Gore, Liu Xiaobo, Barack Obama, and the European Union have all been the subject of controversy.\nThe joint award given to Lê Đức Thọ and Henry Kissinger prompted two dissenting Committee members to resign. Thọ refused to accept the prize, on the grounds that such \"bourgeois sentimentalities\" were not for him and that peace had not been achieved in Vietnam. Thọ said many year later that he did not want to share the prize with Kissinger, who he called \"the representative of American aggressors\". Kissinger donated his prize money to charity, did not attend the award ceremony and later offered to return his prize medal after the fall of South Vietnam to North Vietnamese forces 18 months later.In 1994, Kåre Kristiansen resigned from the Norwegian Nobel Committee in protest over the award of the prize to Yasser Arafat, whom he labeled \"world's most prominent terrorist\".\n\n\n=== Notable omissions ===\nForeign Policy has listed Mahatma Gandhi, Eleanor Roosevelt, U Thant, Václav Havel, Ken Saro-Wiwa, Fazle Hasan Abed and Corazon Aquino as people who \"never won the prize, but should have\".The omission of Mahatma Gandhi has been particularly widely discussed, including in public statements by various members of the Nobel Committee. The committee has confirmed that Gandhi was nominated in 1937, 1938, 1939, 1947, and, finally, a few days before his assassination in January 1948. The omission has been publicly regretted by later members of the Nobel Committee. Geir Lundestad, Secretary of Norwegian Nobel Committee in 2006 said, \"The greatest omission in our 106-year history is undoubtedly that Mahatma Gandhi never received the Nobel Peace Prize. Gandhi could do without the Nobel Peace prize, whether Nobel committee can do without Gandhi is the question\". In 1948, following Gandhi's death, the Nobel Committee declined to award a prize on the ground that \"there was no suitable living candidate\" that year. Later, when the Dalai Lama was awarded the Peace Prize in 1989, the chairman of the committee said that this was \"in part a tribute to the memory of Mahatma Gandhi\".\n\n\n== List of Nobel Peace Prize laureates ==\n\nAs of November 2020, the Peace Prize has been awarded to 107 individuals and 28 organizations. 17 women have won the Nobel Peace Prize, more than any other Nobel Prize. Only two recipients have won multiple Prizes: the International Committee of the Red Cross has won three times (1917, 1944, and 1963) and the Office of the United Nations High Commissioner for Refugees has won twice (1954 and 1981). Lê Đức Thọ is the only person who refused to accept the Nobel Peace Prize.\n\n\n== References ==\n\n\n== External links ==\n\"The Nobel Peace Prize\" – Official webpage of the Norwegian Nobel Committee\n\"The Nobel Peace Prize\" at the official site of the Nobel Prize\n\"All Nobel Laureates in Peace\"\n\"The Nobel Prize Award Ceremonies\"\nWorld Summit of Nobel Peace Laureates, official site with information on annual summits beginning in 1999\n\"National Peace Nobel Prize shares 1901–2009 by citizenship (or home of the organization) at the time of the award.\" – From J. Schmidhuber (2010): Evolution of National Nobel Prize Shares in the 20th Century at arXiv:1009.2634v1Martin Luther King, Jr.'s Nobel Peace Prize, Civil Rights Digital Library\nThe Nobel Peace Prize Watch, the main project of The Lay Down your Arms Association"