"Human overpopulation (or human population overshoot) is the concept of a human population becoming too large to be sustained by its environment in the long term. The idea is usually discussed in the context of world population, though it may also concern regions. Human population growth has increased in recent centuries due to medical advancements and improved agricultural productivity. Those concerned by this trend argue that it results in a level of resource consumption which exceeds the environment's carrying capacity, leading to population overshoot. The concept is often discussed in relation to other population concerns such as demographic push and depopulation, as well as in relation to resource depletion and the human impact on the environment. \nDiscussion of overpopulation follow a similar line of inquiry as Malthusianism and its Malthusian catastrophe, a hypothetical event where population exceeds agricultural capacity, causing famine or war over resources, resulting in poverty and depopulation. \nRecent discussion of overpopulation was popularized by Paul Ehrlich in his 1968 book The Population Bomb. Ehrlich described overpopulation as a function of overconsumption, arguing that overpopulation should be defined by a population being unable to sustain itself without depleting non-renewable resources. Modern proponents of the concept have suggested a link between overpopulation and human-caused environmental issues such as global warming and biodiversity loss. To mitigate this, population planning strategies have been advocated to establish what proponents consider a sustainable population.\nThe concept of overpopulation is controversial. A 2015 article in Nature listed overpopulation as a pervasive science myth. Demographic projections suggest that population growth will stabilise in the 21st century, and many experts believe that global resources can meet this increased demand, suggesting a global overpopulation scenario is unlikely. Critics highlight how attempts to blame environmental issues on overpopulation tend to oversimplify complex social or economic systems, or place blame on developing countries and poor populations—reinscribing colonial or racist assumptions. For these reasons, critics of overpopulation suggest overconsumption be treated as an issue separate from population growth. However, many in the scientific community consider population growth a significant factor in ecological and societal problems.\n\n\n== History of concept ==\nConcerns about population size or density have a long history: Tertullian, a resident of the city of Carthage in the second century CE, criticized population at the time saying  \"Our numbers are burdensome to the world, which can hardly support us.. In very deed, pestilence, and famine, and wars, and earthquakes have to be regarded as a remedy for nations, as the means of pruning the luxuriance of the human race.\" Despite these concerns, scholars have not found historic societies which have collapsed because of overpopulation or overconsumption. This could be because, prior to modern medicine, infectious diseases prevented populations from growing too large.By the beginning of the 19th century, intellectuals such as Thomas Malthus predicted that humankind would outgrow its available resources because a finite amount of land would be incapable of supporting a population with limitless potential for increase. During the 19th century, Malthus' work, particularly An Essay on the Principle of Population, was often interpreted in a way that blamed the poor alone for their condition and helping them was said to worsen conditions in the long run. This resulted, for example, in the English poor laws of 1834 and a hesitating response to the Irish Great Famine of 1845–52.Paul R. Ehrlich's book The Population Bomb became a bestseller upon its release in 1968, creating renewed interest in overpopulation. The book predicted population growth would lead to famine, societal collapse, and other social, environmental and economic strife in the coming decades, and advocated for policies to curb it. The idea of overpopulation was also a topic of some works of English-language science fiction and dystopian fiction during the latter part of the 1960s. Human population and family planning policies were adopted by some nations in the late 20th century in an effort to curb population growth, including in China and India. Albert Allen Bartlett gave more than 1,742 lectures on the threat of exponential population growth starting in 1969.As the profile of environmental issues facing humanity increased during the end of the 20th century, some have looked to population growth as a root cause. A 2015 survey from Pew Research Center reports that 82% of scientists associated with the American Association for the Advancement of Science are concerned about human overpopulation. In 2017, more than one-third of 50 Nobel prize-winning scientists surveyed by the Times Higher Education at the Lindau Nobel Laureate Meetings said that human overpopulation and environmental degradation are the two greatest threats facing mankind. In November that same year, a statement by 15,364 scientists from 184 countries indicated that rapid human population growth is \"a primary driver behind many ecological and even societal threats.\" In 2019, a warning on climate change signed by 11,000 scientists from 153 nations said that human population growth adds 80 million humans annually, and \"the world population must be stabilized—and, ideally, gradually reduced—within a framework that ensures social integrity\" to reduce the impact of \"population growth on GHG emissions and biodiversity loss.\"\n\n\n=== Advocacy organizations ===\n\nMore recently, overpopulation organizations have promoted the conversation in academic and policy circles. Organizations focused on population stabilization and population concern often focus on the policy of particular governments, or particular solutions to overpopulation. Some of these organizations are popular or visible because of their association with major public figures, such as Population Matters' connection with David Attenborough, while others are more closely associated with particular academic interpretations or solutions.\n\n\n== Global population dynamics, their history and factors ==\n\nWorld population has been rising continuously since the end of the Black Death, around the year 1350. The fastest doubling of the world population happened between 1950 and 1986: a doubling from 2.5 to 5 billion people in just 37 years,  mainly due to medical advancements and increases in agricultural productivity. Due to its dramatic impact on the human ability to grow food, the Haber process enabling the global population to increase from 1.6 billion in 1900 to 7.7 billion by November 2018.Some researchers analyze this growth in population like other animal populations, human populations predictably grow and shrink according to their available food supply (see Lotka–Volterra equations), including agronomist and insect ecologist David Pimentel, behavioral scientist Russell Hopfenberg, and anthropologist Virginia Abernethy.\n\n\n=== History of world population ===\n\nWorld population has gone through a number of periods of growth since the dawn of civilization in the Holocene period, around 10,000 BCE. The beginning of civilization roughly coincides with the receding of glacial ice following the end of the last glacial period.Farming allowed for the growth of populations in many parts of the world, including Europe, the Americas and China through the 1600s, occasionally disrupted by plagues or other crisis. For example, the Black Death is thought to have reduced the world's population, then at an estimated 450 million, to between 350 and 375 million by 1400.After the start of the Industrial Revolution, during the 18th century, the rate of population growth began to increase. By the end of the century, the world's population was estimated at just under 1 billion. At the turn of the 20th century, the world's population was roughly 1.6 billion. Dramatic growth beginning in 1950 (above 1.8% per year) coincided with greatly increased food production as a result of the industrialization of agriculture brought about by the Green Revolution. The rate of human population growth peaked in 1964, at about 2.1% per year. By 1940, this figure had increased to 2.3 billion. Each subsequent addition of a billion humans took less and less time: 33 years to reach three billion in 1960, 14 years for four billion in 1974, 13 years for five billion in 1987, and 12 years for six billion in 1999.On 14 May 2018 , the United States Census Bureau calculates 7,472,985,269 for that same date and the United Nations estimated over 7 billion. In 2017, the United Nations increased the medium variant projections to 9.8 billion for 2050 and 11.2 billion for 2100. The UN population forecast of 2017 was predicting \"near end of high fertility\" globally and anticipating that by 2030 over ⅔ of the world population will be living in countries with fertility below the replacement level and for total world population to stabilize between 10 and 12 billion people by the year 2100.\n\n\n== Proposed impacts ==\nBiologists and sociologists have discussed overpopulation as a threat to the quality of human life. Some environmentalists, such as Pentti Linkola, have argued human overpopulation represents a threat to Earth's biosphere.Paul R. Ehrlich argued in 2017:\n\nRich western countries are now siphoning up the planet's resources and destroying its ecosystems at an unprecedented rate. We want to build highways across the Serengeti to get more rare earth minerals for our cellphones. We grab all the fish from the sea, wreck the coral reefs and put carbon dioxide into the atmosphere. We have triggered a major extinction event ... If everyone consumed resources at the US level—which is what the world aspires to—you will need another four or five Earths. We are wrecking our planet's life support systems.\nHowever, Ehrlich's earlier predictions were controversial. In 1968 book The Population Bomb, he stated that \"[i]n the 1970s hundreds of millions of people will starve to death in spite of any crash programs embarked upon now,\" with later editions changing to instead be \"in the 1980s\".\n\n\n=== Poverty, and infant and child mortality ===\n\nAlthough proponents of human overpopulation have expressed concern that growing population will lead to an increase in global poverty and infant mortality, both indicators have declined over the last 200 years of population growth.\n\n\n=== Environmental impacts ===\n\nIt has been suggested that overpopulation has substantially adversely impacted the environment of Earth starting at least as early as the 20th century.  There are also economic consequences of environmental degradation caused by excess waste production and overconsumption in the form of ecosystem services attrition. Some scientists suggest that the overall human impact on the environment during the Great Acceleration, particularly due to human population size and growth, economic growth, overconsumption, pollution, and proliferation of technology, has pushed the planet into a new geological epoch known as the Anthropocene.However, even in countries which have both large population growth and major ecological problems, it is not necessarily true that curbing the population growth will make a major contribution towards resolving all environmental problems.\n\nSome studies and commentary link population growth with climate change. However, critics have pointed out population growth may have less influence on climate change than other factors. The global consumption of meat is projected to rise by as much as 76% by 2050 as the global population increases, with this projected to have further environmental impacts such as biodiversity loss and increased greenhouse gas emissions.Continued population growth and overconsumption have been posited as key drivers of biodiversity loss and the 6th (and ongoing) mass extinction, with some researchers and environmentalists specifically suggesting this indicates a human overpopulation scenario. Some prominent scientists and environmentalists, including Jared Diamond, E. O. Wilson, Jane Goodall and David Attenborough contend that population growth is devastating to biodiversity. Wilson for example, has expressed concern when Homo sapiens reached a population of six billion their biomass exceeded that of any other large land dwelling animal species that had ever existed by over 100 times.\n\n\n=== Resource depletion ===\n\nSome commentary has attributed depletion of non-renewable resources, such as land, food and water, to overpopulation and suggested it could lead to a diminished quality of human life. Ecologist David Pimentel was one such proponent, saying \"with the imbalance growing between population numbers and vital life sustaining resources, humans must actively conserve cropland, freshwater, energy, and biological resources. There is a need to develop renewable energy resources. Humans everywhere must understand that rapid population growth damages the Earth's resources and diminishes human well-being.\"Although food shortages have been warned as a consequence of overpopulation, according to the Food and Agriculture Organization, global food production exceeds increasing demand from global population growth. Food insecurity in some regions is attributable to the globally unequal distribution of food supplies. Some proponents of overpopulation warn expansion of agricultural production to meet population growth is likely to have a substantial impact on the environment, and have expressed concern at usable land area becoming limited.The notion that space is limited has been decried by skeptics, who point out that the Earth's population of roughly 6.8 billion people could comfortably be housed an area comparable in size to the state of Texas, in the United States (about 269,000 square miles or 696,706.80 square kilometres). Critics suggest changes to policies relating to land use or agriculture would be more likely to resolve land shortage issues.Water scarcity, on which agriculture depends, represents a global issue that some have linked to population growth. Although water is not scarce on a global scale, water issues persist in many developing countries.\n\n\n=== Other ===\nLow life expectancy in countries with fastest growing populations. Overall life expectancy has increased globally despite of population growth, including countries with fast-growing populations.\nLess personal freedom and more restrictive laws. It was speculated by Aldous Huxley in 1958 that democracy is threatened by overpopulation, and could give rise to totalitarian style governments. Physics professor Albert Allen Bartlett at the University of Colorado Boulder warned in 2000 that overpopulation and the development of technology are the two major causes of the diminution of democracy. However, over the last 200 years of population growth, the actual level of personal freedom has increased rather than declined.\n\n\n== Future dynamics ==\n\n\n=== Projections of population growth ===\n\n\n=== Overconsumption ===\n\nSome groups (for example, the World Wide Fund for Nature and Global Footprint Network) have stated that the yearly biocapacity of Earth is being exceeded as measured using the ecological footprint. In 2006, WWF's \"Living Planet Report\" stated that in order for all humans to live with the current consumption patterns of Europeans, we would be spending three times more than what the planet can renew. Humanity as a whole was using, by 2006, 40 percent more than what Earth can regenerate. However, Roger Martin of Population Matters states the view: \"the poor want to get rich, and I want them to get rich,\" with a later addition, \"of course we have to change consumption habits,... but we've also got to stabilise our numbers\". Another study by the World Wildlife Fund in 2014 found that it would take the equivalent of 1.5 Earths of biocapacity to meet humanity's current levels of consumption.But critics question the simplifications and statistical methods used in calculating ecological footprints. Therefore, Global Footprint Network and its partner organizations have engaged with national governments and international agencies to test the results—reviews have been produced by France, Germany, the European Commission, Switzerland, Luxembourg, Japan and the United Arab Emirates. Some point out that a more refined method of assessing Ecological Footprint is to designate sustainable versus non-sustainable categories of consumption.\n\n\n=== Carrying capacity ===\n\nMany attempts have been made to estimate the world's carrying capacity for humans; the maximum population the world can host. A 2004 meta-analysis of 69 such studies from 1694 until 2001 found the average predicted maximum number of people the Earth would ever have was 7.7 billion people, with lower and upper meta-bounds at 0.65 and 98 billion people, respectively. They conclude: \"recent predictions of stabilized world population levels for 2050 exceed several of our meta-estimates of a world population limit\".A 2012 United Nations report summarized 65 different estimated maximum sustainable population sizes and the most common estimate was 8 billion. Advocates of reduced population often put forward much lower numbers. Paul R. Ehrlich stated in 2018 that the optimum population is between 1.5 and 2 billion. Geographer Chris Tucker estimates that 3 billion is a sustainable number.Critics of overpopulation criticize the basic assumptions associated with these estimates. For example, Jade Sasser believes that calculating a maximum of number of humanity is unethical while only some, mostly privileged European former colonial powers, are mostly responsible for unsustainably using up Earth's resources.\n\n\n== Proposed solutions and mitigation measures ==\nSeveral strategies have been proposed to mitigate overpopulation.\n\n\n=== Population planning ===\nSeveral scientists (including e.g. Paul and Anne Ehrlich and Gretchen Daily) proposed that humanity should work at stabilizing its absolute numbers, as a starting point towards beginning the process of reducing the total numbers. They suggested the following solutions and policies: following a small-family-size socio-cultural-behavioral norm worldwide (especially one-child-per-family ethos), and providing contraception to all along with proper education on its use and benefits (while providing access to safe, legal abortion as a backup to contraception), combined with a significantly more equitable distribution of resources globally. Australian scientist Tim Flannery has advocated for population planning, including in Australia, after suggesting the country's environment could not support its growing population.Population planning that is intended to reduce population size or growth rate may promote or enforce one or more of the following practices, although there are other methods as well:\n\nGreater and better access to contraception\nReducing infant mortality so that parents do not need to have many children to ensure at least some survive to adulthood.\nImproving the status of women in order to facilitate a departure from traditional sexual division of labour.\nFamily planning\nCreating small family \"role models\"\n\n\n==== Education and empowerment ====\n\nEducation and empowerment of women and giving access to family planning and contraception have demonstrated positive impacts on reducing birthrates. Many studies conclude that educating girls reduces the number of children they have. One option according to some activists is to focus on education about family planning and birth control methods, and to make birth-control devices like condoms, contraceptive pills and intrauterine devices easily available. Worldwide, nearly 40% of pregnancies are unintended (some 80 million unintended pregnancies each year). An estimated 350 million women in the poorest countries of the world either did not want their last child, do not want another child or want to space their pregnancies, but they lack access to information, affordable means and services to determine the size and spacing of their families. In the developing world, some 514,000 women die annually of complications from pregnancy and abortion, with 86% of these deaths occurring in the sub-Saharan Africa region and South Asia. Additionally, 8 million infants die, many because of malnutrition or preventable diseases, especially from lack of access to clean drinking water.Women's rights and their reproductive rights in particular are issues regarded to have vital importance in the debate. This incentive, however, has been questioned by Rosalind Pollack Petchesky. Citing his attendance of the 1994 Cairo conference, he reported that overpopulation and birth control were being diverted by feminists into women's rights issues, mostly downplaying the overpopulation issue as only one minor matter of many others; most of these focusing on women's rights. Upon his observation, he argued this was forging many faults and distractions on the main problem of human overpopulation and how to solve it.\n\n\n==== Coercive population control policies ====\n\nSome nations, like China, have used strict or coercive measures such as the one-child policy to reduce birth rates. Compulsory sterilization has also been implemented in many countries as a form of population control.Another choice-based approach is financial compensation or other benefits (free goods and/or services) by the state (or state-owned companies) offered to people who voluntarily undergo sterilization. Such compensation has been offered in the past by the government of India.\n\n\n=== Extraterrestrial settlement ===\n\n\n=== Urbanization ===\nDespite the increase in population density within cities (and the emergence of megacities), UN Habitat states in its reports that urbanization may be the best compromise in the face of global population growth. Cities concentrate human activity within limited areas, limiting the breadth of environmental damage. UN Habitat says this is only possible if urban planning is significantly improved.Paul Ehrlich pointed out in his book The Population Bomb (1968) argues that rhetoric supporting the increase of city density as a means of avoiding dealing with the actual problem of overpopulation to begin with and rather than treating the increase of city density as a symptom of the root problem, it has been promoted by the same interests that have profited from population increase e.g. property developers, the banking system, which invests in property development, industry, municipal councils etc. Subsequent authors point to growth economics as driving governments seek city growth and expansion at any cost disregarding the impact it might have on the environment.\n\n\n== Criticism ==\n\nThe concept of human overpopulation, and its attribution as a cause of environmental issues, are controversial.Some critics refer to what they call the \"myth of overpopulation\". Critics suggest that enough resources are available to support projected population growth, and that human impacts on the environment are not attributable to overpopulation. According to libertarian think tank the Fraser Institute, both the idea of overpopulation and the alleged depletion of resources are myths; most resources are now more abundant than a few decades ago, thanks to technological progress. The Institute is also questioning the sincerity of advocates of population control in poor countries.Demographer Nicholas Eberstadt has criticised the idea of overpopulation, saying that \"overpopulation is not really overpopulation. It is a question of poverty\".A 2020 study in The Lancet concluded that \"continued trends in female educational attainment and access to contraception will hasten declines in fertility and slow population growth\", with projections suggesting world population would peak at 9.73 billion in 2064 and fall by 2100. Media commentary interpreted this as suggesting overconsumption represents a greater environmental threat as an overpopulation scenario may never occur.Some human population planning strategies advocated by proponents of overpopulation are controversial for ethical reasons. Those concerned with overpopulation, including Paul Elrich, have been accused of influencing human rights abuses including forced sterilisation policies in India and under China's one-child policy, as well as mandatory or coercive birth control measures taken in other countries.\n\n\n=== Women's rights ===\n\nInfluential advocates such as Betsy Hartmann consider the \"myth of overpopulation\" to be destructive as it “prevents constructive thinking and action on reproductive rights,” which acutely effects women and communities of women in poverty. The 1994 International Conference on Population and Development (ICPD) define reproductive rights as “the basic right of all couples and individuals to decide freely and responsibly the number, spacing, and timing of their children and to have the information to do so.\"  This oversimplification of human overpopulation leads individuals to believe there are simple solutions and the creation of population policies that limit reproductive rights.  \nScholar Heather Alberro argues to reject the overpopulation argument, stating that the human population growth is rapidly slowing down, the underlying problem is not the number of people, but how resources are distributed and that the idea of overpopulation could fuel a racist backlash against the population of poor countries.\n\n\n=== Racism ===\n\nThe argument of overpopulation has been criticized by some scholars and environmentalists as being racist and having roots in colonialism and white supremacy, since control and reduction of human population is often focused on the global south, instead of on overconsumption and the global north. George Monbiot has said \"when affluent white people wrongly transfer the blame for their environmental impacts on to the birthrate of much poorer brown and black people, their finger-pointing reinforces [white genocide conspiracy] narratives. It is inherently racist.\" Overpopulation is said to be a common component of ecofascist ideology.\n\n\n=== By public figures ===\nSome billionaires have expressed concern that impending population collapse is the greatest ecological threat, more so than pollution, environmental degradation or climate change. Elon Musk is a vocal critic of the idea of overpopulation. According to Musk, proponents of the idea are misled by their immediate impressions from living in dense cities. Because of the negative replacement rates in many countries, he expects that by 2039 the biggest issue will be population collapse, not explosion. Jack Ma expressed a similar opinion. However, these sentiments are not supported by data and practically all population projections point to the human population reaching at least 10 billion people by 2100.\n\n\n== See also ==\n\n\n== References ==\n\n\n== Further reading ==\nDavid Foreman, Man Swarm: How Overpopulation is Killing the Wild World. Livetrue Books, 2015. ISBN 978-0986383205\nKaren Shragg, Move Upstream: A Call to Solve Overpopulation. ISBN 978-0988493834 (published November 2015). Discussion of the book by the author, March 2017 (video, 91 minutes).\nAlan Weisman. Countdown: Our Last, Best Hope for a Future on Earth? Little, Brown and Company, (2013) ISBN 0316097756\nThomas Robertson, The Malthusian Moment: Global Population Growth and the Birth of American Environmentalism (2012), Rutgers University Press\nJ.R. McNeill, Peter Engelke, The Great Acceleration: An Environmental History of the Anthropocene since 1945 (2016)"