"Human overpopulation (or human population overshoot) is the concept of a human population becoming too large to be sustained by its environment in the long term. The idea is usually discussed in the context of world population, though it may also concern regions. Human population growth has increased in recent centuries due to medical advancements and improved agricultural productivity. Those concerned by this trend argue that it results in a level of resource consumption which exceeds the environment's carrying capacity, leading to population overshoot. The concept is often discussed in relation to other population concerns such as demographic push and depopulation, as well as in relation to resource depletion and the human impact on the environment. \nDiscussion of overpopulation follow a similar line of inquiry as Malthusianism and its Malthusian catastrophe, a hypothetical event where population exceeds agricultural capacity, causing famine or war over resources, resulting in poverty and depopulation. \nRecent discussion of overpopulation was popularized by Paul Ehrlich in his 1968 book The Population Bomb. Ehrlich described overpopulation as a function of overconsumption, arguing that overpopulation should be defined by a population being unable to sustain itself without depleting non-renewable resources. Modern proponents of the concept have suggested a link between overpopulation and human-caused environmental issues such as global warming and biodiversity loss. To mitigate this, population planning strategies have been advocated to establish what proponents consider a sustainable population.\nThe concept of overpopulation is controversial. A 2015 article in Nature listed overpopulation as a pervasive science myth. Demographic projections suggest that population growth will stabilise in the 21st century, and many experts believe that global resources can meet this increased demand, suggesting a global overpopulation scenario is unlikely. Critics highlight how attempts to blame environmental issues on overpopulation tend to oversimplify complex social or economic systems, or place blame on developing countries and poor populations—reinscribing colonial or racist assumptions. For these reasons, critics of overpopulation suggest overconsumption be treated as an issue separate from population growth. However, many in the scientific community consider population growth a significant factor in ecological and societal problems."