"Pyromancy (from Greek pyr, “fire,” and manteia, “divination”) is the art of divination by means of fire.\n\n\n== History of pyromancy ==\nDue to the importance of fire in society in prehistory and its continued importance within civilizations, it is quite likely that pyromancy was one of the earlier forms of divination, arising independently in many civilizations around the world.\nIn much of Western Culture, fire was often associated with a god, or was revered as a god itself. Fire was associated with a living being--it ate, breathed, grew, decayed, and died--in both Western and non-Western religions. Fire was so basic to the human experience that it persisted in the minds of humanity as an element close to nature.Fire rituals in Mesopotamia and Eurasia were thought to originate with Ancient Zoroastrian rituals around the use of fire in temples and on altars. Ancient Zoroastrians believe fire to have been “the most holy spirit” from which all life was born, and was used as a central icon in many rituals.In the Old Testament, fire was often associated with divine intervention; with the burning bush guiding the decision of Moses, and the pillar of fire guiding the Israelites in the wilderness. Even the burning of Sodom and Gomorrah was accomplished through divine retribution.Greek legends of the origins of fire speaks to the importance of fire to separate humans from animals. To many Ancient Greeks, fire was a godly element bestowed by higher forces; given to humanity by the Titan Prometheus. It is said that in Greek society, virgins at the Temple of Athena in Athens regularly practiced pyromancy. It is also likely the followers of Hephaestus, the Greek god of fire and the forge, practiced pyromancy.In Renaissance magic, pyromancy was classified as one of the seven \"forbidden arts,\" along with necromancy, geomancy, aeromancy, hydromancy, chiromancy (palmistry), and scapulimancy.Fire rituals in East Asia most often revolved around animal bones. In Ancient China, Japan, and Tibet, bones from animal scapula (the shoulder bone) would be thrown into fires, and the cracks would be interpreted to divine the future. In Japan, specifically, turtle shells would also be used as a ritualistic divination technique. In Tibet such divination was used to understand natural phenomena otherwise inexplicable to villagers. Lamps using animal fat were often burned by ancient Tibetan peoples, and the smoke and flames were interpreted as the guidance of natural forces.\n\n\n== Types of pyromancy ==\nThe most basic form of pyromancy is that in which the diviner observes flames, from a sacrificial fire, a candle, or another source of flame, and interprets the shapes that he or she sees within them.  There are several variations on pyromancy, however, some of which are as follows:\n\nAlomancy, divination by salt, one type of which involves casting salt into a fire\nBotanomancy, divination by burning plants\nCapnomancy, divination by smoke; light, thin smoke that rose straight up was a good omen; otherwise, a bad one.\nCausinomancy, divination by burning (non-specific as to the object burned)\nDaphnomancy (also, Empyromancy), divination by burning laurel leaves\nOsteomancy, divination using bones, one type of which involves heating to produce cracks\nPlastromancy, divination using turtle plastrons; in China, this was done by heating pits carved into them.\nScapulimancy, divination by scapulae; in Asia and North America, this was done pyromantically.\nSideromancy, divination by burning straw with an iron.\n\n\n== References =="