"Magic: The Gathering (colloquially known as Magic or MTG) is a tabletop and digital collectible card game created by Richard Garfield. Released in 1993 by Wizards of the Coast (now a subsidiary of Hasbro), Magic was the first trading card game and had approximately thirty-five million players as of December 2018, and over twenty billion Magic cards were produced in the period from 2008 to 2016, during which time it grew in popularity.A player in Magic takes the role of a Planeswalker, doing battle with other players as Planeswalkers by casting spells, using artifacts, and summoning creatures as depicted on individual cards drawn from their individual decks. A player defeats their opponent typically (but not always) by casting spells and attacking with creatures to deal damage to the opponent's \"life total,\" with the object being to reduce it from 20 to 0. Although the original concept of the game drew heavily from the motifs of traditional fantasy role-playing games such as Dungeons & Dragons, the gameplay bears little similarity to pencil-and-paper adventure games, while simultaneously having substantially more cards and more complex rules than many other card games.\nMagic can be played by two or more players, either in person with printed cards or on a computer, smartphone or tablet with virtual cards through the Internet-based software Magic: The Gathering Online or other video games such as Magic: The Gathering Arena. It can be played in various rule formats, which fall into two categories: constructed and limited. Limited formats involve players building a deck spontaneously out of a pool of random cards with a minimum deck size of 40 cards; in constructed formats, players create decks from cards they own, usually with a minimum of 60 cards per deck.\nNew cards are released on a regular basis through expansion sets. An organized tournament system (the DCI) played at the international level and a worldwide community of professional Magic players has developed, as well as a substantial resale market for Magic cards. Certain cards can be valuable due to their rarity in production and utility in gameplay, with prices ranging from a few cents to tens of thousands of dollars.\n\n\n== Gameplay ==\n\nA standard game of Magic involves two or more players who are engaged in a battle acting as powerful wizards, known as Planeswalkers. Each player has their own deck of cards, either one previously constructed or made from a limited pool of cards for the event. A player starts the game with a \"life total\" of twenty and loses the game when their life total is reduced to zero. A player can also lose if they must draw from an empty deck. In addition, some cards specify other ways to win or lose the game.Cards in Magic: The Gathering have a consistent format, with half of the face of the card showing the card's art, and the other half listing the card's mechanics, often relying on commonly-reused keywords to simplify the card's text. Cards fall into generally two classes: lands and spells. Lands provide mana, or magical energy, which is used as magical fuel when the player attempts to cast spells. Players can only play one land card per turn, with most land providing a specific color of mana when they are \"tapped\" (usually by rotating the card 90 degrees to show it has been used that turn), with each land only able to be tapped for mana once per turn. Spells consume mana, typically with at least one or more mana of a specific color. More powerful spells cost more mana, so as the game progresses, more land will be in play, more mana will be available, and the quantity and relative power of the spells played tends to increase. Spells come in several varieties: non-permanents like \"sorceries\" and \"instants\" have a single, one-time effect before they go to the \"graveyard\" (discard pile); \"enchantments\" and \"artifacts\" that remain in play after being cast to provide a lasting magical effect; and \"creature\" spells summon creatures that can attack and damage an opponent as well as used to defend from the opponent's creature attacks. Land, enchantments, artifacts, and creature cards are considered permanents as they remain in play until removed by other spells, ability, or combat effects. The set Lorwyn introduced the new \"planeswalker\" card type, which represents powerful allies who fight with their own magic abilities.Players begin the game by shuffling their decks and then drawing seven cards. On each player's turn, following a set phase order, they draw a card, tap their lands and other permanents as necessary to gain mana as to cast spells, engage their creatures in a single attack round against their opponent who may use their own creatures to block the attack, and then complete other actions with any remaining mana. Tapped resources remain tapped until the start of the player's next turn, which may leave them without land to draw for mana to cast spells in reaction to their opponent, or without creatures to block attacks, so the player must also plan ahead for their opponent's turn. Most actions that a player can perform enter the \"Stack\", a concept similar to the stack in computer programming, as either player can react to these actions with other actions, such as counter-spells; the stack provides a method of resolving complex interactions that may result in certain scenarios.\n\n\n=== Deck construction ===\n\nDeck building requires strategy as players must choose among thousands of cards which they want to play. This requires players to evaluate the power of their cards, as well as the possible synergies between them, and their possible interactions with the cards they expect to play against (this \"metagame\" can vary in different locations or time periods). The choice of cards is usually narrowed by the player deciding which colors they want to include in the deck. This decision is a key part of creating a deck. In general, reducing the number of colors used increases the consistency of play and the probability of drawing the lands needed to cast one's spells, at the expense of restricting the range of tactics available to the player. Part of the Magic product line has been starter decks which are aimed to provide novice players with ideas for deck building. Players expand their card library for deck building through booster packs, which have a random distribution of cards from a specific Magic set and defined by rarity. These rarities are known as Common, Uncommon, Rare, and Mythic, with generally more powerful cards having higher rarities.\nMost sanctioned games for Magic: The Gathering under the DCI use the based Constructed format that require players to build their decks from their own library of cards. In general, this requires a minimum of sixty cards in the deck, and, except for basic land cards, no more than four cards of the same named card. The pool of cards is also typically limited to the Standard rotation, which consists of the base sets and expansions that have been released in the last two years. The Standard format helps to prevent \"power creep\" that can be difficult to predict with the size of the Magic card library and help give newer players a fair advantage with long-term players. Other Constructed formats exist that allow for use of older expansions to give more variety for decks. A large variety of formats have been defined by DCI that allow different pools of expansions to be used or alter deck construction rules for special events.\nIndividual cards may be listed as \"restricted\", where only one copy can be included in a deck, or simply \"banned\", at the DCI's discretion. These limitations are usually for balance of power reasons, but have been occasionally made because of gameplay mechanics, for example, with the elimination of the \"play for ante\" mechanics in all formal formats, all such cards with this feature are banned. More recently, older cards have been banned from all formal play by Wizards due to inappropriate racial or cultural depictions in their text or illustrations in the wake of the George Floyd protests, and their images have been blocked or removed from online Magic databases. This included a card called \"Invoke Prejudice,\" which was displayed on the official card index site Gatherer \"at a web URL ending in '1488,' numbers that are synonymous with white supremacy.\" During the COVID-19 pandemic which drew more players to the online Magic games and generated volumes of data of popular deck constructions, Wizards was able to track popular combinations more quickly than in a purely paper game, and in mid-2020, banned additional cards that in specific combos could draw out games far longer than desired.In the Limited format, a small number of cards are opened for play from booster packs or tournament packs, and a minimum deck size of forty cards is enforced. The most popular limited format is Booster Draft, in which players open a booster pack, choose a card from it, and pass it to the player seated next to them. This continues until all the cards have been picked, and then a new pack is opened. Three packs are opened in total, and the direction of passing alternates left-right-left. Once the draft is done, players create 40-card decks out of the cards they picked, basic land cards being provided for free, and play games with the players they drafted with. There are no banned or restricted cards in limited formats.\n\n\n=== Colors of Magic ===\n\nMost cards in Magic are based on one of five colors that make up the game's \"Color Wheel\" or \"Color Pie\", shown on the back of each card, and each representing a school or realm of magic: white, blue, black, red, and green. The arrangement of these colors on the wheel describe relationships between the schools, which can broadly affect deck construction and game execution. For a given color such as white, the two colors immediate adjacent to it, green and blue, are considered complementary, while the two colors on the opposite side, black and red, are its opposing schools. The Research and Development (R&D) team at Wizards of the Coast aimed to balance power and abilities among the five colors by using the Color Pie to differentiate the strengths and weaknesses of each. This guideline lays out the capabilities, themes, and mechanics of each color and allows for every color to have its own distinct attributes and gameplay. The Color Pie is used to ensure new cards are thematically in the correct color and do not infringe on the territory of other colors.The concepts behind each of the colors on the Color Wheel, based on a series of articles written by Mark Rosewater, are as follows:\nWhite represents order, peace, and light, and draws mana from plains. White planeswalkers can summon individually weak creatures that are collectively strong as a group such as soldiers, as well as powerful creatures and leaders that can impart buffs across all of the player's creatures. Their spells tend to focus on healing or preventing damage, protecting their allies, and neutralizing advantages on the battlefield by their opponents.\nBlue represents intellect, logic, manipulation, and trickery, and pulls its mana from islands. Its magic is typically associated with the classical elements of air and water. Many of Blue's spells can interact or interfere with the opponent's spells as well as with the general flow of the game. Blue's magic is also associated with control, allowing the player to gain temporary or full control of the opponent's creatures. Blue creatures often tend to be weak but evasive and difficult to target.\nBlack represents power, death, corruption, and sacrifice, drawing mana from swamps. Many of Black's creatures are undead, and several can be sacrificed to make other creatures more powerful, destroy opponent's creatures or permanents, or other effects. Black creatures may be able to draw the life taken in an attack back to their caster, or may even be able to kill creatures through a deathtouch effect. Black's spells similarly coerce sacrifice by the player or their opponent through cards or life.\nRed represents freedom, chaos, fury, and warfare, pulling its power from mountains. Its powers are associated with the classical fire and earth elements, and tends to have the strongest spells such as fireballs that can be powered-up by tapping additional mana when cast. Red is an offense-oriented class: in addition to powerful creatures like dragons, red planeswalkers can summon weak creatures that can strike quickly to gain the short-term edge.\nGreen is the color of life, nature, evolution, and indulgence, drawing mana from forests. Green has the widest array of creatures to draw upon, ranging across all power levels, and generally is able to dominate the battlefield with many creatures at play at once. Green creatures and spells can generate life points and mana, and can also gain massive strength through spells.Most cards in Magic: The Gathering are based on a single color, shown along the card's border. The cost to play them requires some mana of that color and potentially any amount of mana from any other color. Multicolored cards were introduced in the Legends and typically use a gold border. Their casting cost includes mana from at least two different colors plus additional mana from any color. Hybrid cards, included with Ravnica, use a two-color gradient border. These cards can be cast using mana from either color shown, in addition to other mana costs. Finally, colorless cards, such as some artifacts, do not have any colored mana requirements but still require a general amount of mana to be spent to play.\nThe color wheel can influence deck construction choices. Cards from colors that are aligned such as red and green often provide synergistic effects, either due to the core nature of the schools or through designs of cards, but may leave the deck vulnerable to the magic of the common color in conflict, blue in the case of red and green. Alternatively, decks constructed with opposing colors like green and blue may not have many favorable combinations but will be capable of dealing with decks based on any other colors. There are no limits to how many colors can be in a deck, but the more colors in a deck, the more difficult it may be to provide mana of the right color.\n\n\n=== Luck vs. skill ===\nMagic, like many other games, combines chance and skill. One frequent complaint about the game involves the notion that there is too much luck involved, especially concerning possessing too many or too few lands. Early in the game especially, too many or too few lands could ruin a player's chance at victory without the player having made a mistake. This in-game statistical variance can be minimized by proper deck construction, as an appropriate land count can reduce mana problems. In Duels of the Planeswalkers 2012, the land count is automatically adjusted to 40% of the total deck size.A \"mulligan\" rule was introduced into the game, first informally in casual play and then in the official game rules. The most current mulligan rule allows players to shuffle an unsatisfactory opening hand back into the deck at the start of the game, draw a new hand with the same number of cards, and repeat until satisfied, after which any player who has mulliganed, will put cards from the hand they kept on the bottom of their deck equal to the number of times they mulliganed. In multiplayer, a player may take one mulligan without penalty, while subsequent mulligans will still cost one card (a rule known as \"Partial Paris mulligan\"). The original mulligan allowed a player a single redraw of seven new cards if that player's initial hand contained seven or zero lands. A variation of this rule called a \"forced mulligan\" is still used in some casual play circles and in multiplayer formats on Magic Online, and allows a single \"free\" redraw of seven new cards if a player's initial hand contains seven, six, one or zero lands. With the release of the Core Set 2020 a new mulligan system was introduced for competitive play known as the London Mulligan.Confessing his love for games combining both luck and skill, Magic creator Richard Garfield admitted its influence in his design of Magic. In addressing the complaint about luck influencing a game, Garfield states that new and casual players tend to appreciate luck as a leveling effect, since randomness can increase their chances of winning against a more skilled player. Meanwhile, a player with higher skills appreciates a game with less chance, as the higher degree of control increases their chances of winning. According to Garfield, Magic has and would likely continue decreasing its degree of luck as the game matured. The \"Mulligan rule\", as well as card design, past vs. present, are good examples of this trend. He feels that this is a universal trend for maturing games. Garfield explained using chess as an example, that unlike modern chess, in predecessors, players would use dice to determine which chess piece to move.\n\n\n=== Gambling ===\nThe original set of rules prescribed that all games were to be played for ante. Garfield was partly inspired by the game of marbles and added this rule because he wanted the players to play with the cards rather than simply collect them. The ante rule stated that each player must remove a card at random from the deck they wished to play with before the game began, and the two cards would be set aside together as the ante. At the end of the match, the winner would take and keep both cards. Early sets included a few cards with rules designed to interact with this gambling aspect, allowing replacements of cards up for ante, adding more cards to the ante, or even permanently trading ownership of cards in play.\nThe ante concept became controversial because many regions had restrictions on games of chance. The ante rule was soon made optional because of these restrictions and because of players' reluctance to possibly lose a card that they owned. The gambling rule is forbidden at sanctioned events and is now mostly a relic of the past, though can still be used in friendly games as well as the retired prismatic format. The last card to mention ante was printed in the 1995 expansion set Homelands.\n\n\n== Organized play ==\n\nThe Wizards Play Network (WPN), formally the DCI, is the organizing body for sanctioned Magic events; it is owned and operated by Wizards of the Coast. The WPN establishes the set allowances and card restrictions for the Constructed and Limited formats for regulation play for tournaments as well as for other events.\"Thousands of games shops\" participate in Friday Night Magic (FNM), an event sponsored by the WPN; it is advertised as \"the event where new players can approach the game, and start building their community\". FNM offers both sanctioned tournament formats and all casual formats. In 2018, The New Yorker reported that \"even as it has grown in popularity and size, Magic flies low to the ground. It thrives on the people who gather at lunch tables, in apartments, or in one of the six thousand stores worldwide that Wizards has licensed to put on weekly tournaments dubbed Friday Night Magic\". FNM tournaments can act as a stepping-stone to more competitive play.\n\n\n=== Tournaments ===\nMagic tournaments regularly occur in gaming stores and other venues. Larger tournaments with hundreds of competitors from around the globe sponsored by Wizards of the Coast are arranged many times every year, with substantial cash prizes for the top finishers. A number of websites report on tournament news, give complete lists for the most currently popular decks, and feature articles on current issues of debate about the game.[citation needed] Additionally, the WPN maintains a set of rules for being able to sanction tournaments, as well as runs its own circuit.\nThe WPN runs the Pro Tour as a series of major tournaments to attract interest. The right to compete in a Pro Tour has to be earned by either winning a Pro Tour Qualifier Tournament or being successful in a previous tournament on a similar level. A Pro Tour is usually structured into two days of individual competition played in the Swiss format. On the final day, the top eight players compete with each other in an elimination format to select the winner. At the end of the competition in a Pro Tour, players are awarded Pro Points depending on their finishing place. If the player finishes high enough, they will also be awarded prize money. Frequent winners of these events have made names for themselves in the Magic community, such as Gabriel Nassif, Kai Budde and Jon Finkel. As a promotional tool, the DCI launched the Hall of Fame in 2005 to honor selected players.At the end of the year the Magic World Championship is held. The World Championship functions like a Pro Tour, except that competitors have to present their skill in three different formats (usually Standard, booster draft and a second constructed format) rather than one. Another difference is that invitation to the World Championship can be gained not through Pro Tour Qualifiers, but via the national championship of a country. Most countries send their top four players of the tournament as representatives, though nations with minor Magic playing communities may send just one player. The World Championship also has a team-based competition, where the national teams compete with each other.At the beginning of the World Championship, new members are inducted into the Hall of Fame. The tournament also concludes the current season of tournament play and at the end of the event, the player who earned the most Pro Points during the year is awarded the title \"Pro Player of the Year\". The player who earned the most Pro Points and did not compete in any previous season is awarded the title \"Rookie of the Year\".Invitation to a Pro Tour, Pro Points and prize money can also be earned in lesser tournaments called Grand Prix that are open to the general public and are held more frequently throughout the year. Grand Prix events are usually the largest Magic tournaments, sometimes drawing more than 2,000 players. The largest Magic tournament ever held was Grand Prix: Las Vegas in June 2013 with a total of 4,500 players.\n\n\n== Development ==\n\n\n=== Inception ===\n\nRichard Garfield had an early attachment to games during his youth: before settling down in Oregon, his father, an architect, had brought his family to Bangladesh and Nepal during his work projects. Garfield did not speak the native languages, but was able to make friends with the local youth through playing cards or marbles. Once back in the United States, he had heard of Dungeons & Dragons but neither his local game store nor his friends had a copy, so he developed his own version of what he thought the game would be based on the descriptions he had read, which considered closer to Clue, with players moving from room to room fighting monsters with a fixed end-goal. When Garfield eventually got copies of the Dungeon & Dragons rulesets, he was surprised that it was a more open-ended game but was \"dreadfully written\". Dungeon & Dragons's open-endedness inspired him, like many others, to develop their own game ideas from it. For Garfield, this was a game he called Five Magics, based on five elemental magics that were drawn from geographically-diverse areas. While this remained the core concept of Five Magics, Garfield continued to refine the game while growing up, often drastically changing the base type of game, though never planned to publish this game.In 1991, Garfield was a doctoral candidate in combinatorial mathematics at University of Pennsylvania and had been brought on as an adjunct professor at Whitman College. During his candidacy, he developed his ideas and had playtested RoboRally, a board game based on moving robots through a factory filled with hazards. Garfield had been seeking publishers for the title, and his colleague, Mike Davis, suggested the newly formed Wizards of the Coast, a small outfit established by Peter Adkison, a systems analyst for Boeing in Seattle. In mid-1991, the three arranged to meet in Oregon near Garfield's parents' home. Adkison was impressed by RoboRally but considered that it had too many logistics and would be too risky for him to publish. He told Garfield and Davis that he liked Garfield's ideas and that he was looking for a portable game that could be played in the downtime that frequently occurs at gaming conventions.After the meeting, Garfield remained in Oregon to contemplate Adkison's advice. While hiking near Multnomah Falls, he was inspired to take his Five Magics concept but apply it to collectible color-themed cards, so that each player could make a customizable deck, something each player could consider part of their identity. Garfield arranged to meet with Adkison back in Seattle within the week, and when Adkison heard the idea, he recognized the potential that this would be a game that could be expanded on indefinitely with new cards in contrast to most typical tabletop games; Adkison later wrote on the idea on a USENET post \"If executed properly, [the cards] would make us millions.\" Adkison immediately agreed to produce it.\n\n\n=== Initial design ===\nGarfield returned to Pennsylvania and set off designing the game's core rules and initial cards, with about 150 completed in the few months after his return. The type of gameplay centered on each color remained consistent with how Five Magics had been and with how Magic: The Gathering would stay in the future, such as red representing aggressive attacks. Other games also influenced the design at this point, with Garfield citing games like Cosmic Encounter and Strat-o-matic Baseball as games that differ each time they are played because of different sets of cards being in play. Initial \"cards\" were based on using available copyrighted art, and copied to paper to be tested by groups of volunteers at the university. About six months after the meeting with Adkison, Garfield had refined the first complete version of his game. Garfield also began to set the narrative of the game in \"Dominia\", a multiverse of infinite \"planes\" from which players, as wizards, can draw power from, which would allow for the vast array of creatures and magics that he was planning for the cards.Garfield has stated that two major influences in his creation of Magic: the Gathering were the games Cosmic Encounter, which first used the concept that normal rules could sometimes be overridden, and Dungeons & Dragons. The \"Golden Rule of Magic\" states that \"Whenever a card's text directly contradicts the rules, the card takes precedence.\" The Comprehensive Rules, a detailed rulebook, exists to clarify conflicts.Simultaneously, Adkison sought investment into Wizards of the Coast to prepare to publish the game. The company had already committed to completing The Primal Order rulebook, aimed to be compatible with most other role-playing systems on the market, which most investment was drawn to. He had to bring in a number of local Cornish artists to create the fantasy art for Garfield's cards, offering them shares in Wizards of the Coast in payment. After The Primal Order was published in 1992, Wizards of the Coast was sued by Palladium for copyright infringement, a case that was settled out of court and with the result that a second printing of The Primal Order removed the rules relevant to Palladium's system, but this case also financially harmed Wizards of the Coast. Adkison decided to create a separate company, Garfield Games, for publishing the card game.While the game was simply called Magic through most of playtesting, when the game had to be officially named a lawyer informed them that the name Magic was too generic to be trademarked. Mana Clash was instead chosen to be the name used in the first solicitation of the game. However, everybody involved with the game continued to refer to it simply as Magic. After further legal consultation, it was decided to rename the game Magic: The Gathering, thus enabling the name to be trademarked.\n\n\n=== First releases ===\nBy 1993, Garfield and Adkison had gotten everything ready to premiere Magic: The Gathering at that year's Gen Con in Milwaukee that August, but did not have the funds for a production run to have shipped to game stores in time. Adkison took a single box of cards with a handful of complete decks to the Wizards booth at Origins Game Fair hoping to secure the funds by demonstrating the game. Among those he demonstrated to were representatives of Wargames West, manufacturers of historical tactics games; the representatives eventually brought their CEO over, and after seeing the game, took Adkison to dinner and negotiated funding terms. Adkison returned with US$40,000, enough to make the necessary orders.Magic: The Gathering underwent a general release on August 5, 1993. After shipping the orders, Adkison and his wife drove towards Milwaukee while making stops at game stores and demonstrate the game to drum up support for Gen Con. Their initial stops were quiet, but word of mouth from previous stops spread, and as they traveled south and west, they found larger and larger crowds anxiously awaiting their arrival. Garfield met up with Adkison at Gen Con, where their shipment of 2.5 million cards had been delayed a day. Despite this, by the end of the convention, they had completely sold out.Magic was an immediate success for Wizards of the Coast. By October 1993, they had sold out their supply of 10 million cards. Wizards was even reluctant to advertise the game because they were unable to keep pace with existing demand. Initially Magic attracted many Dungeons & Dragons players, but the following included all types of other people as well.\n\n\n=== Expansions ===\nThe success of the initial edition prompted a reissue later in 1993, along with expansions to the game. Arabian Nights was released as the first expansion in December 1993. New expansions and revisions of the base game (\"Core Sets\") have since been released on a regular basis, amounting to four releases a year. By the end of 1994, the game had printed over a billion cards. Until the release of Mirage in 1996, expansions were released on an irregular basis. Beginning in 2009 one revision of the core set and a set of three related expansions called a \"block\" were released every year. This system was revised in 2015, with the Core Set being eliminated and blocks now consisting of two sets, released semiannually. A further revision occurred in 2018, reversing the elimination of the core sets and no longer constraining sets to blocks. While the essence of the game has always stayed the same, the rules of Magic have undergone three major revisions with the release of the Revised Edition in 1994, Classic Edition in 1999, and Magic 2010 in July 2009. With the release of the Eighth Edition in 2003, Magic also received a major visual redesign.\nIn 1996, Wizards of the Coast established the \"Pro Tour\", a circuit of tournaments where players can compete for sizeable cash prizes over the course of a single weekend-long tournament. In 2009 the top prize at a single tournament was US$40,000. Sanctioned through the DCI, the tournaments added an element of prestige to the game by virtue of the cash payouts and media coverage from within the community. For a brief period of time, ESPN2 televised the tournaments.By April 1997, 2 billion cards had been sold. In 1999, Wizards of The Coast was acquired by Hasbro for $325 million, making Magic a Hasbro game.\nA patent was granted to Wizards of the Coast in 1997 for \"a novel method of game play and game components that in one embodiment are in the form of trading cards\" that includes claims covering games whose rules include many of Magic's elements in combination, including concepts such as changing orientation of a game component to indicate use (referred to in the rules of Magic and later of Garfield's games such as Vampire: The Eternal Struggle as \"tapping\") and constructing a deck by selecting cards from a larger pool.  The patent has aroused criticism from some observers, who believe some of its claims to be invalid. In 2003, the patent was an element of a larger legal dispute between Wizards of the Coast and Nintendo, regarding trade secrets related to Nintendo's Pokémon Trading Card Game. The legal action was settled out of court, and its terms were not disclosed.While unofficial methods of online play existed previously, Magic Online (often shortened to \"MTGO\" or \"Modo\"), an official online version of the game, was released in 2002. A new, updated version of Magic Online was released in April 2008.In February 2018, Wizards noted that between the years of 2008 and 2016 they had printed over 20 billion Magic: the Gathering cards.\n\n\n== Production and marketing ==\n\nMagic: The Gathering cards are produced in much the same way as normal playing cards. Each Magic card, approximately 63 × 88 mm in size (2.5 by 3.5 inches), has a face which displays the card's name and rules text as well as an illustration appropriate to the card's concept. 22,291 unique cards have been produced for the game as of September 2016,\nmany of them with variant editions, artwork, or layouts, and 600–1000 new ones are added each year. The first Magic cards were printed exclusively in English, but current sets are also printed in Simplified Chinese, Traditional Chinese, French, German, Italian, Japanese, Korean, Portuguese, Russian, and Spanish.The overwhelming majority of Magic cards are issued and marketed in the form of sets. For the majority of its history there were two types: the Core Set and the themed expansion sets. Under Wizards of the Coast's current production and marketing scheme, a new set is released quarterly. Various products are released with each set to appeal to different segments of the Magic playing community:\n\nThe majority of cards are sold in booster packs, which contain fifteen cards normally divided into four rarities, which can be differentiated by the color of the expansion symbol. A fifteen-card Booster Pack will typically contain one rare (gold), three uncommons (silver), ten commons (black), and one basic land (colored black, as commons). Sets prior to Shards of Alara contained eleven commons instead of a basic land.Shards of Alara also debuted mythic rares (red-orange), which replace one in eight rare cards on average. There are also premium versions of every card with holographic foil, randomly inserted into some boosters in place of a common, which replace about one in seventy cards.\n\nEach set since Kaladesh features two Planeswalker decks, which are meant to help new players learn the game. They contain a 60-card pre-constructed deck with an exclusive Planeswalker, as well as several exclusive cards, two booster packs from the set they accompany, as well as a rule guide and a card board box with an image of the included Planeswalker.\nEach set from Shards of Alara to Eldritch Moon featured five Intro Packs, which fulfilled the same function as planeswalker decks. They contained a 60-card pre-constructed deck, as well as two booster packs from the set they accompany and a rule guide.\nEach set from Mirrodin Besieged to Gatecrash featured two Event Decks, which were pre-constructed decks designed as an introduction to tournament play. Beginning with  Dragon's Maze, each set featured only one Event Deck. However, event decks were discontinued after the set \"Battle for Zendikar\".\nPreviously, cards were also sold in Tournament Packs typically containing three rares, ten uncommons, thirty-two commons, and thirty basic lands. Tournament Packs were discontinued after Shards of Alara.As of 2018, the number of consecutive sets set on the same world varies. For example, although Dominaria takes place in one set, the Guilds of Ravnica block takes place over three sets. In addition, small sets have been removed due to developmental problems and all sets are now large. Prior to this change, sets were put into two-set blocks, starting with a large set and ending with a smaller one three months later. Prior to 2016, expansion sets were released in a three-set block (again, beginning with a larger set followed by two smaller sets). These sets consist almost exclusively of newly designed cards. In contrast with the wide-ranging Core Set, each expansion focuses on a subset of mechanics and ties into a set storyline. Expansions also dedicate several cards to a handful of particular, often newly introduced, game mechanics.\nThe Core Sets began to be released annually (previously biennially) in July 2009 coinciding with the name change from 10th Edition to Magic 2010. This shift also introduced new, never before printed cards into the core set, something that previously had never been done. However, core sets were discontinued following the release of Magic Origins, on July 17, 2015, at the same time that two-set blocks were introduced. Wizards of Coast announced on June 12, 2017 that they plan on revamping and reintroducing a revamped core set, and Core Set 2019 was released on July 13, 2018.\nIn addition to the quarterly set releases, Magic cards are released in other products as well, such as the Planechase and Archenemy spin-off games. These combine reprinted Magic cards with new, oversized cards with new functionality. Magic cards are also printed specifically for collectors, such as the From the Vault and Premium Deck Series sets, which contain exclusively premium foil cards.\nIn 2003, starting with the Eighth Edition Core Set, the game went through its biggest visual change since its creation—a new card frame layout was developed to allow more rules text and larger art on the cards, while reducing the thick, colored border to a minimum. The new frame design aimed to improve contrast and readability using black type instead of the previous white, a new font, and partitioned areas for the name, card type, and power and toughness. The card frame was changed once again in Core Set 2015, which maintained the same templating, but made the card sleeker and added a holo-foil stamp to every rare and mythic card to curtail counterfeiting.\nFor the first few years of its production, Magic: The Gathering featured a small number of cards with names or artwork with demonic or occultist themes, in 1995 the company elected to remove such references from the game. In 2002, believing that the depiction of demons was becoming less controversial and that the game had established itself sufficiently, Wizards of the Coast reversed this policy and resumed printing cards with \"demon\" in their names.In 2019, starting with Throne of Eldraine, booster packs have a chance of containing an alternate art \"showcase card\". This is to increase the reward of buying boosters and making it more exciting.A new format, \"Jumpstart\", was introduced in July 2020 alongside the Core 2021 set. These are special themed 20-card booster packs, based on nearly 500 cards, several being reprints of cards from previous sets, with 121 possible packs available. Each is a curated set rather than random selection of cards, built around a theme, such as \"Pirates\" or \"Unicorns\". Each theme has a small number of possible card sets on that threme, distributed on a rarity basis, such that the specific booster that a player purchases will still be a random selection. Because many are reprints, not all Jumpstart cards are available to be used in the various Constructed formats but can be used in other modes of play. Jumpstart was designed to make it much easier to get into Magic by eliminating the deck-building but still providing some customization and randomness that comes with card acquisition and deck building. A special Jumpstart format was introduced for these boosters, where players select two desired themes, and are given a random booster from those themes and sufficient land cards to make a 60-card deck.\n\n\n=== Writing and storyline ===\n\nGarfield had established that Magic: The Gathering took place in a Multiverse with countless possible worlds (planes), the game's primary events taking place on the plane of Dominaria, and unique and rare beings called Planeswalkers are capable of traversing the Multiverse. This allows the game to frequently change worlds so as to renew its mechanical inspiration, while maintaining planeswalkers as recurrent, common elements across worlds. Players represent planeswalkers able to draw on the magics and entities of these planes to do battle with others. Story elements were told through the cards' flavor text, but otherwise without any driving narrative. The first expansion Arabian Nights designed by Garfield was based on One Thousand and One Nights folklore and include figures from that like Aladdin.Early expansions were designed separately, each with their own internal narrative to establish concepts, keywords, and flavoring. With Weatherlight, the team wanted to start a longer arc that would cover multiple expansions over five years that would also extend into comics, magazines, and other media. However, with a change in oversight of the Magic: The Gathering team, player fatigue, and a disconnect between the novels and cards, this plan was scrapped. returning to the general approach of designing a narrative specific to one expansion.Wizards, which had regained the license from Harper Prism and Armada (an imprint of Acclaim Entertainment) to write novels for Magic: The Gathering, still worked to integrate the novel writing staff with the game designers so that there was some cohesion between the game and books, but did not seek to make this a key priority as the Weatherlight goal had been. Novels soon gave way to eBooks and later to shorter stories posted on the Wizards' website which fared better in terms of popularity.In 2017, Wizards hired novelist and scriptwriter Nic Kelman as their Head of Story and Entertainment. Kelman became responsible for crafting the Magic: The Gathering story bible from all established lore as reference for further expansions and for the external media. This task helped Kelmen to prepare the novel War of the Spark: Ravnica that was published just prior to the new set War of the Spark, with cards retaining continuity with the novel and past events.\n\n\n=== Artwork ===\n\nEach card has an illustration to represent the flavor of the card, often reflecting the setting of the expansion for which it was designed. Much of Magic's early artwork was commissioned with little specific direction or concern for visual cohesion. One infamous example was the printing of the creature Whippoorwill without the \"flying\" ability even though its art showed a bird in flight. The art direction team later decided to impose a few constraints so that the artistic vision more closely aligned with the design and development of the cards. Each block of cards now has its own style guide with sketches and descriptions of the various races and places featured in the setting.A few early sets experimented with alternate art for cards. However, Wizards came to believe that this impeded easy recognition of a card and that having multiple versions caused confusion when identifying a card at a glance. Consequently, alternate art is now only used sparingly and mostly for promotional cards. When older cards are reprinted in new sets, however, Wizards of the Coast usually prints them with new art to make the older cards more collectible, though they sometimes reuse well-received artwork if it makes sense thematically.\nAt the back of each card, at the end of the word \"Deckmaster\", a pen stroke is visible. According to Wizards of the Coast, this is a printing error which was never corrected, as all card backs have to look the same. As Magic has expanded across the globe, its artwork has had to change for its international audience. Artwork has been edited or given alternate art to comply with the governmental standards. For example, the portrayal of skeletons and most undead in artwork was prohibited by the Chinese government until 2008.\n\n\n=== Promotional crossovers ===\nWizards of the Coast has introduced specials cards and sets that include cross-promotional elements with other brands typically as promotional cards, not legal for Standard play and may be unplayable even in eternal formats. Four promotional cards were sold at HasCon 2017, featuring three other Hasbro brands, Transformers, Nerf, and Dungeons & Dragons. A special three-card set based on characters from My Little Pony: Friendship Is Magic (another Hasbro brand) was sold as both physical product and digital items within MTG Arena to support the Extra Life charity. The \"Ikoria, Lair of Behemoths\" set released in April 2020 included 16 kaiju monsters from Toho as promotional cards, such as Godzilla. The new Universes Beyond series will bring other crossover properties into Magic such as Warhammer 40,000 and The Lord of the Rings. Polygon reported that the Lord of the Rings themed set, planned for 2023, \"will be a complete, Modern-legal set of cards\" and \"it will be a full product line. That means players will be able to draft cards for pick-up play, and compete in multiplayer games with one of four preconstructed Commander decks\".The Secret Lair promotional series has also been used to introduce crossover cards from other brands. As part of the Secret Lair set in 2020, a number of cards were made that featured crossovers with AMC's television show The Walking Dead, which the development team felt was a natural fit since zombies were already part of the Magic game. A limited set of land cards in the Secret Lair featured paintings from Bob Ross, licensed through his estate. In June 2021, Wizards of the Coast announced a Secret Lair based on Dungeons and Dragon cartoon. A planned 2021 Secret Lair drop will feature cards based on Stranger Things, while Fortnite and Street Fighter will be featured in the Secret Lair drop in 2022.Additionally, Wizards has continued to develop a strong connection between the Magic and the Dungeons & Dragons (D&D) universes. Greg Tito, Wizards of the Coast Senior Communications Manager, said that \"there is a huge crossover between Magic players and D&D players\". In July 2021, a D&D themed set expansion, Adventures in the Forgotten Realms, was released; it is based on the Forgotten Realms campaign setting. Separately, elements of Magic have been brought into the role-playing game. The first such official crossover was a D&D campaign setting book for the plane of Ravnica, a Magic expansion introduced in 2005 and 2006 and later revisited in the 2018 expansion Guilds of Ravnica. Guildmasters' Guide to Ravnica was also published in 2018 to correspond with the newer Magic expansion's release. A second campaign setting book, Mythic Odysseys of Theros (2020), introduced the plane of Theros to D&D and corresponded with the 2020 Theros Beyond Death expansion. Strixhaven: A Curriculum of Chaos (2021) will introduce the 2021 Magic expansion as a D&D campaign setting; it is expected to be released in November 2021.\n\n\n== Reception ==\n\n\n=== Critical reviews ===\nScott Haring reviewed Magic: The Gathering in Pyramid #4 (Nov./Dec., 1993), and stated that \"Not only is Magic the best gaming bargain to come down the pike in memory; not only is it the most original idea in years; it's also a delightfully addictive game that you and your friends will find impossible to put down.\"A 2004 article in USA Today suggested that playing Magic might help improve the social and mental skills of some of the players. The article interviewed players' parents who believe that the game, similar to sports, teaches children how to more gracefully win and lose. Magic also contains a great amount of strategy and vocabulary that children may not be exposed to on a regular basis. Parents also claimed that playing Magic helped keep their children out of trouble, such as using illegal drugs or joining criminal gangs. On the other hand, the article also briefly mentions that Magic can be highly addictive, leading to parents worried about their children's Magic obsession. In addition, until 2007, some of the better players had opportunities to compete for a small number of scholarships.\nJordan Weisman, an American game designer and entrepreneur, commented, \"I love games that challenge and change our definition of adventure gaming, and Magic: The Gathering is definitely one of a very short list of titles that has accomplished that elusive goal. By combining the collecting and trading elements of baseball cards with the fantasy play dynamics of role-playing games, Magic created a whole new genre of product that changed our industry forever.\"In 2015, The Guardian reported that an estimated 20 million people played Magic around the world and that the game had a thriving tournament scene, a professional league and a weekly organized game program called Friday Night Magic.A July 2019 article in Bloomberg reported that \"Magic is part of the [Hasbro’s] 'franchise brands,' a segment that accounted for $2.45 billion in net revenue for the company last year, bigger than its emerging, partner and gaming brand units combined. [Chris] Cocks said Magic accounts for a 'meaningful portion' of that, with KeyBanc estimating the game’s contribution is already more than $500 million—including both the physical cards and the nascent digital version. Of the franchise brands, only Magic and Monopoly logged revenue gains last year\". Magic: The Gathering Arena, in open beta testing since September 2018, is a free-to-play digital collectible card game with microtransaction purchases based on Magic. Brett Andress, an analyst at KeyBanc Capital Markets, predicts Magic: The Gathering Arena adding as much as 98 cents a share in incremental earnings to results by 2021 (which is at least a 20% boost). Joe Deaux, for Bloomberg, wrote that \"nearly 3 million active users will be playing Arena by the end of this year, KeyBanc estimates, and that could swell to nearly 11 million by 2021 according to its bull case scenario—especially if it expands from PCs to mobile. That’s just active users, and registered users could be higher by the millions. Already, according to Hasbro, a billion games have been played online\".\n\n\n=== Awards ===\n1994: Mensa Select Award winner\n1994: Origins Awards for Best Fantasy or Science Fiction Board game of 1993 and Best Graphic Presentation of a Board game of 1993\n1994: Origins Award for the Legends expansion as Best Game Accessory\n1995: Deutscher Spiele Preis special award for new game mechanics\n1995: Italian Gaming Society Gioco dell'Anno award winner\n1996: Super As d'Or award for \"Best New Game Concept and Genre Introduced in France\"\n1997: InQuest Fan Award for Best CCG Expansion for the Weatherlight expansion\n1998: Origins Award for the Urza's Saga expansion as Collectible Card Game Expansion of the Year\n1999: Inducted alongside Richard Garfield into the Origins Hall of Fame\n2003: Games Magazine selected Magic for its Games Hall of Fame\n2005: Origins Award for the Ravnica: City of Guilds expansion as Collectible Card Game Expansion of the Year\n2009: Origins Award for the Shards of Alara expansion as Collectible Card Game Expansion of the Year\n2012: Origins Award for the Innistrad expansion as Collectible Card Game Expansion of the Year\n2015: Origins Award for the Khans of Tarkir expansion as Best Collectible Card Game of the Year\n2019: Inducted into the National Toy Hall of FameIn addition, several individuals including Richard Garfield and Donato Giancola won personal awards for their contributions to Magic.\n\n\n=== Legacy ===\nThe success of Magic: The Gathering led to the creation of similar games by other companies as well as Wizards of the Coast themselves. Companion Games produced the Galactic Empires CCG (the first science fiction trading card game), which allowed players to pay for and design their own promotional cards, while TSR created the Spellfire game, which eventually included five editions in six languages, plus twelve expansion sets. Wizards of the Coast produced Jyhad (now called Vampire: The Eternal Struggle), a game about modern-day vampires. Other similar games included trading card games based on Star Trek and Star Wars. Magic is often cited as an example of a 1990s collecting fad, though the game's makers were able to overcome the bubble traditionally associated with collecting fads.\n\n\n=== Secondary market ===\n\nThere is an active secondary market in individual cards among players and game shops. This market arose from two different facets: players seeking specific cards to help complete or enhance their existing decks and thus were less concerned on the value of the cards themselves, and from collectors seeking the rarer cards for their monetary value to complete collections. Many physical and online stores sell single cards or \"playsets\" of four of a card. Common cards rarely sell for more than a few cents and are usually sold in bulk. Uncommon cards and weak rare cards typically sell from 10¢ up to $1. The more expensive cards in Standard tournament play - a rotating format featuring the newest cards designed to be fairer and more accessible to newer players - are typically priced between $1 and $25. A second format, Modern, comprising an intermediate level of power and allowing most cards released since roughly 2003, has staple cards that often value between $5 and $100, with higher rarity and demand but reprints every few years intended to keep the format affordable. Foil versions of rare and mythic rare cards are typically priced at about twice as much as the regular versions. Some of the more sought-after rare and mythic rare cards can have foil versions that cost up to three or four times more than the non-foil versions.A few of the oldest cards, due to smaller printings and limited distribution, are highly valued and rare. This is partly due to the Reserved List, a list of cards from the sets Alpha to Urza's Destiny (1994–1999) that Wizards has promised never to reprint. Legacy-only cards on the Reserved List, which are barred from reprint under a voluntary but genuine legal obligation, are in short supply due to smaller print runs of the game in its oldest days, and may be worth $200 to $1,000 or higher. And certain Vintage cards - the oldest cards in Magic, with most on the Reserved List, such as the so-called \"Power Nine\" - can easily cost more than $1,000 apiece. The most expensive card that was in regular print (as opposed to being a promotional or special printing) is the Black Lotus, which are currently worth thousands of dollars. In 2019, an unsigned \"Pristine 9.5 grade\" Beckett Grading Services graded Alpha Black Lotus was bought by an anonymous buyer for a record $166,100. A PSA \"Gem Mint 10\" graded Alpha Black Lotus in pristine condition, framed in a case signed by its artist Christopher Rush, was sold at auction for US$511,100 in January 2021.The secondary market started with comic book stores, and hobby shops displaying and selling cards, with the cards' values determined somewhat arbitrarily by the employees of the store. Hobbyist magazines, already tracking prices of sports trading cards, engaged with the Magic secondary market by surveying the stores to inquire on current prices to cards, which they then published. With the expansion of the Internet, prices of cards were determined by the number of tournament deck lists a given card would appear in. If a card was played in a tournament more frequently, the cost of the card would be higher (in addition to the market availability of the card). When eBay, Amazon, and other large online markets started to gain popularity, the Magic secondary market evolved substantially, with the site TCGPlayer.com launched in 2008 being the first that not only compiled the pricing data but allowed for players to buy and sell cards for Magic and other CCGs directly via the site. TCGPlayer developed a metric called the TCG Market Price for each card that was based on the most recent sales, allowing for near real-time valuation of a card in the same manner as a stock market. Buying and selling Magic cards online became a source of income for people who learned how to manipulate the market.Today, the secondary market is so large and complex, it has become an area of study for consumer research called Magic: The Gathering finance. Some people make a career out of market manipulation, creating mathematical models to analyze the growth of cards' worth, and predict the market value of both individual cards, and entire sets of cards. Magic's economy has also been tied to the introduction of Bitcoin and other cryptocurrencies, as Magic cards represent a physical asset that can be converted back and forth into the virtual currency. Nearly all of Magic's trading market is unregulated, and issues related to insider trading based on planned changes to the game have occurred. Active Magic financial traders have gained a sour reputation with more casual Magic players due to the lack of regulations, and that the market manipulations makes it costly for casual players to buy single cards simply for purposes for improving decks.As of late 2013, Wizards of the Coast has expressed concern over the increasing number of counterfeit cards in the secondary market. Wizards of the Coast has since made an effort to counteract the rise of counterfeits by introducing a new holofoil stamp on all rare and mythic rare cards as of Magic 2015.\n\n\n=== Academic analysis ===\nThere are several examples of academic, peer-reviewed research concerning different aspects of Magic: The Gathering. One study examined how players use their imaginations when playing. This research studied hobby players and showed how players sought to create and participate in an epic fantasy narrative. Another example used online auctions for Magic cards to test revenue outcomes for various auction types. A third example uses probability to examine Magic card-collecting strategies. Using a specific set of cards in a specialized manner has shown Magic: The Gathering to be Turing complete. Further, by proving this, the researchers assert that Magic: The Gathering is so complex as to be Turing complete and capable of being \"programmed\" to perform any task, that in terms of playing an actual game of Magic, \"the winning strategy is non-computable\", making it an improbable challenge to devise computer opponents that can play Magic in a mathematically optimal manner.\n\n\n== Franchise ==\nMagic: The Gathering video games, comics, and books have been produced under licensing or directly by Wizards of the Coast.\n\n\n=== Other traditional games ===\nIn 2015 Wizards of the Coast and Hasbro published Magic: The Gathering – Arena of the Planeswalkers. Arena of the Planeswalkers is a tactical boardgame where the players maneuver miniatures over a customizable board game, and the ruleset and terrain is based on Heroscape, but with an addition of spell cards and summoning. The original master set includes miniatures that represent the five Planeswalkers Gideon, Jace, Liliana, Chandra, and Nissa as well as select creatures from the Magic: The Gathering universe. They later released an expansion Battle for Zendikar featuring multi-color Planeswalkers Kiora and Ob Nixilis and a colorless Eldrazi Ruiner, and a second master set Shadows Over Innistrad which has 4 new Planeswalkers and also includes the addition of cryptoliths.\n\n\n=== Video games ===\n\nThere are currently two official video game adaptions of Magic: The Gathering for online play. Magic: The Gathering Online, first introduced in 2002, allows for players to buy cards and boosters and play against others including in officially-sanctioned tournaments for prize money. Magic: The Gathering Arena, introduced in 2019, is fashioned after the free-to-play Hearthstone, with players able to acquire new cards for free or through spending real-world funds. Arena currently limited online events with in-game prizes, but is currently being positioned by Wizards of the Coast to also serve as a means for official tournament play, particularly after the COVID-19 pandemic. Both Online and Arena are regularly updated with new Core and Expansion cards as well as all rule changes made by Wizards.In addition, Wizards of the Coast has worked with other developers for various iterations of Magic: The Gathering as a card game in a single-player game format. Microprose developed 1997 Magic: The Gathering and its expansions, which had the player travel the world of Shandalar to challenge computer opponents, earn cards to customize their decks, improve their own Planeswalker attributes and ultimately defeat a powerful Planeswalker. Stainless Games developed a series of titles starting with 2009's Magic: The Gathering – Duels of the Planeswalkers and culminating with 2015's Magic Duels, a free-to-play title. The Duels series did not feature full sets of Magic cards but selected subsets, and were initially designed to couple a challenging single-player experience with an advanced artificial-intelligence computer opponent. Later games in the series added in more deck-building options and multiplayer support.Additional games have tried other variations of the Magic: The Gathering gameplay in other genres. Acclaim developed a real-time strategy game Magic: The Gathering: BattleMage in 2003, in which the player's abilities were inspired by the various cards. Acclaim also had made a 1997 arcade game Magic: The Gathering — Armageddon, a Breakout-style trackball-based game, but only as many as six cabinets were known to have been made. Hiberium and D3 Publisher developed Magic: The Gathering - Puzzle Quest, combining deck building with match-3-style casual gaming. This was released in December 2015 as a freemium game and continues to be updated with new card sets from the physical game. Cryptic Studios and Perfect World Entertainment have started beta tests for Magic: Legends, a massively multiplayer online action role-playing game for personal computers and consoles. The title was cancelled ahead of its full release in 2021; executive producer Stephen Ricossa explained that the game's creative vision had \"missed the mark\".In addition to official programs, a number of unofficial programs were developed to help user to track their Magic: The Gathering library and allow for rudimentary play between online players. Examples of such programs included Apprentice, Magic Workstation, XMage, and Cockatrice. These programs are not endorsed by Wizards of the Coast.\n\n\n=== Novels ===\n\nHarper Prism originally had an exclusive license to produce novels for Magic: The Gathering, and published ten books between 1994 and 1996. Around 1997, the license reverted to Wizards, and the company published its own novels to better tie these works to the expansion sets from 1998 to about 2011.\n\n\n=== Comics ===\nin 1994, Wizards of the Coast gave an exclusive license to Armada Comics, an imprint of Acclaim Entertainment, to publish comic books. The comics were not developed in concert with the game and were created with divergent ideas to the game. However, \"much of the lore established\" by Armada Comics was \"the foundation from which the rest of continuity was built. [...] Some of the details changed (or were 'retconned', in popular fan speak), but for the most part the core of these stories stayed the same\". The comics came to a sudden end in 1996 when Acclaim started to run into financial trouble. In 1998, a new four-issue limited comic series was published by Dark Horse.In September 2011, Hasbro and IDW Publishing accorded to make a four-issue mini-series about Magic: The Gathering with a new story but heavily based on MTG elements and with a new Planeswalker called Dack Fayden, the story of which mainly developed in the planes of Ravnica and Innistrad. The series started in February 2012. In 2018, a four-issue mini-series on the Planeswalker Chandra Nalaar was released. A sequel mini-series was announced in 2019, however, it was cancelled before publication.In January 2021, Boom! Studios acquired the comic license of Magic: The Gathering and announced for a new Magic series for April 2021.\n\n\n=== Film ===\nIn January 2014, 20th Century Fox acquired the rights to produce a Magic: The Gathering film with Simon Kinberg as producer and TSG Entertainment (its co-financing partner), and Allspark Pictures as co-financers, after Universal Pictures allegedly dropped the film from their schedule (both Universal and Hasbro had been developing the original Magic: The Gathering film since 2009). In June 2014, Fox hired screenwriter Bryan Cogman to write the script for the film. In 2019 following Disney's acquisition of 21st Century Fox's assets, the film along with numerous other properties in development at Fox were cancelled.In April 2016, Enter the Battlefield, a documentary about life on the Magic Pro Tour was released. The film was written by Greg Collins, Nathan Holt, and Shawn Kornhauser.The production team behind The Toys That Made Us will produce a documentary Igniting the Spark, The Story of Magic: The Gathering.\n\n\n=== Television ===\nIn June 2019, Variety reported that Joe and Anthony Russo, Wizards of the Coast, and Hasbro's Allspark Animation have teamed with Netflix for an animated Magic: The Gathering television series. In July 2019 at the San Diego Comic-Con, the Russos revealed the logo of the animated series and spoke about doing a live-action series. During the Magic Showcase virtual event in August 2021, they revealed that Brandon Routh would be the voice of Gideon Jura, and that the series will premiere sometime in 2022.\n\n\n=== Parodies ===\nIn 1998, PGI Limited created Havic: The Bothering, which was a parody of Magic: The Gathering. Wizards of the Coast, which owned the rights to Magic: The Gathering, took active steps to hinder the distribution of the game and successfully shut out PGI Limited from attending GenCon in July 1998. In an attempt to avoid breaching copyright and Richard Garfield's patent, each starter deck of Havic had printed on the back side, \"This is a Parody\", and on the bottom of the rule card was printed, \"Do not have each player: construct their own library of predetermined number of game components by examining and selecting [the] game components from [a] reservoir of game components or you may infringe on U.S. Patent No. 5,662,332 to Garfield.\"Four official parody expansions of Magic exist: Unglued, Unhinged, Unstable, and Unsanctioned (2020). Most of the cards in these sets feature silver borders and humorous themes. The silver-bordered cards are not legal for play in DCI-sanctioned tournaments.\n\n\n== Notes ==\n\n\n== References ==\n\n\n== Further reading ==\nBaldwin & Waters (1998). The Art of Magic: A Fantasy of World Building and the Art of the Rath Cycle. Renton, WA: Wizards of the Coast. ISBN 978-0-7869-1178-3.\nFlores, Michael J. (2006). Deckade: 10 Years of Decks, Thoughts and Theory. New York: top8magic.com. ISBN 978-0-9778395-0-6.\nMoursund, Beth (2002). The Complete Encyclopedia of Magic: The Gathering. New York: Thunder's Mouth Press. ISBN 978-1-56025-443-0.\n\n\n== External links ==\n\nOfficial website \nMagic: The Gathering at Curlie\nReview in Shadis"