"Magic: The Gathering (colloquially known as Magic or MTG) is a tabletop and digital collectible card game created by Richard Garfield. Released in 1993 by Wizards of the Coast (now a subsidiary of Hasbro), Magic was the first trading card game and had approximately thirty-five million players as of December 2018, and over twenty billion Magic cards were produced in the period from 2008 to 2016, during which time it grew in popularity.A player in Magic takes the role of a Planeswalker, doing battle with other players as Planeswalkers by casting spells, using artifacts, and summoning creatures as depicted on individual cards drawn from their individual decks. A player defeats their opponent typically (but not always) by casting spells and attacking with creatures to deal damage to the opponent's \"life total,\" with the object being to reduce it from 20 to 0. Although the original concept of the game drew heavily from the motifs of traditional fantasy role-playing games such as Dungeons & Dragons, the gameplay bears little similarity to pencil-and-paper adventure games, while simultaneously having substantially more cards and more complex rules than many other card games.\nMagic can be played by two or more players, either in person with printed cards or on a computer, smartphone or tablet with virtual cards through the Internet-based software Magic: The Gathering Online or other video games such as Magic: The Gathering Arena. It can be played in various rule formats, which fall into two categories: constructed and limited. Limited formats involve players building a deck spontaneously out of a pool of random cards with a minimum deck size of 40 cards; in constructed formats, players create decks from cards they own, usually with a minimum of 60 cards per deck.\nNew cards are released on a regular basis through expansion sets. An organized tournament system (the DCI) played at the international level and a worldwide community of professional Magic players has developed, as well as a substantial resale market for Magic cards. Certain cards can be valuable due to their rarity in production and utility in gameplay, with prices ranging from a few cents to tens of thousands of dollars."