"Saṃsāra (Sanskrit, Pali; also samsara) in Buddhism is the beginningless cycle of repeated birth, mundane existence and dying again. Samsara is considered to be dukkha, suffering, and in general unsatisfactory and painful, perpetuated by desire and avidya (ignorance), and the resulting karma.Rebirths occur in six realms of existence, namely three good realms (heavenly, demi-god, human) and three evil realms (animal, ghosts, hellish). Samsara ends if a person attains nirvana, the \"blowing out\" of the desires and the gaining of true insight into impermanence and non-self reality.\n\n\n== Characteristics ==\nIn Buddhism, saṃsāra is the \"suffering-laden, continuous cycle of life, death, and rebirth, without beginning or end\". In several suttas of the Samyutta Nikaya's chapter XV in particular it's said \"From an inconstruable beginning comes transmigration. A beginning point is not evident, though beings hindered by ignorance and fettered by craving are transmigrating & wandering on\". It is the never-ending repetitive cycle of birth and death, in six realms of reality (gati, domains of existence), wandering from one life to another life with no particular direction or purpose. Samsara is characterized by dukkha (\"unsatisfactory,\" \"painful\").Samsara relates to the Four Noble Truths in Buddhism, as dukkha (\"unsatisfactory,\" \"painful\") is the essence of Samsara. Every rebirth is temporary and impermanent. In each rebirth one is born and dies, to be reborn elsewhere in accordance with one's own karma. It is perpetuated by one's avidya (\"ignorance\"), particularly about anicca (“impermanence”) and anatta, (“no-self”) and from craving. Samsara continues until moksha is attained by means of insight and nirvana. the \"blowing out\" of the desires and the gaining of true insight into impermanence and non-self reality. Samsara and the notion of cyclic existence dates back to 800 BCE.\n\n\n=== Mechanism ===\nThe Saṃsāra doctrine of Buddhism asserts that while beings undergo endless cycles of rebirth, there is no changeless soul that transmigrates from one lifetime to another - a view that distinguishes its Saṃsāra doctrine from that in Hinduism and Jainism. This no-soul (no-self) doctrine is called the Anatta or Anatman in Buddhist texts.The early Buddhist texts suggest that Buddha faced a difficulty in explaining what is reborn and how rebirth occurs, after he innovated the concept that there is \"no self\" (Anatta). Later Buddhist scholars, such as the mid-1st millennium CE Pali scholar Buddhaghosa, suggested that the lack of a self or soul does not mean lack of continuity; and the rebirth across different realms of birth – such as heavenly, human, animal, hellish and others – occurs in the same way that a flame is transferred from one candle to another. Buddhaghosa attempted to explain rebirth mechanism with \"rebirth-linking consciousness\" (patisandhi).The mechanistic details of the Samsara doctrine vary within the Buddhist traditions. Theravada Buddhists assert that rebirth is immediate while the Tibetan schools hold to the notion of a bardo (intermediate state) that can last at least forty-nine days before the being is reborn.  In Mahayana Buddhist philosophy Samsara and Nirvana are seen as the same. According to Nagarjuna, an ancient Indian philosopher, and a teacher of Mahayana Buddhism, \"Nothing of Samsara is different from Nirvana, nothing of Nirvana is different from Samsara. That which is the limit of Nirvana is also the limit of Samsara, there is not the slightest difference between the two.\"\n\n\n== Realms of rebirth ==\n\nBuddhist cosmology typically identifies six realms of rebirth and existence: gods, demi-gods, humans, animals, hungry ghosts and hells. Earlier Buddhist texts refer to five realms rather than six realms; when described as five realms, the god realm and demi-god realm constitute a single realm.The six realms are typically divided into three higher realms (good, fortunate) and three lower realms (evil, unfortunate). The three higher realms are the realms of the gods, humans and demi-gods; the three lower realms are the realms of the animals, hungry ghosts and hell beings. The six realms are organized into thirty one levels in east Asian literature. Buddhist texts describe these realms as follows:\nGods realm: the gods (devas) is the most pleasure-filled among the six realms, and typically subdivided into twenty six sub-realms. A rebirth in this heavenly realm is believed to be from very good karma accumulation. A Deva does not need to work, and is able to enjoy in the heavenly realm all pleasures found on earth. However, the pleasures of this realm lead to attachment (Upādāna), lack of spiritual pursuits and therefore no nirvana. The vast majority of Buddhist lay people, states Kevin Trainor, have historically pursued Buddhist rituals and practices motivated with rebirth into Deva realm. The Deva realm in Buddhist practice in southeast and east Asia, states Keown, include gods found in Hindu traditions such as Indra and Brahma, and concepts in Hindu cosmology such as Mount Meru.\nHuman realm: called the manuṣya realm. Buddhism asserts that one is reborn in this realm with vastly different physical endowments and moral natures because of a being's past karma. A rebirth in this realm is considered as fortunate because it offers an opportunity to attain nirvana and end the Saṃsāra cycle.\nDemi-god realm (Asura): the demi-gods (asuras) is the third realm of existence in Buddhism. Asura are notable for their anger and some supernatural powers. They fight with the Devas (gods), or trouble the Manusya (humans) through illnesses and natural disasters. They accumulate karma, and are reborn. Demi-god is sometimes ranked as one of the evil realms as there are stories of them fighting against the Gods.\nAnimal realm: is state of existence of a being as an animal (tiryag). This realm is traditionally thought to be similar to a hellish realm, because animals are believed in Buddhist texts to be driven by impulse and instinct, they prey on each other and suffer. Some Buddhist texts assert that plants belong to this realm, with primitive consciousness.\nHungry ghost realm: hungry ghosts and other restless spirits (preta) are rebirths caused by karma of excessive craving and attachments. They do not have a body, are invisible and constitute only \"subtle matter\" of a being. Buddhist texts describe them as beings who are extremely thirsty and hungry, very small mouths but very large stomachs. Buddhist traditions in Asia attempt to care for them on ritual days every year, by leaving food and drinks in open, to feed any hungry ghosts nearby. When their bad karma demerit runs out, these beings are reborn into another realm. According to McClelland, this realm is the mildest of the three evil realms. According to Yangsi Rinpoche, in contrast, the suffering of the beings born in the realm of the hungry ghosts is far more intense than those born in the animal realm.\nHell realm: beings in hell (naraka) enter this realm for evil karma such as theft, lying, adultery and others. The texts vary in their details, but typically describe numerous hellish regions each with different forms of intense suffering, such as eight extremely hot hellish realms, eight extremely cold, being partially eaten alive, beating and other forms of torture in proportion to the evil karma accumulated. These beings are reborn in another realm after their evil karma has run its course, they die, and they get another chance. This realm is not similar to afterlife hell in Christianity, states Damien Keown, because in Buddhism there is no realm of final damnation and existence in this realm is also a temporary state.\n\n\n== Cause and end ==\nSamsara is perpetuated by one's karma, which is caused by craving and ignorance (avidya).\n\n\n=== Karma ===\n\nSamsara is perpetuated by karma. Karma or 'action' results from an intentional physical or mental act, which causes a future consequence. Gethin explains:\n\nThus acts of body and speech are driven by an underlying intention or will (cetanā), and they are unwholesome or wholesome because they are motivated by unwholesome or wholesome intentions. Acts of body and speech are, then, the end products of particular kinds of mentality. At the same time karma can exist as a simple 'act of will', a forceful mental intention or volition that does not lead to an act of body or speech.\nIn the Buddhist view, therefore, the type of birth one has in this life is determined by actions or karma from the previous lives; and the circumstances of the future rebirth are determined by the actions in the current and previous lives.\n\n\n=== Craving and ignorance ===\nInconsistencies in the oldest texts show that the Buddhist teachings on craving and ignorance, and the means to attain liberation, evolved, either during the lifetime of the Buddha, or thereafter. According to Frauwallner, the Buddhist texts show a shift in the explanation of the root cause of samsara. Originally craving was considered to be the root cause of samsara, which could be stilled by the practice of dhyana, leading to a calm of mind which according to Vetter is the liberation which is being sought.The later Buddhist tradition considers ignorance (avidya) to be the root cause of samsara. Avidya is misconception and ignorance about reality, leading to grasping and clinging, and repeated rebirth. According to Paul Williams, \"it is the not-knowingness of things as they truly are, or of oneself as one really is.\" It can be overcome by insight into the true nature of reality. In the later Buddhist tradition \"liberating insight\" came to be regarded as equally liberating as the practice of dhyana. According to Vetter and Bronkhorst, this happened in response to other religious groups in India, who held that a liberating insight was an indispensable requisite for moksha, liberation from rebirth.The ideas on what exactly constituted this \"liberating insight\" evolved over time. Initially the term prajna served to denote this \"liberating insight.\" Later on, prajna was replaced in the suttas by the four truths. This happened in those texts where \"liberating insight\" was preceded by the four jhanas, and where this practice of the four jhanas then culminates in \"liberating insight.\" The four truths were superseded by pratityasamutpada, and still later, in the Hinayana schools, by the doctrine of the non-existence of a substantial self or person. And Schmithausen states that still other descriptions of this \"liberating insight\" exist in the Buddhist canon: \n\n\"that the five Skandhas are impermanent, disagreeable, and neither the Self nor belonging to oneself\"; \"the contemplation of the arising and disappearance (udayabbaya) of the five Skandhas\"; \"the realisation of the Skandhas as empty (rittaka), vain (tucchaka) and without any pith or substance (asaraka).\n\n\n=== Liberation ===\n\nSamsara ends when one attains moksha, liberation. In early Buddhism, Nirvana, the \"blowing out\" of desire, is moksha. In later Buddhism insight becomes predominant, for example the recognition and acceptance of non-self, also called the anatta doctrine. One who no longer sees any soul or self, concludes Walpola Rahula, is the one who has been liberated from the samsara suffering cycles. The theme that Nirvana is non-Self, states Peter Harvey, is recurring in early Buddhist texts.Some Buddhist texts suggest that rebirth occurs through the transfer of vinnana (consciousness) from one life to another. When this consciousness ceases, then liberation is attained. There is a connection between consciousness, karmic activities, and the cycle of rebirth, argues William Waldron, and with the destruction of vinnana, there is \"destruction and cessation of \"karmic activities\" (anabhisankhara, S III, 53), which are considered in Buddhism to be \"necessary for the continued perpetuation of cyclic existence.\"While Buddhism considers the liberation from samsara as the ultimate spiritual goal, in traditional practice, Buddhists seek and accumulate merit through good deeds, donations to monks and various Buddhist rituals in order to gain better rebirths rather than nirvana.\n\n\n=== Impermanence and Non-Self Reality ===\n\nA value of Buddhism is the idea of impermanence. All living things, causes, conditions, situations are impermanent.  Impermanence is the idea that all things disappear once they have originated.  According to Buddhism, Impermanence occurs constantly \"moment to moment\", and this is why there is no recognition of the self. Since everything is considered to be in a state of decay, happiness and self cannot exist in Samsara.Anatta is the Buddhist idea of non-self. Winston L. King, a writer from the University of Hawai'i Press, references  two integral parts of Anatta in Philosophy East and West. King details the first aspect, that Anatta can be \"experienced and not just described.\" King states the second aspect of Anatta is that it is the liberation from the \"power of samsaric drives.\" Obtaining awareness of Anatta and non-self reality results in a, \"freedom from the push-pull of his own appetites, passions, ambitions, and fixations and from the external world's domination in general, that is, the conquest of greed, hatred, and delusion.\" This \"push-pull\" of mundane human existence or samsara results in dukka, but the recognition of Anatta results in a \"freedom from the push-pull.\"\n\n\n== Psychological interpretation ==\nAccording to Chogyam Trungpa the realms of samsara can refer to both \"psychological states of mind and physical cosmological realms\".Gethin argues, rebirth in the different realms is determined by one's karma, which is directly determined by one's psychological states. The Buddhist cosmology may thus be seen as a map of different realms of existence and a description of all possible psychological experiences. The psychological states of a person in current life lead to the nature of next rebirth in Buddhist cosmology.Paul Williams acknowledges Gethin's suggestion of the \"principle of the equivalence of cosmology and psychology,\" but notes that Gethin is not asserting the Buddhist cosmology is really all about current or potential states of mind or psychology. The realms in Buddhist cosmology are indeed realms of rebirths. Otherwise rebirth would always be into the human realm, or there would be no rebirth at all. And that is not traditional Buddhism, states Williams.David McMahan concludes that the attempts to construe ancient Buddhist cosmology in modern psychological terms is modernistic reconstruction, \"detraditionalization and demythologization\" of Buddhism, a sociological phenomenon that is seen in all religions.\n\n\n== Alternate translations ==\nConditioned existence (Daniel Goleman)\nCycle of clinging and taking birth in one desire after another (Phillip Moffitt)\nCycle of existence\nCyclic existence (Jeffry Hopkins)\nUncontrollably recurring rebirth (Alexander Berzin)\nWheel of suffering (Mingyur Rinpoche)\n\n\n== See also ==\nBhavacakra\nBuddhist cosmology\nIndex of Buddhism-related articles\nNirvana (Buddhism)\nRebirth (Buddhism)\nSecular Buddhism\n\n\n== Notes ==\n\n\n== References ==\n\n\n=== Web references ===\n\n\n=== Sources ==="