"Pedophilia (alternatively spelt paedophilia) is a psychiatric disorder in which an adult or older adolescent experiences a primary or exclusive sexual attraction to prepubescent children. Although girls typically begin the process of puberty at age 10 or 11, and boys at age 11 or 12, criteria for pedophilia extend the cut-off point for prepubescence to age 13. A person must be at least 16 years old, and at least five years older than the prepubescent child, for the attraction to be diagnosed as pedophilia.Pedophilia is termed pedophilic disorder in the Diagnostic and Statistical Manual of Mental Disorders (DSM-5), and the manual defines it as a paraphilia involving intense and recurrent sexual urges towards and fantasies about prepubescent children that have either been acted upon or which cause the person with the attraction distress or interpersonal difficulty. The International Classification of Diseases (ICD-11) defines it as a \"sustained, focused, and intense pattern of sexual arousal—as manifested by persistent sexual thoughts, fantasies, urges, or behaviours—involving pre-pubertal children.\"In popular usage, the word pedophilia is often applied to any sexual interest in children or the act of child sexual abuse. This use conflates the sexual attraction to prepubescent children with the act of child sexual abuse and fails to distinguish between attraction to prepubescent and pubescent or post-pubescent minors. Researchers recommend that these imprecise uses be avoided, because although some people who commit child sexual abuse are pedophiles, child sexual abuse offenders are not pedophiles unless they have a primary or exclusive sexual interest in prepubescent children, and some pedophiles do not molest children.Pedophilia was first formally recognized and named in the late 19th century. A significant amount of research in the area has taken place since the 1980s. Although mostly documented in men, there are also women who exhibit the disorder, and researchers assume available estimates underrepresent the true number of female pedophiles. No cure for pedophilia has been developed, but there are therapies that can reduce the incidence of a person committing child sexual abuse. The exact causes of pedophilia have not been conclusively established. Some studies of pedophilia in child sex offenders have correlated it with various neurological abnormalities and psychological pathologies. In the United States, following Kansas v. Hendricks in 1997, sex offenders who are diagnosed with certain mental disorders, particularly pedophilia, can be subject to indefinite involuntary commitment.\n\n\n== Definitions ==\nThe word pedophilia comes from the Greek παῖς, παιδός (paîs, paidós), meaning \"child\", and φιλία (philía), \"friendly love\" or \"friendship\". Pedophilia is used for individuals with a primary or exclusive sexual interest in prepubescent children aged 13 or younger. Infantophilia is a sub-type of pedophilia; it is used to refer to a sexual preference for children under the age of 5 (especially infants and toddlers). This is sometimes referred to as nepiophilia (from the Greek: νήπιος (népios) meaning \"infant\" or \"child,\" which in turn derives from \"ne-\" and \"epos\" meaning \"not speaking\"), though this term is rarely used in academic sources. Hebephilia is defined as individuals with a primary or exclusive sexual interest in 11- to 14-year-old pubescents. The DSM-5 does not list hebephilia among the diagnoses; while evidence suggests that hebephilia is separate from pedophilia, the ICD-10 includes early pubertal age (an aspect of hebephilia) in its pedophilia definition, covering the physical development overlap between the two philias. In addition to hebephilia, some clinicians have proposed other categories that are somewhat or completely distinguished from pedophilia; these include pedohebephilia (a combination of pedophilia and hebephilia) and ephebophilia (though ephebophilia is not considered pathological).\n\n\n== Signs and symptoms ==\n\n\n=== Development ===\nPedophilia emerges before or during puberty, and is stable over time. It is self-discovered, not chosen. For these reasons, pedophilia has been described as a disorder of sexual preference, phenomenologically similar to a heterosexual or homosexual orientation. These observations, however, do not exclude pedophilia from being classified as a mental disorder as pedophilic acts cause harm, and mental health professionals can sometimes help pedophiles to refrain from harming children.In response to misinterpretations that the American Psychiatric Association considers pedophilia a sexual orientation because of wording in its printed DSM-5 manual, which distinguishes between paraphilia and what it calls \"paraphilic disorder\", subsequently forming a division of \"pedophilia\" and \"pedophilic disorder\", the association commented: \"'[S]exual orientation' is not a term used in the diagnostic criteria for pedophilic disorder and its use in the DSM-5 text discussion is an error and should read 'sexual interest.'\" They added, \"In fact, APA considers pedophilic disorder a 'paraphilia,' not a 'sexual orientation.' This error will be corrected in the electronic version of DSM-5 and the next printing of the manual.\" They said they strongly support efforts to criminally prosecute those who sexually abuse and exploit children and adolescents, and \"also support continued efforts to develop treatments for those with pedophilic disorder with the goal of preventing future acts of abuse.\"\n\n\n=== Comorbidity and personality traits ===\nStudies of pedophilia in child sex offenders often report that it co-occurs with other psychopathologies, such as low self-esteem, depression, anxiety, and personality problems. It is not clear whether these are features of the disorder itself, artifacts of sampling bias, or consequences of being identified as a sex offender. One review of the literature concluded that research on personality correlates and psychopathology in pedophiles is rarely methodologically correct, in part owing to confusion between pedophiles and child sex offenders, as well as the difficulty of obtaining a representative, community sample of pedophiles. Seto (2004) points out that pedophiles who are available from a clinical setting are likely there because of distress over their sexual preference or pressure from others. This increases the likelihood that they will show psychological problems. Similarly, pedophiles recruited from a correctional setting have been convicted of a crime, making it more likely that they will show anti-social characteristics.Impaired self-concept and interpersonal functioning were reported in a sample of child sex offenders who met the diagnostic criteria for pedophilia by Cohen et al. (2002), which the authors suggested could contribute to motivation for pedophilic acts. The pedophilic offenders in the study had elevated psychopathy and cognitive distortions compared to healthy community controls. This was interpreted as underlying their failure to inhibit their criminal behavior. Studies in 2009 and 2012 found that non-pedophilic child sex offenders exhibited psychopathy, but pedophiles did not.Wilson and Cox (1983) studied the characteristics of a group of pedophile club members. The most marked differences between pedophiles and controls were on the introversion scale, with pedophiles showing elevated shyness, sensitivity and depression. The pedophiles scored higher on neuroticism and psychoticism, but not enough to be considered pathological as a group. The authors caution that \"there is a difficulty in untangling cause and effect. We cannot tell whether paedophiles gravitate towards children because, being highly introverted, they find the company of children less threatening than that of adults, or whether the social withdrawal implied by their introversion is a result of the isolation engendered by their preference i.e., awareness of the social [dis]approbation and hostility that it evokes\" (p. 324). In a non-clinical survey, 46% of pedophiles reported that they had seriously considered suicide for reasons related to their sexual interest, 32% planned to carry it out, and 13% had already attempted it.A review of qualitative research studies published between 1982 and 2001 concluded that child sexual abusers use cognitive distortions to meet personal needs, justifying abuse by making excuses, redefining their actions as love and mutuality, and exploiting the power imbalance inherent in all adult–child relationships. Other cognitive distortions include the idea of \"children as sexual beings\", uncontrollability of sexual behavior, and \"sexual entitlement-bias\".\n\n\n=== Child pornography ===\nConsumption of child pornography is a more reliable indicator of pedophilia than molesting a child, although some non-pedophiles also view child pornography. Child pornography may be used for a variety of purposes, ranging from private sexual gratification or trading with other collectors, to preparing children for sexual abuse as part of the child grooming process.Pedophilic viewers of child pornography are often obsessive about collecting, organizing, categorizing, and labeling their child pornography collection according to age, gender, sex act and fantasy. According to FBI agent Ken Lanning, \"collecting\" pornography does not mean that they merely view pornography, but that they save it, and \"it comes to define, fuel, and validate their most cherished sexual fantasies\". Lanning states that the collection is the single best indicator of what the offender wants to do, but not necessarily of what has been or will be done. Researchers Taylor and Quayle reported that pedophilic collectors of child pornography are often involved in anonymous internet communities dedicated to extending their collections.\n\n\n== Causes ==\nAlthough what causes pedophilia is not yet known, researchers began reporting a series of findings linking pedophilia with brain structure and function, beginning in 2002. Testing individuals from a variety of referral sources inside and outside the criminal justice system as well as controls, these studies found associations between pedophilia and lower IQs, poorer scores on memory tests, greater rates of non-right-handedness, greater rates of school grade failure over and above the IQ differences, lesser physical height, greater probability of having suffered childhood head injuries resulting in unconsciousness, and several differences in MRI-detected brain structures.Such studies suggest that there are one or more neurological characteristics present at birth that cause or increase the likelihood of being pedophilic. Some studies have found that pedophiles are less cognitively impaired than non-pedophilic child molesters. A 2011 study reported that pedophilic child molesters had deficits in response inhibition, but no deficits in memory or cognitive flexibility. Evidence of familial transmittability \"suggests, but does not prove that genetic factors are responsible\" for the development of pedophilia. A 2015 study indicated that pedophilic offenders have a normal IQ.Another study, using structural MRI, indicated that male pedophiles have a lower volume of white matter than a control group. Functional magnetic resonance imaging (fMRI) has indicated that child molesters diagnosed with pedophilia have reduced activation of the hypothalamus as compared with non-pedophilic persons when viewing sexually arousing pictures of adults. A 2008 functional neuroimaging study notes that central processing of sexual stimuli in heterosexual \"paedophile forensic inpatients\" may be altered by a disturbance in the prefrontal networks, which \"may be associated with stimulus-controlled behaviours, such as sexual compulsive behaviours\". The findings may also suggest \"a dysfunction at the cognitive stage of sexual arousal processing\".Blanchard, Cantor, and Robichaud (2006) reviewed the research that attempted to identify hormonal aspects of pedophiles. They concluded that there is some evidence that pedophilic men have less testosterone than controls, but that the research is of poor quality and that it is difficult to draw any firm conclusion from it.\nWhile not causes of pedophilia themselves, childhood abuse by adults or comorbid psychiatric illnesses—such as personality disorders and substance abuse—are risk factors for acting on pedophilic urges. Blanchard, Cantor, and Robichaud addressed comorbid psychiatric illnesses that, \"The theoretical implications are not so clear. Do particular genes or noxious factors in the prenatal environment predispose a male to develop both affective disorders and pedophilia, or do the frustration, danger, and isolation engendered by unacceptable sexual desires—or their occasional furtive satisfaction—lead to anxiety and despair?\" They indicated that, because they previously found mothers of pedophiles to be more likely to have undergone psychiatric treatment, the genetic possibility is more likely.A study analyzing the sexual fantasies of 200 heterosexual men by using the Wilson Sex Fantasy Questionnaire exam determined that males with a pronounced degree of paraphilic interest (including pedophilia) had a greater number of older brothers, a high 2D:4D digit ratio (which would indicate low prenatal androgen exposure), and an elevated probability of being left-handed, suggesting that disturbed hemispheric brain lateralization may play a role in deviant attractions.\n\n\n== Diagnosis ==\n\n\n=== DSM and ICD-11 ===\nThe Diagnostic and Statistical Manual of Mental Disorders 5th edition (DSM-5) has a significantly larger diagnostic features section for pedophilia than the previous DSM version, the DSM-IV-TR, and states, \"The diagnostic criteria for pedophilic disorder are intended to apply both to individuals who freely disclose this paraphilia and to individuals who deny any sexual attraction to prepubertal children (generally age 13 years or younger), despite substantial objective evidence to the contrary.\" Like the DSM-IV-TR, the manual outlines specific criteria for use in the diagnosis of this disorder. These include the presence of sexually arousing fantasies, behaviors or urges that involve some kind of sexual activity with a prepubescent child (with the diagnostic criteria for the disorder extending the cut-off point for prepubescence to age 13) for six months or more, or that the subject has acted on these urges or suffers from distress as a result of having these feelings. The criteria also indicate that the subject should be 16 or older and that the child or children they fantasize about are at least five years younger than them, though ongoing sexual relationships between a 12- to 13-year-old and a late adolescent are advised to be excluded. A diagnosis is further specified by the sex of the children the person is attracted to, if the impulses or acts are limited to incest, and if the attraction is \"exclusive\" or \"nonexclusive\".The ICD-10 defines pedophilia as \"a sexual preference for children, boys or girls or both, usually of prepubertal or early pubertal age\". Like the DSM, this system's criteria require that the person be at least 16 years of age or older before being diagnosed as a pedophile. The person must also have a persistent or predominant sexual preference for prepubescent children at least five years younger than them. The ICD-11 defines pedophilic disorder as a \"sustained, focused, and intense pattern of sexual arousal—as manifested by persistent sexual thoughts, fantasies, urges, or behaviours—involving pre-pubertal children.\" It also states that for a diagnosis of pedophilic disorder, \"the individual must have acted on these thoughts, fantasies or urges or be markedly distressed by them. This diagnosis does not apply to sexual behaviours among pre- or post-pubertal children with peers who are close in age.\"Several terms have been used to distinguish \"true pedophiles\" from non-pedophilic and non-exclusive offenders, or to distinguish among types of offenders on a continuum according to strength and exclusivity of pedophilic interest, and motivation for the offense (see child sexual offender types). Exclusive pedophiles are sometimes referred to as true pedophiles. They are sexually attracted to prepubescent children, and only prepubescent children. Showing no erotic interest in adults, they can only become sexually aroused while fantasizing about or being in the presence of prepubescent children, or both. Non-exclusive offenders—or \"non-exclusive pedophiles\"—may at times be referred to as non-pedophilic offenders, but the two terms are not always synonymous. Non-exclusive offenders are sexually attracted to both children and adults, and can be sexually aroused by both, though a sexual preference for one over the other in this case may also exist. If the attraction is a sexual preference for prepubescent children, such offenders are considered pedophiles in the same vein as exclusive offenders.Neither the DSM nor the ICD-11 diagnostic criteria require actual sexual activity with a prepubescent youth. The diagnosis can therefore be made based on the presence of fantasies or sexual urges even if they have never been acted upon. On the other hand, a person who acts upon these urges yet experiences no distress about their fantasies or urges can also qualify for the diagnosis. Acting on sexual urges is not limited to overt sex acts for purposes of this diagnosis, and can sometimes include indecent exposure, voyeuristic or frotteuristic behaviors, or masturbating to child pornography. Often, these behaviors need to be considered in-context with an element of clinical judgment before a diagnosis is made. Likewise, when the patient is in late adolescence, the age difference is not specified in hard numbers and instead requires careful consideration of the situation.Ego-dystonic sexual orientation (F66.1) includes people who acknowledge that they have a sexual preference for prepubertal children, but wish to change it due to the associated psychological or behavioral problems (or both).\n\n\n=== Debate regarding criteria ===\nThere was discussion on the DSM-IV-TR being overinclusive and underinclusive. Its criterion A concerns sexual fantasies or sexual urges regarding prepubescent children, and its criterion B concerns acting on those urges or the urges causing marked distress or interpersonal difficulty. Several researchers discussed whether or not a \"contented pedophile\"—an individual who fantasizes about having sex with a child and masturbates to these fantasies, but does not commit child sexual abuse, and who does not feel subjectively distressed afterward—met the DSM-IV-TR criteria for pedophilia since this person did not meet criterion B. Criticism also concerned someone who met criterion B, but did not meet criterion A. A large-scale survey about usage of different classification systems showed that the DSM classification is only rarely used. As an explanation, it was suggested that the underinclusiveness, as well as a lack of validity, reliability and clarity might have led to the rejection of the DSM classification.Ray Blanchard, an American-Canadian sexologist known for his research studies on pedophilia, addressed (in his literature review for the DSM-5) the objections to the overinclusiveness and under underinclusiveness of the DSM-IV-TR, and proposed a general solution applicable to all paraphilias. This meant namely a distinction between paraphilia and paraphilic disorder. The latter term is proposed to identify the diagnosable mental disorder which meets Criterion A and B, whereas an individual who does not meet Criterion B can be ascertained but not diagnosed as having a paraphilia. Blanchard and a number of his colleagues also proposed that hebephilia become a diagnosable mental disorder under the DSM-5 to resolve the physical development overlap between pedophilia and hebephilia by combining the categories under pedophilic disorder, but with specifiers on which age range (or both) is the primary interest. The proposal for hebephilia was rejected by the American Psychiatric Association, but the distinction between paraphilia and paraphilic disorder was implemented.The American Psychiatric Association stated that \"[i]n the case of pedophilic disorder, the notable detail is what wasn't revised in the new manual. Although proposals were discussed throughout the DSM-5 development process, diagnostic criteria ultimately remained the same as in DSM-IV TR\" and that \"[o]nly the disorder name will be changed from pedophilia to pedophilic disorder to maintain consistency with the chapter’s other listings.\" If hebephilia had been accepted as a DSM-5 diagnosable disorder, it would have been similar to the ICD-10 definition of pedophilia that already includes early pubescents, and would have raised the minimum age required for a person to be able to be diagnosed with pedophilia from 16 years to 18 years (with the individual needing to be at least 5 years older than the minor).O'Donohue, however, suggests that the diagnostic criteria for pedophilia be simplified to the attraction to children alone if ascertained by self-report, laboratory findings, or past behavior. He states that any sexual attraction to children is pathological and that distress is irrelevant, noting \"this sexual attraction has the potential to cause significant harm to others and is also not in the best interests of the individual.\" Also arguing for behavioral criteria in defining pedophilia, Howard E. Barbaree and Michael C. Seto disagreed with the American Psychiatric Association's approach in 1997 and instead recommended the use of actions as the sole criterion for the diagnosis of pedophilia, as a means of taxonomic simplification.\n\n\n== Treatment ==\n\n\n=== General ===\nThere is no evidence that pedophilia can be cured. Instead, most therapies focus on helping the pedophile refrain from acting on their desires. Some therapies do attempt to cure pedophilia, but there are no studies showing that they result in a long-term change in sexual preference. Michael Seto suggests that attempts to cure pedophilia in adulthood are unlikely to succeed because its development is influenced by prenatal factors. Pedophilia appears to be difficult to alter but pedophiles can be helped to control their behavior, and future research could develop a method of prevention.There are several common limitations to studies of treatment effectiveness. Most categorize their participants by behavior rather than erotic age preference, which makes it difficult to know the specific treatment outcome for pedophiles. Many do not select their treatment and control groups randomly. Offenders who refuse or quit treatment are at higher risk of offending, so excluding them from the treated group, while not excluding those who would have refused or quit from the control group, can bias the treated group in favor of those with lower recidivism. The effectiveness of treatment for non-offending pedophiles has not been studied.\n\n\n=== Cognitive behavioral therapy ===\nCognitive behavioral therapy (CBT) aims to reduce attitudes, beliefs, and behaviors that may increase the likelihood of sexual offenses against children. Its content varies widely between therapists, but a typical program might involve training in self-control, social competence and empathy, and use cognitive restructuring to change views on sex with children. The most common form of this therapy is relapse prevention, where the patient is taught to identify and respond to potentially risky situations based on principles used for treating addictions.The evidence for cognitive behavioral therapy is mixed. A 2012 Cochrane Review of randomized trials found that CBT had no effect on risk of reoffending for contact sex offenders. Meta-analyses in 2002 and 2005, which included both randomized and non-randomized studies, concluded that CBT reduced recidivism. There is debate over whether non-randomized studies should be considered informative. More research is needed.\n\n\n=== Behavioral interventions ===\nBehavioral treatments target sexual arousal to children, using satiation and aversion techniques to suppress sexual arousal to children and covert sensitization (or masturbatory reconditioning) to increase sexual arousal to adults. Behavioral treatments appear to have an effect on sexual arousal patterns during phallometric testing, but it is not known whether the effect represents changes in sexual interests or changes in the ability to control genital arousal during testing, nor whether the effect persists in the long term. For sex offenders with mental disabilities, applied behavior analysis has been used.\n\n\n=== Sex drive reduction ===\nPharmacological interventions are used to lower the sex drive in general, which can ease the management of pedophilic feelings, but does not change sexual preference. Antiandrogens work by interfering with the activity of testosterone. Cyproterone acetate (Androcur) and medroxyprogesterone acetate (Depo-Provera) are the most commonly used. The efficacy of antiantrogens has some support, but few high-quality studies exist. Cyproterone acetate has the strongest evidence for reducing sexual arousal, while findings on medroxyprogesterone acetate have been mixed.Gonadotropin-releasing hormone analogues such as leuprorelin (Lupron), which last longer and have fewer side-effects, are also used to reduce libido, as are selective serotonin reuptake inhibitors. The evidence for these alternatives is more limited and mostly based on open trials and case studies. All of these treatments, commonly referred to as \"chemical castration\", are often used in conjunction with cognitive behavioral therapy. According to the Association for the Treatment of Sexual Abusers, when treating child molesters, \"anti-androgen treatment should be coupled with appropriate monitoring and counseling within a comprehensive treatment plan.\" These drugs may have side-effects, such as weight gain, breast development, liver damage and osteoporosis.Historically, surgical castration was used to lower sex drive by reducing testosterone. The emergence of pharmacological methods of adjusting testosterone has made it largely obsolete, because they are similarly effective and less invasive. It is still occasionally performed in Germany, the Czech Republic, Switzerland, and a few U.S. states. Non-randomized studies have reported that surgical castration reduces recidivism in contact sex offenders. The Association for the Treatment of Sexual Abusers opposes surgical castration and the Council of Europe works to bring the practice to an end in Eastern European countries where it is still applied through the courts.\n\n\n== Epidemiology ==\n\n\n=== Pedophilia and child molestation ===\nThe prevalence of pedophilia in the general population is not known, but is estimated to be lower than 5% among adult men. Less is known about the prevalence of pedophilia in women, but there are case reports of women with strong sexual fantasies and urges towards children. Most sexual offenders against children are male. Females may account for 0.4% to 4% of convicted sexual offenders, and one study estimates a 10 to 1 ratio of male-to-female child molesters. The true number of female child molesters may be underrepresented by available estimates, for reasons including a \"societal tendency to dismiss the negative impact of sexual relationships between young boys and adult women, as well as women's greater access to very young children who cannot report their abuse\", among other explanations.The term pedophile is commonly used by the public to describe all child sexual abuse offenders. This usage is considered problematic by researchers, because many child molesters do not have a strong sexual interest in prepubescent children, and are consequently not pedophiles. There are motives for child sexual abuse that are unrelated to pedophilia, such as stress, marital problems, the unavailability of an adult partner, general anti-social tendencies, high sex drive or alcohol use. As child sexual abuse is not automatically an indicator that its perpetrator is a pedophile, offenders can be separated into two types: pedophilic and non-pedophilic (or preferential and situational). Estimates for the rate of pedophilia in detected child molesters generally range between 25% and 50%. A 2006 study found that 35% of its sample of child molesters were pedophilic. Pedophilia appears to be less common in incest offenders, especially fathers and step-fathers. According to a U.S. study on 2429 adult male sex offenders who were categorized as \"pedophiles\", only 7% identified themselves as exclusive; indicating that many or most child sexual abusers may fall into the non-exclusive category.Some pedophiles do not molest children. Little is known about this population because most studies of pedophilia use criminal or clinical samples, which may not be representative of pedophiles in general. Researcher Michael Seto suggests that pedophiles who commit child sexual abuse do so because of other anti-social traits in addition to their sexual attraction. He states that pedophiles who are \"reflective, sensitive to the feelings of others, averse to risk, abstain from alcohol or drug use, and endorse attitudes and beliefs supportive of norms and the laws\" may be unlikely to abuse children. A 2015 study indicates that pedophiles who molested children are neurologically distinct from non-offending pedophiles. The pedophilic molesters had neurological deficits suggestive of disruptions in inhibitory regions of the brain, while non-offending pedophiles had no such deficits.According to Abel, Mittleman, and Becker (1985) and Ward et al. (1995), there are generally large distinctions between the characteristics of pedophilic and non-pedophilic molesters. They state that non-pedophilic offenders tend to offend at times of stress; have a later onset of offending; and have fewer, often familial, victims, while pedophilic offenders often start offending at an early age; often have a larger number of victims who are frequently extrafamilial; are more inwardly driven to offend; and have values or beliefs that strongly support an offense lifestyle. One study found that pedophilic molesters had a median of 1.3 victims for those with girl victims and 4.4 for those with boy victims. Child molesters, pedophilic or not, employ a variety of methods to gain sexual access to children. Some groom their victims into compliance with attention and gifts, while others use threats, alcohol or drugs, or physical force.\n\n\n== History ==\nPedophilia is believed to have occurred in humans throughout history, but was not formally named, defined or studied until the late 19th century. The term paedophilia erotica was coined in an 1886 article by the Viennese psychiatrist Richard von Krafft-Ebing but does not enter the author's Psychopathia Sexualis until the 10th German edition. A number of authors anticipated Krafft-Ebing's diagnostic gesture. In Psychopathia Sexualis, the term appears in a section titled \"Violation of Individuals Under the Age of Fourteen\", which focuses on the forensic psychiatry aspect of child sexual offenders in general. Krafft-Ebing describes several typologies of offender, dividing them into psychopathological and non-psychopathological origins, and hypothesizes several apparent causal factors that may lead to the sexual abuse of children.Krafft-Ebing mentioned paedophilia erotica in a typology of \"psycho-sexual perversion\". He wrote that he had only encountered it four times in his career and gave brief descriptions of each case, listing three common traits:\n\nThe individual is tainted [by heredity] (hereditär belastete)\nThe subject's primary attraction is to children, rather than adults.\nThe acts committed by the subject are typically not intercourse, but rather involve inappropriate touching or manipulating the child into performing an act on the subject.He mentions several cases of pedophilia among adult women (provided by another physician), and also considered the abuse of boys by homosexual men to be extremely rare. Further clarifying this point, he indicated that cases of adult men who have some medical or neurological disorder and abuse a male child are not true pedophilia and that, in his observation, victims of such men tended to be older and pubescent. He also lists pseudopaedophilia as a related condition wherein \"individuals who have lost libido for the adult through masturbation and subsequently turn to children for the gratification of their sexual appetite\" and claimed this is much more common.Austrian neurologist Sigmund Freud briefly wrote about the topic in his 1905 book Three Essays on the Theory of Sexuality in a section titled The Sexually immature and Animals as Sexual objects. He wrote that exclusive pedophilia was rare and only occasionally were prepubescent children exclusive objects. He wrote that they usually were the subject of desire when a weak person \"makes use of such substitutes\" or when an uncontrollable instinct which will not allow delay seeks immediate gratification and cannot find a more appropriate object.In 1908, Swiss neuroanatomist and psychiatrist Auguste Forel wrote of the phenomenon, proposing that it be referred to it as \"Pederosis\", the \"Sexual Appetite for Children\". Similar to Krafft-Ebing's work, Forel made the distinction between incidental sexual abuse by persons with dementia and other organic brain conditions, and the truly preferential and sometimes exclusive sexual desire for children. However, he disagreed with Krafft-Ebing in that he felt the condition of the latter was largely ingrained and unchangeable.The term pedophilia became the generally accepted term for the condition and saw widespread adoption in the early 20th century, appearing in many popular medical dictionaries such as the 5th Edition of Stedman's in 1918. In 1952, it was included in the first edition of the Diagnostic and Statistical Manual of Mental Disorders. This edition and the subsequent DSM-II listed the disorder as one subtype of the classification \"Sexual Deviation\", but no diagnostic criteria were provided. The DSM-III, published in 1980, contained a full description of the disorder and provided a set of guidelines for diagnosis. The revision in 1987, the DSM-III-R, kept the description largely the same, but updated and expanded the diagnostic criteria.\n\n\n== Law and forensic psychology ==\n\n\n=== Definitions ===\nPedophilia is not a legal term, and having a sexual attraction to children is not illegal. In law enforcement circles, the term pedophile is sometimes used informally to refer to any person who commits one or more sexually-based crimes that relate to legally underage victims. These crimes may include child sexual abuse, statutory rape, offenses involving child pornography, child grooming, stalking, and indecent exposure. One unit of the United Kingdom's Child Abuse Investigation Command is known as the \"Paedophile Unit\" and specializes in online investigations and enforcement work. Some forensic science texts, such as Holmes (2008), use the term to refer to offenders who target child victims, even when such children are not the primary sexual interest of the offender. FBI agent Kenneth Lanning, however, makes a point of distinguishing between pedophiles and child molesters.\n\n\n=== Civil and legal commitment ===\nIn the United States, following Kansas v. Hendricks, sex offenders who have certain mental disorders, including pedophilia, can be subject to indefinite civil commitment under various state laws (generically called SVP laws) and the federal Adam Walsh Child Protection and Safety Act of 2006. Similar legislation exists in Canada.In Kansas v. Hendricks, the US Supreme Court upheld as constitutional a Kansas law, the Sexually Violent Predator Act, under which Hendricks, a pedophile, was found to have a \"mental abnormality\" defined as a \"congenital or acquired condition affecting the emotional or volitional capacity which predisposes the person to commit sexually violent offenses to the degree that such person is a menace to the health and safety of others\", which allowed the State to confine Hendricks indefinitely irrespective of whether the State provided any treatment to him. In United States v. Comstock, this type of indefinite confinement was upheld for someone previously convicted on child pornography charges; this time a federal law was involved—the Adam Walsh Child Protection and Safety Act. The Walsh Act does not require a conviction on a sex offense charge, but only that the person be a federal prisoner, and one who \"has engaged or attempted to engage in sexually violent conduct or child molestation and who is sexually dangerous to others\", and who \"would have serious difficulty in refraining from sexually violent conduct or child molestation if released\".In the US, offenders with pedophilia are more likely to be recommended for civil commitment than non-pedophilic offenders. About half of committed offenders have a diagnosis of pedophilia. Psychiatrist Michael First writes that, since not all people with a paraphilia have difficulty controlling their behavior, the evaluating clinician must present additional evidence of volitional impairment instead of recommending commitment based on pedophilia alone.\n\n\n== Society and culture ==\n\n\n=== General ===\nPedophilia is one of the most stigmatized mental disorders. One study reported high levels of anger, fear and social rejection towards pedophiles who have not committed a crime. The authors suggested such attitudes could negatively impact child sexual abuse prevention by reducing pedophiles' mental stability and discouraging them from seeking help. According to sociologists Melanie-Angela Neuilly and Kristen Zgoba, social concern over pedophilia intensified greatly in the 1990s, coinciding with several sensational sex crimes (but a general decline in child sexual abuse rates). They found that the word pedophile appeared only rarely in The New York Times and Le Monde before 1996, with zero mentions in 1991.Social attitudes towards child sexual abuse are extremely negative, with some surveys ranking it as morally worse than murder. Early research showed that there was a great deal of misunderstanding and unrealistic perceptions in the general public about child sexual abuse and pedophiles. However, a 2004 study concluded that the public was well-informed on some aspects of these subjects.\n\n\n=== Misuse of medical terminology ===\nThe words pedophile and pedophilia are commonly used informally to describe an adult's sexual interest in pubescent or post-pubescent teenagers. The terms hebephilia or ephebophilia may be more accurate in these cases.Another common usage of pedophilia is to refer to the act of sexual abuse itself, rather than the medical meaning, which is a preference for prepubescents on the part of the older individual (see above for an explanation of the distinction). There are also situations where the terms are misused to refer to relationships where the younger person is an adult of legal age, but is either considered too young in comparison to their older partner, or the older partner occupies a position of authority over them. Researchers state that the above uses of the term pedophilia are imprecise or suggest that they are best avoided. The Mayo Clinic states that pedophilia \"is not a criminal or legal term\".\n\n\n=== Pedophile advocacy groups ===\n\nFrom the late 1950s to early 1990s, several pedophile membership organizations advocated age of consent reform to lower or abolish age of consent laws, as well as for the acceptance of pedophilia as a sexual orientation rather than a psychological disorder, and for the legalization of child pornography. The efforts of pedophile advocacy groups did not gain mainstream acceptance, and today those few groups that have not dissolved have only minimal membership and have ceased their activities other than through a few websites. In contrast to these organizations, members of the support group Virtuous Pedophiles believe that child sexual abuse is wrong and seek to raise awareness that some pedophiles do not offend; this is generally not considered pedophile advocacy, as the Virtuous Pedophiles organization does not approve of the legalization of child pornography and does not support age of consent reform.\n\n\n=== Anti-pedophile activism ===\n\nAnti-pedophile activism encompasses opposition against pedophiles, against pedophile advocacy groups, and against other phenomena that are seen as related to pedophilia, such as child pornography and child sexual abuse. Much of the direct action classified as anti-pedophile involves demonstrations against sex offenders, against pedophiles advocating for the legalization of sexual activity between adults and children, and against Internet users who solicit sex from minors.High-profile media attention to pedophilia has led to incidents of moral panic, particularly following reports of pedophilia associated with Satanic ritual abuse and day care sex abuse. Instances of vigilantism have also been reported in response to public attention on convicted or suspected child sex offenders. In 2000, following a media campaign of \"naming and shaming\" suspected pedophiles in the UK, hundreds of residents took to the streets in protest against suspected pedophiles, eventually escalating to violent conduct requiring police intervention.\n\n\n== See also ==\nAge disparity in sexual relationships\nChild sexuality\nTrafficking of children\nCircles of Support and Accountability\nGerontophilia\nList of paraphilias\nPrevention Project Dunkelfeld\n\n\n== References ==\n\n\n== Further reading ==\nGladwell, Malcolm. \"In Plain View.\" (\"Jerry Sandusky and the Mind of a Pedophile\") The New Yorker. September 24, 2012.\nPhilby, Charlotte. \"Female sexual abuse: The untold story of society's last taboo.\" The Independent. Saturday August 8, 2009.\nBleyer, Jennifer. \"How Can We Stop Pedophiles? Stop treating them like monsters.\" Slate. Monday September 24, 2012.\nFong, Diana. Editor: Nancy Isenson. \"'If I'm attracted to children, I must be a monster'.\" Die Welt. May 29, 2013.\n\n\n== External links ==\nUnderstanding MRI research on pedophilia\nPedophilia: Myths, Realities and Treatments ( Page will play audio when loaded)Indictment from Operation Delego (PDF) (Archive)\nVirtuous Pedophiles, online support for non-offending pedophiles working to remain offence-free.\nHelpWantedPrevention.org, an online self-help course from Johns Hopkins University for managing attraction to children"