"Pedophilia (alternatively spelt paedophilia) is a psychiatric disorder in which an adult or older adolescent experiences a primary or exclusive sexual attraction to prepubescent children. Although girls typically begin the process of puberty at age 10 or 11, and boys at age 11 or 12, criteria for pedophilia extend the cut-off point for prepubescence to age 13. A person must be at least 16 years old, and at least five years older than the prepubescent child, for the attraction to be diagnosed as pedophilia.Pedophilia is termed pedophilic disorder in the Diagnostic and Statistical Manual of Mental Disorders (DSM-5), and the manual defines it as a paraphilia involving intense and recurrent sexual urges towards and fantasies about prepubescent children that have either been acted upon or which cause the person with the attraction distress or interpersonal difficulty. The International Classification of Diseases (ICD-11) defines it as a \"sustained, focused, and intense pattern of sexual arousal—as manifested by persistent sexual thoughts, fantasies, urges, or behaviours—involving pre-pubertal children.\"In popular usage, the word pedophilia is often applied to any sexual interest in children or the act of child sexual abuse. This use conflates the sexual attraction to prepubescent children with the act of child sexual abuse and fails to distinguish between attraction to prepubescent and pubescent or post-pubescent minors. Researchers recommend that these imprecise uses be avoided, because although some people who commit child sexual abuse are pedophiles, child sexual abuse offenders are not pedophiles unless they have a primary or exclusive sexual interest in prepubescent children, and some pedophiles do not molest children.Pedophilia was first formally recognized and named in the late 19th century. A significant amount of research in the area has taken place since the 1980s. Although mostly documented in men, there are also women who exhibit the disorder, and researchers assume available estimates underrepresent the true number of female pedophiles. No cure for pedophilia has been developed, but there are therapies that can reduce the incidence of a person committing child sexual abuse. The exact causes of pedophilia have not been conclusively established. Some studies of pedophilia in child sex offenders have correlated it with various neurological abnormalities and psychological pathologies. In the United States, following Kansas v. Hendricks in 1997, sex offenders who are diagnosed with certain mental disorders, particularly pedophilia, can be subject to indefinite involuntary commitment."