"The Blood of Gods is the fourteenth album by thrash metal band Gwar. It was released on October 20, 2017 by Metal Blade Records. It is the band's first album without founding member Dave Brockie, who portrayed Oderus Urungus, due to his heroin overdose death on March 23, 2014. The album is also the first to feature Michael Bishop since 1999's We Kill Everything, portraying the newest character, lead singer Blöthar the Berserker, as opposed to his role as the original Beefcake the Mighty.\n\n\n== Overview ==\nThe album's description reads:\n\nDuring their set on the first day of the 2017 Vans Warped Tour, the band debuted \"Fuck This Place\", a tribute to Oderus Urungus.\n\n\n== Track listing ==\n\"Fuck This Place\" contains an unlisted orchestral reprise of \"War on Gwar\" after the main song concludes. Vinyl pressings of the album feature a re-ordered track listing and place the reprise at the end of side C, following \"Crushed By the Cross.\"\n\n\n== Personnel ==\nMike Bishop (Blöthar the Berserker) – lead vocals, bass on \"Viking Death Machine\" and \"Crushed By the Cross\"\nBrent Purgason (Pustulus Maximus) – lead guitar, backing vocals, lead vocals on \"Crushed By the Cross\", additional vocals on \"El Presidente\" and \"Death to Dickie Duncan\"\nMike Derks (Balsac the Jaws of Death) – rhythm guitar, backing vocals, additional vocals on \"El Presidente\"\nJamison Land (Beefcake the Mighty) – bass, backing vocals, additional vocals on \"El Presidente\" and \"Fuck This Place\", glockenspiel\nBrad Roberts (Jizmak Da Gusha) – drums, percussion, additional vocals on \"El Presidente\" and \"Fuck This Place\"\nMatt Maguire (Sawborg Destructo) – lead vocals on \"The Sordid Soliloquy of Sawborg Destructo\"\nBob Gorman (Bonesnapper) – spoken words at the end of \"If You Want Blood\"\nMC Chris (Dickie Duncan) – additional vocals on \"Death to Dickie Duncan\" and \"Fuck This Place\"\nJenna Ottinger – additional vocals on \"War on Gwar\" and \"Crushed By the Cross\"\nJW Adkins – orchestral arrangement on \"War on Gwar\" reprise\nDanny T. Levin – all horns and horn arrangements on \"El Presidente\"\nJonah Kane-West – B3 organ on \"Viking Death Machine\", \"I'll Be Your Monster\", and \"Phantom Limb\"\nNicole Roberts – additional percussion, tambourine, vibraslap, and Tibetan chimes\nMark Kilbourn – additional sound design\nRonan Chris Murphy – production, keyboards, additional percussion, and backing vocals\n\n\n== Charts ==\n\n\n== References ==\n\n\n== External links ==\n\"Gwar - The Blood Of Gods MP3 Music Download\". CD Universe. Retrieved August 19, 2017."