"David Murray Brockie (August 30, 1963 – March 23, 2014) was a Canadian-American musician, best known as the lead vocalist of the heavy metal band Gwar, in which he performed as Oderus Urungus. He performed as a bassist and lead singer in bands such as Death Piggy, X-Cops, and the Dave Brockie Experience (DBX), and starred in the comedy/horror TV sitcom Holliston as Oderus Urungus. Brockie died in 2014 of a heroin overdose.\n\n\n== Early life ==\nDavid Brockie was the youngest of two adopted sons of William and Marion Brockie, both of whom were originally from the United Kingdom.  David's older brother, Paul, died from complications of AIDS in the early 1990s.  While born in Canada, at age 3 his parents emigrated to the United States.  David grew up in Fairfax, VA on Portsmouth Rd., near the intersection of Braddock Rd. and Route 123 (Chain Bridge Rd.).  He attended Oak View Elementary School and graduated from James W. Robinson Secondary High School in 1981.  David's interest in playing music began in high school.  David was a huge fan of Monty Python's Flying Circus and frequently impersonated their skits with friends.  He possessed a vivid imagination and was very creative throughout his youth.\n\n\n== Oderus Urungus ==\n\nBrockie portrayed Oderus Urungus, Gwar's lead singer, from Gwar's inception in 1984 until his death. Oderus appeared as an intergalactic humanoid barbarian with devil horns and a meaty-looking face, and carried a long sword named \"Unt Lick\" and a cuttlefish around his loins.\n\n\n=== Backstory ===\nAccording to the character's backstory, Oderus Urungus is 50 billion years old, and was assembled on a planet called Scumdogia in \"Syntho Womb 5\" after pieces of his moldy war frame were found scattered throughout the galaxy. His only true companion was his cuttlefish, though lost for a short period it returned to its true resting place, strategically placed over his loins. According to interviews, Oderus's father was a supercomputer, and his mother was a petri dish. During a reading of Goodnight Moon, Oderus revealed that he was born into a gladiatorial arena, during which time he was given a sword, and battled an onslaught of \"slowtards\" who were trying to rape him. It is suggested in the lyrics of \"Fire in the Loins\" (from RagNaRok) that Slymenstra Hymen is his sister, but this is never fully explained.\n\n\n=== History ===\nOderus Urungus was the only character to have existed in every incarnation of Gwar, having started as a guitarist, then moving to bass, and finally lead vocals.\nLike all of Gwar's characters, Oderus underwent several design changes since his inception. He first started out as a relatively normal-looking character with a papier-mâché helmet with spikes that appeared to be made out of aluminum foil. This eventually progressed into a rubber wig. In the late 1980s Brockie, along with Chuck Varga, created the now-famous original design mask. After Hell-O!, he would add large shoulder pads. These would remain relatively unchanged (except for materials used) until 1994, when Brockie experimented with a new style - the left arm resembled a very mutated tentacle. The change did not last, and by the year's end, the design returned to the World War I-era German helmet-shaped shoulder pads. This version can be found in the \"Saddam A Go-Go\" video from the \"Rendezvous With RagNaRok\" movie. In 2001, after the filming of \"It's Sleazy\", Brockie redesigned the shoulder pads to their current design - two skulls with longer, more blade-shaped points. The disfigured face remained relatively unchanged since 1988, with slight additions made in 2001 (the redesign of Oderus was in collaboration with the medieval violence-themed Violence Has Arrived album, released in November of that year) – two horns, roughly six or seven inches (178 mm)  in length.\nFor the Beyond Hell album and tours both preceding and succeeding said album, Oderus's mask was once again redesigned. It appeared more decayed and distorted than the previous masks, and there was exposed flesh on the forehead and the mask had a lighter color to it. Another addition was that the beard was fuller and larger and had red and green highlights in it. The most recent Oderus mask had longer horns and cheek bones that stood out more.As the front man for the band, Dave Brockie was the most interviewed among the group (alternating between himself and Oderus Urungus). All of Gwar's major television appearances included Dave portraying Oderus.Oderus appeared semi-regularly on the late-night Fox News talk show Red Eye w/Greg Gutfeld as the Intergalactic Correspondent from July 8, 2009, to September 30, 2010.\n\n\n==== Holliston ====\nOn April 3, 2012, the television sitcom Holliston had its world television premiere on the FEARnet cable television network. Created by horror filmmaker Adam Green (Hatchet, Frozen), the series starred Dave Brockie in his \"Oderus Urungus\" character as series lead Adam Green's imaginary alien friend and guardian angel who lives in his closet. In each episode, whenever \"Adam\" faced a personal problem, \"Oderus\" would come out of his closet and dish out advice that was both hilariously and terribly misguided, oftentimes causing \"Adam\" to have even worse problems. The series also included heavy metal icon Dee Snider of Twisted Sister. Holliston was an instant success with horror and metal fans and a second season was green-lit the morning after the second episode had aired. The second season of Holliston began airing on television on June 4, 2012, and solidified the series as a major success. Brockie toured and appeared with his castmates as \"Oderus Urungus\" at many live performances of Holliston across the United States in 2012 and 2013. Green also appeared on stage with Gwar several times when the band had him introduce their encore performance. The full Holliston cast was murdered on stage and fed to both Gwar's world maggot and meat grinder at several US shows. A third season of Holliston was being scripted by Green when Brockie died in March 2014. When asked in recent interviews about how he would address the loss of Brockie and whether or not Holliston would indeed continue, Green stated, \"I am too heartbroken over the loss of my friend and brother to think about that right now.\" Green says he will be focusing on his other upcoming film projects until he is emotionally ready to turn his attention back to his TV series and that \"it will take me however long it may take me.\" A 25-year-long fan of Gwar and one of Brockie's closest friends, Green took Brockie's death extremely hard. Green joined Jello Biafra and Randy Blythe on stage as one of the speakers at Brockie's public memorial in Richmond, Virginia in August 2014 where he delivered a moving 15 minute eulogy to the crowd and also posted a public eulogy in his blog on www.ariescope.com that included the full audio of Brockie's final voice mail to him.  In the voice mail message, Brockie calls Green from Gwar's tour in Australia simply to say, \"I miss my Holliston family and I love you… like a little motherfucking little brother. I love you very much.\"\nIn 2012, he joined the 11th annual Independent Music Awards judging panel to assist independent musicians' careers.\n\n\n== 1990 arrest for obscenity ==\nIn 1990, Brockie was arrested by police for obscenity after a Charlotte, North Carolina concert, that almost led to him being deported (Brockie was, at the time, a Canadian citizen and did not have a driver's license), reportedly taking the \"Cuttlefish of Cthulhu\" (an on-stage prop meant to represent Oderus's penis) into custody as \"evidence.\" In the end, Brockie was not deported.The arrest was written into the Oderus Urungus mythology. Oderus attracts trouble wherever he goes, including one instance where, according to the storyline of Gwar's America Must Be Destroyed album and Phallus in Wonderland movie, Corporal Punishment of The Morality Squad ambushes and detaches the Cuttlefish. This is detailed in the song \"Ham On The Bone\" (although the song predates the event in question by more than a year, it fits the context of the story perfectly). Since that incident, Oderus had made it a point to appear with the Cuttlefish whenever possible (though some tours downplayed the \"fish\", Gwar's more recent tours had utilized a re-designed Cuttlefish as a means to spray the audience with various fluids).\n\n\n== Instruments ==\nThough he was the lead vocalist of Gwar, Dave Brockie played other instruments with the band. His original position was as one of the (three) guitarists, though other Slave Pit members (as well as Brockie himself) claimed that he was a very poor guitarist. Don Drakulich, a.k.a. Sleazy P. Martini, has given a similar answer in the \"Ask Sleazy\" section of Bohab Central (the largest Gwar fansite), even going so far as to say that all of Brockie's guitar parts on Let There Be Gwar were removed.\nAs a bass player, however, Brockie fared much better. In the Live From Antarctica concert video, Oderus played bass on \"Cool Place To Park\", while Michael Bishop (then Beefcake the Mighty) sang – though Bishop was capable of singing and playing at the same time, his thrashing and jumping made that impossible. Brockie also played bass on the tracks \"Eat Steel\" and \"Fight\", on Gwar's album This Toilet Earth (both these tracks feature Bishop's Beefcake on vocals). Additionally, Brockie played bass for X-Cops as Patrolman Cobb Knobbler, as well as the Dave Brockie Experience.\n\n\n== Musical influences ==\nBrockie stated he grew up a \"rocker\"; he started out listening to heavy metal as a kid, then immediately became more absorbed into punk rock as a teenager, especially the 1980s hardcore punk scene. Brockie stated his favorite punk bands were Bad Brains, Black Flag, and Charged GBH. He got back into heavy metal when thrash metal bands, such as Metallica and Slayer began to emerge.\n\n\n== Death ==\nOn Sunday March 23, 2014, Brockie was found dead, his body sitting upright in a chair in his home, by a fellow band member. The cause of death was determined to be a heroin overdose. Gwar's management confirmed initial reports of Brockie's death on the official Gwar website at 4am on March 24 and news of Brockie's death spread quickly with many of his fellow musical peers and bandmates responding through social media. Mike Bishop, at that time a former member of Gwar, was one of the first to confirm Brockie's death.Many fans and fellow musicians took the time to honor his memory, including Lamb of God lead singer Randy Blythe, Foo Fighters lead singer Dave Grohl, and The Daily Beast writer Andy Hinds. Oderus Urungus was given a traditional Viking funeral in a public memorial prior to the 5th annual GWAR-B-Q event on August 15, 2014. Brockie is not buried in Hollywood Cemetery in Richmond, Virginia, but has a memorial marker.After Brockie's death, a fan petition was started to persuade the developers of Mortal Kombat X to include Oderus into the game as a tribute to Brockie. In addition, a second petition was made to persuade the developers of Killer Instinct to include Oderus.As a part of the band's complex mythology, on the Gwar Eternal Tour, Mr. Perfect tells Gwar that he stole Oderus Urungus' immortality and impaled him on his own sword.\nBrockie was survived by his father, William Brockie.In April 2015, William Brockie filed suit in Richmond, Virginia, Circuit Court against  the surviving band members and their management company, Slave Pit Inc., seeking \"$1 million in compensatory damages, punitive damages, and injunctive relief on claims of conversion, breach of contract, and unauthorized use of David Brockie's image.\"\n\n\n== Discography ==\n\n\n=== With Gwar ===\nHell-O (1988)\nScumdogs of the Universe (1990)\nAmerica Must Be Destroyed (1992)\nThis Toilet Earth (1994)\nRagnarök (1995)\nCarnival of Chaos (1997)\nWe Kill Everything (1999)\nViolence Has Arrived (2001)\nWar Party (2004)\nLive From Mt. Fuji (2005)\nBeyond Hell (2006)\nLust in Space (2009)\nBloody Pit of Horror (2010)\nBattle Maximus (2013)\n\n\n=== With Dave Brockie Experience ===\nDiarrhea of a Madman (2001)\nLive From Ground Zero (2002)\nSongs for the Wrong (2003)\n\n\n=== With Death Piggy ===\nLove War 7\" EP (1983)\nDeath Rules the Fairway 7\" EP (1984)\nR45 7\" EP (1985)\nSmile Or Die!!! (1999) (compilation)\n\n\n=== With X-Cops ===\nYou Have the Right to Remain Silent... (1995)\n\n\n== Bibliography ==\nDave., Brockie (2010). Whargoul. Portland, OR: Deadite Press. ISBN 9781936383368. OCLC 785150673.\n\n\n== References ==\n\n\n== External links ==\nOfficial Website\nOfficial Website of Gwar Videos and Online Community\nDave Brockie at IMDb\nJapanese Official Website\nDave Brockie's Official Website\nOderus Urungus with Gwar - Picture Gallery\nOderous interviewed on Metal Rules! Radio episode 12\nRIP Dave Brockie, aka Oderus Urungus of GWAR, RVA Magazine\nInterview with Oderus Urungus at ion magazine\nTheMetalStation.com Posts Death of Dave Brockie"