"This Timeline of social nudity shows the varying degrees of acceptance given to the naked human body by diverse cultures throughout history. The events listed here demonstrate how various societies have shifted between strict and lax clothing standards, how nudity has played a part in social movements and protest, and how the nude human body is accepted in the public sphere.\n\n\n== Prehistory–1800 ==\n\n70,000 BP: Humans first wear clothing, a date suggested by evidence based on lice DNA which shows when the clothing louse first began to diverge genetically from the human head louse.\n720 BC: According to one legend, an athlete (Orsippos of Megara) who discards his loincloth wins his race at the Olympic Games. A variation of the legend asserts that the loincloth accidentally falls off a runner at the Olympics who trips on it, strikes his head, and dies. So, for reasons of either improved athletic performance or for safety, ancient Greek Olympic athletes compete naked.\nc. 650 BC: In Sparta, both women and men occasionally appear nude in certain festivals and during exercise.\nFirst century AD: Historian Diodorus Siculus records that the Celts commonly fight naked in battle. Nudity is mentioned several times in the New Testament, although none of the examples give it a sexual connotation. For example, refusal to wear clothes could be a sign of insanity during this period. Nakedness was also used as a symbol of poverty or vulnerability. There are a few New Testament references to actual nudity, such as (Mark 14:52) in which a young man runs away naked from the Garden of Gethsemane, and (John 21:7) where Peter is described as naked while he is fishing. Some say that the term means semi-naked, arguing that it is unlikely that a Jew would go completely unclothed in public, although others argue that fishermen in the Sea of Galilee did actually work naked.\n100 AD–18th century: The Adamites are adherents of an early Christian sect that flourishes in North Africa in the 2nd, 3rd and 4th centuries, with later revivals. They practice \"holy nudism\", claiming that its members are re-established in Adam and Eve's state of original innocence.\n201 AD: The first known liturgy of baptism is recorded by Saint Hippolytus of Rome, which insists on complete nudity for all participants, even down to the removal of jewellery and hair fastenings. Baptism is later segregated by sex, as suggested by a scene depicted on a 5th-century lead font, but still conducted on an unclothed participant. Christian groups, including the Adamites, Carpocratians, Aquarii, and Marcosians all practice social nudity.\n393 AD: Students in ancient Greece exercise and receive instruction naked and athletes compete naked. This tradition ends in 393 AD when the Christian Emperor Theodosius I bans the Olympic Games because he considers them pagan.\n632 AD: Quran teachings transmitted by Muhammad impose modest dress on men and women.\nc. 1050 AD: Leofric, Earl of Mercia imposes a heavy tax burden on the citizens of Coventry, England to support his grandiose public works. According to legend that is almost certainly untrue, his wife Godgyfu begs him to reduce the tax, and he tells her that she must ride naked through the city's market before he will do it. Godgyfu, remembered as Lady Godiva, accepts the challenge.\n1185–1333: In Kamakura-period Japan, religious bathing is provided to the public free of charge with no concept of gender segregation. After the collapse of free services, a for-pay system emerges which later evolves to become the modern day sentō.\n\n\n== 1800–1899 ==\n\n1840s (1840s): Nude swimming is common on beaches, United Kingdom.\n1868 (1868): Introduction of the swimming-costume, because regular clothing was cumbersome and endangered the swimmer.\n1873 (1873): The diary of Rev. Robert Francis Kilvert notes the transition to the mandatory use of swimming-costumes after bathing at Seaton. He was brought \"a pair of very short red and white striped drawers to cover my nakedness\", and being so \"unaccustomed to such things and customs\" that he had \"set at nought the conventionalities of the place\", Victorian England.\n1874 (1874): European missionaries try to stop nude surfing and force indigenous women to cover themselves by wearing the Mother Hubbard dress. The dress code, however, is often ignored; a British engraving shows a set of waves ridden by nearly a dozen Hawaiian surfers, male and female, all of them naked, Polynesia.\n1891 (1891): Earliest known naturist club founded by Charles Edward Gordon Crawford, District and Sessions Judge for the Bombay Civil Service, Thana, India.\n\n\n== 1900–1974 ==\n\n1900 (1900): Sociologist Heinrich Pudor publishes The Cult of the Nude and nude public bathing is seen as the start of the nudist movement, Germany.\n1900 (1900): Paul Zimmerman establishes the first naturist resort near Hamburg, Germany.\n1903 (1903) – 1932: Freedomites (Svobodniki or Sons of Freedom) Doukhobors engage in nude protests. In May of 1903 they protest nude and are persecuted. In 1932 nearly 900 nude protesters are sentenced by the government of British Columbia to three years imprisonment on Piers Island, Canada.\nc. 1905 (c. 1905): The English Gymnosophist Society founded, United Kingdom\n1922 (1922): The Down With Shame movement holds nude marches and \"Evenings of the Denuded Body\" intended to dispel earlier bourgeois morality, former Soviet Union.\n1926 (1926): Societe Internationale de Gymnosophie founded by Kenne D'Mongeot, France.\n1927 (1927): The New Gymnosophy, the philosophy of nudity as applied in modern life,  first edition published in the US by Dr. Maurice Parmelee, Professor of Sociology, City College of New York, who would later become the first president of the American Gymnosophical Association, United States.\n1927 (1927): Fiveacres Country Club, the oldest naturist club still on its original site, founded, Bricket Wood, Hertfordshire, England.\n1929 (1929): The American League for Physical Culture (ALPC) is founded, United States.\n1930 (1930): American Gymnosophical Association (AGA) is formed by Dr. Maurice Parmelee as an outgrowth of the American League for Physical Culture at the Rock Lodge Club, Stockholm, New Jersey.\n1931 (1931): Héliopolis, Europe's first town dedicated to naturism, founded by Doctors Gaston and André Durville, Île du Levant, France.\nMay 15, 1932 (1932-05-15): Sky Farm, the first permanent nudist community in the United States, is established, Liberty Corner, New Jersey.\n1933 (1933): Nazi edict bans many nudist organizations, but nudists reorganize as sports groups and are accepted, Germany.\n1934 (1934): Though full-body swimming attire is mandatory, men begin to appear bare-chested on crowded public beaches despite the threat of arrest, Long Island, New York.\n1936 (1936): Male bare-chestedness is legalized, United States.\n1938 (1938): First naturist clubs are established, New Zealand.\n1945 (1945): Gerald Gardner, founder of Wicca, buys Fiveacres Country Club, and establishes the Bricket Wood coven in its grounds.  This marks the beginning of \"Skyclad\" ritual nudity within Wicca., Hertfordshire, England.\n1953 (1953): International Naturist Federation formed at the CHM Montalivet, France.\n1957: Arkansas passes law to make it illegal to \"advocate, demonstrate, or promote nudism.\"  The law applies to both public spaces and private property, United States.\n1958 (1958): Michigan Supreme Court rules that people have a right to practice nudism within private resorts, United States.\n1958 (1958): New Zealand Sunbathing Association established, later renamed the New Zealand Naturist Federation.\n1958 (1958): United States Supreme Court rules in Sunshine Book Co. v. Summerfield that naturist magazines are acceptable under Comstock laws, which define and regulate social morals.\n1964 (1964): Fashion designer Rudi Gernreich produces the topless swimsuit or Monokini, United States.\n1967 (1967): Paul Bindrim conducts the first nude psychotherapy group, California, United States.\n1968 (1968): John Lennon and Yoko Ono release experimental album Two Virgins with a nude cover.\n1968 (1968): Indecent Publications Tribunal finds that publishing nude photos is not unlawful, New Zealand.\n1969 (1969): Three hundred individuals participate in a massive naked \"wade-in\" at a Danish beach. As a result, the vast majority of beaches become clothing optional, Denmark.\n1973 (1973): Beachfront USA is established as a beach nudism organizing and advocacy forum, Los Angeles, California.\n1974 (1974): Streaking becomes popular on college campuses, United States.\n1974 (1974): Robert Opel appears naked in Los Angeles City Council Chamber.\n\n\n== 1975–1989 ==\n\nFebruary 1975 (1975-02): First legal nude beach is created when the section of Maslin Beach south of Adelaide is proclaimed legal for both clothed and naked bathing, Australia.\n1976 (1976) – 1981 (1981): Thousands enjoy the Nambassa festivals while wearing little or no clothing, New Zealand.\n1976 (1976): The Down to Earth Co-operative Society holds the first ConFest with the aim of \"transforming society\", Cotter River, Australian Capital Territory,\nJuly 2, 1976 (1976-07-02): A nude beach picnic and photo shoot is organized during Memorial Day weekend in front of the World Trade Center at \"a temporarily barren, enormous construction sandfill directly on the Hudson River near Wall Street\", New York City.[source: N 19.3]\nAugust 7, 1976 (1976-08-07): The first National Nude Beach Day is designated.[source N 19.3]\n1980 (1980) – 1981 (1981): The Naturist Society is formed, United States.[source N 19.3]\n1981 (1981): Nude & Natural magazine is established by The Naturist Society founder Lee Baxandall (originally titled Clothed with the Sun)., United States.\nJuly 30, 1981 (1981-07-30): Stelarc performance piece, \"Seaside Suspension: Event for Wind & Waves\", shows a body suspended over water at Jōgashima, Miura, Japan.\nJuly 21, 1984 (1984-07-21): Stelarc performance piece, \"Street Suspension\", with a body suspended over the Mo David gallery, New York City.\n1985 (1985): The University of Michigan's Naked Mile is first organized—a run by streakers marking the last day of classes in winter. It is started by a handful of students and eventually grows to a thousand participants annually. The event is cancelled in 2003 after concerted action by police and the University of Michigan administration.[source: Paul Rapoport Dec 2003]\nJune 28, 1985 (1985-06-28): Stelarc performance piece \"City Suspension\", with a body suspended over the city of Copenhagen, Denmark.\n1986 (1986): First year of the clothing-optional Burning Man festival at Baker Beach. Larry Harvey and Jerry James construct a wooden figure and burn it in celebration of the summer solstice. Participants: 20, San Francisco, California.\nJuly 15, 1989 (1989-07-15): Fourteen women go bare-chested outside the Women's Hall of Fame in Seneca Falls to protest the inequality of dress between genders, New York state, United States.[source N 12.2]\n\n\n== 1990–1999 ==\n\n1991 (1991): High Court of New Zealand quashes an \"offensive behaviour\" conviction for sunbathing nude on a public beach in the presence of children on the grounds that, as nudity is \"not uncommon\" on the beach in question, a reasonable person would not be moved to \"anger, disgust, or outrage\" by the behaviour.\n1991 (1991): Gwen Jacob goes topless in Guelph, Ontario, Canada on a hot day. She was eventually acquitted of public indecency in 1996 by the Ontario Court of Appeal on the basis that the act of being topless is not in itself a sexual act or indecent. While this decision was only binding within Ontario, it is considered highly influential, and has been referenced and upheld several times, including in other jurisdictions.\n1992 (1992): Photographer Spencer Tunick starts documenting the live nude figure in public.\nSeptember 1992 (1992-09): First annual Nude & Breast Freedom Parade, Berkeley, California.\n1992 (1992): Peter Cleall addresses the Brighton Solidarity Network while naked.\n1992 (1992) – 1996 (1996): Painted naked cyclists at the Fremont Summer Solstice Parade, Seattle.\nJuly 18, 1992 (1992-07-18): Four go topfree for protest at the Canadian Parliament, Ottawa.[source N 12.2]\nJuly 27, 1992 (1992-07-27): About 20 topfree women protest, Brattleboro, Vermont.[source N 12.2]\nSeptember 1992 (1992-09): Andrew Martinez attends a class—Russian history—without clothes, University of California, Berkeley.[source N 12.2]\nOctober 11, 1992 (1992-10-11): X-plicit Players go nude or topfree from Smokey Joe's Cafe on Shattuck Avenue to Cafe Milano on Telegraph Avenue to support New York topfree victory, Berkeley, California.[source N 12.2]\n1994 (1994) – 2002 (2002): Photographer \"Harvey\" photographs nudes in public urban environments.\n1995 (1995): The Burning Man festival moves to Black Rock Desert with 4,000 participants. The camp becomes the most populous (temporary) settlement in Pershing County and is known as Black Rock City, Nevada, United States.\n1997 (1997): Writer and performance artist David Robert Lewis disrobes in front of the South African National Gallery in a naked art ritual and public nudity event entitled Decontamination.\n1997 (1997): Vincent Bethell starts writing letters to the Home Office and his Member of Parliament questioning the law regarding public nakedness, United Kingdom.\nAugust 24, 1998 (1998-08-24): Evangeline Godron swims bare-chested in the Wascana pool (not for the first time), Regina, Saskatchewan, Canada.[source: TERA]\nApril 1999 (1999-04): Annual \"April Fool's Naked Run\" draws approximately 30 participants, Portland, Oregon.[source: Terri Sue Webb]\nJuly 7, 1999 (1999-07-07): Photographer Henning von Berg organizes the world’s first and only male nude photo shoot inside a parliament building as a social-political statement. The group photo series Naked Berlin—The Liberal Capital features six naked men inside the historical Reichstag building and at nine other famous landmarks in Berlin, Germany.\nJuly 28, 1999 (1999-07-28): First protest by The Freedom to be Yourself at the Royal Courts of Justice, London.\nOctober 1999 (1999-10): Ohio State University female rugby players pose bare-chested for a photo at the Lincoln Memorial and are punished harshly by the University.[source N 19.3]\nOctober 3, 1999 (1999-10-03): Naked anti-nuclear weapons protesters march down Van Ness Avenue, San Francisco.[source N 19.3]\n\n\n== 2000–present ==\n\n2002 (2002): First nude rugby match, which becomes a tradition held each year until 2014, after which it becomes sporadic., Dunedin, New Zealand.\n2003 (2003): National Nude Day is created when Marc Ellis on the New Zealand TV show SportsCafe challenges viewers to streak in front of then Prime Minister Helen Clark. It becomes a semi-regular annual event on the show. Later rebranded \"World Nude Day\" or \"International Nude Day\", the event outlives the end of SportsCafe in 2005 by at least four years.\nJune 12, 2004 (2004-06-12): The World Naked Bike Ride begins.\nFebruary 2005 (2005-02): Henning von Berg photographs a group of naked women in front of major tourist locations, including the Commonwealth Bank, Hyde Park, Queen Victoria's statue, the National Treasure Bank, a leading TV broadcast studio, the iconic Opera House, and the Harbour Bridge, Sydney, Australia.\nJuly 1, 2005 (2005-07-01): The first naked crossing of the European Alps.\n2008 (2008): Political protest group FEMEN is started by Hanna Hutsol, Ukraine.\nJuly 11, 2009 (2009-07-11): American Association for Nude Recreation coordinates a skinny dipping event at 3:00PM throughout North America. The event is recorded by The Guinness Book of World Records as the \"largest number of people simultaneously skinny-dipping\".\nNovember 20, 2012 (2012-11-20): San Francisco bans and criminalizes public nudity without a police-issued parade permit; however, female toplessness is still allowed throughout the city.\n\n\n== Repeating events ==\nHarvard Primal Scream at Harvard University, Cambridge, Massachusetts (once each semester)\nRainbow Family of Living Light's annual Gathering of the Tribes for World Peace and Healing\nSolstice Cyclists, Seattle, June\nWorld Naked Bike Ride\n\n\n== See also ==\n\nBohemianism\nChristian naturism\nSocial nudity in San Francisco\nSocial nudity in Seattle\nCounterculture\nCulture jamming\nDirect action\nFlash mob\nSmart mob\n\n\n== References ==\n\n\n== Further reading ==\nWight, Fred (1953). Manners and Customs of Bible Lands. Chicago: Moody Press. ISBN 9780802451750.\n\n\n== External links ==\nHistoire du naturisme at Nateuropa.org -(In French). Google translation. Accessed December 2006"