"Klaatu () is a fictional humanoid alien in the 1951 science fiction film The Day the Earth Stood Still and its 2008 remake. Klaatu is famous in part because of the phrase \"Klaatu barada nikto!\".\n\n\n== Michael Rennie as Klaatu ==\nKlaatu (Michael Rennie) arrives in a flying saucer in Washington, DC, accompanied by Gort (Lock Martin), as a peaceful ambassador from an extraterrestrial confederation; but when he presents a harmless device as \"a gift for [the American] President... to study life on other planets\", his intentions are misinterpreted by one of the soldiers that form his welcoming committee, who shoots him. To protect Klaatu, Gort destroys the surrounding artillery.\nKlaatu is taken to a hospital, where he quickly recovers. On learning that the government does not expect other nations to be willing to meet him, he takes residence in a boarding house, using the surname \"Carpenter\", the name found on the clothes and suitcase obtained by himself at the hospital, and befriends Bobby Benson (Billy Gray), a boy who stays there with his widowed mother, Helen Benson (Patricia Neal), and visits Professor Barnhardt, a brilliant scientist (played by Sam Jaffe). When Klaatu/Carpenter is brought later to him, Barnhardt agrees to summon scientists from all nations, and asks Klaatu for a show of power, thus exhibiting that the extraterrestrial alliance would threaten Earth if Earth threatens the peace in space. Klaatu, in reply, neutralizes electric power all over the world (with some notable exceptions where lives would be endangered as a result, such as hospitals and airplanes in flight) for 30 minutes. Klaatu's action is taken as an act of war. Betrayed by Mrs. Benson's suitor, he is fatally shot by the U.S. Army; whereupon Mrs. Benson, at his behest, delivers the message \"Klaatu barada nikto!\" barely in time to save her own life. Gort retrieves Klaatu's body, and revives him from death.\nKlaatu gives the assembled scientists the following ultimatum: Earth can either join other spacefaring worlds, wherein peace is ensured by a massive deterrent force of robots similar to Gort, or \"be reduced to a burned-out cinder\". Klaatu then departs.\n\n\n== Keanu Reeves as Klaatu ==\nThe 2008 remake of The Day the Earth Stood Still features Keanu Reeves in the role of Klaatu and Jennifer Connelly as Helen Benson. While the original Klaatu was simply of a near-human species, in the remake it is stated that Klaatu's biology was radically altered to give him a human form from DNA acquired in 1928. He is captured by the military but escapes with help from Helen. He meets with a man named Mr. Wu (actually another alien of Klaatu's race in disguise) to discuss whether humanity should be destroyed. Klaatu orders smaller spheres—previously hidden on Earth—to remove animal species from the planet (cf. Noah's Ark) and activates Gort to destroy humanity. After spending time with Helen and her stepson Jacob, as well as talking with Professor Barnhardt, Klaatu sacrifices his physical form to stop Gort, setting off a massive electromagnetic pulse that permanently disables all electric technology worldwide.  His spaceship/sphere then departs Earth. Reeves' Klaatu shows very little emotion, and explains this because Klaatu \"is an alien entity contained in a human body, and when he is looking out of that body, he is just looking out.\" The filmmakers had \"decided that in the beginning he should just be very different. That involved having no natural human gestures or behavioral signs but appearing more flat and expressionless. He has a concentrated way of seeing the world.\" The original Klaatu knew little of Earth, and  spent most of the film learning; whereas in the later film, another member of Klaatu's race had been sent to Earth decades earlier.\n\n\n== References =="