"In the Chronicles of Narnia franchise created by C. S. Lewis, Narnian Centaurs are creatures with the upper torso of a human and the lower legs and body of a horse, just as they appear in Greek mythology. Unlike most of their counterparts in the Greek myths (which are portrayed as wild, violent, lustful, and intoxicated), Narnian centaurs are always seen in a positive light, more in line with the unique Greek figure Chiron. Throughout the books, they are seen as wise prophets, sages, and loyal courtiers. Typically, they are highly skilled in astronomy and divination, using this ability to read the stars and tell of future events. In addition, they are usually proficient warriors, using their great size and strength to their advantage. Centaurs are viewed as one of the most majestic and powerful creatures in Narnia, and as such, fellow Narnians place a great deal of respect on any member of this species.\nCentaurs appear in five out of seven books in the Chronicles of Narnia series, two out of three of the movie adaptations, and the other assorted television specials and series based on the works of C. S. Lewis.\n\n\n== The Lion, the Witch and the Wardrobe (1950) ==\nFour centaurs are present as members of the army of Aslan. They are described as looking like part English farm horse and part giant, from the perspective of the Pevensie children. Some of them help rescue Edmund from the White Witch, and all four participate in the climactic battle against her. In addition, at least two more appear as stone statues in the White Witch's castle, and they are rescued and restored by Aslan as reinforcements for the main army.In the The Chronicles of Narnia: The Lion, the Witch and the Wardrobe film version, Aslan's army is much larger than the book. Dozens of centaurs, both male and female, participate in the battle against the White Witch. The film introduces Oreius, portrayed by Patrick Kake, who is featured prominently as the field leader of the army until the Pevensies arrive. Like the books, Oreius leads a team to help rescue Edmund from the White Witch, and he later helps Peter organize the troops in the wake of Aslan's temporary death. During the battle, Oreius and a rhino hold off the entire enemy army in order to buy time so that Peter and the others can fall back, with Oreius getting turned into stone by the White Witch after killing her minotaur general. At the Pevensies' coronation, Oreius can be seen in the croud, apparently restored by Aslan offscreen.\n\n\n== Prince Caspian (1951) ==\nDescribed as having a chestnut flank, broad chest, and flowing golden beard, Glenstorm and his three sons are among the first members of the Narnian rebellion to be recruited by Prince Caspian to fight against Miraz and the Telmarines. Due to his abilities as a prophet and astronomer, Glenstorm is already aware of the coming conflict and Caspian's position as the rightful king, so he wholeheartedly pledges his support even as some of the other Narnians remain skeptical due to Caspian's Telmarine ties. Glenstorm sees that the heavenly bodies Tarva and Alambil have met in the sky, signifying that it is time for a Son of Adam to take the throne. At this point, Caspian's followers are disorganized and in no way resemble an army, let alone a victorious one. Most of the Narnians would not even suggest moving towards war, but Glenstorm knows that the time for war is right and therefore moves to organize the campaign accordingly at the council of Dancing Lawn. However, the Telmarine army proves to be very formidable to deal with, and one of Glenstorm's sons is badly injured in one of their skirmishes. Once the Pevensies and the dwarf Trumpkin reunite with Caspian's company, a plan is devised for Peter to challenge Miraz to a duel. Edmund, Glenstorm, and the giant Wimbleweather are commissioned to carry the message to Miraz, as Trufflehunter the badger states, \"No one ever laughed at a Centaur.\"  Later, Peter chooses Glenstorm, Wimbleweather, and one of the Bulgy Bears to be his marshals in his duel with Miraz. Following the death of Miraz, Glenstorm participates in the climactic battle, and he is present at the ceremony where Aslan returns the Pevensies to the mortal world.Glenstorm plays a similar role in the film version, portrayed by Cornell S. John. Glenstorm and his three sons (Rainstone, Ironhoof, and Suncloud) are some of the first to join Caspian, and Glenstorm's vocal support is what solidifies the Narnian rebellion around Caspian as their leader. Many other centaurs are present at Aslan's How in addition to Glenstorm's family. The fighting against Miraz is expanded into a secret castle siege in the film, where Miraz manages to trap a significant portion of the army behind the iron gate and drawbridge. Rainstone is trapped as well, but he urges his father and the other lucky Narnians to escape while he and the trapped creatures are mowed down and killed by crossbow fire. Glenstorm once again acts as a marshal for Peter, and he and his remaining sons play a significant part in the final battle, and all three appear at the final ceremony.\n\n\n== The Voyage of the Dawn Treader (1952) ==\nCentaurs do not appear in any capacity in the book or the The Chronicles of Narnia: The Voyage of the Dawn Treader film adaptation, as the story takes place at sea and far away from Narnia.\n\n\n== The Silver Chair (1953) ==\nFollowing their harrowing adventure, in The Silver Chair, the faun Orruns tells Eustace that a centaur named Cloudbirth, a famous healer, is coming to tend to Puddleglum's burnt foot.\nTwo unnamed centaurs offer to take Eustace and Jill Pole back across Narnia to where they started their journey.  They allow Eustace and Jill to ride them, which is a tremendous honor that had never been done and would never be replicated in the entirety of Narnian history. Despite this great honor, putting on a saddle was still completely out of the question, so so Jill and Eustace have to uncomfortably ride bareback. As the four talk, the children learn that centaurs possess both a human and horse digestive system, so they require double the sustenance— large meals (particularly breakfast) and long hours of grazing on grass. On their journey through Narnia, they teach the Eustace and Jill about herbs and roots, planets, the nine names of Aslan with their meanings, and other philosophical and scientific discussions.\n\n\n== The Horse and His Boy (1954) ==\nIn The Horse and His Boy, when Shasta discovers that he is Prince Cor of Archenland, he relates to his friends Aravis, Bree, and Hwin the new details that he discovered regarding his birth and subsequent kidnapping as a baby. After he and his brother Corin were born, they were taken to wise and old centaur in Narnia, whose a great prophet. The centaur predicted that a day would come when Cor would save Archenland from the deadliest danger in which ever she lay. In order to prevent this prophecy from coming true, one of the King's courtiers had kidnapped the baby Cor and taken him to Calormen, inadvertently setting up the very circumstances required for the prophecy to be fulfilled. In the preceding battle, other unnamed centaurs are present in the Narnian army.\n\n\n== The Magician's Nephew (1955) ==\nCentaurs do not appear in any capacity in the The Magician's Nephew. They are not included in the account of the Creation of Narnia by Aslan, so it is unknown at what point they came into existence. No doubt Aslan had something to do with their creation, as they are all fiercely loyal to him for the rest of the series without exception.\n\n\n== The Last Battle (1956) ==\nDescribed as having a golden beard and a deep voice, Roonwit is one of the last remaining loyal subjects to King Tirian and the Narnian throne in The Last Battle. Like other centaurs, Roonwit is a star-gazer and prophet. While the rest of Narnia is celebrating the apparent return of Aslan, Roonwit tells Tirian and the unicorn Jewel that Aslan has not in fact returned, and something very sinister is happening based on the terrible signs in the sky. Alarmed, Tirian listens to the centaur's advise and sends Roonwit to gather anyone that they can trust. With Calormene forces closing in, Tirian and Jewel escape into hiding, where Eustace and Jill join them from the human world. While they travel and try to enlist the aid of the dwarves and the donkey Puzzle, the eagle Farsight finds them and informs them that castle Cair Paravel has been taken by Calormen, and Roonwit has been slain by an enemy archer. Farsight delivers Roonwit's final message, telling Tirian that all world's draw to an end and that a noble death is a most precious treasure. Following the final battle with the Calormenes and being forced through the stable door, the company observe the destruction of Narnia by Aslan, which involved every remaining creature quickly choosing whether to go through the archway or away into darkness. Roonwit is one of these who goes through the door with other noble living things, and he sprints far ahead of the others to go \"further in and higher up\" to Aslan's Country. In this perfect place, heroes from throughout the entire series can be scene, including Glenstorm from the events of Prince Caspian.\n\n\n== References =="