"Selsoviet (Belarusian: сельсавет,  tr. sieĺsaviet;  Russian: сельсовет, tr. selsovet, IPA: [ˈsʲelʲsɐˈvʲɛt]; Ukrainian: сільрада, silrada) is a shortened name for a rural council and for the area governed by such a council (soviet). The full names for the term are, in Belarusian: се́льскi саве́т, Russian: се́льский сове́т, Ukrainian: сільська́ ра́да. Selsoviets were the lowest level of administrative division in rural areas in the Soviet Union. After the dissolution of the Soviet Union, they were preserved as a third tier of administrative-territorial division throughout Ukraine, Belarus, and some of the federal subjects of Russia.\nA selsoviet is a rural administrative division of a district that includes one or several smaller rural localities and is in a subordination to its respective raion administration.\nThe name refers to the local rural self-administration, the rural soviet (council), a part of the Soviet system of administration. A selsoviet was headed by a chairman, who had to be appointed by higher administration.\nFor a considerable period of Soviet history, passports of rural residents were stored in selsoviet offices, and people could not move outside their area of residence without the permission of selsoviet.\n\n\n== Selsoviets in Russia ==\nDivision into selsoviets as administrative-territorial units remained after the dissolution of the Soviet Union in many of the federal subjects of Russia.\nIn modern Russia, a selsoviet is a type of an administrative division of a district in a federal subject of Russia, which is equal in status to a town of district significance or an urban-type settlement of district significance, but is organized around a rural locality (as opposed to a town or an urban-type settlement). In some federal subjects, selsoviets were replaced with municipal rural settlements, which, in turn, were granted status of administrative-territorial units.\nPrior to the adoption of the 1993 Constitution of Russia, this type of administrative division had a uniform definition on the whole territory of the Russian SFSR. After the adoption of the 1993 Constitution, the administrative-territorial structure of the federal subjects is no longer identified as the responsibility of the federal government or as the joint responsibility of the federal government and the federal subjects. This state of the matters is traditionally interpreted by the governments of the federal subjects as a sign that the matters of the administrative-territorial divisions are the sole responsibility of the federal subjects themselves. As a result, the modern administrative-territorial structures of the federal subjects vary significantly from one federal subject to another; that includes the manner in which the selsoviets are organized and the choice of a term to refer to such entities.\nAs of 2013, the following types of such entities are recognized:\n\nInhabited locality (населённый пункт): in Krasnoyarsk Krai (together with selsoviets)\nRural administration (сельская администрация): in the Republic of Kalmykia and in Tula Oblast (together with rural okrugs, rural territories, and volosts)\nRural administrative okrug (сельский административный округ): in Bryansk Oblast\nRural okrug (сельский округ): in the Mari El Republic, the Republic of North Ossetia–Alania, and the Sakha Republic; in Krasnodar Krai (together with stanitsa okrugs); in Belgorod, Kaliningrad, Kirov, Omsk, Ryazan, Tula (together with rural administrations, rural territories, and volosts), Tyumen, Ulyanovsk, and Yaroslavl Oblasts\nRural settlement (сельское поселение): in the Altai and the Chuvash Republics; in Amur, Moscow, Rostov, Smolensk, Tver, and Voronezh Oblasts\nRural territory (сельская территория): in Kemerovo Oblast and Tula Oblast (together with rural administrations, rural okrugs, and volosts)\nRural-type settlement administrative territory (административная территория – посёлок сельского типа): in the Komi Republic (together with selo administrative territories)\nSelo administrative territory (административная территория – село): in the Komi Republic (together with rural-type settlement administrative territories)\nSelsoviet (сельсовет): in the Republics of Bashkortostan, Buryatia (together with somons), Dagestan, Khakassia (together with settlement councils), Mordovia, and the Udmurt Republic; in Altai (together with settlement administrations), Krasnoyarsk (together with inhabited localities), and Stavropol Krais; in Arkhangelsk, Astrakhan, Chelyabinsk, Kurgan, Kursk, Lipetsk, Nizhny Novgorod, Orenburg (together with settlement councils), Oryol, Penza, Tambov, Volgograd, and Vologda Oblasts; in Nenets Autonomous Okrug (together with settlements)\nSettlement (поселение): in Kostroma and Novgorod Oblasts\nSettlement (посёлок): in Nenets Autonomous Okrug (together with selsoviets)\nSettlement administration (поселковая администрация): in Altai Krai (together with selsoviets)\nSettlement council (поссовет): in the Republic of Khakassia (together with selsoviets) and in Orenburg Oblast (together with selsoviets)\nSettlement municipal formation (муниципальное образование со статусом поселения): in Leningrad Oblast\nSomon (сомон): in the Republic of Buryatia (together with selsoviets)\nSumon (сумон): in the Tyva Republic\nStanitsa okrug (станичный округ): in Krasnodar Krai (together with rural okrugs)\nTerritorial okrug (территориальный округ): in Murmansk Oblast\nVolost (волость): in Pskov Oblast and Tula Oblast (together with rural administrations, rural okrugs, and rural territories)\n\n\n== See also ==\nRural council (in other countries)\n\n\n== References =="