"Mars, Incorporated is an American multinational manufacturer of confectionery, pet food, and other food products and a provider of animal care services, with US$33 billion in annual sales in 2015. It was ranked as the 6th largest privately held company in the United States by Forbes. Headquartered in McLean, Virginia, United States, the company is entirely owned by the Mars family. Mars operates in five business segments around the world: Mars Wrigley Confectionery (headquartered in Chicago, Illinois, with US headquarters in Hackettstown and Newark, New Jersey), Petcare (Zaventem, Belgium; Poncitlán and Jalisco, Mexico; Querétaro, Mexico), Food (Rancho Dominguez, California), Drinks (West Chester, Pennsylvania), and Symbioscience (Germantown, Maryland), the company's life sciences division.\n\n\n== History ==\n\nMars is a company known for the confectionery items that it creates, such as Mars bars, Milky Way bars, M&M's, Skittles, Snickers, and Twix.  They also produce non-confectionery snacks, such as Combos, and other foods, including Uncle Ben's Rice, and pasta sauce brand Dolmio, as well as pet foods, such as Pedigree, Whiskas, Nutro and Royal Canin brands.Orbit gum is among the most popular brands, managed by the Mars subsidiary brand Wrigley. During World War II, Wrigley was selling their eponymous gum only to soldiers, while Orbit was sold to the public. Though abandoned shortly after the war, about 30 years later Orbit made a comeback in America during the chewing gum craze.Franklin Clarence Mars, whose mother taught him to hand dip candy, sold candy by age 19. He started the Mars Candy Factory in 1911 with Ethel V. Mars, his second wife, in Tacoma, Washington. This factory produced and sold fresh candy wholesale, but ultimately the venture failed because there was a better established business, Brown & Haley, also operating in Tacoma. By 1920, Mars had returned to his home state, Minnesota, where the earliest incarnation of the present day Mars company was founded that year as Mar-O-Bar Co., in Minneapolis and later incorporated there as Mars, Incorporated.Forrest Mars, Sr., son of Frank and his first wife, Veronica, was inspired by a popular type of milkshake in 1923, to introduce the Milky Way bar, advertised as a \"chocolate malted milk in a candy bar\", which became the best-selling candy bar. In 1929, Frank moved the company to Bakersfield, California and started full production in a plant which still exists today. In 1930, Frank Mars created the Snickers bar and first sold it in US markets. In 1932, Mars introduced the 3 Musketeers bar. The same year, Forrest started Mars Limited in the United Kingdom and launched the Mars bar.\nMars moved its headquarters to McLean, Virginia, in 1984. It is still a family business owned by the Mars family. The company is famous for its secrecy. A 1993 Washington Post Magazine article was a rare raising of the veil, as the reporter was able to see the \"M\"s being applied to the M&M's, something that \"no out-sider had ever before been invited to observe\". In 1999, for example, the company did not acknowledge that Forrest Mars, Sr. had died or that he had worked for the company.Mars' purchase of Doane Petcare Company in June 2007 significantly increased Mars' position in the U.S. dry pet food category. In addition to these businesses, Mars also operates a chain of premium chocolate shops called Ethel M Chocolates.  These shops are an outgrowth of the Ethel M premium chocolate business that Forrest Mars started in Las Vegas in 1980, when he became bored with retirement.In 2008 Mars and theBelGroup has conducted research study which resulted in resurrecting the famous Mars slogan “Work, Rest & Play”.\nPackaged and led global launch of Mars Refuel Sports drink. Initiated and implemented sponsorship programme “The Mars Refuel Drink Fund”. On April 28, 2008, Mars, Incorporated, together with Berkshire Hathaway Incorporated, announced the buyout of Wm. Wrigley Jr. Company, the world's largest chewing gum producer, for $23 billion in an all-cash deal.  The two companies together generate sales in excess of $30 billion.The company published its Principles in Action communication in September 2011. This communication outlines the history of Mars, its legacy as a business committed to its Five Principles, and the company's goal of putting its Principles into action to make a difference to people and the planet through performance. Encompassing themes of Health and Nutrition, Supply Chain, Operations, Products, and Working at Mars, the Principles in Action communication outlines Mars Incorporated's targets, progress, and ongoing challenges. It also describes its businesses, including Petcare, Chocolate, Wrigley, Food, Drinks, Symbioscience.The company spent more than $1.8 million on lobbying during 2008, almost all of it at Patton Boggs, where it has long been one of the largest lobbying clients. Mars also spent $10,000 at Skadden, Arps, Slate, Meagher & Flom. In 2009, Mars also hired Ernst & Young to lobby on corporate and international tax issues, including issues related to tax changes proposed by the Obama administration. The company spent another $1,655,000 that year.In 2014, Mars opened a new $270 million chocolate plant in Topeka, Kansas, the first new plant in the US in 35 years.In 2016, Mars announced the merger of its chocolate and Wrigley segments to form a new subsidiary, appropriately called Mars Wrigley Confectionery.In 2017, the company's confectionery segment announced a return to its roots, and opened a new office in Newark, New Jersey.In May 2020, Mars filed a lawsuit against JAB Holding over claims that Jacek Szarzynski, a former JAB Holding executive stole various confidential documents and passed them to the owner of Pret A Manger and Panera Bread. According to the lawsuit, over 6,000 Mars internal documents, including detailed financial results, strategic planning documents, and potential acquisition targets, were illegally downloaded.In the United States, the company has 22 manufacturing facilities in Hackettstown, New Jersey; Albany, Georgia; Burr Ridge, Illinois; Minneapolis, Minnesota; Chicago, Illinois; and Mattoon, Illinois; Cleveland, Tennessee; Chattanooga, Tennessee; Columbia, South Carolina; Columbus, Ohio; Elizabethtown, Pennsylvania; Greenville, Mississippi; Greenville and Waco, Texas; Henderson and Reno, Nevada; Fort Smith, Arkansas; Joplin, Missouri; Kansas City, Missouri; Miami, Oklahoma; and Galena, Kansas. Their newest facility is situated in Topeka, Kansas. Their Canadian facilities are located in Bolton and Newmarket, Ontario.\n\n\n== Mars Food UK Limited ==\nMars Food UK Limited is the name of the United Kingdom branch of Mars, Inc. The company is based in Slough, England. Mars brands manufactured for the United Kingdom market but not for the United States include Tunes.In 1932, Forrest Mars, Sr., opened what was then Mars (Europe) headquarters, and remains Mars (UK) headquarters in Slough, Berkshire on the then-new Slough Trading Estate, after a disagreement with his father, Franklin Clarence Mars. In this factory, he produced the first Mars bar, based on the American Milky Way.Many brands first created and sold in the United Kingdom were later introduced in the United States, including Starburst (original UK brand name Opal Fruits) and Skittles. The brands Twix and Topic were UK based.Milky Way in Europe and worldwide is known as the 3 Musketeers in America. Similarly, the Snickers bar was previously marketed in Ireland and the United Kingdom as Marathon until 1990; in the UK, France, Germany and the Netherlands, also until 1990; Galaxy in the Middle East is known as Dove in America and worldwide; and Starburst was known in the UK and Ireland as Opal Fruits until 1998. Chocolate and peanut M&M's were introduced in 1990.In November 2020, Mars acquired full ownership of snack food company Kind North America for $5 billion.\n\n\n=== Mars Drinks UK ===\nMars Drinks UK, the beverages division of Mars Limited, operates from Basingstoke in Hampshire and specializes in office vending machines. Mars Drinks UK comprises the FLAVIA and KLIX brands which offer branded drinks such as the Starburst Orange Drink, the Maltesers Hot Chocolate and the Galaxy drinks.Mars Drinks also produces coffee and the equipment used to make it. In 1982 FLAVIA was created out of the high demand for coffee in the United Kingdom. Initially marketed as Dimension 3 until 1989, FLAVIA was introduced in France and Germany in 1986 and Japan in 1992 then brought to the United States in 1996 and to Canada in 1997. Other products such as cappuccino were introduced in 2002 and tea in 2004.In 2018, the Drinks division was sold to Lavazza.\n\n\n== Mars Petcare ==\nForrest Mars started the pet food industry in Europe, and his Mars Candy Company bought Kal Kan. Forrest Mars changed the name of Kal Kan dog food to Pedigree, and Kal Kan cat food to Whiskas. As of 1991, Mars controlled 60 percent of the pet food market, both in volume and value. Whiskas was the number one brand. As of 1994, Mars was the leading pet food company worldwide with $4 billion in sales.In February 2003, Mars acquired Aquarium Pharmaceuticals, Inc. (API, incorporated in 1964) and in 2007 it was renamed Mars Fishcare, Inc. The company manufactures and supplies home aquarium and pond products. Mars Fishcare brands include: Aquarium Pharmaceuticals (API), RENA, AQUARIAN, and PondCare.The company introduced a genetic test for dogs using cheek swabs to identify breed breakdown, trait tests and health risks in 2007 known as Wisdom Panel. In 2018, Mars Petcare acquired Genoscoper Laboratories, a Finnish animal molecular diagnostics company, \"to form the basis for future practical applications in enabling precision healthcare for pets\" under its genetic testing unit, Wisdom Health. Wisdom Panel DNA testing expanded to include cats in mid 2021.In Australia, the division operates three sites that are located in Wodonga, Victoria (established in 1967 for manufacture of wet pet food); Bathurst, New South Wales (established in the 1980s for manufacture of dry pet food); and Brisbane, Queensland (for manufacture of birdcare products).Mars Petcare manufactures the 'Trill\" birdseed range.\n\n\n=== Mars Veterinary Health ===\nIn 2007, Mars, Incorporated purchased a significant stake in the Banfield Pet Hospital chain.In October 2015, BluePearl Veterinary Partners was acquired by Mars Petcare division. This acquisition resulted in Mars Petcare becoming the largest pet nutrition and veterinary care provider in the world.In January 2017, Mars Veterinary Health North America announced the US$7.7 billion acquisition of Los Angeles-based animal hospital chain VCA Inc.In June 2018, Mars Veterinary Health International and Diagnostics acquired the Linnaeus Group consolidating its position as a leading veterinary provider in the United Kingdom.\n\n\n== Factories ==\nIn 1963, a large factory was opened in Veghel in the Netherlands. This factory has currently the biggest production volume of Mars factories and is one of the biggest chocolate factories in the world. Most confectionery products for Europe were produced in Slough and Veghel. The two factories in Slough were located on Liverpool Road and Dundee Road; the one on Liverpool Road closed in 2007, with Twix production moving to the Netherlands and Starburst production moving to the Czech Republic.The major production plant for Mars confectionery products in Australia is in Ballarat, Victoria.There is one factory outside of Hershey, Pennsylvania. It is located in Elizabethtown, Pennsylvania.\nThe factory in Chicago, Illinois, has its own commuter rail station, simply named Mars.\n\n\n== Consumer relations ==\n\n\n=== Opposition to labeling of genetically engineered ingredients in California ===\nThroughout 2012, Mars contributed $376,650 to a $46 million political campaign known as \"The Coalition Against The Costly Food Labeling Proposition, sponsored by Farmers and Food Producers\". This organization was set up to oppose \"Proposition 37\", demanding mandatory labeling of foods containing genetically modified ingredients.\n\n\n=== Removal of artificial ingredients to food portfolio ===\nIn February 2016, Mars stated that it would no longer be using artificial colors in each of its candy products. The company announced that more than 50 of its products would be affected in commitment effort to align with the changing preferences of consumers. The company along with more than 12 others has recently pledged to remove artificial colors from its products. While it has been said that the use of artificial colors in candy, and other products do not pose a threat to human health outright, the preference of natural ingredients by consumers has grown substantially.\nThe company was not the first to recently announce that it would be changing the use of artificial flavors in its products. In 2015, food giant, General Mills proposed an initiative that noted that all of the artificial ingredients it was using in its products would be dropped by 2017. This meant a reformulation of many of the cereals, with alternatives that were more suitable to the palates of humans. A key aspect in that proposed initiative was that the cereal, Trix, would no longer have the blue and green colors forming a new iteration of the cereal.There have been two different arguments presented about the use of artificial colors in foods. Many studies have shown that their use in food could be linked to illnesses such as ADHD and cancer. There has seemed to be an issue with the use of red 40, yellow 3, yellow 5 and yellow 6 and how they bind to the DNA in humans. Other additives such as Blue 2 have been linked to the cause of brain tumors in rodents and, in 1981, Green 3 was found to be a direct link to bladder cancer. Given the fact that the company will be replacing the artificial dyes in its products, the company has also said that consumers should prepare themselves for the transition process in terms of special packaging and colors being used as to indicate that the changes have taken place. It has been said that the company is not likely to stop using coloring entirely, but that the use of artificial coloring will be going away.\nInstead Mars will use natural colors like turmeric in India.\n\n\n== Criticism ==\n\n\n=== Animal vs vegetable ingredients ===\nFrom May 1, 2007, many Mars products made in the UK became unsuitable for vegetarians. The company announced that it would be using whey made with animal rennet (material from a calf's stomach lining, and a byproduct of veal), instead of using rennet made by microorganisms, in products including Mars, Twix, Snickers, Maltesers, Bounty, Minstrels and Milky Way. The response from many consumers, particularly the Vegetarian Society's request for UK vegetarians to register their protests with Mars, generated extensive press and caused the company to abandon the plans shortly thereafter. Mars switched to all-vegetarian sources in the UK.\n\n\n=== Unethical treatment of animals ===\nIn 2007, Mars came under criticism from People for the Ethical Treatment of Animals (PETA) for funding laboratory experiments on mice, rats, guinea pigs and rabbits, which the group alleges are inhumane and in violation of the company's own policies prohibiting experiments on animals.One study was conducted in collaboration with the Salk Institute regarding angiogenesis and spatial memory, in which mice were given an ad-lib diet that included epicatechin, plant-derived flavonoid. One of the experiments involved groups of control and experimental animals, the latter of which were housed individually in cages that included a running wheel for optional exercise for two hours a day. The former, also housed individually, did not have access to a running wheel. Another experiment was the classical spatial memory assay, the Morris water maze, in which experimenters had mice swim in water mixed with white paint that concealed the water depth. The study, which Mars contends was legally required in order for the company to make flavonoid-related health claims, showed that the inclusion of epicatechin in the diet improved memory and angiogenesis, more so if coupled with exercise.\n\n\n=== Child labor and slave labor ===\nMars has been criticized for buying cocoa beans from West African farmers who reportedly use unpaid or poorly paid child laborers. In 2009, Mars announced that the company would work towards only purchasing cocoa from suppliers who meet environmental, labor, and production standards. TransFair USA, an organization which certifies products as Fair Trade, applauded the move and expressed hope that it would include a provision for fair wages for laborers and farmers. In 2010, Mars Inc. received the U.S. Secretary of State's Award for Corporate Excellence. In April 2010, Mars launched the MyCocoaPaper initiative, which claims to provide economic opportunities to women and families in Indonesia by making paper products out of cocoa bark and recycled office paper.In 2011, Mars and Fairtrade International announced an agreement to introduce the first Fairtrade labeled Mars product and to work together to enable farmers to have sustainable livelihoods and substantially increased productivity. The first Mars product to carry the Fairtrade mark was Maltesers, which appeared in stores in 2012 in the UK and Ireland.In 2019, Mars announced that they couldn't guarantee that their chocolate products were free from child slave labor, as they could trace only 24% of their purchasing back to the farm level. The Washington Post noted that the commitment taken in 2001 to eradicate such practices within 4 years had not been kept, neither at the due deadline of 2005, nor within the revised deadlines of 2008 and  2010, and that the result was not likely to be achieved for 2020 either.In 2021, Mars was named in a class action lawsuit filed by eight former child slaves from Mali who alleged that the company aided and abetted their enslavement on cocoa plantations in Ivory Coast. The suit accused Mars (along with Nestlé, Cargill, Barry Callebaut, Olam International, The Hershey Company, and Mondelez International) of knowingly engaging in forced labor, and the plaintiffs sought damages for unjust enrichment, negligent supervision, and intentional infliction of emotional distress.\n\n\n=== Deforestation in African national parks ===\nIn September 2017, an investigation conducted by NGO Mighty Earth found that a large amount of the cocoa used in chocolate produced by Mars and other major chocolate companies was grown illegally in national parks and other protected areas in Ivory Coast and Ghana. The countries are the world's two largest cocoa producers.The report documents show, in several national parks and other protected areas, 90% or more of the land mass has been converted to cocoa. Less than four percent of Ivory Coast remains densely forested, and the chocolate companies' laissez-faire approach to sourcing has driven extensive deforestation in Ghana as well. In Ivory Coast, deforestation has pushed chimpanzees into just a few small pockets, and reduced the country's elephant population from several hundred thousand to about 200–400.\n\n\n== Products ==\nMany Mars products are household, famous-name brands. Some of these product lines are manufactured by Mars; others are manufactured by The Wrigley Company.\n\n\n=== Original food products ===\n\n\n==== Confectionery products manufactured by The Wrigley Company ====\n\n\n=== Products for pet consumption ===\n\n\n=== Discontinued product linesAquaDrops ===\nBisc &\nCookies &\nPacers\nPB Max\nRoyals\nSpangles\nSummit Cookie Bars\nBanjo Candy Bar\nBliss Candy Bar\n\n\n== Veterinary services ==\nMars Veterinary Health North America \n\nBanfield Pet Hospital – 1,054 sites\nVCA Animal Hospitals – 917 sites\nPet Partners – 86 sites\nBluePearl Veterinary Partners – 61 sitesMars Veterinary Health International\n\nAniCura – 280 sites\nAntech Diagnostics / Sound\nAsia Veterinary Diagnostics\nLinnaeus Veterinary Group – 148 sites\nMount Pleasant Veterinary Group\nVeterinary Emergency & Specialty (VES) Hospital Singapore\nVSH Hong Kong\n\n\n== Awards and honors ==\nThe company was named by Fortune magazine as one of the top 100 companies to work for in 2013, citing the example that employees of the pet food division can take their dogs to work.The company has made donations to Elizabethtown College, which includes a room sponsored by them and a weekly executive lecture series.\n\n\n== See also ==\n\nBig Chocolate\nList of food companies\n\n\n== References ==\n\n\n== Further reading ==\nStephen Beckett, Industrial Chocolate Manufacture and Use, Fourth Edition, Wiley-Blackwell, 2008 ISBN 978-1-4051-3949-6.\n\n\n== External links ==\nOfficial website \nMars, Incorporated companies grouped at OpenCorporates\nSymbioscience\nMasterfoods (archived)\nCocoa Sustainability Initiative (archived)"