"Jesus (Greek: Ἰησοῦς, romanized: Iēsoûs, likely from Hebrew/Aramaic: יֵשׁוּעַ‎, romanized: Yēšûaʿ), c. 4 BC –  AD 30 / 33, also referred to as Jesus of Nazareth or Jesus Christ, was a first-century Jewish preacher and religious leader. He is the central figure of Christianity, the world's largest religion. Most Christians believe he is the incarnation of God the Son and the awaited messiah (the Christ), prophesied in the Old Testament.Virtually all modern scholars of antiquity agree that Jesus existed historically, although the quest for the historical Jesus has yielded some uncertainty on the historical reliability of the Gospels and on how closely the Jesus portrayed in the Bible reflects the historical Jesus, as the only records of Jesus' life are contained in the Gospels. Jesus was a Galilean Jew, who was baptized by John the Baptist and began his own ministry. His teachings were initially conserved by oral transmission and he himself was often referred to as \"rabbi\". Jesus debated with fellow Jews on how to best follow God, engaged in healings, taught in parables and gathered followers. Tradition holds that he was arrested and tried by the Jewish authorities, turned over to the Roman government, and crucified on the order of Pontius Pilate, the Roman prefect. After his death, his followers believed he rose from the dead, and the community they formed eventually became the early Church.Christian doctrines include the beliefs that Jesus was conceived by the Holy Spirit, was born of a virgin named Mary, performed miracles, founded the Christian Church, died by crucifixion as a sacrifice to achieve atonement for sin, rose from the dead, and ascended into Heaven, from where he will return. Commonly, Christians believe Jesus enables people to be reconciled to God. The Nicene Creed asserts that Jesus will judge the living and the dead either before or after their bodily resurrection, an event tied to the Second Coming of Jesus in Christian eschatology. The great majority of Christians worship Jesus as the incarnation of God the Son, the second of three persons of the Trinity. A small minority of Christian denominations reject Trinitarianism, wholly or partly, as non-scriptural. The birth of Jesus is celebrated annually on December 25 as Christmas. His crucifixion is honored on Good Friday and his resurrection on Easter Sunday. The widely used calendar era \"AD\", from the Latin anno Domini (\"year of the Lord\"), and the equivalent alternative \"CE\", are based on the approximate birthdate of Jesus.Jesus is also revered outside of Christianity in religions such as Islam, Manicheanism and Baha'i. Manicheanism was the first organised religion outside of Christianity to venerate Jesus, viewing him as an important prophet. In Islam, Jesus (often referred to by his Quranic name ʿĪsā) is considered one of God's important prophets and the messiah. Muslims believe Jesus was born of a virgin, but was neither God nor a son of God. The Quran states that Jesus never claimed divinity. Most Muslims do not believe that he was killed or crucified, but that God raised him into Heaven while he was still alive. In contrast, Judaism rejects the belief that Jesus was the awaited messiah, arguing that he did not fulfill messianic prophecies, and was neither divine nor resurrected."