"Sri Lankan Tamils (Tamil: இலங்கை தமிழர், ilankai tamiḻar ?,Tamil: ஈழத் தமிழர், īḻat tamiḻar ?), also known as Ceylon Tamils or Eelam Tamils, are members of the Tamil ethnic group native to the South Asian island state of Sri Lanka. Today, they constitute a majority in the Northern Province, live in significant numbers in the Eastern Province and are in the minority throughout the rest of the country. 70% of Sri Lankan Tamils in Sri Lanka live in the Northern and Eastern provinces.\nModern Sri Lankan Tamils descend from residents of the Jaffna Kingdom, a former kingdom in the north of Sri Lanka and Vannimai chieftaincies from the east. According to the anthropological and archaeological evidence, Sri Lankan Tamils have a very long history in Sri Lanka and have lived on the island since at least around the 2nd century BCE.\nThe Sri Lankan Tamils are mostly Hindus with a significant Christian population. Sri Lankan Tamil literature on topics including religion and the sciences flourished during the medieval period in the court of the Jaffna Kingdom. Since the beginning of the Sri Lankan Civil War in the 1980s, it is distinguished by an emphasis on themes relating to the conflict. Sri Lankan Tamil dialects are noted for their archaism and retention of words not in everyday use in Tamil Nadu, India.\nSince Sri Lanka gained independence from Britain in 1948, relations between the majority Sinhalese and minority Tamil communities have been strained. Rising ethnic and political tensions following the Sinhala Only Act, along with ethnic pogroms carried out by Sinhalese mobs in 1956, 1958, 1977, 1981 and 1983, led to the formation and strengthening of militant groups advocating independence for Tamils. The ensuing civil war resulted in the deaths of more than 100,000 people and the forced disappearance and rape of thousands of others. The civil war ended in 2009 but there are continuing allegations of atrocities being committed by the Sri Lankan Military. A United Nations panel found that as many as 40,000 Tamil civilians may have been killed in the final months of the civil war. In January 2020, President Gotabaya Rajapaksa said that the estimated 20,000+ disappeared Sri Lankan Tamils were dead. The end of the civil war has not fully improved conditions in Sri Lanka, with press freedom not being restored and the judiciary coming under political control.One-third of Sri Lankan Tamils now live outside Sri Lanka. While there was significant migration during the British colonial period, the civil war led to more than 800,000 Tamils leaving Sri Lanka, and many have left the country for destinations such as Canada, United Kingdom, Germany and India as refugees or emigrants. The persecution and discrimination that Sri Lankan Tamils faced has resulted in some Tamils today not identifying themselves as Sri Lankans but instead identifying themselves as Eelam Tamils or simply Tamils. Many still support the idea of Tamil Eelam, a proposed independent state that Sri Lankan Tamils aspired to create in the North-East of Sri Lanka. Inspired by the Tamil Eelam flag, the tiger also used by the LTTE, has become a symbol of Tamil nationalism for Tamils in Sri Lanka and the Sri Lankan Tamil diaspora."