"The tangelo ( TAN-jə-loh,  tan-JEL-oh; C. reticulata × C. maxima or × C. paradisi; sometimes referred to as honeybells), Citrus × tangelo,  is a citrus fruit hybrid of a Citrus reticulata variety, such as a mandarin orange or tangerine, and a Citrus maxima variety, such as a pomelo or grapefruit.  The name is a portmanteau of 'tangerine' and 'pomelo'. \nTangelos are the size of an adult fist, have a tart and tangy taste, and are juicy at the expense of flesh. They generally have loose skin and are easier to peel than oranges, readily distinguished from them by a characteristic \"nipple\" at the stem. Tangelos can be used as a substitute for mandarin oranges or sweet oranges.\n\n\n== Varieties ==\n\n\n=== Orlando ===\nThe early maturing Orlando tangelo is noted for its rich juiciness, mild and sweet flavor, large size, distinct zesty smell, and flat-round shape without a characteristic knob. California/Arizona tangelos have a slightly pebbled texture, vibrant interior and exterior color, very few seeds, and a tight-fitting rind. Orlando tangelos are available from mid-November to the beginning of February. The tangelo originated as a cross between a Duncan grapefruit and a Dancy mandarin.  Walter Tennyson Swingle of the United States Department of Agriculture (USDA) is credited with creating the hybrid in 1911. When the Orlando tangelo was first cultivated, it was known by the name Lake tangelo. The trees of this variety grow to a large size and are easily recognized by their cup-shape leaves. Orlando tangelos are recognized as one of the more cold-tolerant varieties. Northern Florida grows significantly fewer tangelos, but they are much sweeter due to climate.\n\n\n=== Minneola ===\nThe Minneola tangelo (also known as the Honeybell) is a cross between a Duncan grapefruit and a Dancy mandarin, and was released in 1931 by the USDA Horticultural Research Station in Orlando.  It is named after Minneola, Florida.  Most Minneola tangelos are characterized by a stem-end neck, which tends to make the fruit appear bell-shaped. Because of this, it is also called the Honeybell in the gift fruit trade, where it is one of the most popular varieties. Both Minneolas and Honeybells are usually fairly large, typically 3–3+1⁄2 inches (76–89 mm) in diameter; the Honeybells tend to be larger and sweeter. The peel color, when mature, is a bright-reddish-orange color. The rind of the Minneola is relatively thin, while the rind of the Honeybell is slightly thicker. Both the Minneola and Honeybell Tangelo peel rather easily. Both are very juicy. Both the Minneola and the Honeybell are not strongly self-fruitful, and yields will be greater when interplanted with suitable pollenizers such as Temple tangor, Sunburst tangerine, or possibly Fallglo tangerine. It tends to bear a good crop every other year. In the Northern Hemisphere the fruit matures in the December–February period, with January being the peak.\n\n\n=== Jamaican tangelo ===\n\nThe Jamaican tangelo, marketed under proprietary names ugli fruit and uniq fruit, is a spontaneous hybrid discovered about 1920 on the island of Jamaica, with a rough, wrinkled, greenish-yellow rind. Its exact parentage has not been determined, but it is thought to be a tangerine/grapefruit hybrid.\n\n\n=== K-Early (Sunrise) ===\nA hybrid propagated by Walter Tennyson Swingle and Herbert John Webber, the K-Early is an early-ripening cultivar which gained a bad reputation at first but has been increasing in popularity in recent years. It is sometimes called 'Sunrise', a name also used for a different and older cultivar.\n\n\n=== Seminole ===\nThe seminole is a hybrid between a 'Bowen' grapefruit and a 'Dancy' tangerine. It is deep red-orange in color and oblate in shape with a thin and firm peel, and is not necked. It has 11-13 juicy segments and a pleasant, subacid flavor. It has 20-25 small seeds. The tree is high-yielding and scab-resistant.\n\n\n=== Thornton ===\nA tangerine-grapefruit hybrid developed by Walter Tennyson Swingle in 1899, the Thornton is oblate to obovate in shape, slightly rough, and medium to large in size. The peel is light orange in color and is of a medium thickness; the pulp inside is pale to deep orange. It has 10-12 juicy segments and a rich subacid to sweet flavor. There are 10-25 slender seeds inside. It ripens from December to March. The tree is high-yielding and is well-adapted to hot and dry regions, although the fruit ships poorly.\n\n\n=== Novel varieties ===\nIn 2011, a troop of baboons were attracted to the higher sweetness of a new likely mutation in a Minneola planting in Cape Town, South Africa, prompting its propagation.\n\n\n== Drug interactions ==\nOne study thus far has shown that, unlike grapefruit, interactions with statins are not likely with tangelos. Although the tangelo is derived from a grapefruit crossed with a mandarin, the furocoumarins in grapefruit are not expressed in tangelos.\n\n\n== Notes ==\n\n\n== References =="