"X Reality (XR or Cross Reality)\nis defined as: a form of “mixed reality environment that comes from the fusion (union) of ... ubiquitous sensor/actuator networks and shared  online virtual worlds....”.\nIt encompasses a wide spectrum of hardware and software, including sensory interfaces, applications, and infrastructures, that enable content creation for virtual reality (VR), mixed reality (MR), cinematic reality (CR). With these tools, users generate new forms of reality by bringing digital objects into the physical world and bringing physical world objects into the digital world.\nIts meaning has more recently been broadened to include technologies of extended (\"cyborg\" or wearable) intelligence in regards to the IEEE Council on Extended Intelligence (CXI).\n\"XR\" is a far-reaching, inclusive, and flexible term. The \"X\" represents a variable that defines a continuum that can also be expanded and extended in a multivariate sense (e.g. \"XYR\" = XY Reality).XR technologies have applications in almost every industry, such as: architecture, automotive industry, sports training, real estate, mental health, medicine, health care, retail, space travel, design, engineering, interior design, television and film, media, advertising, marketing, libraries, education, news, music, and travel.\n\n\n== Background ==\nDrawing from media studies and philosophy, the concept of XR is related to a variety of theories about virtuality, computer vision, machine learning, and the increasingly collaborative relationship between human and machine. Our growing ability to see like digital devices results in a world that blurs the digital and the biological.\nXR can be viewed as a manifestation of \"The New Aesthetic\", the term coined by James Bridle that references \"the increasing appearance of the visual language of digital technology and the Internet in the physical world, and the blending of virtual and physical\".Closely related to Gilles Deleuze's concept of virtuality, XR positions \"virtual\" as not opposed to \"real\". Within the framework of XR, virtuality is not the opposite of reality and digital is not the opposite of biological. Rather, XR envisions a more complex relationship in which virtuality actualizes real effects to the extent that our perception of virtual objects becomes fully real. This explains why virtual reality can treat phobias.\n\n\n== History of the XR, X-Reality, and Cross-Reality terminology ==\nThe terms \"X-Reality\" and \"XR\" have a long history from the 1960s (Wyckoff), the 1990s (Mann and Wyckoff for computerized eyeglass-based mediated reality), and the 2000s (Coleman, Paradisio and Landay who also introduced the term \"Cross Reality\"), and the term \"XR\" has appeared in multiple trademark registrations submitted to the US Patent & Trademark office by the Sony Corporation beginning as early as 1988 (though Sony does not hold a trademark for the standalone, two letter term \"XR\").Headsets that enable VR and MR experiences, such as the Windows 10 MR devices, have been referred to as \"XR devices\". In May 2016, Pixvana referred to XR as an umbrella term for virtual, mixed, and augmented reality. An arts program called SIFFX at the Seattle International Festival used \"X\" to describe the \"radical unknown\" of VR, AR and 360 content in June 2016. SIXR, a Seattle-based collective of artists, refers to XR in their mission in order to encourage creators to work across the AR/MR/VR/360 spectrum.In February 2017 at GDC, Unity announced they are developing an XR Foundation Toolkit for AR/VR creators. Also that month, The Khronos Group formed a working group of key industry leaders from Oculus, Valve, Unity, Epic, Samsung, and Google to form the OpenXR initiative: \"a cross-platform VR standard eliminates industry fragmentation by enabling applications to be written once to run on any VR system, and to access VR devices integrated into those VR systems to be used by applications\". The working group has named the initiative OpenXR in order to include standards for VR and AR applications and devices. A podcast interview with Valve's Joe Ludwig on Voices of VR cites XR as \"one of the most significant collaborations across the entire VR industry\". The \"Women in XR\" initiative was announced at VRLA April 2017. In May 2017, an article defining XR written by S. Somasegar and Linda Lian appeared in TechCrunch.The term 'XR' was liberally used by VR pioneers, Upload, in their blog announcement to the XR industry on March 16, 2018, advising that they were closing their San Francisco and Los Angeles facilities to focus on their education and media services \"to the XR community\".\" Commentary on the terms 'XR' and 'cross reality' were further defined, in the VR Focus article by Editor-in-Chief Kevin Joyce which states: \"A new emerging trend is to define any content using these emerging technologies as ‘XR’. However, XR is also used to define ‘cross reality’, which is any hardware that combines aspects of AR, MR and VR; such as Google Tango.\" \n\n\n== References =="