"Ingrid Bergman (29 August 1915 – 29 August 1982) was a Swedish actress who starred in a variety of European and American films, television movies, and plays. With a career spanning five decades, she is often regarded as one of the most influential screen figures in cinematic history. She won numerous accolades, including three Academy Awards, two Primetime Emmy Awards, a Tony Award, four Golden Globe Awards, and a BAFTA Award.\nBorn in Stockholm to a Swedish father and a German mother, Bergman began her acting career in Swedish and German films. Her introduction to the American audience came in the English-language remake of Intermezzo (1939). Known for her naturally luminous beauty, she starred in Casablanca (1942) as Ilsa Lund, her most famous role, opposite Humphrey Bogart's Rick Blaine.  \nBergman's notable performances from the 1940s include the dramas For Whom the Bell Tolls (1943) with Gary Cooper, Gaslight (1944), The Bells of St. Mary's (1945), and Joan of Arc (1948), all of which earned her nominations for the Academy Award for Best Actress; she won the award for Gaslight. She made three films with Alfred Hitchcock: Spellbound (1945), with Gregory Peck, Notorious (1946), opposite Cary Grant and Under Capricorn (1949), alongside Joseph Cotten.\nIn 1950, she starred in Roberto Rossellini's Stromboli, following the revelation that she was having an extramarital affair with the director. The affair and subsequent marriage to Rossellini created a scandal in the United States that forced her to remain in Europe for several years, during which she starred in Rossellini's Europa '51 and Journey to Italy (1954), now critically acclaimed. She made a successful return to working for a Hollywood studio in the drama Anastasia (1956), winning her second Academy Award for Best Actress. \nIn her later years, Bergman won her third Academy Award, this one for Best Supporting Actress, for her small role in Murder on the Orient Express (1974). In 1978, she worked with director Ingmar Bergman in the Swedish-language Autumn Sonata, for which she received her sixth Academy Award nomination for Best Actress. In her final acting role, she portrayed the late Israeli Prime Minister Golda Meir in the television miniseries A Woman Called Golda (1982) for which she posthumously won her second Emmy Award for Best Actress. Bergman died of breast cancer on her sixty-seventh birthday (29 August 1982).\nAccording to the St. James Encyclopedia of Popular Culture, Bergman quickly became \"the ideal of American womanhood\" and a contender for Hollywood's greatest leading actress. In the United States, she is considered to have brought a \"Nordic freshness and vitality\" to the screen, along with exceptional beauty and intelligence; David O. Selznick once called her \"the most completely conscientious actress\" he had ever worked with. In 1999, the American Film Institute recognised Bergman as the fourth greatest female screen legend of Classic Hollywood Cinema."