"The American Revolutionary War (April 19, 1775 – September 3, 1783), also known as the Revolutionary War or the American War of Independence, was initiated by delegates from thirteen American colonies of British America in Congress against Great Britain over their objection to Parliament's taxation policies and lack of colonial representation. From their founding in the 1600s, the colonies were largely left to govern themselves. The cost of victory in the 1754 to 1763 French and Indian War and the 1756 to 1763 Seven Years' War left the British government deeply in debt; the colonies, where the war was fought, equipped and populated the British forces there at the cost of millions of their own funds. The Stamp Act and Townshend Acts provoked colonial opposition and unrest, leading to the 1770 Boston Massacre and 1773 Boston Tea Party. When Parliament imposed the Intolerable Acts in spring 1774 upon Massachusetts, twelve colonies sent delegates to the First Continental Congress (September 5 – October 26, 1774) to draft a Petition to the King and organize a boycott of British goods.Fighting broke out on 19 April 1775: the British army stationed at Boston was harassed by the Massachusetts militia at Lexington and Concord after destroying colonial Assembly powder stores. In June, the Second Continental Congress appointed George Washington to create a Continental Army and oversee the capture of Boston (April 19, 1775 – March 17, 1776). The Patriots sent the Olive Branch Petition (signed July 8, 1775) to the King and Parliament, both of whom rejected it. In response, they invaded British Quebec but were repulsed. In July 1776, Congress unanimously passed the Declaration of Independence. Hopes of a quick settlement were supported by American sympathizers within Parliament who opposed Lord North's \"coercion policy\" in the colonies. However, after the British were driven out of Boston the new British commander-in-chief, General Sir William Howe, launched a counter-offensive and captured New York City. After crossing the Delaware Washington engaged and routed Hessian forces at the Battle of Trenton and the British at the Battle of Princeton. After British General Burgoyne surrendered at the Battles of Saratoga in October 1777, Howe's 1777–1778 Philadelphia campaign captured that city. Washington retreated to Valley Forge during the winter of 1777–1778 where Prussian allied General von Steuben drilled the largely untrained Continental Army into an organized fighting unit.French Foreign Minister Vergennes saw the war as a way to create an America economically and militarily dependent on France, not Britain. Although talks on a formal alliance began in late 1776, they proceeded slowly until the Patriot victory at Saratoga in October 1777. Fears Congress might come to an early settlement with Britain resulted in France and the United States signing two treaties in February 1778. The first was a commercial treaty, the second a Treaty of Alliance; in return for a French guarantee of American independence, Congress agreed to join the war against Britain and defend the French West Indies. Although Spain refused to join the Franco-American alliance, in the 1779 Treaty of Aranjuez they agreed to support France in its global war with Britain, hoping to regain losses incurred in 1713.In other fronts in North America, Governor of Spanish Louisiana Bernardo Gálvez routed British forces from Louisiana. The Spanish, along with American privateers supplied the 1779 American conquest of Western Quebec (later the US Northwest Territory). Gálvez then expelled British forces from Mobile during the Battle of Fort Charlotte and the siege of Pensacola, cutting off British military aid to their American Indian allies in the interior southeast. Howe's replacement, General Sir Henry Clinton, then mounted a 1778 \"Southern strategy\" from Charleston. After capturing Savannah, defeats at the Battle of Kings Mountain and the Battle of Cowpens forced Cornwallis to retreat to Yorktown, where his army was besieged by an allied French and American force. An attempt to resupply the garrison was repulsed by the French navy at the Battle of the Chesapeake, and Cornwallis surrendered in October 1781.\nAlthough their war with France and Spain continued for another two years, the British fight against the Americans ended with the Battle of Yorktown. The North Ministry was replaced by Lord Rockingham, who accepted office on the basis George III agreed to American independence. Preliminary articles were signed in November 1782, and in April 1783 Congress accepted British terms; these included independence, evacuation of British troops, cession of territory up to the Mississippi River and navigation to the sea, as well as fishing rights in Newfoundland. On September 3, 1783, the Treaty of Paris was signed between Great Britain and the United States, then ratified the following spring."