"Fear the Walking Dead is an American post-apocalyptic horror drama television series created by Robert Kirkman and Dave Erickson for AMC. It is a spin-off to The Walking Dead, which is based on the comic book series of the same name by Kirkman, Tony Moore, and Charlie Adlard. The first three seasons serve as a prequel, focusing on a blended family who experience the start of the zombie apocalypse. Subsequent seasons run concurrently to the original show, with Morgan Jones (Lennie James) from The Walking Dead crossing over into the series.\n\nThe series premiered on August 23, 2015, and has completed its sixth season, which concluded on June 13, 2021. A seventh season has been announced, which is set to premiere on October 17, 2021. Andrew Chambliss and Ian Goldberg serve as the showrunners since the fourth season, succeeding Erickson from the first three.\n\n\n== Premise ==\nSet in Los Angeles, California and later in Mexico, the first three seasons of Fear the Walking Dead follow a dysfunctional, blended family composed of high school counselor Madison Clark, her English teacher fiancé Travis Manawa, her daughter Alicia, her drug addict son Nick, Travis' son from a previous marriage, Chris, Chris' mother Liza Ortiz, and others who join their group at the onset of the zombie apocalypse. They must reinvent themselves, learning new skills and adopting new attitudes in order to survive as civilization collapses around them.Beginning in the fourth season, the series shifts focus towards Morgan Jones, a character from the original series, who encounters the group's surviving members and new survivors in Texas.\n\n\n== Cast and characters ==\n\n\n=== Main ===\nKim Dickens as Madison Clark: An intelligent and domineering guidance counselor, the mother of Nick and Alicia, and Travis' fiancée. (seasons 1–4)\nCliff Curtis as Travis Manawa: A resolute and peacekeeping high school teacher, Madison's fiancé, Chris' father, and Liza's ex-husband. (seasons 1–3)\nFrank Dillane as Nicholas \"Nick\" Clark: A brave and selfless recovering heroin addict, Madison's son, and Alicia's brother. (seasons 1–4)\nAlycia Debnam-Carey as Alicia Clark: The fiery yet compassionate daughter of Madison, and Nick's sister.\nElizabeth Rodriguez as Elizabeth \"Liza\" Ortiz: A no-nonsense and caring nursing student, Travis' ex-wife, and Chris' mother. (season 1; guest season 2)\nMercedes Mason as Ofelia Salazar: The strong-willed and very capable daughter of Daniel and his wife Griselda. (seasons 1–3)\nLorenzo James Henrie as Christopher \"Chris\" Manawa: Travis and Liza's rebellious teenage son, who becomes more brutal due to the landscape of the deadly new world. (seasons 1–2)\nRubén Blades as Daniel Salazar: A courageous and practical former Sombra Negra member, a barber, Griselda's husband, and Ofelia's father. (seasons 1–3; 5–present)\nColman Domingo as Victor Strand: A smart and sophisticated conman-turned-businessman, who forms friendships with Nick and Madison. (season 2–present; guest season 1)\nMichelle Ang as Alex: A pragmatic and quiet survivor introduced in the Fear the Walking Dead: Flight 462 web series. (season 2)\nDanay García as Luciana Galvez: A strong and cautious former member of the La Colonia community in Tijuana, Mexico, and Nick's girlfriend. (season 3–present; recurring season 2)\nDaniel Sharman as Troy Otto: The charismatic and impulsive son of Jeremiah, and Jake's half-brother. (season 3)\nSam Underwood as Jeremiah \"Jake\" Otto Jr.: Jeremiah's moralistic and wiser son, Troy's half-brother, and Alicia's love interest. (season 3)\nDayton Callie as Jeremiah Otto Sr.: The racist and candid leader of Broke Jaw Ranch, and Jake and Troy's father. (season 3; guest season 2)\nLisandra Tena as Lola Guerrero: The generous and empathetic leader of a community stationed at a dam located in Tijuana, who is responsible for supplying water. (season 3)\nMaggie Grace as Althea \"Al\" Szewczyk-Przygocki: A curious and tactical journalist who encounters Morgan and John. (season 4–present)\nGarret Dillahunt as John Dorie: A lonesome and friendly police officer whom Morgan encounters. (seasons 4–6)\nLennie James as Morgan Jones: A mentally unstable and ruthlessly pragmatic man, formerly a part of Rick Grimes' group on The Walking Dead, who encounters the core group of survivors. (season 4–present)\nJenna Elfman as June \"Naomi/Laura\" Dorie: A kind and mysterious nurse whom Madison encounters. (season 4–present)\nAlexa Nisenson as Charlie: A young girl who is a spy for the Vultures until she defected to Morgan's group. (season 5–present; recurring season 4)\nKaren David as Grace Mukherjee: A mysterious woman who used to work at a nuclear power plant that melted down near the site where the plane of Morgan's group crashed. (season 5–present)\nAustin Amelio as Dwight: A ruthless and reluctant former lieutenant of the Saviors, who was exiled from Virginia by Rick Grimes' group on The Walking Dead. (season 5–present)\nMo Collins as Sarah Rabinowitz: The adoptive sister of Wendell and a former Marine. (season 6–present; recurring seasons 4–5)\nColby Hollman as Wes: A survivor who allies with Morgan's group. (season 6–present; recurring season 5)\nZoe Colletti as Dakota: A member of the Pioneers who is Virginia's daughter. (season 6)\nChristine Evangelista as Sherry: Dwight's long-missing ex-wife who fled across the country to Texas after escaping the Saviors. (season 6–present)\nKeith Carradine as John Dorie Sr.: John's father who was also a police officer before the apocalypse. (season 6–present)\n\n\n=== Recurring ===\n\n\n==== Los Angeles ====\nPatricia Reyes Spíndola as Griselda Salazar: Ofelia's mother, who emigrated from El Salvador with her husband Daniel to escape political unrest. (season 1; guest season 2)\nShawn Hatosy as Cpl. Andrew Adams: A well-intentioned military man with a soulful disposition, who is out of his element. (season 1)\nSandrine Holt as Dr. Bethany Exner: A confident and skilled doctor. (season 1)\n\n\n==== Pacific Coast ====\nDaniel Zovatto as Jack Kipling: A member of the pirates who develops an attraction to Alicia. (season 2)\nArturo Del Puerto as Luis Flores: An ally and right-hand man of Victor Strand and Thomas Abigail. (season 2)\n\n\n==== Mexico ====\nDougray Scott as Thomas Abigail: Strand's boyfriend and the namesake of the boat Abigail. (season 2)\nMarlene Forte as Celia Flores: Luis's mother. (season 2)\nPaul Calderón as Alejandro Nuñez: A pharmacist and leader of La Colonia, a community in Tijuana, Mexico, he claims to have been bitten, but did not die. (season 2)\nAlejandro Edda as Marco Rodriguez: The leader of the gang who live near La Colonia. (season 2)\nKaren Bethzabe as Elena Reyes: The Rosario Beach hotel manager who helps Alicia. (season 2; guest season 3)\nRamses Jimenez as Hector Reyes: Elena's nephew who used to manage the hotel with her. (season 2; guest season 3)\nAndres Londono as Oscar Diaz: The leader of a group of survivors living at a hotel. (season 2)\nRaul Casso as Andrés Diaz: Oscar's brother. (season 2)\nBrenda Strong as Ilene Stowe: A member of the wedding party and mother-in-law of Oscar. (season 2; guest season 3)\nKelly Blatz as Brandon Luke: The leader of a group of young men that befriend Chris. (season 2)\nKenny Wormald as Derek: A member of Brandon's group. (season 2)\n\n\n==== The Ranch ====\nMichael Greyeyes as Qaletaqa Walker: A Native American in a war with Jeremiah Otto, who occupies his lands. (season 3)\nMichael William Freeman as Blake Sarno: A member of Broke Jaw Ranch's militia. (season 3)\nJustin Rain as Lee \"Crazy Dog\": The right-hand man of Qaletaqa. (season 3)\nMatt Lasky as Cooper: A member of Broke Jaw Ranch's militia. (season 3)\n\n\n==== The Dam and The Proctors ====\nJesse Borrego as Efrain Morales: A man who saves Daniel's life when he was injured by a fire. (season 3)\nRay McKinnon as Proctor John: The leader of the gang known as the Proctors. (season 3)\n\n\n==== Baseball Stadium ====\nSebastian Sozzi as Cole: A resident of the community within the baseball stadium. (season 4; guest season 6)\nRhoda Griffis as Vivian: A resident of the community within the baseball stadium. (season 4; guest season 6)\nKenneth Wayne Bradley as Douglas: A resident of the community within the baseball stadium. (season 4; guest season 6)\n\n\n==== The Vultures ====\nKevin Zegers as Melvin: An antagonistic leader of the Vultures. (season 4)\nEvan Gamble as Ennis: A member of the Vultures. (season 4)\n\n\n==== Texas/Mississippi ====\nAaron Stanford as Jim Brauer: A survivor who brews for a living. (season 4)\nDaryl Mitchell as Wendell: The adoptive brother of Sarah who uses a wheelchair. (season 4–present)\nTonya Pinkins as Martha: A mysterious antagonistic woman who kills every survivor that tries to help someone else. (season 4)\nPeggy Schott as Tess: A woman who lived with her son and husband and had never left home until her husband died. (season 5)\nPeter Jacobson as Jacob Kessner: A rabbi who joins Morgan's group. (season 5–present)\n\n\n==== C&L Freight Services/Tank Town ====\nMatt Frewer as Logan: The former partner of Clayton (aka \"Polar Bear\") who tricks Morgan's group and seizes the denim factory for himself. (season 5)\nMikala Gibson as Doris: Logan's right-hand woman. (season 5)\nCory Hart as Rollie: A loyal member of Logan's group. (seasons 5–6)\nBeau Smith as Dom: A former member of Clayton's group who is a resident and oil producer of Tank Town. (season 5)\n\n\n==== Camp Cackleberry ====\nCooper Dodson as Dylan: Annie and Max's younger brother. (season 5)\nEthan Suess as Max: A teenage survivor and brother to Annie and Dylan. (season 5)\nBailey Gavulic as Annie: A teenage survivor and sister to Dylan and Max. (season 5)\n\n\n==== Civic Republic Military ====\nSydney Lemmon as Isabelle: A helicopter pilot who serves for a mysterious organization known as the Civic Republic Military. She also fell in love with Althea. (season 5–present)\n\n\n==== The Pioneers ====\nColby Minifie as Virginia: An antagonistic leader of the Pioneers who is the mother of Dakota. (seasons 5–6)\nHolly Curran as Janis: A woman who called Alicia and Strand for help and was saved by Wes. She later joined Morgan's group. She is Tom's sister. (season 5; guest season 6)\nCraig Nigh as Hill: A high-ranking member of the Pioneers. (season 6)\nJustin Smith as Marcus: An arrogant member of the Pioneers. (season 6)\n\n\n==== The Doomsday Cult ====\nJohn Glover as Theodore \"Teddy\" Maddox: The cult's leader who was arrested by John Dorie Sr. in the 1970s. (season 6)\nNick Stahl as Riley: Teddy's right-hand man. (season 6)\n\n\n== Episodes ==\n\nThe first season consists of six episodes. The second season, comprising 15 episodes, premiered on April 10, 2016. On April 15, 2016, AMC announced the series had been renewed for a 16-episode third season, which premiered on June 4, 2017. In April 2017, AMC renewed the series for a 16-episode fourth season and announced that Andrew Chambliss and Ian Goldberg would replace the departing Dave Erickson as showrunners. The fourth season premiered on April 15, 2018. On July 28, 2018, the series was renewed for a fifth season, which premiered on June 2, 2019. On July 19, 2019, the series was renewed for a sixth season, which premiered on October 11, 2020. On December 3, 2020, the series was renewed for a seventh season, which is set to premiere on October 17, 2021.\n\n\n== Production ==\n\n\n=== Development ===\nIn September 2013, AMC announced they were developing a companion series to The Walking Dead, which follows a different set of characters created by Robert Kirkman. In September 2014, AMC ordered a pilot, which was written by Kirkman and Dave Erickson, and directed by Adam Davidson, and is executive produced by Kirkman, Erickson, Gale Anne Hurd, and David Alpert, with Erickson serving as showrunner. The project was originally known as Cobalt; Kirkman confirmed, in March 2015, that the series would be titled Fear the Walking Dead. On March 9, 2015, AMC announced it had ordered Fear the Walking Dead to series, with a two-season commitment. The series premiered on August 23, 2015.\n\n\n=== Casting ===\n\nIn December 2014, the first four starring roles were cast: Kim Dickens as Madison Clark, the female lead; Cliff Curtis as Travis Manawa, the male lead; Frank Dillane as Nick; and Alycia Debnam-Carey as Alicia. In April and May 2015, Elizabeth Rodriguez and Mercedes Mason were announced as series regulars, both in unknown roles.In November 2017, it was confirmed that Lennie James who portrays Morgan Jones on The Walking Dead would crossover and join the main cast in the fourth season. The fourth season also sees the additions of several new series regulars, played by Garret Dillahunt, Jenna Elfman, and Maggie Grace.In December 2018, it was reported that Rubén Blades, who last appeared in the series' third season, would return in the fifth season as Daniel Salazar. In January 2019, it was reported that Austin Amelio would join the cast as Dwight, who last appeared in the eighth season of The Walking Dead. On March 5, 2019, it was announced that Karen David had joined the main cast for the fifth season as Grace. In December 2019, it was announced that Zoe Colletti would join the main cast for the sixth season as Dakota, and that Mo Collins and Colby Hollman were promoted to series regulars.\n\n\n=== Music ===\nPaul Haslinger composed the score for the series in its first three seasons. After Dave Erickson left at the end of the third season of the series, the show underwent major changes with the fourth season taking on a semi-reboot approach. Haslinger was replaced by Danny Bensi and Saunder Jurriaans beginning with the fourth season. The original title card composed by Atticus Ross was also replaced.\n\n\n=== Filming ===\nProduction of the pilot episode began in early 2015 and ended on February 6, 2015. The pilot and early episodes were filmed in Los Angeles, including Woodrow Wilson High School; the remaining first-season episodes were filmed in Vancouver, British Columbia, Canada. Production on the remaining five first-season episodes began on May 11, 2015. Adam Davidson, who directed the pilot, also directed the series' second and third episodes.Filming for the second season began in December 2015, with production moving to Baja California, Mexico. Locations included Rosarito (sea scenes and hotel) and Valle de Guadalupe (Abigail's vineyard). The sea scenes were filmed using a horizon tank at Baja Film Studios. An additional scene from the season one finale was filmed in The Sunken City, San Pedro, Los Angeles. Filming for the third season began on January 6, 2017, in Baja California, Mexico, with some of the same location sites used for the second half of season two. Additional locations in Tijuana Municipality included Avenida Revolución, Abelardo L. Rodríguez Dam and the hills that hosted the Otto's ranch.Filming for the fourth season began in early 2018 in various locations around Austin, Texas, including the Dell Diamond baseball stadium in nearby Round Rock, the vacant Brackenridge Hospital in downtown Austin, and the flood-damaged Onion Creek neighborhood. Filming for the fifth season began in December 2018. It was also confirmed by the showrunners that the season would be filmed in New Braunfels, Texas.In March 2020, production for the sixth season was reported to have gone on a three-week hiatus due to the COVID-19 pandemic.\n\n\n== Broadcast ==\nOn August 23, 2015, the series debuted simultaneously worldwide on: AMC in the U.S.; AMC Global in major regional markets in Africa, Asia, Europe, Latin America, and the Middle East; and FX in Australia. Hulu holds the show's video on demand rights in the U.S., while Amazon Instant Video owns the streaming rights in Austria and Germany, and will make episodes available online one day after their original airing. Streaming in the United Kingdom became available to Amazon Prime members in 2016.\n\n\n== Reception ==\n\n\n=== Critical response ===\n\n\n==== Season 1 ====\nOn Rotten Tomatoes, the first season has a rating of 76%, based on 63 reviews, whose average rating is 6.75/10. The site's critical consensus reads, \"Fear the Walking Dead recycles elements of its predecessor, but it's still moody and engrossing enough to compete with the original.\" On Metacritic, the season has a score of 66 out of 100, based on 33 critics, indicating \"generally favorable reviews\".Elisabeth Vincentelli of the New York Post rated the first two episodes three out of four stars, stating that \"[They] are creepily suspenseful–they're great examples of how effective a slow pace and a moody atmosphere can be.\" Another positive review of the first episode came from Ken Tucker of Yahoo TV, who wrote, \"Fear the Walking Dead is a mood piece, more artful than the original series\" and that the cast is \"terrific\". Tim Goodman of The Hollywood Reporter gave an average review, writing, \"The 90-minute first episode and the hour-long second episode are, while not actually boring, certainly less magnetic than the original.\"One of the harshest negative reviews came from HitFix, on Daniel Fienberg and Alan Sepinwall's podcast, where Fienberg called the premiere episode \"awful, just horrible ... as bad as The Walking Dead has ever gotten at its very worst. This is that bad. I've been kind of stunned to see people being generous to it. ... I thought this was almost unwatchably bad.\" Sepinwall called his B− review \"slightly generous\".\n\n\n==== Season 2 ====\nThe second season received mostly mixed reviews from critics. On Rotten Tomatoes, the season has a rating of 70%, based on 30 reviews, whose average rating is 6.60/10. The site's critical consensus reads, \"Fear the Walking Dead sets sail in its sophomore season with an intriguing backdrop that doesn't always disguise its deficiencies in comparison to its predecessor.\" On Metacritic, the season has a score of 54 out of 100, based on 12 critics, indicating \"mixed or average reviews\".\n\n\n==== Season 3 ====\nOn Rotten Tomatoes, the third season has an approval rating of 84% based on 6 reviews, with an average rating of 7.25/10. The site's critical consensus reads, \"A distinctive ensemble brings a compelling flavor of Fear the Walking Dead mythos, but this ambitious spinoff still shares its originator's penchant longwinded pacing that may diminish the tension for some viewers.\" In his season review for IGN, Matt Fowler gave it an 8.2 out of 10 and wrote, \"Fear the Walking Dead more solidly found its tone and voice this season by embracing the arid landscape, ramping up the human-on-human conflict, and rallying around Kim Dickens' anti-hero mom, Madison, as the driving character\" and that it is now \"a better series overall than The Walking Dead\".\n\n\n==== Season 4 ====\nOn Rotten Tomatoes, the fourth season has an approval rating of 80% based on 6 reviews, with an average rating of 6.85/10. The site's critical consensus reads, \"Fear the Walking Dead shuffles onward confidently in its fourth season with a bevy of horrifying set-pieces and heartbreaking twists, but some viewers may be dispirited by the series' constant reshuffling of its characters.\" TVLine reevaluated the series for its fourth season, giving it a grade of a \"B+\". Reviewer Charlie Mason wrote, \"it's gone from being an adequate stopgap between seasons of The Walking Dead to a show that's as good or arguably even better than the one from which it was spun off.\" He also praised the addition of Jenna Elfman and Garret Dillahunt and that season 4 has had several genuine surprises in its storytelling.\n\n\n==== Season 5 ====\nThe fifth season received mostly mixed reviews from critics. On Rotten Tomatoes, the season has a rating of 55% based on 9 reviews, with an average rating of 5.10/10. The site's critical consensus reads, \"Despite delivering some memorable and splatter-filled zombie set-pieces that fans crave, Fear the Walking Dead feels stiff with early-onset rigor mortis in a fifth season that emphasizes altruism over coherent characterization.\"\n\n\n==== Season 6 ====\nOn Rotten Tomatoes, the sixth season has an approval rating of 89% based on 9 reviews, with an average rating of 7.30/10.\n\n\n=== Ratings ===\nThe U.S. series premiere attracted 10.1 million total viewers, with 6.3 million in the advertiser-coveted 18-to-49-year-old demographic, both cable television records for a series premiere. Numerous international debuts of the pilot also set ratings records. The first season averaged 11.2 million viewers in \"live plus-3\" ratings (includes VOD and DVR viewing within three days after initial telecast) to become the highest-rated first season of any series in cable history.\n\n\n=== Awards and nominations ===\n\n\n== Web series ==\n\n\n=== Fear the Walking Dead: Flight 462 ===\n\nFear the Walking Dead: Flight 462, a 16-part web series, premiered on October 4, 2015, on AMC.com; it also aired as promos during The Walking Dead season 6. Two of the web series' characters, Alex (previously known as Charlie) and Jake, are introduced in Fear the Walking Dead season 2, episode 3 (\"Ouroboros\").\n\n\n=== Fear the Walking Dead: Passage ===\nA second 16-part web series debuted on October 17, 2016, and episodes were made available online weekly and aired as promos during the seventh season of The Walking Dead. The web series follows Sierra, a capable survivor, who helps an injured woman named Gabi as they try to find sanctuary. The series was written by Lauren Signorino and Mike Zunic, and directed by Andrew Bernstein.\n\n\n=== The Althea Tapes ===\nA six-part web series was released from July 27 to August 8, 2019, on AMC.com and YouTube. The web series features Althea interviewing different survivors for their story.\n\n\n== Home media ==\nThe first season was released on Blu-ray and DVD on December 1, 2015. A special edition version of the first season was released on Blu-ray and DVD on March 22, 2016, with new bonus features, including deleted scenes, seven featurettes, and audio commentaries by cast and crew, on all six episodes. The second season, featuring audio commentaries, deleted scenes, and various behind-the-scene featurettes, was released on Blu-ray and DVD on December 13, 2016. The third season, featuring audio commentaries and deleted scenes, was released on Blu-ray and DVD on March 13, 2018. The fourth season, featuring four audio commentaries, was released on Blu-ray and DVD on March 5, 2019.\n\n\n== Lawsuit ==\nIn July 2018, Mel Smith, the creator of the comic book series Dead Ahead, filed a lawsuit against AMC Studios charging that the second season of Fear the Walking Dead stole thematic elements from Dead Ahead, specifically a group of survivors attempting to flee a zombie apocalypse by a boat. The lawsuit also includes David Alpert, who was Smith's agent and who remains a business partner with Robert Kirkman, and who is one of Fear's executive producers; Smith's lawsuit asserts that Alpert violated his fiduciary duty to protect Smith's interests when he began working on Fear. AMC attempted to have the lawsuit dismissed, stating that once one stripped out generic elements of the zombie genre, there were no further similarities between the works. In February 2019, judge Lucy Koh rejected this, believing that it would be necessary to have a discovery phase and expert testimony to evaluate AMC's stance.In March 2019, AMC settled the lawsuit, details remained confidential.\n\n\n== References ==\n\n\n== External links ==\n\nOfficial website\nFear the Walking Dead at IMDb"