"An ethnic bioweapon (or a biogenetic weapon) is a type of theoretical bioweapon which could only target or primarily target people of specific ethnicities or people with specific genotypes.\n\n\n== History ==\nOne of the first modern fictional discussions of ethnic weapons is in Robert A. Heinlein's 1942 novel Sixth Column (republished as The Day After Tomorrow), in which a race-specific radiation weapon is used against a so-called \"Pan-Asian\" invader.\n\n\n=== Genetic weapons ===\nIn 1997, U.S. Secretary of Defense William Cohen referred to the concept of an ethnic bioweapon as a possible risk. In 1998 some biological weapon experts considered such a \"genetic weapon\" plausible, and believed the former Soviet Union had undertaken some research on the influence of various substances on human genes.In its 2000 policy paper Rebuilding America's Defenses, think-tank Project for the New American Century (PNAC) described ethnic bioweapons as a \"politically useful tool\" that US adversaries could have incentive to develop and utilize.The possibility of a \"genetic bomb\" is presented in Vincent Sarich's and Frank Miele's book, Race: The Reality of Human Differences, published in 2004. These authors view such weapons as technically feasible but not very likely to be used. (page 248 of paperback edition.)\nIn 2004, The Guardian reported that the British Medical Association (BMA) considered bioweapons designed to target certain ethnic groups as a possibility, and highlighted problems that advances in science for such things as \"treatment to Alzheimer's and other debilitating diseases could also be used for malign purposes\".In 2005, the official view of the International Committee of the Red Cross was \"The potential to target a particular ethnic group with a biological agent is probably not far off. These scenarios are not the product of the ICRC's imagination but have either occurred or been identified by countless independent and governmental experts.\"In 2008, the US government held a congressional committee, ‘Genetics and other human modification technologies: sensible international regulation or a new kind of arms race?’, during which it was discussed how “we can anticipate a world where rogue (and even not-so-rogue) states and non-state actors attempt to manipulate human genetics in ways that will horrify us”.In 2012, The Atlantic wrote that a specific virus that targets individuals with a specific DNA sequence is within possibility in the near future. The magazine put forward a hypothetical scenario of a virus which caused mild flu to the general population but deadly symptoms to the President of the United States. They cite advances in personalized gene therapy as evidence.In 2016, Foreign Policy magazine suggested the possibility of a virus used as an ethnic bioweapon that could sterilize a \"genetically-related ethnic population.\"\n\n\n== Israeli \"ethno-bomb\" controversy ==\nIn November 1998, The Sunday Times reported that Israel was attempting to build an \"ethno-bomb\" containing a biological agent that could specifically target genetic traits present amongst Arab populations. Wired News also reported the story, as did Foreign Report.Microbiologists and geneticists were skeptical towards the scientific plausibility of such a biological agent. The New York Post, describing the claims as \"blood libel\", reported that the likely source for the story was a work of science fiction by Israeli academic Doron Stanitsky. Stanitsky had sent his completely fictional work about such a weapon to Israeli newspapers two years before. The article also noted the views of genetic researchers who claimed the idea as \"wholly fantastical\", with others claiming that the weapon was theoretically possible.\n\n\n== Russian ban on export of biological samples ==\nIn May 2007, a Russian newspaper Kommersant reported that the Russian government banned all exports of human biosamples.\nThe report claims that the reason for the ban was a secret FSB report about on-going development of \"genetic bioweapons\" targeting Russian population by Western institutions. The report mentions the Harvard School of Public Health, American International Health Alliance, Department of Medical Biotechnology of Jagiellonian University, United States Department of Justice Environment and Natural Resources Division, Institute of Genetics and Biotechnology Warsaw University, and United States Agency for International Development.\n\n\n== In fiction ==\nIn Liu Cixin's novel The Dark Forest, a terrorist organisation uses a \"personal\" virus targeted at the DNA of one particular individual but causing no serious harm to anyone else infected.\nIn Arma 3, \"Atrox Strain\" is an engineered variant of Malaria developed by the Canton Protocol Strategic Alliance Treaty that is used to target specific genotypes for the purposes of expanding soft power into affected countries via medical assistance.\nIn the Joe Ledger Series by Jonathan Maberry, the second novel, The Dragon Factory, deals with ethnic bioweapons. The antagonists in the novel, led by Cyrus Jakoby, use advanced transgenic science to make communicable versions of genetic disorders that predominately affect specific ethnic populations, such as Tay-Sachs disease and Sickle-cell Anemia, with the goal of committing mass genocides, a project they refer to as the \"Extinction Wave.\"\nIn the hit tv show Chuck, a biological weapon known as \"The Norseman\" is used as a device that is able to kill anyone on the planet from anywhere, using their DNA.\nIn British TV series Utopia, a bio weapon is devised to reduce the population by 'randomly' sterilising half the people it infects.  Spoiler: later it is discovered the plot involves targeting people of colour.\nSimilarly, series 3 of Designated Survivor involves a plot to sterilise all people of colour in the USA under fear that the white power will be lost when whites become minority by \"2035\".\n\n\n== See also ==\nBiological warfare\nGenographic Project,  genetic anthropology study; intention is to study migration.\nInternational HapMap Project\nMetal Gear Solid V: The Phantom Pain, a video game which features an ethnic bioweapon targeting languages instead of genes.\nPharmacogenomics\nPrayer of the Rollerboys\nProject Coast\nRace in biomedicine\nSARS conspiracy theory\nSyphon Filter, another video game in which terrorists attempt to release a genetically programmable virus.\nToxicogenomics\nWouter Basson\n\n\n== References ==\n\n\n== External links ==\n \"Ethnic Weapons\" - Race Specific Biological Weapons 1970 Military Review on YouTube\nGenetic weapons: a 21st-century nightmare?, Ethirajan Anbarasan, UNESCO Courier, March 1999\nIs all fair in biological warfare?, Journal of Medical Ethics, June 2009.\nNew biological weapons: Science fiction or moral imperative?, Robin Coupland, Red Cross Red Crescent, July 1999\nUS military agency invests $100m in genetic extinction technologies  Neslen, Arthur, 2017-12-04, The Guardian, access date 2018-05-01"