"A UFO religion is any religion in which the existence of extraterrestrial (ET) entities operating unidentified flying objects (UFOs) is an element of belief. Typically, adherents of such religions believe the ETs to be interested in the welfare of humanity which either already is, or eventually will become, part of a pre-existing ET civilization. Others may incorporate ETs into a more supernatural worldview in which the UFO occupants are more akin to angels than physical aliens; this distinction may be blurred within the overall subculture. These religions have their roots in the tropes of early science fiction (especially space opera) and weird fiction writings, in ufology, and in the subculture of UFO sightings and alien abduction stories.\n\n\n== Summary ==\nSome adherents believe that the arrival or rediscovery of alien civilizations, technologies and spirituality will enable humans to overcome current ecological, spiritual and social problems. Issues such as hatred, war, bigotry, poverty and so on are said to be resolvable through the use of superior alien technology and spiritual abilities. Such belief systems are also described as millenarian in their outlook.UFO religions developed first in such countries as the United States, Canada, France, the United Kingdom and Japan as the concept presumes the cultural context of a society technologically advanced enough to conceive of ET as such and one in which religion of any kind is not discouraged or suppressed. The term \"flying saucers\" and the popular notion of the UFO originated in 1947. The 1950s saw the creation of UFO religions, with the advent of the purported contactees.\n\n\n== Notable UFO religions ==\n\n\n=== Aetherius Society ===\n\nThe Aetherius Society was founded in the United Kingdom in 1955. Its founder, George King, claimed to have been contacted telepathically by an alien intelligence called Aetherius, who represented an \"Interplanetary Parliament.\" According to Aetherians, their society acts as a vehicle through which \"Cosmic Transmissions of advanced metaphysical significance\" can be disseminated to humanity. These \"transmissions\" were recorded on magnetic reel-to-reel tape by persons present during each \"telepathic transmission\" as George King sat in a state of \"Samadhi\" and the \"transmission\" was \"delivered\" via his own voicebox. In 1956 and 1957, and on occasion before a public audience, several of these \"transmissions\" forecast flying saucer activity in specific parts of the world on certain dates (You Are Responsible! Aetherius Society 1961). Shortly after these dates, newspapers, such as the Sunday Times and The Daily Telegraph, reported sightings which coincided with the dates and locations forecast in these \"transmissions\". As a spiritual teacher, George King taught certain yoga practices, spiritual healing, Eastern mantra and \"dynamic prayer\"—tools for spiritual self-advancement and service to the world—which the Aetherius Society is principally based upon.\n\n\n=== Church of the SubGenius ===\n\nFounded in 1979 with the publication of SubGenius Pamphlet #1 by Ivan Stang and Philo Drummond, the Church of the SubGenius has been known as a \"parody religion\" due to its extensive use of comedy and parody. In spite of this, the organization claims over 10,000 followers worldwide who have paid $30 to become \"ordained SubGenius ministers\", and it has been embraced by many skeptic and atheist groups. With the publication of The Book of the SubGenius in 1983, the Church of the SubGenius prophesied that its founder, J.R. \"Bob\" Dobbs, was in contact with an exterrestrial race called the Xists (\"X-ists\"), and these Xists were scheduled to launch a worldwide invasion of Earth on July 5, 1998.  (See also: X-Day (Church of the SubGenius))  The day of the scheduled invasion came and went without an appearance by the Xists, but church members remain unconvinced. The church now holds annual \"X-Day\" celebrations on July 5 of every year. The church also claims that its members are not entirely human, having descended from the Yeti.\n\n\n=== Heaven's Gate ===\n\nThe Heaven's Gate group achieved notoriety in 1997 when founder Marshall Applewhite convinced 38 followers to commit mass suicide. Members reportedly believed themselves to be aliens, awaiting a spaceship that would arrive with Comet Hale-Bopp. The suicide was undertaken in the apparent belief that their souls would be transported onto the spaceship, which they thought was hiding behind the comet. They underwent elaborate preparations for their trip, including purchasing and wearing matching shoes and living in a darkened house to simulate the long journey they expected to have in outer space.\n\n\n=== Nation of Islam ===\n\nThe Nation of Islam subscribes to the belief that UFOs are man-made machines that are piloted not by extraterrestrial beings, but by humans. It is believed that these machines will have a hand in the Day of Judgment. Its late leader Elijah Muhammed claimed that the biblical Book of Ezekiel describes a \"Mother Plane\" or great \"Wheel\". Elijah reported in his books that his mentor, Wallace Fard Muhammad, claimed that there was hidden technology on the Earth which selected scientists all around the world are secretly aware of. Fard explained that he had had a huge \"Mother Plane\" or \"Wheel\" constructed on the island of Nippon (Japan) in 1929. The movement's current leader, Louis Farrakhan, describes the \"Mother Plane\" thus:\n\nThe Honorable Elijah Muhammad told us of a giant Motherplane that is made like the universe, spheres within spheres. White people call them unidentified flying objects (UFOs). Ezekiel, in the Old Testament, saw a wheel that looked like a cloud by day but a pillar of fire by night. The Hon. Elijah Muhammad said that that wheel was built on the island of Nippon, which is now called Japan, by some of the original scientists. It took 15 billion dollars in gold at that time to build it. It is made of the toughest steel. America does not yet know the composition of the steel used to make an instrument like it. It is a circular plane, and the Bible says that it never makes turns. Because of its circular nature it can stop and travel in all directions at speeds of thousands of miles per hour. He said there are 1,500 small wheels in this mother wheel which is a half mile by a half mile (800 by 800 m). This Mother Wheel is like a small human built planet. Each one of these small planes carry three bombs.\n\n\n=== Raëlism ===\n\nThe International Raëlian Movement has been described as \"the largest UFO religion in the world.\" Raëlians believe that scientifically advanced extraterrestrials, known as the Elohim, created life on Earth through genetic engineering, and that a combination of human cloning and \"mind transfer\" can ultimately provide eternal life. Past religious teachers, like Jesus, Buddha and Muhammad, are said to have been sent by these scientifically advanced extraterrestrials to teach humanity. The Elohim are said to be planning a future visit to complete their revelation and education of humanity.Raëlian Priest Thomas said on this topic, \"The difference between Raëlians and Heaven's Gate and Jim Jones etc., is that the others destructively believed in a God who would give them a better life after death, just like most believers in a monotheistic religion do today, and hence the risk for suicide chasing afterlife rewards … as Raëlians we want the best right now in our life, who would want to die now in that scenario with all those pleasures to enjoy? Raëlians believe in enjoying life now, with happiness and laughter.\"\n\n\n=== Scientology ===\n\nScientology has been discussed in the context of UFO religions in UFO Religions by Christopher Partridge, The Encyclopedic Sourcebook of UFO Religions by James R. Lewis, and UFO Religion: Inside Flying Saucer Cults and Culture by Gregory Reece. Stories of extraterrestrial civilizations and interventions in past lives form a part of the belief system of Scientology. The most well-known story publicized and held up to ridicule by critics is that of Xenu, the ruler of the Galactic Confederacy who is said to have brought billions of frozen people to Earth 75 million years ago and placed them near a number of volcanoes, and dropped hydrogen bombs into them, thus killing the entire population in an effort to solve overpopulation. The spirits of these people were then captured by Xenu and mass implanted with numerous suggestions and then \"packaged\" into clusters of spirits.From the early 1950s onwards, Scientology's founder, L. Ron Hubbard, published a number of books, lectures, and other works describing what he termed \"space opera\".Scientology teaches that all humans have experienced innumerable past lives, including lives in ancient advanced extraterrestrial societies, such as Helatrobus and the Marcabians. Traumatic memories from these past lives are said to be the cause of many present-day physical and mental ailments. Scientologists also believe that human beings possess superhuman powers which cannot be restored until they have been fully rehabilitated as spiritual beings through the practice of \"auditing\", using methods set out by Hubbard in his various works.According to Hubbard, a thetan (the Scientology term for a soul) has a body. When that body dies the thetan goes to a \"landing station\" on the planet Venus, where they are re-implanted and are programmed to forget their previous lifetimes. The Venusians then \"capsule\" each thetan and send them back to Earth to be dumped into the Gulf of California; whereupon, each thetan searches for a new body to inhabit. To avoid these inconveniences, Hubbard advised Scientologists to simply refuse to go to Venus after their death.\n\n\n=== Unarius Academy of Science ===\n\nFounded by Ernest L. Norman and his wife, Ruth, in 1954, the Unarians are a group headquartered in El Cajon, California, who believe that, through the use of Four-dimensional space physics, they are able to communicate with supposed advanced intelligent beings that allegedly exist on \"higher frequency\" planes. Unarians believe in past lives and hold that the Solar System was once inhabited by ancient interplanetary civilizations.\n\n\n=== Universal Industrial Church of the New World Comforter ===\nThe Universal Industrial Church of the New World Comforter is a UFO religion founded in 1967 by Allen Michael. Michael claimed that in 1947, under his birth name Allen Noonan, while he was a pictorial sign painter in Long Beach, California, he was contacted by the Great Galactic Being that was manifesting itself as the Milky Way galaxy. He was asked to serve as the spiritual Comforter and preach supernatural truth to the world. During his services Michael often quoted from and provided his interpretations of the Bible. In 1967 in the Haight and Ashbury neighborhood of San Francisco, he founded the One World Family Commune as a pilot model of living that he was preaching as the Comforter. He claimed to have physically encountered a flying saucer in 1954 at Giant Rock in the Mojave Desert of California. During the Summer of Love, he began the One World Family Commune opening a vegan restaurant  on the northeast corner of Haight and Scott streets in San Francisco, California, called the Here and Now. 7 similar restaurants followed. In 1969, the commune established a vegan restaurant in a much larger space on Telegraph Avenue and Haste Street in Berkeley and the name of the restaurant was changed to Mustard Seed and late became One World Family Natural Food Center, which also included a bakery, a pizzeria, a clothing store and an assembly room for public events. They lived in two adjacent houses that are now home to the Lothlorien house of the Berkeley Student Cooperative. The commune published a vegetarian cookbook called Cosmic Cookery. There was a large mural on the side of the restaurant painted by Allen Michael that had written above it the phrase Farmers, Workers, Soldiers Unite — The People's Spiritual Reformation 1776–1976! The farmer was holding a pitchfork, the worker was holding a hammer, and the soldier was holding a gun, and they had their arms around each other's shoulders. Above the three were three flying saucers coming in for a landing. In 1973, Allen Michael founded \"The Universal Industrial Church of the New World Comforter\" and published the first volume of his channeled revelations, The Everlasting Gospel. In 1975, the church headquarters and the vegetarian restaurant relocated to Stockton, California. Allen Noonan ran for president of the United States in the 1980 and 1984 elections on the Utopian Synthesis Party ticket.\n\n\n=== Universe People ===\n\nThe Universe People or Cosmic people of light powers (Czech: Vesmírní lidé sil světla) is a Czech movement centered around Ivo A. Benda. Its belief system is based upon the existence of extraterrestrial civilizations communicating with Benda and other \"contacters\" since October 1997 telepathically and later by direct personal contact. According to Benda, those civilizations operate a fleet of spaceships led by Ashtar (sometimes written Ashtar Sheran) orbiting and closely watching the Earth, helping the good and waiting to transport the followers into another dimension. The Universe People teaching incorporates various elements from ufology (some foreign \"contacters\" are credited, though often also renounced after a time as misguided or deceptive), Christianity (Jesus was a \"fine-vibrations\" being) and conspiracy theories (forces of evil are supposed to plan compulsory chipping of the populace).\n\n\n== UFOs in other Non-UFO religions ==\n\n\n=== Ascended Master Teachings ===\nThe Ascended Master Teachings are a group of religions based on Theosophy. In the traditional Ascended Master Teachings of Guy Ballard and Elizabeth Clare Prophet, no mention is made of UFOs or flying saucers. However, the Ascended Master Teachings teacher Joshua David Stone in his teachings began, beginning in 1993, to refer to Ashtar, believed by some UFO enthusiasts to be the commander of a flying saucer fleet called the \"Ashtar Galactic Command\" that operates near Earth (manned mostly by Venusians), as a Master along with the more traditional ascended masters. He continued to include \"Ashtar\" on his list of ascended masters that he mentioned he received dictations from when speaking at his yearly Wesak Festival Mount Shasta gatherings that began to be held in 1996. Stone also taught that the Master Jesus, under his \"galactic\" name Sananda, sometimes rides with \"Commander Ashtar\" in his flying saucer fleet.\n\n\n=== Church of Jesus Christ of Latter-day Saints ===\n\nAccording to Mormon scripture, the Earth's is just one of many inhabited worlds, and there are many governing heavenly bodies, including the planet or star Kolob, which is said to be nearest the throne of God.\n\n\n=== Share International and Maitreya ===\nThe Theosophical-influenced guru Benjamin Creme of Share International claimed that the Messiah figure he referred to as Maitreya is in telepathic contact with Nordic aliens. Creme believed that Nordic aliens live on the etheric plane of Venus and visited earth in flying saucers. Creme accepted George Adamski's UFO sightings as valid. According to Creme, the Venusians have mother ships up to four miles long. It is also believed by the Theosophists in general as well as Creme in particular that the governing deity of Earth, Sanat Kumara (who is believed to live in a city called Shamballa located above the Gobi desert on the etheric plane of Earth), is a Nordic alien who originally came from Venus 18,500,000 years ago. The followers of Benjamin Creme believe there is regular flying saucer traffic between Venus and Shamballah and that crop circles are mostly caused by flying saucers.\n\n\n=== Tempelhofgesellschaft ===\nA neo-Nazi esoteric Nazi Gnostic sect headquartered in Vienna, Austria, called the Tempelhofgesellschaft, founded in the early 1990s, teaches what it calls a form of Marcionism. They distribute pamphlets claiming that the Aryan race originally came to Atlantis from the star Aldebaran (this information is supposedly based on \"ancient Sumerian manuscripts\"). They maintain that the Aryans from Aldebaran derive their power from the vril energy of the Black Sun. They teach that since the Aryan race is of extraterrestrial origin it has a divine mission to dominate all the other races. It is believed by adherents of this religion that an enormous space fleet is on its way to Earth from Aldebaran which, when it arrives, will join forces with the \"Nazi Flying Saucers from Antarctica\" to establish the Western Imperium.\n\n\n=== Training centre for release of the Atma-energy ===\nThis sect was originally a splinter group of the Brahma Kumaris and is known for a police and media scare in which an alleged attempt to commit ritual suicide took place in Teide National Park in Tenerife in 1998. Apparently, the 32 members of the sect believed that they would be collected by a spacecraft and taken to an unspecified destination.\n\n\n=== Worldwide Community of the New Message from God ===\nThe New Message from God is at once both a set of teachings with claims of divine authority and the new religious movement that promotes these teachings. It is entirely based on the work of Marshall Vian Summers, who is granted elevated status as \"the Messenger\" on the basis of these teachings. Summers and his adherents represent that he is a prophet on the order of the Buddha, Jesus, and Muhammad, in receipt of an unworldly communication having salvific power for individuals and for the planet among others in a populated universe. Summers has recorded these communications on tape, the transcription approaching ten thousand pages. Key components of this communication include warnings of an incursion upon Earth called the Intervention, and pronouncements about the future involving global upheaval and interaction between the human race and extraterrestrials which, Summers claims, are from \"the Greater Community.\"\n\n\n== See also ==\n\nDoomsday cult\nList of new religious movements\nList of Ufologists\nList of UFO organizations\nList of UFO religions\n\n\n== References ==\n\n\n== Bibliography ==\nLewis, James R. (1995), The Gods have landed: new religions from other worlds, SUNY Press, ISBN 978-0-7914-2329-5\nPartridge, Christopher Hugh (2003), UFO religions, Routledge, ISBN 978-0-415-26323-8\nTumminia, Diana G. (2007), Alien worlds: social and religious dimensions of extraterrestrial contact, Syracuse University Press, ISBN 978-0-8156-0858-5\nMartin Gardner, Fads and Fallacies in the Name of Science, Dover Publications, 1957, ISBN 0-486-20394-8\nJacques Vallee, Messengers of Deception: UFO Contacts and Cults, Ronin Publishing, ISBN 0-915904-38-1 (originally published 1979)\nJames R. Lewis (ed.), Encyclopedic Sourcebook of UFO Religions, Prometheus Books, 2003, ISBN 1-57392-964-6\nDiana G. Tumminia, When Prophecy Never Fails: Myth and Reality in a Flying-Saucer Group, Oxford University Press, 2005, ISBN 0-19-517675-8"