"Technirama is a screen process that has been used by some film production houses as an alternative to CinemaScope. It was first used in 1957 but fell into disuse in the mid-1960s. The process was invented by Technicolor and is an anamorphic process with a screen ratio the same as revised CinemaScope (2.35:1) (which became the standard), but it is actually 2.25:1 on the negative.\n\n\n== Technical ==\nThe Technirama process used a film frame area twice as large as CinemaScope. This gave the former a sharper image with less photographic grain. Cameras used 35-mm film running horizontally with an 8-perforation frame, double the normal size, exactly the same as VistaVision. VistaVision cameras were sometimes adapted. Technirama used 1.5:1 anamorphic curved mirror optics in front of the camera lens (unlike CinemaScope's cylindrical lenses which squeezed the image in a 1:2 ratio). In the laboratory, the 8-perforation horizontal negative would be reduced optically, incorporating a 1.33:1 horizontal squeeze to create normal 4-perforation (vertically running) prints with images having an anamorphic ratio of 2:1.\nJust as VistaVision had a few flagship engagements using 8-perf horizontal contact prints and special horizontal-running projectors, there is a bit of evidence that horizontal prints were envisioned for Technirama as well (probably with 4-track magnetic sound as in CinemaScope), but to what extent this was ever done commercially, if at all, remains unclear.\nThe name Super Technirama 70 was used on films where the shooting was done in Technirama and at least some prints were made on 70-mm stock by unsqueezing the image.  Such prints would be compatible with those made by such 65-mm negative processes as Todd-AO and Super Panavision.  The quality would have been very good but perhaps a bit less than those processes, because the negative was not quite as large and needed to be printed optically.\nTechnicolor had roughly 12 of its Three-Strip cameras converted into VistaVision cameras, using camera movements supplied by Mitchell Camera Corporation, the 1932 supplier of the original Three-Strip camera movements. After the 1956 delivery by Mitchell Camera Corporation, the converted Technicolor Three-Strip cameras immediately became obsolete, and were surplus to Technicolor's operations.  These converted Three-Strip VistaVision cameras thereafter became the standard Technirama cameras, which were subsequently supplemented by a few Paramount hand-held VistaVision cameras fitted with anamorphic optics. The logistical advantage of using 35mm film, end-to-end, should not be underestimated.\nA few 8-perf titles have been preserved on 65mm film, but most have been preserved on 35mm film or are considered unprintable.\nThe color was enhanced through the use of a special development process that was used to good effect in films such as The Vikings (1958) and The Music Man (1962). However, fewer than 40 films were produced using this process in the United States. It was more popular and longer-lasting in Europe. Walt Disney Productions used the process twice for full-length animated features: Sleeping Beauty (1959), and The Black Cauldron (1985). The 2008 DVD and Blu-ray Disc release of Walt Disney's Sleeping Beauty was shown at an aspect-ratio of 2.55:1 for the first time.\n\n\n== Specifications ==\nFilm: 35 mm running horizontally using eight perforations at 24 frames per second.\nFilm area: 1.496\" (38 mm) × 0.992\" (25.2 mm).\nAnamorphic power: 1.5\nAspect ratio: 2.35:1 (Prints) 2.25:1 (Negative)\n\n\n== Films ==\nSee List of Technirama films.\n\n\n== See also ==\nList of film formats\nSuper Technirama 70\n\n\n== References ==\n\n\n== External links ==\nWidescreen museum Technirama page.\nThe Technirama Process - Technicolor 100 Explanation of the format by the George Eastman Museum"