"Coriolanus ( or ) is a tragedy by William Shakespeare, believed to have been written between 1605 and 1608. The play is based on the life of the legendary Roman leader Caius Marcius Coriolanus. Shakespeare worked on it during the same years he wrote Antony and Cleopatra, making them the last two tragedies written by him.\nCoriolanus is the name given to a Roman general after his military feats against the Volscians at Corioli. Following his success he seeks to be consul, but his disdain for the plebeians and the mutual hostility of the tribunes lead to his banishment from Rome. He presents himself to the Volscians, then leads them against Rome.\n\n\n== Characters ==\n\n\n== Synopsis ==\n\nThe play opens in Rome shortly after the expulsion of the Tarquin kings. There are riots in progress, after stores of grain were withheld from ordinary citizens. The rioters are particularly angry at Caius Marcius, a brilliant Roman general whom they blame for the loss of their grain. The rioters encounter a patrician named Menenius Agrippa, as well as Caius Marcius himself. Menenius tries to calm the rioters, while Marcius is openly contemptuous, and says that the plebeians were not worthy of the grain because of their lack of military service. Two of the tribunes of Rome, Brutus and Sicinius, privately denounce Marcius. He leaves Rome after news arrives that a Volscian army is in the field.\nThe commander of the Volscian army, Tullus Aufidius, has fought Marcius on several occasions and considers him a blood enemy. The Roman army is commanded by Cominius, with Marcius as his deputy. While Cominius takes his soldiers to meet Aufidius' army, Marcius leads a rally against the Volscian city of Corioli. The siege of Corioli is initially unsuccessful, but Marcius is able to force open the gates of the city, and the Romans conquer it. Even though he is exhausted from the fighting, Marcius marches quickly to join Cominius and fight the other Volscian force. Marcius and Aufidius meet in single combat, which ends only when Aufidius' own soldiers drag him away from the battle.\n\nIn recognition of his great courage, Cominius gives Caius Marcius the agnomen, or \"official nickname\", of Coriolanus. When they return to Rome, Coriolanus's mother Volumnia encourages her son to run for consul. Coriolanus is hesitant to do this, but he bows to his mother's wishes. He effortlessly wins the support of the Roman Senate, and seems at first to have won over the plebeians as well. However, Brutus and Sicinius scheme to defeat Coriolanus and whip up another riot in opposition to his becoming consul. Faced with this opposition, Coriolanus flies into a rage and rails against the concept of popular rule. He compares allowing plebeians to have power over the patricians to allowing \"crows to peck the eagles\". The two tribunes condemn Coriolanus as a traitor for his words, and order him to be banished. Coriolanus retorts that it is he who banishes Rome from his presence.\nAfter being exiled from Rome, Coriolanus makes his way to the Volscian capital of Antium, and asks Aufidius's help to wreak revenge upon Rome for banishing him. Moved by his plight and honoured to fight alongside the great general, Aufidius and his superiors embrace Coriolanus, and allow him to lead a new assault on Rome.\nRome, in its panic, tries desperately to persuade Coriolanus to halt his crusade for vengeance, but both Cominius and Menenius fail. Finally, Volumnia is sent to meet her son, along with Coriolanus's wife Virgilia and their child, and the chaste gentlewoman Valeria. Volumnia succeeds in dissuading her son from destroying Rome, urging him instead to clear his name by reconciling the Volscians with the Romans and creating peace.\nCoriolanus concludes a peace treaty between the Volscians and the Romans. When he returns to the Volscian capital, conspirators, organised by Aufidius, kill him for his betrayal.\n\n\n== Sources ==\n\nCoriolanus is largely based on the \"Life of Coriolanus\" in Thomas North's translation of Plutarch's The Lives of the Noble Grecians and Romans (1579). The wording of Menenius's speech about the body politic is derived from William Camden's Remaines of a Greater Worke Concerning Britaine (1605), where Pope Adrian IV compares a well-run government to a body in which \"all parts performed their functions, only the stomach lay idle and consumed all\"; the fable is also alluded to in John of Salisbury's Policraticus (Camden's source) and William Averell's A Marvailous Combat of Contrarieties (1588).Other sources have been suggested, but are less certain. Shakespeare might also have drawn on Livy's Ab Urbe condita, as translated by Philemon Holland, and possibly a digest of Livy by Lucius Annaeus Florus; both of these were commonly used texts in Elizabethan schools. Machiavelli's Discourses on Livy were available in manuscript translations, and could also have been used by Shakespeare. He might also have made use of Plutarch's original source, the Roman Antiquities of Dionysius of Halicarnassus, as well as on his own grammar-school knowledge of Roman custom and law\".\n\n\n== Date and text ==\n\nMost scholars date Coriolanus to the period 1605–10, with 1608–09 being considered the most likely, although the available evidence does not permit great certainty.\nThe earliest date for the play rests on the fact that Menenius's fable of the belly is derived from William Camden's Remaines, published in 1605. The later date derives from the fact that several other texts from 1610 or thereabouts seem to allude to Coriolanus, including Ben Jonson's Epicoene, Robert Armin's Phantasma and John Fletcher's The Woman's Prize, or the Tamer Tamed.Some scholars note evidence that may narrow down the dating to the period 1607–09. One line may be inspired by George Chapman's translation of the Iliad (late 1608). References to \"the coal of fire upon the ice\" (I.i) and to squabbles over ownership of channels of water (III.i) could be inspired by Thomas Dekker's description of the freezing of the Thames in 1607–08 and Hugh Myddleton's project to bring water to London by channels in 1608–09 respectively. Another possible connection with 1608 is that the surviving text of the play is divided into acts; this suggests that it could have been written for the indoor Blackfriars Theatre, at which Shakespeare's company began to perform in 1608, although the act-breaks could instead have been introduced later.The play's themes of popular discontent with government have been connected by scholars with the Midland Revolt, a series of peasant riots in 1607 that would have affected Shakespeare as an owner of land in Stratford-upon-Avon; and the debates over the charter for the City of London, which Shakespeare would have been aware of, as it affected the legal status of the area surrounding the Blackfriars Theatre. The riots in the Midlands were caused by hunger because of the enclosure of common land.\nFor these reasons, R.B. Parker suggests \"late 1608 ... to early 1609\" as the likeliest date of composition, while Lee Bliss suggests composition by late 1608, and the first public performances in \"late December 1609 or February 1610\". Parker acknowledges that the evidence is \"scanty ... and mostly inferential\".The play was first published in the First Folio of 1623. Elements of the text, such as the uncommonly detailed stage directions, lead some Shakespeare scholars to believe the text was prepared from a theatrical prompt book.\n\n\n== Analysis and criticism ==\nA. C. Bradley described this play as \"built on the grand scale,\" like King Lear and Macbeth, but it differs from those two masterpieces in an important way. The warrior Coriolanus is perhaps the most opaque of Shakespeare's tragic heroes, rarely pausing to soliloquise or reveal the motives behind his proud isolation from Roman society. In this way, he is less like the effervescent and reflective Shakespearean heroes/heroines such as Macbeth, Hamlet, Lear and Cleopatra, and more like figures from ancient classical literature such as Achilles, Odysseus, and Aeneas—or, to turn to literary creations from Shakespeare's time, the Marlovian conqueror Tamburlaine, whose militaristic pride finds its parallel in Coriolanus. Readers and playgoers have often found him an unsympathetic character, as his caustic pride is strangely, almost delicately balanced at times by a reluctance to be praised by his compatriots and an unwillingness to exploit and slander for political gain. His dislike of being praised might be seen as an expression of his pride; all he cares about is his own self-image, whereas acceptance of praise might imply that his value is affected by others' opinion of him. The play is less frequently produced than the other tragedies of the later period, and is not so universally regarded as great. (Bradley, for instance, declined to number it among his famous four in the landmark critical work Shakespearean Tragedy.) In his book Shakespeare's Language, Frank Kermode described Coriolanus as \"probably the most fiercely and ingeniously planned and expressed of all the tragedies\".T. S. Eliot famously proclaimed Coriolanus superior to Hamlet in The Sacred Wood, in which he calls the former play, along with Antony and Cleopatra, the Bard's greatest tragic achievement. Eliot wrote a two-part poem about Coriolanus, \"Coriolan\" (an alternative spelling of Coriolanus); he also alluded to Coriolanus in a passage from his own The Waste Land when he wrote, \"Revive for a moment a broken Coriolanus.\"Coriolanus has the distinction of being among the few Shakespeare plays banned in a democracy in modern times. It was briefly suppressed in France in the late 1930s because of its use by the fascist element, and Slavoj Žižek noted its prohibition in Post-War Germany due to its intense militarism.\n\n\n== Performance history ==\nLike some of Shakespeare's other plays (All's Well That Ends Well; Antony and Cleopatra; Timon of Athens), there is no recorded performance of Coriolanus prior to the Restoration. After 1660, however, its themes made it a natural choice for times of political turmoil. The first known performance was Nahum Tate's bloody 1682 adaptation at Drury Lane. Seemingly undeterred by the earlier suppression of his Richard II, Tate offered a Coriolanus that was faithful to Shakespeare through four acts before becoming a Websterian bloodbath in the fifth act. A later adaptation, John Dennis's The Invader of His Country, or The Fatal Resentment, was booed off the stage after three performances in 1719. The title and date indicate Dennis's intent, a vitriolic attack on the Jacobite 'Fifteen. (Similar intentions motivated James Thomson's 1745 version, though this bears only a very slight resemblance to Shakespeare's play. Its principal connection to Shakespeare is indirect; Thomas Sheridan's 1752 production at Smock Alley used some passages of Thomson's. David Garrick returned to Shakespeare's text in a 1754 Drury Lane production.Laurence Olivier first played the part at The Old Vic in 1937 and again at the Shakespeare Memorial Theatre in 1959. In that production, he performed Coriolanus's death scene by dropping backwards from a high platform and being suspended upside-down without the aid of wires.In 1971, the play returned to the Old Vic in a National Theatre production directed by Manfred Wekwerth and Joachim Tenschert with stage design by Karl von Appen. Anthony Hopkins played Coriolanus, with Constance Cummings as Volumnia and Anna Carteret as Virgilia.Other performances of Coriolanus include Alan Howard, Paul Scofield, Ian McKellen, Ian Richardson, Toby Stephens, Robert Ryan, Christopher Walken, Morgan Freeman, Colm Feore, Ralph Fiennes and Tom Hiddleston.In 2012, National Theatre Wales produced a composite of Shakespeare's Coriolanus with Bertolt Brecht's Coriolan, entitled Coriolan/us, in a disused hangar at MOD St Athan. Directed by Mike Brookes and Mike Pearson, the production used Silent disco headsets to permit the text to be heard while the dramatic action moved throughout the large space. The production was well received by critics.In December 2013, Donmar Warehouse opened their new production. It was directed by Josie Rourke, starring Tom Hiddleston in the title role, along with Mark Gatiss, Deborah Findlay, Hadley Fraser, and Birgitte Hjort Sørensen. The production received very strong reviews. Michael Billington with The Guardian wrote \"A fast, witty, intelligent production that, in Tom Hiddleston, boasts a fine Coriolanus.\" He also credited Mark Gatiss as excellent as Menenius, the \"humorous patrician\". In Variety, David Benedict wrote that Deborah Findlay in her commanding maternal pride, held beautifully in opposition by Birgitte Hjort Sørensen as Coriolanus's wife Virgilia. Helen Lewis, in her review of Coriolanus, along with two other concurrently running sold-out Shakespeare productions with celebrity leads—David Tennant's Richard II and Jude Law's Henry V—concludes \"if you can beg, borrow or plunder a ticket to one of these plays, let it be Coriolanus.\" The play was broadcast in cinemas in the U.K. and internationally on 30 January 2014 as part of the National Theatre Live programme.\n\n\n== Adaptations ==\nBertolt Brecht adapted Shakespeare's play in 1952–55, as Coriolan for the Berliner Ensemble. He intended to make it a tragedy of the workers, not the individual, and introduce the alienation effect; his journal notes showing that he found many of his own effects already in the text, he considered staging the play with only minimal changes. The adaptation was unfinished at Brecht's death in 1956; it was completed by Manfred Wekwerth and Joachim Tenschert and staged in Frankfurt in 1962.In 1963 the BBC included Coriolanus in The Spread of the Eagle.\nSlovak composer Ján Cikker adapted the play into an opera which premiered in 1974 in Prague.\nIn 1983, the BBC Television Shakespeare series produced a version of the play. It starred Alan Howard and was directed by Elijah Moshinsky.\nIn 2003 the Royal Shakespeare Company performed a new staging of Coriolanus (along with two other plays) starring Greg Hicks at the University of Michigan. The director, David Farr, saw the play as depicting the modernization of an ancient ritualized culture, and drew on samurai influences to illustrate that view. He described it as \"in essence, a modern production. The play is basically about the birth of democracy.\"In 2011, Ralph Fiennes directed and starred as Coriolanus with Gerard Butler as Aufidius and Vanessa Redgrave as Volumnia in a modern-day film adaptation Coriolanus. It was released on DVD and Blu-ray in May, 2012. It has a 93% rating on the film review site Rottentomatoes.com, giving it a Certified Fresh award. Slavoj Žižek argued that unlike preceding adaptations, Fiennes' film portrayed Coriolanus without trying to rationalize his behaviour, as a raw figure for the \"radical left\", a figure who represents contempt for a decadent liberal democracy and the willingness to use violence to counter its latent imperialism in alliance with the oppressed, someone he compares to Che Guevara (who justified himself as a revolutionary killing machine).\n\n\n=== Parody ===\nWhile the title character's name's pronunciation in classical Latin has the a pronounced \"[aː]\" in the IPA, in English the a is usually prononunced \"[eɪ].\"  Ken Ludwig's Moon Over Buffalo contains a joke dependent upon this pronunciation, and the parody The Complete Wrks of Wllm Shkspr (Abridged) refers to it as \"the anus play\". Shakespeare pronunciation guides list both pronunciations as acceptable.Cole Porter's song \"Brush Up Your Shakespeare\" from the musical Kiss Me, Kate includes the lines: \"If she says your behavior is heinous,/Kick her right in the Coriolanus.\"\nBased on Coriolanus, and written in blank verse, \"Complots of Mischief\" is a satirical critique of those who dismiss conspiracy theories. Written by philosopher Charles Pigden, it was published in Conspiracy Theories: The Philosophical Debate (Ashgate 2006).\n\n\n== References ==\n\n\n== Further reading ==\nKrajewski, Bruce. \"Coriolanus: 'Unfit for Anyone's Conversation,'\" in Traveling with Hermes: Hermeneutics and Rhetoric (1992), ISBN 0-87023-815-9.\nLunberry, Clark (2002). \"In the Name of Coriolanus: The Prompter (Prompted)\". Comparative Literature. 54 (3): 229–241. doi:10.1215/-54-3-229. JSTOR 4125436.\n\n\n== External links ==\nText of the play by Shakespeare:\nFull text of Shakespeare's play\nOld Spelling Transcription – Transcription of First Folio.\nCoriolanus at Project Gutenberg.\nCoriolanus at the British Library\n Coriolanus public domain audiobook at LibriVox\nCoriolanus – Scene-indexed and searchable version of the play.\nPlutarch's Life of Coriolanus :\nPlutarch's Life of Coriolanus – 17th century English translation by John Dryden\nPlutarch's Life of Coriolanus – 19th century English translation by Aubrey Stewart and George Long\nCoriolanus at IMDb"