"An oceanarium can be either a marine mammal park, such as Marineland of Canada, or a large-scale aquarium, such as the Lisbon Oceanarium, presenting an ocean habitat with marine animals, especially large ocean dwellers such as sharks.\n\n\n== First marine mammal parks ==\n\nMarineland of Florida, one of the first theme parks in Florida, United States, started in 1938, claims to be \"the world's first oceanarium\"\nMarineland of Florida was developed as Marine Studios near St. Augustine in Marineland, Florida, which was followed in Florida by Miami Seaquarium, opened in 1955 and in California by Marineland of the Pacific, opened in 1954 near Los Angeles, and Marine World, Africa USA, opened in 1968 near San Francisco.\n\n\n== SeaWorld ==\n\nSeaWorld San Diego was opened in 1964, developed by four fraternity brothers Milt Shedd, Ken Norris, David DeMott and George Millay.\nSeaWorld Aurora opened in 1970 near Cleveland, Ohio.\nSeaWorld Orlando was opened in 1973.\nSeaWorld (San Diego, Aurora, Orlando) was sold to Harcourt Brace Jovanovich (a publishing company listed on the New York Stock Exchange) in 1976. \nThey purchased Marineland of the Pacific in 1986 and closed the park.\nThey had opened SeaWorld San Antonio in 1988.\nIn 1989 they sold SeaWorld (San Diego, Aurora, Orlando, San Antonio) to Anheuser-Busch, the world's largest brewer and owner of the Busch Gardens Safari Parks, for US$1.1 billion. \nIn 2001, Anheuser-Busch sold SeaWorld Ohio to Six Flags, which combined the park with the neighboring Geauga Lake to form Six Flags Worlds of Adventure. The animal aquatics portion of the park closed prior to 2004 when Six Flags sold the park to Cedar Fair.\n\n\n== World's largest marine life park ==\n\nWhen a new 170,000-square-foot exhibit at the Shedd Aquarium in Chicago opened on April 27, 1991, it debuted as the largest indoor marine mammal facility in the world. The position as world's largest oceanarium has since shifted repeatedly in recent years. From 2005 to 2012 it was the Georgia Aquarium in the United States with an initial total water volume of 32,000 m3 (8,500,000 US gal), later it expanded to 38,000 m3 (10,000,000 US gal), and home to 100–120,000 animals of 700 species. In 2012 it was surpassed by Marine Life Park in Singapore with a total water volume of 45,000 m3 (12,000,000 US gal) and over 100,000 animals of more than 800 species. In 2014, the Singapore park was surpassed by the Chimelong Ocean Kingdom in China, the current record holder, with a total water volume of 48,750 m3 (12,880,000 US gal).\n\n\n== Marine public aquariums ==\n\nModern marine aquariums try to create natural environments. A host of marine animals swim together in the four-story cylindrical tank of the New England Aquarium in Boston, which opened in 1969.\nAt the National Aquarium in Baltimore, which opened in 1981, a walkway spirals up through the center of two gigantic cylindrical tanks, the Atlantic Coral Reef and the Shark Alley, which display sharks, sawfish, and other sea creatures.\nSince then, many new aquariums have sought even greater realism, often concentrating on local environments. Monterey Bay Aquarium in California, which opened in 1984, is an example.The Afrykarium is the only themed oceanarium devoted solely to exhibiting the fauna of Africa and located in Wrocław, Poland. A part of the Wrocław Zoo, the idea behind the Afrykarium is to comprehensively present selected ecosystems from the continent of Africa.Nur-Sultan, the  capital of Kazakhstan, is home to the only oceanarium in Central Asia.\n\n\n== See also ==\nManila Ocean Park\nMoscow Oceanarium\nNordsøen Oceanarium, Hirtshals, Denmark.\nDolphinarium\nPublic aquarium\nUnderWater World Guam\n\n\n== Notes ==\n\n\n== Further reading ==\nLou Jacobs, Wonders of an oceanarium: The story of marine life in captivity. Golden Gate Junior Books, 1965.\nJoanne F. Oppenheim, Oceanarium. BBooks, 1994. ISBN 0-553-09520-X.\nPatryla, Jim. (2005). A Photographic Journey Back To Marineland of the Pacific. Lulu Publishing. ISBN 978-1-4116-7130-0.\nBrunner, Bernd. The Ocean at Home: An Illustrated History of the Aquarium. Reaktion Books, 2011.\n\n\n== External links ==\nOceanarium — The Bournemouth Aquarium, UK\nOceanarium, West Australia — suppliers of marine aquarium specimens\nMarine Life Park - Resorts World @ Sentosa"