"The Polish–Soviet War (late autumn 1918 – 18 March 1921) was fought primarily between the Second Polish Republic and the Russian Soviet Federative Socialist Republic in the aftermath of World War I, on territories formerly held by the Russian Empire and the Austro-Hungarian Empire.\nOn 13 November 1918, Vladimir Lenin's Russia annulled the Treaty of Brest-Litovsk and soon started slowly moving forces in the western direction to recover and secure the lands vacated by the German forces that were lost by the Russian state under the treaty. Lenin saw the newly independent Poland as the bridge the Red Army had to cross to assist other communist movements and to bring about more European revolutions. At the same time, leading Polish politicians of different orientations pursued the general expectation of restoring the country's pre-1772 borders. Motivated by that idea, Polish Chief of State Józef Piłsudski began moving troops east.\nIn 1919, while the Red Army was preoccupied with the Russian Civil War, the Polish Army took most of Lithuania and Belarus. By July 1919, Polish forces had taken control of much of Western Ukraine and emerged victorious from the Polish–Ukrainian War. Meanwhile, in the eastern part of Ukraine bordering on Russia, Symon Petliura tried to defend the Ukrainian People's Republic, but as the Bolsheviks gained the upper hand in the civil war, they advanced westward towards the disputed Ukrainian lands and made Petliura's forces retreat. Reduced to a small amount of territory in the west, Petliura was compelled to seek an alliance with Piłsudski, which was officially formed in April 1920.\nPiłsudski believed that the best way for Poland to secure favorable borders was by military action and that he could easily defeat the Red Army forces. His Kiev Offensive, considered to have begun the Polish–Soviet War sensu stricto, commenced in late April 1920 and resulted in the takeover of Kiev by the Polish and allied Ukrainian forces on 7 May. The Soviet armies in the area, which were weaker, had not been defeated, as they avoided major confrontations and withdrew.\nThe Polish offensive was met by successful counterattacks by the Red Army, from 5 June on the southern Ukrainian front and from 4 July on the northern front. The Soviet operation pushed the Polish forces back westward all the way to Warsaw, the Polish capital, while the Directorate of Ukraine fled to Western Europe. Fears of Soviet troops arriving at the German borders increased the interest and involvement of the Western powers in the war. In mid-summer the fall of Warsaw seemed certain, but in mid-August the tide had turned again after the Polish forces achieved an unexpected and decisive victory at the Battle of Warsaw. In the wake of the eastward Polish advance that followed, the Soviets sued for peace, and the war ended with a ceasefire on 18 October 1920.\nThe Peace of Riga, signed on 18 March 1921, divided the disputed territories between Poland and Soviet Russia. The war and the treaty negotiations determined the Soviet–Polish border for the rest of the interwar period. Poland's eastern border was established at about 200 km east of the Curzon Line, a British proposal for Poland's border, previously approved by the Entente leaders as the limit of Poland's expansion in the eastern direction. Ukraine and Belarus became divided between Poland and the Soviet Union, which established the respective Soviet republics in its parts.\nThe peace negotiations, on the Polish side conducted chiefly by Piłsudski's opponents and against his will, ended with the official recognition of the two Soviet republics, which became parties to the treaty. This outcome and the new border agreed on precluded any possibility of the formation of the Intermarium Polish-led federation of states that Piłsudski had planned for or of meeting his other eastern policy goals. The Soviet Union later used the Ukrainian Soviet Republic and the Byelorussian Soviet Republic to claim their unification with parts of the Kresy territories where East Slavic people outnumbered ethnic Poles and which had remained, after the Peace of Riga, on the Polish side of the border, lacking any form of autonomy.\n\n\n== Names and dates ==\nThe war is known by several names. \"Polish–Soviet War\" is the most common but other names include \"Russo–Polish War\" (or \"Polish–Russian War\") and \"Polish–Bolshevik War\". This last term (or just \"Bolshevik War\" (Polish: Wojna bolszewicka)) is most common in Polish sources. In some Polish sources it is also referred as the \"War of 1920\" (Polish: Wojna 1920 roku).There is disagreement over the dates of the war. The Encyclopædia Britannica begins its \"Russo-Polish War\" article with the date range 1919–1920 but then states, \"Although there had been hostilities between the two countries during 1919, the conflict began when the Polish head of state Józef Piłsudski formed an alliance with the Ukrainian nationalist leader Symon Petlyura (21 April 1920) and their combined forces began to overrun Ukraine, occupying Kiev on 7 May.\" Some Western historians, including Norman Davies, consider mid-February 1919 the beginning of the war. However, military confrontations between forces that can be considered officially Polish and the Red Army took place already in late autumn 1918 and in January 1919. The city of Vilnius, for example, was taken by the Soviets on 5 January 1919.The ending date is given as either 1920 or 1921; this confusion stems from the fact that while the cease-fire was put into force on 18 October 1920, the official treaty ending the war was signed on 18 March 1921. While the events of late 1918 and 1919 can be described as a border conflict and only in spring 1920 did both sides engage in an all-out war, the warfare that took place in late April 1920 was an escalation of the fighting that began a year and a half earlier.\n\n\n== Background ==\n\nThe war's main territories of contention lie in what is now Ukraine and Belarus. Until the mid-13th century, they formed part of the medieval state of Kievan Rus'. After a period of internal wars and the 1240 Mongol invasion, the lands became objects of expansion for the Kingdom of Poland and for the Grand Duchy of Lithuania. In the first half of the 14th century, the Principality of Kiev and the land between the Dnieper, Pripyat, and Daugava (Western Dvina) rivers became part of the Grand Duchy of Lithuania. In 1352, Poland and Lithuania divided the Kingdom of Galicia–Volhynia between themselves. In 1569, in accordance with the terms of the Union of Lublin between Poland and Lithuania, some of the Ukrainian lands passed to the Polish Crown. Between 1772 and 1795, many of the East Slavic territories became part of the Russian Empire in the course of the Partitions of Poland. In 1795 (the Third Partition of Poland), Poland lost formal independence. After the Congress of Vienna of 1814–1815, much of the territory of the Duchy of Warsaw was transferred to Russian control and became the autonomous Congress Poland (officially the Kingdom of Poland). After young Poles refused conscription to the Imperial Russian Army during the January Uprising of 1863, Tsar Alexander II stripped Congress Poland of its separate constitution, attempted to force general use of the Russian language and took away vast tracts of land from Poles. Congress Poland was incorporated more directly into imperial Russia by being divided into ten provinces, each with an appointed Russian military governor and all under complete control of the Russian Governor-General at Warsaw.In the aftermath of World War I, the map of Central and Eastern Europe changed drastically. The German Empire's defeat rendered obsolete Berlin's plans for the creation of Eastern European German-dominated states (Mitteleuropa), which included another rendition of the Kingdom of Poland. The Russian Empire collapsed, which resulted in the Russian Revolution and the Russian Civil War. The Russian state lost territory due to the German offensive and the Treaty of Brest-Litovsk, signed by the emergent Soviet Russia. Several nations of the region saw a chance for independence and seized their opportunity to gain it. With the defeat of Germany in the west and the withdrawal of German forces in the east, Soviet Russia disavowed the treaty and proceeded to recover many of the former territories of the Russian Empire. However, preoccupied with the civil war, it did not have the resources to react swiftly to the national rebellions.In November 1918, Poland became a sovereign state. Among the several border wars fought by the Second Polish Republic was the successful Greater Poland uprising (1918–1919) against Germany. The historic Polish–Lithuanian Commonwealth included vast territories in the east. They had been incorporated into the Russian Empire in 1772–1795 and had remained its parts, as the Northwest Territory, until World War I. After the war they were contested by the Polish, Russian, Ukrainian, Belarusian, Lithuanian, and Latvian interests.\nIn newly independent Poland, politics were strongly influenced by Józef Piłsudski. On 11 November 1918, Piłsudski was made head of Polish armed forces by the Regency Council, a body installed by the Central Powers. Subsequently, he was recognized by many Polish politicians as temporary chief of state and exercised in practice extensive powers. Under the Small Constitution of 20 February 1919, he became chief of state. As such, he reported to Legislative Sejm.\n\nWith the collapse of the Russian and German occupying authorities, virtually all of Poland's neighbours began fighting over borders and other issues. Finnish Civil War, Estonian War of Independence, Latvian War of Independence, and Lithuanian Wars of Independence had all been fought in the Baltic Sea region. Russia was overwhelmed by domestic struggles. In early March 1919, the Communist International was established in Moscow. The Hungarian Soviet Republic was proclaimed in March and the Bavarian Soviet Republic in April. Winston Churchill, in a conversation with Prime Minister David Lloyd George, commented sarcastically: \"The war of giants has ended, the wars of the pygmies begin.\" The Polish–Soviet War was the longest lasting of the international engagements.\nThe territory of what had become Poland had been a major battleground during World War I and the new country lacked political stability. It had won the hard-fought Polish–Ukrainian War against the West Ukrainian People's Republic by July 1919 but had already become embroiled in new conflicts with Germany (the 1919–1921 Silesian Uprisings) and the January 1919 border conflict with Czechoslovakia. Meanwhile, Soviet Russia focused on thwarting the counterrevolution and the 1918–1925 intervention by the Allied powers. The first clashes between Polish and Soviet forces occurred in autumn and winter 1918/1919, but it took a year and a half for a full-scale war to develop.The Western powers considered any significant territorial expansion of Poland, at the expense of Russia or Germany, to be highly disruptive to the post-World War I order. Among other factors, the Western Allies did not want to give the disgruntled Germany and Russia a reason to conspire together. The rise of the unrecognized Bolshevik regime complicated this rationale.The Treaty of Versailles, signed on 28 June 1919, regulated Poland's western border. The Paris Peace Conference (1919–1920) had not made a definitive ruling in regard to Poland's eastern border, but it issued a provisional boundary in December 1919, known as the Curzon Line. It was an attempt to define the areas that had an \"indisputably Polish ethnic majority\" and Poland was prohibited from organizing its administration east of that line (along the Bug and San Rivers. All of it was tentative, contingent on Western powers' future negotiations with White Russia, presumed to prevail in the Russian Civil War. Piłsudski and his allies blamed Prime Minister Ignacy Paderewski for this outcome and caused his dismissal. Paderewski, embittered,  withdrew from politics.The leader of Russia's new Bolshevik government, Vladimir Lenin, aimed to regain control of the territories abandoned by Russia in the Treaty of Brest-Litovsk in March 1918 (the treaty was annulled by Russia on 13 November 1918) and to set up Soviet governments in the emerging countries in the western parts of the former Russian Empire. The more ambitious goal was to also reach Germany, where he expected a socialist revolution to break out. He believed that Soviet Russia could not survive without the support of a socialist Germany. By the end of summer 1919, the Soviets had taken over most of eastern and central Ukraine (formerly parts of the Russian Empire) and driven the Directorate of Ukraine from Kiev. In February 1919, they set up the Socialist Soviet Republic of Lithuania and Belorussia (Litbel). The government there was very unpopular because of the terror it had imposed and the collection of food and goods for the army. Officially, the Soviet government denied charges of trying to invade Europe.As the Polish–Soviet War progressed, particularly while Poland's Kiev Offensive was being repelled in June 1920, Soviet policymakers, including Lenin, increasingly saw the war as the opportunity to spread the revolution westward. According to the historian Richard Pipes, the Soviets had prepared for their own strike against Galicia (the disputed eastern part of which had been acquired by Poland in the course of the Polish–Ukrainian War of 1918–1919) already before the Kiev Offensive.From late 1919, Lenin, encouraged by the Red Army's civil war victories over the White Russian anti-communist forces and their Western allies, began to envision the future of world revolution with greater optimism. The Bolsheviks proclaimed the need for the dictatorship of the proletariat and agitated for a worldwide communist community. They intended to link the revolution in Russia with a communist revolution in Germany they had hoped for and to assist other communist movements in Europe. To be able to provide direct physical support to revolutionaries in the West, the Red Army would have to cross the territory of Poland.According to Aviel Roshwald, (Piłsudski) \"hoped to incorporate most of the territories of the defunct Polish–Lithuanian Commonwealth into the future Polish state by structuring it as the Polish-led, multinational federation.\" Piłsudski had wanted to break up the Russian Empire and set up the Intermarium federation of nominally independent states: Poland, Lithuania, Belarus, Ukraine and other Central and East European countries that emerged from the crumbling empires after World War I. In Piłsudski's vision, Poland would replace a truncated and vastly reduced Russia as the great power of Eastern Europe. His plan excluded negotiations prior to military victory. He had hoped that the new Poland-led union would become a counterweight to any potential imperialist intentions of Russia or Germany. Piłsudski believed that there could be no independent Poland without a Ukraine free of Russian control, thus his main interest was in splitting Ukraine from Russia. He used military force to expand the Polish borders in Galicia and Volhynia and crush a Ukrainian attempt at self-determination in the disputed territories east of the Curzon Line, which contained a significant Polish minority. On 7 February 1919, Piłsudski spoke on the subject of Poland's future frontiers: \"At the moment Poland is essentially without borders and all that we can gain in this regard in the west depends on the Entente – on the extent to which it may wish to squeeze Germany. In the east, it's a different matter; there are doors here that open and close and it depends on who forces them open and how far\". Polish military forces had thus set out to expand far in the eastern direction. As Piłsudski imagined, \"Closed within the boundaries of the 16th century, cut off from the Black Sea and Baltic Sea, deprived of land and mineral wealth of the South and South-east, Russia could easily move into the status of second-grade power. Poland, as the largest and strongest of the new states, could easily establish a sphere of influence stretching from Finland to the Caucasus\".Piłsudski's concepts appeared progressive and democratic in comparison with the rival National Democracy's idea of direct incorporation and Polonization of the disputed eastern lands, but he used his \"federation\" idea instrumentally. As he wrote to his close associate Leon Wasilewski in April 1919, (for now) \"I want to be neither an imperialist nor a federalist. ... Taking into account that, in this God's world, an empty talk of the brotherhood of people and nations as well as the American little doctrines seem to be winning, I gladly side with the federalists\". According to the historian Andrzej Chwalba, the differences between Piłsudski's vision of Poland and that of his rival National Democratic leader Roman Dmowski were more rhetorical than real. Piłsudski had made many obfuscating statements, but never specifically stated his views regarding Poland's eastern borders or political arrangements he intended for the region.According to the historian Sean McMeekin, following the Kiev Expedition, the operation and its leaders Piłsudski and Petliura had become convenient targets for Soviet propaganda, which was very effective also in the West. Of the two, the former was an avowed Polish imperialist, the latter a Cossack strongman, and both were reactionaries.\n\n\n=== Preliminary hostilities ===\nFrom late 1917, Polish revolutionary military units were formed in Russia. They were combined into the Western Rifle Division in October 1918. In summer 1918, a short-lived Polish communist government, led by Stefan Heltman, was established in Moscow. Both the military and civilian structures were meant to facilitate the eventual introduction of communism into Poland in the form of a Polish Soviet Republic.Given the precarious situation resulting from the withdrawal of German forces from Belarus and Lithuania and the expected arrival of the Red Army there, Polish Self-Defence had been organized in autumn 1918 around major concentrations of Polish population, such as Minsk, Vilnius and Grodno. They were based on the Polish Military Organisation and were recognized as part of the Polish Armed Forces by the decree of Polish Chief of State Piłsudski, issued on 7 December 1918.The German Soldatenrat of Ober Ost declared on 15 November that its authority in Vilnius will be transferred to the Red Army.In late autumn 1918, the Polish 4th Rifle Division fought the Red Army in Russia. The division operated under the authority of the Polish Army in France and General Józef Haller. Politically, the division fought under the Polish National Committee (KNP), recognized by the Allies as a temporary government of Poland. In January 1919, per Piłsudski's decision, the 4th Rifle Division became part of the Polish Army.The Polish Self-Defence forces were defeated by the Soviets at a number of locations. Minsk was taken by the Russian Western Army on 11 December 1918. The Socialist Soviet Republic of Byelorussia was declared there on 31 December. After three days of heavy fighting with the Western Rifle Division, the Self-Defence units withdrew from Vilnius on 5 January 1919. Polish-Soviet skirmishes continued in January and February.The Polish armed forces were hurriedly formed to fight in several border wars. Two major formations manned the Russian front in February 1919: the northern, led by General Wacław Iwaszkiewicz-Rudoszański, and the southern, under General Antoni Listowski.\n\n\n=== Polish–Ukrainian War ===\nOn 18 October 1918, the Ukrainian National Council was formed in eastern Galicia, still part of the Austro-Hungarian Empire; it was led by Yevhen Petrushevych. The establishment of a Ukrainian state there was proclaimed in November 1918; it had become known as the West Ukrainian People's Republic and it claimed Lviv as its capital. Because of Russia-related political considerations, the Ukrainian attempts failed to generate support of the Entente powers.Key buildings in Lviv were seized by the Ukrainians on 31 October 1918. On 1 November, Polish residents of the city counterattacked and the Polish–Ukrainian War began. Lviv was under Polish control from 22 November. To Polish politicians, the Polish claim to Lviv and eastern Galicia was indisputable; in April 1919, the Legislative Sejm unanimously declared that all of Galicia should be annexed by Poland. In April to June 1919, the Polish Blue Army of General Józef Haller arrived from France. It consisted of over 67,000 well-equipped and highly trained soldiers. The Blue Army helped drive the Ukrainian forces east past the Zbruch River and decisively contributed to the outcome of the war. The West Ukrainian People's Republic was defeated by mid-July and eastern Galicia had come under Polish administration. The destruction of the West Ukrainian Republic confirmed the belief held by many Ukrainians that Poland was the main enemy of their nation.From January 1919 fighting also took place in Volhynia, where the Poles faced the forces of the Ukrainian People's Republic led by Symon Petliura. The Polish offensive resulted in a takeover of the western part of the province. The Polish–Ukrainian warfare there was discontinued from late May, and in early September an armistice was signed.On 21 November 1919, after contentious deliberations, the Allied Supreme War Council mandated Polish control over eastern Galicia for 25 years, with guarantees of autonomy for the Ukrainian population. The Conference of Ambassadors, which replaced the Supreme War Council, recognized the Polish claim to eastern Galicia in March 1923.\n\n\n=== Polish intelligence ===\nBefore the war, Jan Kowalewski, a polyglot and amateur cryptographer, had managed to break the codes and ciphers of the army of the West Ukrainian People's Republic and, during his service in the Polish–Ukrainian War, of General Anton Denikin's White Russian forces. In August 1919, he became chief of the Polish General Staff's cryptography section in Warsaw. By early September, he had gathered a group of mathematicians from the University of Warsaw and the University of Lviv (most notably the founders of the Polish School of Mathematics – Stanisław Leśniewski, Stefan Mazurkiewicz and Wacław Sierpiński), who succeeded in breaking the Soviet Russian ciphers as well. During the Polish–Soviet War, the Polish decryption of Red Army radio messages made it possible to use Polish military forces efficiently against Soviet Russian forces and to win many individual battles, most importantly the 1920 Battle of Warsaw.\n\n\n== War ==\n\n\n=== Early progression of the conflict ===\n\nOn 5 January 1919 the Red Army took Vilnius, which led to the establishment of the Socialist Soviet Republic of Lithuania and Belorussia (Litbel) on 28 February. On 10 February, Soviet Russia's People's Commissar for Foreign Affairs Georgy Chicherin wrote to Polish Prime Minister Ignacy Paderewski, proposing resolution of matters of disagreement and establishment of relations between the two states. It was one of the series of notes exchanged by the two governments in 1918 and 1919. In February, Polish troops marched east to face the Soviets; the new Polish parliament declared the need to liberate \"the northeast provinces of Poland with their capital in Wilno\". After the German World War I troops had been evacuated from the region, the Battle of Bereza Kartuska, a Polish–Soviet skirmish, took place. It occurred during a local Polish offensive action of 13–16 February, led by General Antoni Listowski, near Byaroza, Belarus. The event has been presented as the beginning of the war of liberation by the Polish side, or of Polish aggression by the Russian side. By late February, the Soviet westward offensive had come to a halt. As the low-level warfare continued, the Polish units crossed the Neman River, took Pinsk on 5 March and reached the outskirts of Lida; on 4 March, Piłsudski ordered further movement to the east stopped. The Soviet leadership had become preoccupied with the issue of providing military assistance to the Hungarian Soviet Republic and with the Siberian offensive of the White Army, led by Alexander Kolchak.Fighting the Polish–Ukrainian War, by July 1919 Polish armies eliminated the West Ukrainian People's Republic. Secretly preparing an assault on Soviet-held Vilnius, in early April Piłsudski was able to shift some of the forces used in Ukraine to the northern front. The idea was to create a fait accompli and to prevent the Western powers from granting the territories claimed by Poland to White movement's Russia (the Whites were expected to prevail in the Russian Civil War).A new Polish offensive started on 16 April. Five thousand soldiers, led by Piłsudski, headed for Vilnius. Advancing to the east, the Polish forces  took Lida on 17 April, Novogrudok on 18 April, Baranavichy on 19 April and Grodno on 28 April. Piłsudski's group entered Vilnius on 19 April and captured the city after two days of fighting. The Polish action drove the Litbel government from its proclaimed capital.\n\nUpon the taking of Vilnius, in pursuit of his federation objectives, Piłsudski issued a \"Proclamation to the inhabitants of the former Grand Duchy of Lithuania\" on 22 April. It was sharply criticized by his rival National Democrats, who demanded direct incorporation of the former Grand Duchy lands by Poland and signaled their opposition to Piłsudski's territorial and political concepts. Piłsudski had thus proceeded to restore the historic territories of the Polish–Lithuanian Commonwealth by military means, leaving the necessary political determinations for later.On 25 April, Lenin ordered the Western Front commander to reclaim Vilnius as soon as possible. The Red Army formations that attacked the Polish forces were defeated by Edward Rydz-Śmigły's units between 30 April and 7 May. While the Poles further extended their holdings, the Red Army, unable to accomplish its objectives and facing intensified combat with the White forces elsewhere, withdrew from its positions.The Polish \"Lithuanian-Belarusian Front\" was established on 15 May and placed under command of General Stanisław Szeptycki.In a statute passed on 15 May, Polish Sejm called for the inclusion of the eastern borderline nations in the Polish state as autonomous entities. It was intended to make a positive impression on the participants of the Paris Peace Conference. At the conference, Prime Minister and Foreign Minister Ignacy Paderewski declared Poland's support for self-determination of the eastern nations, in line with Woodrow Wilson's doctrine and in an effort to secure Western support for Poland's policies in regard to Ukraine, Belarus and Lithuania.The Polish offensive was discontinued around the line of German trenches and fortifications from World War I, because of high likelihood of Poland's war with Germany over territorial and other issues. Half of Poland's military strength had been concentrated on the German front by mid-June. The offensive in the east was resumed at the end of June, following the Treaty of Versailles. The treaty, signed and ratified by Germany, preserved the status quo in western Poland.On the southern front in Volhynia, in May and in July the Polish forces confronted the Red Army, which was in process of pushing Petliura's Ukrainian units out of the contested territories. The rural Orthodox population there was hostile to the Polish authorities and actively supported the Bolsheviks. Also in Podolia and near the eastern reaches of Galicia, the Polish armies kept slowly advancing to the east until December. They crossed the Zbruch River and displaced Soviet forces from a number of localities.The Polish forces took Minsk on 8 August. The Berezina River was reached on 18 August. On 28 August, tanks were deployed for the first time and the town of Babruysk was captured. By 2 September, Polish units reached the Daugava River. Barysaw was taken on 10 September and parts of Polotsk on 21 September. By mid-September, the Poles secured the region along the Daugava from the Dysna River to Daugavpils. The frontline had also extended south, cutting through Polesia and Volhynia; along the Zbruch River it reached the Romanian border. A Red Army assault between the Daugava and Berezina Rivers was repelled in October and the front had become relatively inactive with sporadic encounters only, as the line designated by Piłsudski to be the goal of the Polish operation in the north was reached.In autumn 1919, the Sejm voted to incorporate into Poland the conquered territories up to the Daugava and Berezina Rivers, including Minsk.The Polish successes in summer 1919 resulted from the fact that the Soviets prioritized the warfare with the White forces, which was more crucial for them. The successes created an illusion of Polish military prowess and Soviet weakness. As Piłsudski put it, \"I am not worried about the strength of Russia; if I wanted to, I could go now, say to Moscow, and no one would be able to resist my power ...\". The offensive was restrained in late summer by Piłsudski, because he did not want to improve the strategic situation of the advancing Whites.In early summer 1919, the White movement had gained the initiative and its forces, commanded by Anton Denikin and known as the Volunteer Army, marched on Moscow. Piłsuski refused to join the Allied intervention in the Russian Civil War, because he considered the Whites more threatening to Poland than the Bolsheviks. Piłsudski, who engaged in warfare with Soviet Russia from the beginning of his tenure as Polish commander-in-chief, underestimated the strength of the Bolsheviks. He thought he could get a better deal for Poland from the Bolsheviks than from the Whites, who represented, in his opinion, the old Russian imperial policies, hostile to strong Poland and Ukraine independent from Russia, Piłsudski's main objectives. The Bolsheviks had proclaimed the partitions of Poland to be invalid and declared their support for self-determination of the Polish nation. Piłsudski thus speculated that Poland would be better off with the internationalist Bolsheviks, who were also alienated from the Western powers, than with the restored Russian Empire, its traditional nationalism, and its partnership with Western politics. By his refusal to join the attack on Lenin's struggling government, he ignored strong pressure from the Triple Entente leaders and possibly saved the Bolshevik government in summer to fall 1919, although a full-scale attack by the Poles to support Denikin would not have been possible. Mikhail Tukhachevsky later commented on the likely disastrous consequences for the Bolsheviks if the Polish government undertook military cooperation with Denikin at the time of his advance on Moscow. In a book he later published, Denikin pointed at Poland as the savior of the Bolshevik power.Denikin twice appealed to Piłsudski for help, in summer and in autumn 1919. According to Denikin, \"The defeat of the south of Russia will make Poland face the power that will become a calamity for the Polish culture and will threaten the existence of the Polish state\". According to Piłsudski, \"The lesser evil is to facilitate a White Russia's defeat by Red Russia. ... with any Russia we fight for Poland. Let all that filthy West talk all they want; we're not going to be dragged into and used for the fight against the Russian revolution, quite to the contrary, in the name of permanent Polish interests we want to make it easier for the revolutionary army to act against the counter-revolutionary army.\" On 12 December, the Red Army pushed Denikin out of Kiev.The self-perceived interests of Poland and White Russia were irreconcilable. Piłsudski wanted to break up Russia and create a powerful Poland. Denikin, Alexander Kolchak and Nikolai Yudenich wanted territorial integrity for the \"one, great and indivisible Russia\". Piłsudski held the Bolshevik military forces in low regard and thought of Red Russia as easy to defeat. The victorious in the civil war communists were going to be pushed far to the east and deprived of Ukraine, Belarus, the Baltic lands, and the southern Caucasus; they would no longer constitute a threat to Poland.\n\nFrom the beginning of the conflict, many peace initiatives had been declared by the Polish and Russian sides, but they were intended as cover or stalling for time, as each side concentrated on military preparations and moves. One series of Polish-Soviet negotiations commenced in Białowieża after the termination of the summer 1919 military activities; they were moved in early November 1919 to Mikashevichy. Piłsudski's associate Ignacy Boerner met there with Lenin's emissary Julian Marchlewski. Buoyed by their armies' successes in the Russian Civil War, the Soviet government rejected the tough Polish armistice conditions in December. Piłsudski broke off the Mikashevichy talks two days after the Soviet takeover of Kiev, but major military operations had not been resumed. Early in the talks, Boerner informed Marchlewski that Poland had no intention of renewing its offensive; it allowed the Soviets to move forty-three thousand troops from the Polish front to fight Denikin.The only exception to the Polish policy of front stabilization since autumn 1919 was the winter attack on Daugavpils. Edward Rydz-Śmigły's previous attempts to capture the city in summer and early autumn had been unsuccessful. A secret political and military pact regarding a common attack on Daugavpils was signed between representatives of Poland and the Latvian Provisional Government on 30 December. On 3 January 1920, Polish and Latvian forces (30,000 Poles and 10,000 Latvians) commenced a joint operation against the surprised enemy. The Bolshevik 15th Army withdrew and had not been pursued; the fighting terminated on 25 January. The taking of Daugavpils was accomplished primarily by the 3rd Legions Infantry Division under Rydz-Śmigły. Afterwards, the town and its vicinity were handed over to the Latvians. The outcome of the campaign disrupted communications between Lithuanian and Russian forces. A Polish garrison was stationed in Daugavpils until July 1920. Simultaneously, the Latvian authorities pursued peace negotiations with the Soviets, which resulted in the signing of a preliminary armistice. Piłsudski and the Polish diplomacy were not notified and had not been aware of this development.The fighting in 1919 resulted in the formation of a very long frontline, which, according to the historian Eugeniusz Duraczyński, favored Poland at this stage.In late 1919 and early 1920, Piłsudski undertook his gargantuan task of breaking up Russia and creating the Intermarium bloc of countries. Given the refusal of Lithuania and other eastern Baltic region countries to participate in the project, he set his sights on Ukraine.On 4 March 1920, General Władysław Sikorski initiated a new offensive in Polesia; the Polish forces had driven a wedge between Soviet forces to the north (Belarus) and south (Ukraine). The Soviet counter-offensive in Polesia and Volhynia was pushed back.Polish–Russian peace negotiations, attempted in late March 1920, produced no results. Piłsudski, in particular, was not interested in a negotiated solution to the conflict. Preparations for a large-scale resumption of hostilities were being finalized and the marshal and his circle expected the planned new offensive to lead to the fulfillment of his federalist ideas.\n\n\n=== Piłsudski's alliance with Petliura ===\n\nHaving resolved Poland's armed conflicts with the emerging Ukrainian states to Poland's satisfaction, Piłsudski was finally able to work on a Polish–Ukrainian alliance against Russia. The Treaty of Warsaw, Piłsudski's agreement with Hetman Symon Petliura, the exiled Ukrainian nationalist leader, and two other members of the Directorate of Ukraine, was signed on 21 April 1920. It appeared to be Piłsudski's major success, potentially signifying the beginning of a successful implementation of his long-held designs. Petliura, who formally represented the government of the Ukrainian People's Republic, which had de facto been defeated by the Bolsheviks, fled with some Ukrainian troops to Poland, where he found political asylum. His control extended only to a sliver of land near the Polish-controlled areas. Petliura had therefore little choice but to accept the Polish offer of alliance, largely on Polish terms, as determined by the outcome of the recent warfare between the two nations.By concluding an agreement with Piłsudski, Petliura accepted the Polish territorial gains in western Ukraine and the future Polish–Ukrainian border along the Zbruch River. In exchange for renouncing the Ukrainian claim to eastern Galicia, he was promised independence for Ukraine and Polish military assistance in reinstating his government in Kiev. Given the powerful opposition against Piłsudski's eastern policy in war-tired Poland, the negotiations with Petliura were conducted in secrecy and the text of the 21 April agreement remained secret. Poland recognized in it Ukraine's right to parts of the former Polish–Lithuanian Commonwealth (before 1772) east of the Zbruch. A military convention was added on 24 April; it placed Ukrainian units under Polish command.For Piłsudski, the alliance gave his campaign for the Intermarium federation an actual starting point and potentially the most important federation partner, satisfied his demands regarding parts of Polish eastern border relevant to the proposed Ukrainian state and laid a foundation for a Polish-dominated Ukrainian state between Russia and Poland. According to Richard K. Debo, while Petliura could not contribute real strength to the Polish offensive, for Piłsudski the alliance provided some camouflage for the \"naked aggression involved\". For Petliura, it was the final chance to preserve the Ukrainian statehood and at least a theoretical independence of the Ukrainian heartlands, despite his acceptance of the loss of West Ukrainian lands to Poland.\nRegarding the deal they had concluded, both leaders encountered strong opposition in their respective countries. Piłsudski faced stiff opposition from Roman Dmowski's National Democrats, who opposed Ukrainian independence. To protest the alliance and the upcoming war over Ukraine, Stanisław Grabski resigned the chairmanship of the foreign affairs committee in Polish parliament, where the National Democrats were a dominant force (their approval would be needed to finalize any future political settlement). Petliura was criticised by many Ukrainian politicians for entering a pact with the Poles and for abandoning western Ukraine (after the destruction of the West Ukrainian People's Republic, western Ukraine was – from their point of view – occupied by Poland).The alliance with Petlura gave Poland 15,000 allied Ukrainian troops at the beginning of the Kiev campaign, which increased to 35,000 by recruitment and from Soviet deserters during the war. According to Chwalba, there were only 22,488 Ukrainian soldiers on the Polish food ration list as of 1 September 1920.\n\n\n=== From Kiev Offensive to armistice ===\n\n\n==== Polish forces ====\n\nThe Polish Army was made up of soldiers who had served in the armies of the partitioning empires (especially professional officers), as well as many new enlistees and volunteers. The soldiers had come from different armies, formations, backgrounds and traditions. While veterans of Piłsudski's Polish Legions and the Polish Military Organisation formed a privileged stratum, integrating the Greater Poland Army and the Polish Army from France into the national force presented many challenges. The unification of the Greater Poland Army led by General Józef Dowbor-Muśnicki (a highly regarded force of 120,000 soldiers), and the Polish Army from France led by General Józef Haller, with the main Polish Army under Józef Piłsudski, had been finalized on 19 October 1919 in Kraków, in a symbolic ceremony.Within the young Polish state whose continuous existence was uncertain, members of many groups resisted conscription. For example, Polish peasants and small town dwellers, Jews, or Ukrainians from Polish-controlled territories tended to avoid service in Polish armed forces for different reasons. The Polish military was overwhelmingly ethnically Polish and Catholic. The intensifying desertion problem in summer 1920 led to the introduction of death penalty for desertion in August. The summary military trials and the executions often took place on the same day.Female soldiers functioned as members of the Voluntary Legion of Women; they were normally assigned auxiliary duties. A system of military training for officers and soldiers was established with significant help from the French Military Mission to Poland.The Polish Air Force had about two thousand planes, mostly old. 45% of them had been captured from the enemy. Only two hundred could be airborne at any given time. They were used for various purposes including combat, but mostly for reconnaissance. 150 French pilots and navigators flew as part of the French Mission.According to Norman Davies, estimating the strength of the opposing sides is difficult and even generals often had incomplete reports of their own forces.The Polish forces grew from approximately 100,000 by the end of 1918 to over 500,000 in early 1920. Before the Battle of Warsaw, the army reached the total strength of about one million soldiers, including 100,000 volunteers.The Polish armed forces were aided by military members of Western missions, especially the French Military Mission. Poland was supported, in addition to the allied Ukrainian forces (over twenty thousand soldiers), by Russian and Belarusian units and volunteers of many nationalities. Twenty American pilots served in the Kościuszko Squadron.Russian anti-Bolshevik units fought on the Polish side. About one thousand White soldiers fought in summer 1919. The largest Russian formation was sponsored by the Russian Political Committee represented by Boris Savinkov and commanded by General Boris Permikin. The \"3rd Russian Army\" reached over ten thousand battle-ready soldiers and in early October 1920 was dispatched to the front to fight on the Polish side; they did not engage in combat because of the armistice that took effect at that time. Six thousand soldiers fought valiantly on the Polish side in the \"Cossack\" Russian units from 31 May 1920. Various smaller Belarusian formations fought in 1919 and 1920. However, the Russian, Cossack and Belarusian military organizations had their own political agendas and their participation has been marginalized or omitted in the Polish war narrative.Soviet losses and the spontaneous enrollment of Polish volunteers allowed rough numerical parity between the two armies; by the time of the Battle of Warsaw, the Poles may have had gained a slight advantage in numbers and logistics. One of the major formations on the Polish side was the First Polish Army.\n\n\n==== Red Army ====\n\nIn early 1918, Lenin and Leon Trotsky embarked on the rebuilding of the Russian armed forces. The new Red Army was established by the Council of People's Commissars (Sovnarkom) on 28 January, to replace the demobilized Imperial Russian Army. Trotsky became commissar of war on 13 March and Georgy Chicherin took over Trotsky's previous job as foreign minister. On 18 April, the Commissar Bureau was created; it initiated the practice of assigning political commissars to military formations. One million German soldiers occupied the western Russian Empire, but on 1 October, after the first indications of German defeat in the West, Lenin ordered general conscription with the intention of building a multi-million member army. While over 50,000 former tsarist officers had joined the White Volunteer Army, 75,000 of them ended up in the Bolshevik Red Army by summer 1919.The Revolutionary Military Council of the Russian Republic was established in September 1918. It was chaired by Trotsky. Trotsky lacked military experience or expertise, but knew how to mobilize troops and was a master of war propaganda. Revolutionary war councils of particular fronts and armies were placed under the council of the republic. The system was intended as implementation of the concept of collective leadership and management of military affairs.The Red Army's chief commander, from July 1919, was Sergey Kamenev; he was installed by Stalin. Kamenev's Field Staff was led by former tsarist generals. His every decision had to be approved by the Military Council. The actual command center was placed in an armored train, used by Trotsky to travel around the front areas and coordinate military activity.Hundreds of thousands of recruits deserted from the Red Army, which resulted in 600 public executions in the second half of 1919. The army, however, conducting operations on several fronts, had remained an effective fighting force.Officially, there were five million soldiers in the Red Army as of 1 August 1920, but only 10 or 12 percent of them could be counted as the actual fighting force. Female volunteers served in combat on the same basis as men, also in Budyonny's 1st Cavalry Army. The Red Army was particularly week in the areas of logistics, supplies, and communication. Great quantities of Western arms had been captured from the White and Allied forces and domestic production of military equipment kept increasing throughout the war. Still, the stocks were often critically short. As in the Polish Army, boots had been in short supply and many fought barefoot. There were relatively few Soviet airplanes and the Polish air formations soon came to dominate the air space.When the Poles launched their Kiev Offensive, the Russian Southwestern Front had about 83,000 Soviet soldiers, including 29,000 front-line troops. The Poles had some numerical superiority, which was estimated from 12,000 to 52,000 personnel. During the Soviet counter-offensive in mid-1920, on all fronts, the Soviets numbered about 790,000, at least 50,000 more than the Poles. Mikhail Tukhachevsky estimated that he had 160,000 combat ready soldiers, while Piłsudski estimated Tukhachevsky's forces at 200,000–220,000.In 1920, the Red Army personnel numbered 402,000 on the Soviet Western Front and 355,000 on the Southwestern Front in Galicia, according to Davies. Grigori F. Krivosheev gives 382,071 personnel for the Western Front and 282,507 personnel for the Southwestern Front between July and August.After the reorganization of the Western Rifle Division in mid-1919, there were no separate Polish units within the Red Army. Within both the Western and the Southwestern Fronts, besides the Russian units, there had been separate Ukrainian, Latvian, and German–Hungarian units. In addition, many communists of various nationalities, for example the Chinese, fought in integrated units. The Lithuanian Army supported the Soviet forces to some degree.Among the commanders leading the Red Army offensive were Semyon Budyonny, Leon Trotsky, Mikhail Tukhachevsky (the new commander of the Western Front), Alexander Yegorov (the new commander of the Southwestern Front) and Joseph Stalin.\n\n\n==== Logistics and plans ====\nLogistics were very bad for both armies and were supported by whatever equipment was left over from World War I or could be captured. The Polish Army, for example, used guns made in five countries and rifles manufactured in six, each of which used different ammunition. The Soviets had at their disposal many military depots that were left by the German armies after their withdrawal in 1918–1919, and modern French armaments that were captured in great numbers from the White Russians and the Allied expeditionary forces during the Russian Civil War. Still, they suffered a shortage of arms, as both the Red Army and the Polish forces were grossly underequipped by Western standards.However, the Red Army had at its disposal an extensive arsenal as well as fully functional armament industry concentrated in Tula, both inherited from tsarist Russia. In Poland, there were no firearm factories and everything, including rifles and ammunition, had to be imported. Gradual progress in the area of military manufacturing had been made and after the war there were in Poland 140 industrial establishments producing military items.The Polish–Soviet was fought not by trench warfare but by maneuverable formations. The total front was 1500 km (over 900 mi) long and was manned by relatively small amounts of troops. Around the time of the Battle of Warsaw and afterwards, the Soviets suffered from overly long transportation lines and had been unable to supply their forces in a timely manner.By early 1920, the Red Army had been very successful against the White movement. In January 1920, the Soviets began concentrating forces on the Polish northern front, along the Berezina River. British Prime Minister David Lloyd George ordered the Baltic Sea blockade of Soviet Russia lifted. Estonia signed with Russia the Treaty of Tartu on 3 February, recognizing the Bolshevik government. European arms merchants proceeded with supplying the Soviets with items needed by the military, for which the Russian government paid with gold and valuables taken from the imperial stock and confiscated from individuals.From early 1920, both the Polish and Soviet sides had prepared for decisive confrontations. However, Lenin and Trotsky had not yet been able to dispose of all the White forces, including especially the army of Pyotr Wrangel, threatening them from the south. Piłsudski, unconstrained by such limitations, was able to attack first. Convinced that the Whites were no longer a threat to Poland, he resolved to take care of the remaining enemy, the Bolsheviks. The plan for the Kiev Expedition was to beat the Red Army on Poland's southern flank and to install the pro-Polish Petliura government in Ukraine.Victor Sebestyen, author of a 2017 biography of Lenin, wrote: \"The newly independent Poles started the war. With England and France's backing, they invaded Ukraine in spring 1920.\" Some Allied leaders had not supported Poland, including former British Prime Minister H. H. Asquith, who called the Kiev Expedition \"a purely aggressive adventure, a wanton enterprise\". Sebestyen characterized Piłsudski as a \"Polish nationalist, not a socialist\".\n\n\n==== Kiev Offensive ====\n\nOn 17 April 1920, the Polish General Staff ordered the armed forces to assume attack positions. The Red Army, which had been regrouping since 10 March, was not fully ready for combat.On 25 April, the southern group of Polish armies under Piłsudski's command commenced an offensive in the direction of Kiev. Its stated goal was the creation of a formally independent Ukraine, which would separate Poland from Russia. The Polish forces were assisted by 15,000 Ukrainian soldiers under Petliura, who represented the Ukrainian People's Republic.On 26 April, in his \"Call to the People of Ukraine\", Piłsudski told his intended audience that \"the Polish Army would only stay as long as necessary until a legal Ukrainian government took control over its own territory\". However, although many Ukrainians were anti-communist, many were anti-Polish and resented the Polish advance.\n\nThe Polish 3rd Army quickly overpowered the Red Army in Ukraine. The Soviet 12th and 14th Armies had for the most part declined to engage in combat and suffered limited losses; they withdrew or were pushed past the Dnieper River. On 7 May, the combined Polish–Ukrainian forces, led by Edward Rydz-Śmigły, encountered only token resistance as they entered Kiev, mostly abandoned by the Soviet military.In the north, Mikhail Tukhachevsky resolved to launch an offensive on the Belarusian front before Polish troops arrive (according to the Polish plans) from the Ukrainian front. On 14 May, his forces attacked the weaker Polish armies there and penetrated the Polish-held areas (territories between the Daugava and the Berezina Rivers) to the depth of 180 kilometers. Because of the energetic Polish counter-offensive led by Kazimierz Sosnkowski and Leonard Skierski, the Poles recovered the bulk of the lost territory. From 8 June, the front had stabilised near the Avuta River and remained inactive until July.\n\nThis Polish thrust into Ukraine was met with Red Army counterattacks from 29 May. Alexander Yegorov, commander of the Russian Southwestern Front, received considerable reinforcements and initiated an assault maneuver in the Kiev area.Semyon Budyonny's 1st Cavalry Army (Konarmia) conducted repeated attacks and broke the Polish–Ukrainian front on 5 June. The Soviets deployed mobile cavalry units to disrupt the Polish rearguard and target communications and logistics. By 10 June, the Polish armies were in retreat along the entire front. General Rydz-Śmigły, with the Polish and Ukrainian troops under his command, abandoned Kiev (the city was not being attacked) to the Red Army.\n\n\n==== Soviet victories ====\nOn 29 April 1920, the Central Committee of the Bolshevik Communist Party of Russia appealed for volunteers for the war with Poland, to defend the Russian republic against a Polish usurpation. The first units of the volunteer army departed Moscow and headed for the front on 6 May. On 9 May, the Soviet newspaper Pravda printed an article \"Go West!\" (Russian: На Запад!): \"Through the corpse of White Poland lies the way to the World Inferno. On bayonets, we will carry happiness and peace to working humanity\". On 30 May 1920 General Aleksei Brusilov, the last tsarist commander-in-chief, published in Pravda an appeal \"To all former officers, wherever they may be\", encouraging them to forgive past grievances and join the Red Army. Brusilov considered it a patriotic duty of all Russian officers to enlist with the Bolshevik government, which he thought to be defending Russia against foreign invaders. Lenin understood the importance of the appeal to Russian nationalism. The Soviet Russia's counteroffensive was indeed boosted by Brusilov's involvement: 14,000 officers and over 100,000 soldiers of lower ranks enlisted in or returned to the Red Army; thousands of civilian volunteers contributed to the war effort as well.\n\nEdward Rydz-Śmigły, commander of the Polish 3rd Army in Ukraine, wanted to break through the Soviet lines and move in the northwestern direction. However, although the Polish forces in Ukraine managed to withdraw relatively unscathed, they remained tied down in the western part of it. They could not support the Polish northern front and reinforce, as planned by Piłsudski, the defences at the Avuta River for the decisive battle there.Poland's 320 km (200 mi) northern front was manned by a thin line of 120,000 troops, backed by some 460 artillery pieces, with no strategic reserves. This approach to holding ground harked back to the World War I practice of establishing a fortified line of defense. The Polish–Soviet front, however, bore little resemblance to that war's conditions, as it was weakly manned, supported with inadequate artillery, and had almost no fortifications. Such arrangement allowed the Soviets to attain numerical superiority at strategically crucial locations.\n\nAgainst the Polish line, the Red Army gathered its Western Front led by the young General Mikhail Tukhachevsky. Its numbers exceeded 108,000 infantry and 11,000 cavalry, supported by 722 artillery pieces and 2,913 machine guns.A massive Soviet offensive was launched on 4 July along the Smolensk–Brest axis and crossed the Avuta and the Berezina Rivers. The northern 3rd Cavalry Corps, led by Hayk Bzhishkyan, enveloped the Polish forces from the north and moved near the Lithuanian and Prussian border. The 4th, 15th and 3rd Armies pushed to the west, supported from the south by the 16th Army and the Mozyr Group. For three days the outcome of the battle hung in the balance, but by 7 July the Polish forces were in full retreat along the entire front.On 9 July, Lithuania's talks with the Soviets commenced. The Lithuanians launched a series of attacks against the Poles and disorganized the planned relocation of Polish forces.\n\nPolish resistance was offered again on the line of old German trenches and fortifications from World War I; it presented an opportunity to stem the Red Army offensive, but there were too few Polish troops. The Soviet forces found a weakly defended part of the front and broke through. Polish troops withdrew from Minsk on 11 July. Bzhishkyan's units together with Lithuanian forces captured Vilnius on 14 July and the Poles had to retreat again. To the south, in eastern Galicia, Budyonny's cavalry advanced far into the Polish rear, captured Brody and approached Lviv and Zamość. It had become clear to the Poles that the Soviet objectives were not limited to pushing their borders westward but that Poland's very independence was at stake.The Soviet armies moved toward the west at a remarkable speed. Grodno fell on 22 July, Białystok on 28 July, and Brest on 29 July. A Polish counteroffensive Piłsudski aimed for was thwarted by the unexpected fall of Brest. The Polish forces attempted to defend the Bug River line with the 4th Army and Grupa Poleska units but they delayed the Red Army's advance for only one week. The Brest Fortress, headquarters of the planned Polish counteroffensive, fell to the 16th Army in the first attack. After crossing the Narew River on 2 August, the Western Front was only 97 kilometres (60 mi) from Warsaw.\n\nThe Southwestern Front pushed the Polish forces out of most of Ukraine. Stalin thwarted Sergey Kamenev's orders and directed the formations under Budyonny's command to close on Zamość and Lviv, the largest city in eastern Galicia and garrison of the Polish 6th Army. The protracted Battle of Lviv began in July 1920. Stalin's action was detrimental to the situation of the forces of Tukhachevsky in the north, since Tukhachevsky needed relief from Budyonny near Warsaw, where in August decisive battles were fought. Instead of performing a concentric attack on Warsaw, the two Soviet fronts were getting further apart. Piłsudski used the resulting void to launch his counteroffensive on 16 August, during the Battle of Warsaw.Fighting the Battle of Brody in the second half of July and early August, the Polish forces attempted to stop Budyonny's advance on Lviv, but the effort was terminated by Piłsudski, who mustered two divisions to take part in the approaching Battle of Warsaw.On 1 August 1920, Polish and Soviet delegations met at Baranavichy and exchanged notes, but their armistice talks produced no results.\n\n\n==== Diplomatic front ====\n\nThe Western Allies were critical of Polish politics and unhappy with Poland's refusal to cooperate with the Allied intervention in the Russian Civil War, but they supported the Polish forces fighting the Red Army nevertheless, shipping to Poland armaments, extending credits and supporting the country politically. France was especially disappointed, but also particularly interested in defeating the Bolsheviks, so Poland was a natural ally in this respect. British politicians represented a gamut of opinions on the Polish–Russian issue, but many were highly critical of Polish policies and actions. In January 1920, the United States Secretary of War Newton D. Baker accused Poland of conducting imperial politics at the expense of Russia. In early spring 1920 the Allies, irritated by the Polish conduct, considered the idea of transferring the lands east of the Bug River to Allied control, under auspices of the League of Nations.In autumn 1919, the British government of Prime Minister David Lloyd George agreed to provide arms for Poland. On 17 May 1920, following the Polish takeover of Kiev, the cabinet spokesman asserted in the House of Commons that \"no assistance has been or is being given to the Polish government\".The initial success of the Kiev Expedition caused enormous euphoria in Poland and Piłsudski's leading role was recognized by most politicians. However, with the tide turning against Poland, Piłsudski's political power weakened, and that of his opponents, including Roman Dmowski, rose. The government of Leopold Skulski, Piłsudski's ally, resigned in early June. After prolonged bickering, an extra-parliamentary government of Władysław Grabski was appointed on 23 June 1920.As the Soviet armies advanced, the Soviet leadership's confidence soared. In a telegram, Lenin exclaimed, \"We must direct all our attention to preparing and strengthening the Western Front. A new slogan must be announced: Prepare for war against Poland\". The Soviet communist theorist Nikolai Bukharin, writing for the newspaper Pravda, wished for the resources to carry the campaign beyond Warsaw, \"right up to London and Paris\". According to General Tukhachevsky's exhortation, \"Over the corpse of White Poland lies the path to world conflagration ... On to ... Warsaw! Forward!\" As the victory seemed more certain to them, Stalin and Trotsky engaged in political intrigues and argued about the direction of main Soviet offensive.At the height of the Polish–Soviet conflict, Jews were subjected to antisemitic violence by Polish forces, who considered them a potential threat and often accused of supporting the Bolsheviks. The perpetrators of the pogroms that took place were motivated by Żydokomuna accusations. During the Battle of Warsaw, the Polish authorities interned Jewish soldiers and volunteers and sent them to an internment camp.To counter the immediate Soviet threat, national resources were urgently mobilized in Poland and competing political factions declared unity. On 1 July, the Council of Defense of the State was appointed. On 6 July Piłsudski was outvoted in the council, which resulted in the trip of Prime Minister Grabski to the Spa Conference in Belgium made to request Allied assistance for Poland and their mediation in setting up peace negotiations with Soviet Russia. The Allied representatives were largely unresponsive to Polish demands. On 10 July, Grabski signed an agreement containing several terms as required by the Allies: Polish forces would withdraw to the Curzon Line, which delineated Poland's eastern ethnographic frontier and was published by the Allies in December 1919; Poland would participate in a subsequent peace conference; and the questions of sovereignty over Vilnius, Eastern Galicia, Cieszyn Silesia and Danzig would be left up to the Allies. Vague promises of Allied support were made in exchange.\n\nOn 11 July 1920, the British government sent a telegram to the Soviets that was signed by George Curzon and has been described as a de facto ultimatum. It requested the Soviets to halt their offensive at the Curzon Line and to accept it as a temporary border with Poland until a permanent border could be established in negotiations. In case of a Soviet refusal, the British threatened to assist Poland with all means available. The 17 July Soviet response rejected all British mediation and declared willingness to negotiate only directly with Poland.The Second Congress of the Communist International deliberated in Moscow between 19 July and 7 August 1920. Lenin spoke of the increasingly favorable odds for the accomplishment of the World Proletarian Revolution which would lead to an establishment of the World Soviet Republic and the delegates eagerly followed daily reports from the front. The congress issued an appeal to workers in all countries, asking them to forestall their governments' efforts to aid \"White\" Poland.Piłsudski lost another vote at the Defense Council and on 22 July the government dispatched a delegation to Moscow to ask for armistice talks. The Soviets claimed interest in peace negotiations only, the subject the Polish delegation was not authorized to discuss.Sponsored by the Soviets, the Provisional Polish Revolutionary Committee (Polrewkom) was formed on 23 July to organise the administration of Polish territories captured by the Red Army. The committee was led by Julian Marchlewski; Feliks Dzierżyński and Józef Unszlicht were among its members. They found little support in Soviet-controlled Poland. On 30 July in Białystok, the Polrewkom decreed the end of the Polish \"gentry–bourgeoisie\" government.  At Polrewkom's Białystok rally on 2 August, its representatives were greeted on behalf of Soviet Russia, the Bolshevik party and the Red Army by Mikhail Tukhachevsky. The Galician Revolutionary Committee (Galrewkom) was established already on 8 July.On 24 July, the all-party Polish Government of National Defense under Wincenty Witos and Ignacy Daszyński was established. It eagerly adopted a radical program of land reform meant to counter Bolshevik propaganda (the scope of the promised reform was greatly reduced once the Soviet threat had receded). The government attempted to conduct peace negotiations with Soviet Russia; a new Polish delegation tried to cross the front and establish contact with the Soviets from 5 August. On 9 August, General Kazimierz Sosnkowski became Minister of Military Affairs.The Soviets presented their armistice conditions to the Allies on 8 August in Britain. Sergey Kamenev issued assurances of Soviet recognition of Poland's independence and right to self-determination, but the conditions he presented amounted to a surrender of the Polish state. Prime Minister David Lloyd George and the British House of Commons approved the Soviet demands as just and reasonable and the British ambassador in Warsaw presented Britain's categorical advice on that matter to Foreign Minister Eustachy Sapieha. On 14 August, the Polish delegation finally went to Tukhachevsky's headquarters in Minsk for the official peace talks. Severe conditions for peace were presented to them by Georgy Chicherin on 17 August. Decisive battles were already taking place on the outskirts of Warsaw. Most foreign deputations and Allied missions had left the Polish capital and went to Poznań.On 6 August, the British Labour Party printed in a pamphlet that British workers would not take part in the war as Poland's allies. The labour unions blocked supplies to the expeditionary force assisting the Russian Whites in Arkhangelsk. The French Section of the Workers' International declared in its newspaper L'Humanité: \"Not a man, not a sou, not a shell for the reactionary and capitalist Poland. Long live the Russian Revolution! Long live the Workers' International!\". Poland also suffered from sabotage and delays in deliveries of war supplies when Czechoslovak and German workers refused to transit such materials to Poland. Germany, Austria and Belgium banned transit of materials destined for Poland through their territories. In Gdańsk, given the Germany-instigated strike of seaport workers, the British commander, having consulted the British mission in Warsaw, used his soldiers to unload commodities heading for Poland. On 6 August the Polish government issued an \"Appeal to the World\", which disputed the charges of Polish imperialism and stressed Poland's belief in self-determination and the dangers of a Bolshevik invasion of Europe.Hungary offered to send a 30,000 cavalry corps to Poland's aid, but President Tomáš Masaryk and Foreign Minister Edvard Beneš of Czechoslovakia were opposed to assisting Poland and the Czechoslovak government refused to allow them through. On 9 August 1920, the Czechoslovak government declared neutrality regarding the Polish–Soviet War. Some military supplies from Hungary did arrive in Poland.In summer 1919, Lithuania had been engaged in territorial disputes and armed skirmishes with Poland over the city of Vilnius and the areas around Sejny and Suwałki. An August 1919 Piłsudski's attempt to take control of Lithuania by engineering a coup contributed to worsening of the relations. The Soviet and Lithuanian governments signed on 12 July 1920 the Soviet–Lithuanian Peace Treaty; it recognised Vilnius as part of Lithuania. The treaty contained a secret clause that allowed Soviet forces unrestricted movement in Lithuania during any Soviet war with Poland, which led to questions regarding Lithuanian neutrality during the ongoing Polish–Soviet War. The Lithuanians also provided the Soviets with logistic support. Following the treaty, the Red Army occupied Vilnius; the Soviets returned the city to Lithuanian control just before it was recaptured by Polish forces in late August. Until then, the Soviets had encouraged their own communist government, the Litbel, and planned a communist coup in Lithuania.\n\nThe French Military Mission to Poland of four hundred members arrived in 1919. It consisted mostly of French officers but included also a few British advisers led by Adrian Carton de Wiart. In summer 1920, there were one thousand officers and soldiers in the mission, under General Paul Prosper Henrys. Members of the French Mission, through the training programs they conducted and frontline involvement, contributed to battle readiness of Polish forces. The French officers included Captain Charles de Gaulle. During the Polish–Soviet War he won the Virtuti Militari, Poland's highest military decoration. In France de Gaulle had enlisted in General Józef Haller's \"Blue Army\". The army's transit to Poland in 1919 was facilitated by France. Blue Army troops were mostly of Polish origin but included also international volunteers, who had been under French command during World War I. In 1920, France was reluctant to aid Poland in Poland's war with Soviet Russia. Only after the Soviet armistice conditions were presented on 8 August, France declared through its representative in Warsaw the intention to morally, politically and materially support Poland in its fight for independence.On 27 July 1920, the expanded Interallied Mission to Poland arrived in Warsaw. It included the French diplomat Jean Jules Jusserand; Maxime Weygand, chief of staff to Marshal Ferdinand Foch, the supreme commander of the victorious Entente; and the British diplomat Edgar Vincent. The new members of the mission made little impact on the war, but the crucial Battle of Warsaw had been fought and won by the Poles before the mission returned and made its report. Many in the West erroneously believed that it was the timely arrival of Allied forces that had saved Poland; Weygand occupied the central role in the myth that was created.The Polish-French co-operation continued, and French weaponry, including infantry armament, artillery and Renault FT tanks, were shipped to Poland to reinforce its military. On 21 February 1921, France and Poland agreed to a formal military alliance, which became an important factor during the Soviet–Polish negotiations.The Soviet emphasis had gradually shifted from promoting world revolution to dismantling the Treaty of Versailles system, which, in Lenin's words, was the treaty of the \"triumphant world imperialism\". Lenin made remarks to that effect during the 9th Conference of the Russian Communist Party RKP(b), convened on 22–25 September 1920. He repeatedly referred to the Soviet military defeat, for which he indirectly held himself largely responsible. Trotsky and Stalin, in turn, blamed each other for the war's outcome. Stalin sharply rebutted Lenin's accusations regarding Stalin's judgement ahead of the Battle of Warsaw. As Lenin saw it, the conquest of Warsaw, not very important in itself, would have allowed the Soviets to demolish the Versailles European order.\n\n\n==== Before the battle ====\n\nAccording to the plan of the commander-in-chief of the Red Army Sergey Kamenev as of 20 July 1920, two Soviet fronts, Western and Southwestern, were going to execute a concentric attack on Warsaw. However, after consulting Tukhachevsky, the Western Front commander, Kamenev concluded that the Western Front alone could manage the occupation of Warsaw.Tukhachevsky's intention was to destroy the Polish armies in the region of Warsaw. His plan was to have one of his armies attack the Polish capital from the east, while three other were to force their way across the Vistula further north, between Modlin and Toruń. Parts of this formation were going to be used to outflank Warsaw from the west. He issued orders to this effect on 8 August. It had soon become apparent to Tukhachevsky that his designs were not working.The Southwestern Front was given the task of attacking Lviv. Accordingly (and in agreement with his own previously expressed views) Stalin, member of the Revolutionary Council of the Southwestern Front, directed Budyonny to unleash an assault on Lviv, aimed at taking the city (Budyonny's 1st Cavalry Army was originally supposed to head north in the direction of Brest, to assist Tukhachevsky). Budyonny's forces fought in the vicinity of Lviv until August 19. In the meantime, already on August 11, Kamenev ordered the 1st Cavalry Army and the 12th Army of the Southwestern Front to proceed in the northwestern direction toward the Western Front area to fight there under Tukhachevsky's command. Kamenev repeated his order on 13 August, but Budyonny, following Stalin's directives, refused to obey. On 13 August, Tukhachevsky in vain pleaded with Kamenev to expedite the redirecting of both Southwestern armies to his area of combat. Such circumstances led to a Soviet disadvantage as the crucial Battle of Warsaw was about to unfold.Leon Trotsky interpreted Stalin's actions as insubordination, but the historian Richard Pipes asserts that Stalin \"almost certainly acted on Lenin's orders\" in not moving the forces to Warsaw. According to Stalin's biographer Duraczyński, Stalin, despite his devotion to Lenin, displayed a great deal of initiative and boldness; unlike other Soviet officials, including Lenin, he had not become euphoric about the Soviet victories. However, he insisted on the exceptional importance of the activities of the Southwestern Front, which turned out to be costly for the Soviets.Piłsudski had his counteroffensive plan figured by 6 August. He resolved to reinforce the Warsaw and Modlin region, tie-up the Soviet assault forces there, and then use the divisions taken from the front and others in a risky maneuver of attacking the rear of Tukhachevsky's forces from the Wieprz River area. The Soviets found a copy of Piłsudski's order, but Tukhachevsky thought it to be a hoax. In the final parade Piłsudski received before the attack, about half of his worn out and undersupplied soldiers marched barefoot.\n\n\n==== Battle of Warsaw ====\n\nIn August 1919, Polish military intelligence first decrypted the Red Army's radio messages. From the spring of 1920, the Polish high command had been aware of current Soviet moves and plans, which may have had decisively influenced the outcome of the war.On 8 August 1920, Tukhachevsky ordered the Soviet forces to cross the Vistula River in the area of Toruń and Płock. The formations under Hayk Bzhishkyan's command were supposed to take Warsaw from the west, while the main attack came from the east. On 18 August, after intense fighting, the Soviets were repelled from Płock and retreated toward East Prussia.On 10 August, Polish Chief of staff Tadeusz Rozwadowski ordered a two-pronged attack, from the Wkra and the Wieprz Rivers.On 12 August, Tukhachevsky's 16th and 3rd Armies commenced their assault on Warsaw from the east. The Polish 1st Army under General Franciszek Latinik stopped the enemy at the Battle of Radzymin and on 15 August initiated offensive actions of its own.The Polish 5th Army, under General Władysław Sikorski, counterattacked on 14 August from the area of the Modlin Fortress and crossed the Wkra River. It faced the combined forces of the Soviet 3rd and 15th Armies, which were numerically and materially superior. The attack split the Soviet front into two parts. The Soviet advance toward Warsaw and Modlin was halted in one day and had soon turned into a retreat, which contributed to the success of the drive by the main Polish formation coming from the Wieprz River area under Piłsudski's command. Sikorski's 5th Army pushed the exhausted Soviet formations away from Warsaw in a lightning operation and destroyed any Soviet hope of completing the enveloping manoeuvre in the north.\nBy 16 August, the Polish counteroffensive had been joined by Piłsudski's group coming from the Wieprz River, south-east of Warsaw. The weak Mozyr Group, which was supposed to protect the link between the Soviet fronts, was destroyed. The Poles continued their northward offensive and reached the rear of Tukhachevsky's forces. A rapid pursuit of the Russians followed and continued to the Prussian border and to the Neman River. Of the four armies of the Western Front, two disintegrated; the 4th Army with a cavalry corps crossed into East Prussia, where they were interned.Tukhachevsky, at his headquarters in Minsk, was unable to communicate with any of his commanders until 18 August. On that day, he belatedly ordered the remnants of his forces to regroup. He hoped to straighten the front line, halt the Polish attack and regain the initiative, but it was too late and on 19 August he ordered his armies to retreat over the entire front.The Battle of Warsaw lasted ten days. A large portion of the defeated Soviet troops had been taken prisoner or interned in Prussia. Edward Rydz-Śmigły's formation manned the new frontline, which ran from Brest to Grodno. The victory allowed the Poles to regain the initiative and undertake further military offensive.To diminish Piłsudski's military achievement and his role in the saving of Warsaw, at the instigation of his Polish detractors, the Battle of Warsaw had been referred to as the \"Miracle on the Vistula\", and the phrase has since remained in Catholic and popular use in Poland. The \"miracle\" was attributed to the Virgin Mary.\n\n\n==== Conclusion of military campaigns ====\n\nOn 17 August on the southern front, at the Battle of Zadwórze, a Polish battalion sacrificed itself to stop the advance of Semyon Budyonny's 1st Cavalry Army. On 20 August, Budyonny's cavalry belatedly broke off its siege of Lviv to come to the aid of Soviet forces retreating from Warsaw. His units moved on Zamość on 29 August, but became engaged in heavy fighting with Polish troops diverted from the successful Warsaw counteroffensive. On 31 August, the 1st Cavalry Army was surrounded and defeated by Polish cavalry under General Juliusz Rómmel at the Battle of Komarów near Zamość, the largest cavalry battle since 1813 (20,000 horsemen of each side). The remains of Budyonny's army retreated towards Volodymyr-Volynskyi on 6 September and on 20 September were withdrawn from the Polish front.Heading east, the Polish 3rd Army under Władysław Sikorski crossed the Bug River and on 13 September took Kovel. The Polish 6th Army, together with the allied Ukrainians, conducted offensive in the southeastern direction. By the end of September, the front reached the Pinsk–Sarny–Khmelnytskyi–Yampil line. In October, Juliusz Rómmel's cavalry corps arrived at Korosten, Ukraine.Mikhail Tukhachevsky established in September a new defensive line running from the Polish–Lithuanian border area in the north to Polesia, with a central point in the city of Grodno. The Soviet commander utilized a three-week lull in the fighting to reorganize and reinforce his battered forces. The Poles struck on 20 September, before he was ready. It took them several days of heavy fighting to secure Grodno (on 26 September), which was a prelude to the Battle of the Niemen River proper. Edward Rydz-Śmigły led from Grodno an outflanking maneuver, as a result of which Lida was taken and the Red Army's rear destabilized. Polish frontal attacks followed, the Soviet units disintegrated and rapidly retreated. After the second greatest battle of the campaign, the Soviet forces lost the ability to effectively resist and the Poles unleashed a continuous pursuit. The Polish units reached the Daugava River and on 18 October entered Minsk.In the south, Petliura's Ukrainian forces defeated the Bolshevik 14th Army and took control of the left bank of the Zbruch River on 18 September. In October, they moved east to the Yaruha–Sharhorod–Bar–Lityn line. They now numbered 23,000 soldiers and controlled territories immediately to the east of the Polish-controlled areas. They had planned an offensive in Ukraine for 11 November but were attacked by the Bolsheviks on 10 November. By 21 November, after several battles, they were driven into Polish-controlled territory.\n\n\n== Peace negotiations and outcome of the war ==\n\nPeace negotiations commenced in Minsk in mid-August 1920. Initially, the Soviets made harsh demands on Poland; their implementation would turn Poland into a Soviet-dependent state. After the Battle of Warsaw defeat, such condition were withdrawn and the negotiations were moved to Riga on 21 September. As winter approached and there had not been a military resolution to the conflict (the Red Army, despite many defeats, had not been destroyed), both sides decided to stop fighting. The Soviets were also pressured by events that necessitated the use of their military elsewhere, such as developments in the Turkish–Armenian War, Pyotr Wrangel's White Army still occupying the Crimea, or peasant rebellions in Russia.The Preliminary Treaty of Peace and Armistice Conditions was signed on 12 October and the armistice went into effect on 18 October. Ratifications were exchanged at Liepāja on 2 November. The peace treaty negotiations ensued and were concluded, between Poland on one side and Soviet Ukraine, Soviet Russia, and Soviet Belarus on the other, on 18 March 1921. The Peace of Riga, signed on that day, determined the Polish-Soviet border and divided the disputed territories in Belarus and Ukraine between Poland and the Soviet Union. It also regulated various other aspects of Polish-Soviet relations. It complemented the Treaty of Versailles and laid foundations for the relatively peaceful coexistence in Eastern Europe that lasted less than two decades.The armistice preliminary stipulations required the foreign allied forces to leave Poland. Signing the treaty with the Soviet republics, Poland had to rescind its recognition of Petliura's Ukrainian People's Republic and other Russian, Ukrainian and Belarusian \"White\" governments and organizations; the allied military units of the three nationalities were disbanded. The Petliura's units crossed the armistice line and fought the Red Army for a month. Their remnants returned into the Polish territory, where they were interned.During the Polish–Soviet War, about 100,000 people were killed. A complicated problem of prisoners of war was left to be resolved. On both sides, great destruction and economic losses, as well as deep psychological trauma resulted. Piłsudski's goal of separating Ukraine from Russia was not accomplished and the Polish–Soviet border attained indicated future instability.\n\n\n=== Russia ===\nThousands of peasant disturbances and rebellions took place in Russia between 1917 and 1921. The Pitchfork uprising of February–March 1920 greatly distracted the Soviet leadership and negatively affected their military preparedness in Ukraine and Belarus before the Polish Kiev Expedition. Lenin considered the peasant resistance to grain requisitions and other privations of war communism more threatening to Soviet Russia than the White movement. The last and possibly the greatest of peasant uprisings was the Tambov Rebellion of 1920–1921. Acute food shortages reached also Moscow and Saint Petersburg and contributed to the outbreak of the Kronstadt rebellion in March 1921.The Anglo-Soviet Trade Agreement, signed on 16 March 1921, was the first of a series of such international treaties. It broke diplomatic isolation of Soviet Russia. The resulting influx of foreign arms and equipment contributed to the success of the offensive against the partisans in the Tambov province, executed by Mikhail Tukhachevsky and completed by July.The grain requisition practices were eventually replaced by the New Economic Policy, announced by Lenin on 23 March 1921. It represented a partial compromise with capitalism.On 16 April 1922, Russia and Germany signed the Treaty of Rapallo. Diplomatic relations were established and the Russian negotiators obtained favorable resolution of their financial concerns.After the Peace of Riga, Soviet Russia withdrew behind its cordon sanitaire. Its leaders abandoned in reality the cause of the international revolution. The result was the Stalinist \"socialism in one country\" pursuit. The Soviet Union entered a period of intensive industrialization, to eventually become the second greatest industrial power in the world.\n\n\n=== Poland ===\nTheir losses during and after the Battle of Warsaw made the Soviets offer the Polish peace delegation substantial territorial concessions, including Minsk and other areas occupied by Polish forces. Polish resources were also exhausted and Polish public opinion wanted a settlement. Piłsudski and his camp were opposed to the peace process and wanted the warfare to continue to make the realization of the Intermarium concept possible.The negotiations were controlled by Roman Dmowski's National Democrats. The National Democrats wanted to directly incorporate into the Polish state the lands they found desirable. Polish parliament (Sejm) was controlled by Dmowski's allies, whose ideas of the nature of the Polish state and of the arrangement of its borders had since permanently prevailed.The National Democrats, led at the Riga talks by Stanisław Grabski, wanted only the territory they viewed as \"ethnically or historically Polish\" (had Polish-dominated cities) or, in their opinion, could be Polonised. However, in the east, Polish culture was weakly represented even in the cities, except for a few in the western part of the disputed territories, and Grabski refrained from seeking a border along the so-called Dmowski's Line, previously promoted by his movement. Despite the Red Army's defeat and the willingness of the chief Soviet negotiator, Adolph Joffe, to concede most the areas occupied by Polish troops, the National Democratic politics allowed the Soviets to regain some of the territories acquired by the Polish armies during the campaign. The National Democrats worried that Poland would not be able to control overly extended territories, dominated by national minorities; Grabski wanted lands where Poles could predominate. Among the territories evacuated by the Polish Army were Minsk in the north and Kamianets-Podilskyi and other areas east of the Zbruch River in the south. The National Democrats were also conscious of the weakening of their electoral position that would result from annexing more territories dominated by non-Polish ethnic groups. The failed federalist orientation was represented at Riga by Piłsudski's associate, Leon Wasilewski.In the long run, the National Democrats' scheme had not quite worked, because \"the Riga settlement created a Poland which was too westerly to be a federation, but not westerly enough to remain a national state\". Poland ended up with the largest total percentage of ethnic minorities of any unitary state in interwar Europe (only about two thirds of Polish citizens considered themselves ethnically Polish or of Polish nationality). Still, the refusal of the easternmost areas considered was beneficial to the National Democrats' electoral prospects. The resolution of the war had thus dealt a death blow to the Intermarium project.The Peace of Riga was approved by the All-Russian Central Executive Committee on 14 April 1921, by Polish Sejm on 15 April, and by the Central Executive Committee of Soviet Ukraine on 17 April. Until late summer 1939, the Soviet Union refrained from officially questioning the Riga treaty settlement, but it had been understood that the Soviet policy objective was to have it overturned.One consequence of the outcome of the Polish–Soviet War was that Poland's elites acquired an exaggerated perspective of the country's military capabilities.\n\n\n=== Ukraine ===\nThe Peace of Riga partitioned Ukraine and gave a portion of its territory to Poland (eastern Galicia and most of Volhynia) and the other portion to the Soviet Union. The Ukrainian Soviet Republic and the Byelorussian Soviet Republic were recognized by Poland. \"That the Soviet Union established in 1922 included a Ukrainian SSR was the most important consequence of the attempts to establish an independent Ukrainian state in 1918–1920.\"The Treaty of Warsaw between Poland and the Directorate of Ukraine had been invalidated. The Riga treaty violated the spirit of Poland's prior alliance with the Directorate of Ukraine. Members of the Ukrainian faction that accepted the alliance with Poland and fought within that alliance, were now interned by the Polish authorities. The internment worsened relations between the Polish state and its Ukrainian minority. As Polish democracy was \"alien, unrepresentative, and eventually curtailed\", great resentment had been generated in the remaining interwar years because of repressive policies of Polish governments towards Ukrainians living in post-Riga Poland.In the 1920s, the Soviet policy was to help create a modern Ukrainian culture. Ukrainian intellectuals, co-opted by the communist party, were encouraged to create in the Ukrainian language and the result was cultural revival and a period of great productivity. Children were educated and most books and newspapers were published in the native language. The Ukrainian Autocephalous Orthodox Church was established. The liberal policies ended under Joseph Stalin's rule, when the new church was banned and the Ukrainian intelligentsia destroyed in massive purges.Given the circumstances, in the 1930s Poland's eastern Galicia had become the center of Ukrainian political and cultural activity. Despite the atrocities that took place in Soviet Ukraine, Poland was regarded by Ukrainian activists as the principal enemy. They felt disappointed by the failed alliance and the Riga betrayal, and were annoyed by daily domination of the Polish authorities and local Polish elites. Many perceived the Soviet Union primarily as the creator of a Ukrainian state, the Ukrainian SSR.\n\n\n=== Belarus ===\nUnlike in the cases of Lithuania and Ukraine, Piłsudski or his allies had never proposed a Belarusian state associated with Poland.On 11 July 1920, Soviet forces entered Minsk and on 1 August the Byelorussian Soviet Socialist Republic was officially established. Belarus, like Ukraine, was partitioned between Poland and the Soviet Union after the Peace of Riga. The policies of the Byelorussian Soviet Republic were determined by Moscow.Belarusian activists regarded the Peace of Riga results as a tragic betrayal. Without Minsk, Polish Belarusians were reduced to being a mostly rural, marginalized group. To many of them, the Soviet republic to the east seemed an attractive alternative. In 1922, the Soviet Union was established as a formal federation of republics. Its policy called for an eventual extension of the Byelorussian SSR, to include the Belarusian lands under Polish administration. The Communist Party of Western Belorussia, established in Poland, was under Soviet control. The territory of the Byelorussian SSR was extended to the east in 1923, 1924 and 1926 by lands taken from the Russian Republic. In contrast to the repressive Polish policies, in the 1920s the Soviet Union supported Belarusian culture; several major national institutions and thousands of Belarusian schools had been established. However, the official Belarusian progress was mostly destroyed under Stalin in the 1930s.Belarusian activists held a Congress of Representatives in Prague in the fall of 1921, to discuss the peace treaty and its consequences for Belarus. Vera Maslovskaya was sent there as the delegate of the Białystok area, and she proposed a resolution to fight for the unification of Belarus. She sought independence of all Belarusian lands and denounced the partition. Though the convention did not adopt a proposal instituting armed conflict, it passed Maslovskaya's proposal, which led to immediate retaliation from the Polish authorities. They infiltrated the underground network fighting for Belarusian unification and arrested the participants. Maslovskaya was arrested in 1922 and tried in 1923, along with 45 other participants, mostly peasants. Among the arrested were also a sister and brother of Maslovskaya and several teachers and professionals. Maslovskaya accepted all responsibility for the underground organisation, but specifically stated that she was guilty of no crime, having acted only to protect the interests of Belarus against foreign occupiers, in a political and not military action. Unable to prove that the leaders had participated in armed rebellion, the court found them guilty of political crimes and sentenced to six years in prison.\n\n\n=== Lithuania ===\nPressured by the Entente powers, Poland and Lithuania signed the Suwałki Agreement on 7 October 1920; the armistice line left Vilnius on the Lithuanian side of the border. However, Polish military activities, especially the so-called Żeligowski's Mutiny launched two days after the Suwałki Agreement, allowed Poland to capture the Vilnius Region, where a Polish-dominated Governance Committee of Central Lithuania was formed. On 8 January 1922, the Polish military enforced local legislative elections, but they were boycotted by Jews, Belarusians and Lithuanians. The resulting Vilnius assembly voted for the incorporation of \"Central Lithuania\" into Poland on 20 February 1922 and Polish Sejm approved the annexation on 24 March. The Western powers condemned the Polish actions but on 15 March 1923 the Conference of Ambassadors, convinced of the desirability of geographical separation of Lithuania from the Soviet Union, approved Poland's eastern borders, as already determined by the League of Nations in early February (the Soviet Union rejected the granting of Vilnius to Poland). Lithuania refused to comply; the events and the incorporation worsened Polish–Lithuanian relations for decades to come. According to Alfred E. Senn, even though Lithuania lost territory to Poland, it was only the Polish victory against the Soviets in the Polish–Soviet War that derailed the Soviet plans for westward expansion and gave Lithuania the period of interwar independence.\n\n\n=== Latvia ===\nLatvia's fighting with the Bolsheviks ended with the Latvian–Soviet Peace Treaty on 11 August 1920. The Peace of Riga negotiations followed; it established a Polish-Latvian border in the area of Daugavpils. That same year Latvia passed a comprehensive land reform and in 1922 introduced a democratic constitution. The Warsaw Accord was signed by foreign ministers of Latvia, Estonia, Finland and Poland on 17 March 1922. However, the Treaty of Rapallo effectively placed the Baltic states in the German and Soviet spheres of influence.\n\n\n== War crimes and other controversies ==\n\nThe war and its aftermath resulted in controversies, such as the situation of prisoners of war in Poland and in Soviet Russia and Lithuania, treatment of the civilian population, or the behaviour of some commanders, including Stanisław Bułak-Bałachowicz and Vadim Yakovlev. The alleged pogroms of Jews by the Polish military caused the United States to send a commission, led by Henry Morgenthau, to investigate the matter.\n\n\n== Developments in military strategy ==\n\nThe Polish–Soviet War influenced the Polish military doctrine; under Piłsudski's leadership it emphasised the mobility of elite cavalry units. It also influenced Charles de Gaulle, who was an instructor in the Polish Army with a rank of major and fought in several of the battles, including the Battle of Warsaw. He and Władysław Sikorski were the only notable military officers who, based on their experiences during the war, correctly predicted the importance of maneuver and mechanization in the next war. Although they had failed during the interwar period to convince their respective military establishments to heed those lessons, during World War II they rose to command of their respective armed forces in exile.\n\n\n== Aftermath and legacy ==\nDespite the final retreat of Soviet forces and the annihilation of three Soviet field armies, historians do not universally agree on the question of victory. Lenin spoke of a great military defeat suffered by Soviet Russia. Sebestyen wrote: \"The Poles heavily defeated and embarrassed the Soviet state – one of Lenin's biggest setbacks.\" The conflict, however, is also viewed as a military victory for Poland coupled with political defeat. In the treaty, Poland formally gave up its ambitions of helping build independent Ukraine and Belarus and recognized the two states as dependencies of Moscow. The countries envisioned by Piłsudski as members of Poland-led Intermarium federation had instead, under Lenin and Stalin, become incorporated into the Soviet Union.\nIn the autumn of 1920, both combatants had realized that they could not win a decisive military victory. Internally, the newly reestablished Polish state had proved its viability, as an overwhelming majority of its people contributed to the defense of the country and turned out insensitive to Bolshevik appeals to join the revolution. As for the main protagonists, neither one was able to accomplish his principal objective. For Piłsudski it was to recreate in some form the Polish–Lithuanian Commonwealth, and for Lenin to cause the downfall of the capitalist edifice in Europe by facilitating revolutionary processes in key states of the West.Russian and Polish historians tend to assign victory to their respective countries. Outside assessments vary mostly between calling the result a Polish victory or inconclusive. The Poles claimed a successful defence of their state, but the Soviets claimed a repulse of the Polish invasion of Ukraine and Belarus, which they viewed as a part of the foreign intervention in the Russian Civil War. Some British and American military historians argue that the Soviet failure to destroy the Polish Army ended Soviet ambitions for international revolution.After signing the armistice with Poland in October 1920, the Soviets transferred troops toward the Crimea and attacked the Isthmus of Perekop. Pyotr Wrangel's White Army there was ultimately defeated. By 14 November, 83,000 soldiers and civilians had been evacuated aboard French and Russian ships to Istanbul (the British government refused to provide any assistance), while 300,000 White collaborators were left behind. The Red Army then diverted its troops into the Tambov region of central Russia to crush the anti-Bolshevik peasant uprising there.In 1926, the Soviet–Lithuanian Non-Aggression Pact was signed. The Soviets renewed their recognition of the Lithuanian claim to the Vilnius area. In 1939, after the Soviet invasion of Poland, Stalin gave Vilnius to Lithuania. In 1940, Lithuania was incorporated into the Soviet Union as a Soviet republic. This arrangement, interrupted by the German occupation of Lithuania in 1941–44, had lasted until the restoration of Lithuanian independent state in 1990. Under the Lithuanian Soviet Socialist Republic, Vilnius became a city dominated by ethnic Lithuanians.After the Soviet invasion of Poland of September 1939, the partition of Belarus and Ukraine ended on Soviet terms. After Operation Barbarossa and occupation by Nazi Germany, the Soviet Union returned in 1944 and the two Soviet republics permanently reclaimed what had been Polish \"Kresy\" from 1920 to 1939. Since the post-World War II adjustments, the borders of the republics had remained stable, except for the 1954 transfer of Crimea from the Russian SFSR to the Ukrainian SSR. The Soviet republics' borders had been preserved as borders of independent Belarus and Ukraine following the dissolution of the Soviet Union.\nIn 1943, during the course of World War II, the subject of Poland's eastern borders was reopened and was discussed at the Tehran Conference. Winston Churchill argued in favour of the 1920 Curzon Line rather than the Peace of Riga borders, and an agreement among the Allies to that effect was reached at the Yalta Conference in 1945. The Western Allies, despite having alliance treaties with Poland and despite the Polish contribution to the war, left Poland within the Soviet sphere of influence. The Allies allowed Poland to be compensated for the territorial losses in the east with the bulk of the former eastern territories of Germany. The post-war arrangement imposed had become known to many Poles as the Western betrayal.From the end of World War II until 1989, the communists held power in Poland, and the Polish–Soviet War was omitted or minimised in Polish and other Soviet Bloc countries' history books, or was presented as a foreign intervention during the Russian Civil War.Polish Lieutenant Józef Kowalski was the last living veteran of the war. He was awarded the Order of Polonia Restituta on his 110th birthday by President Lech Kaczyński of Poland. He died on 7 December 2013 at the age of 113.\n\n\n== List of battles ==\n\n\n== See also ==\nCipher Bureau (Poland)\nPolish–Ukrainian War\nSoviet invasion of Poland\nGermany–Soviet Union relations, 1918–1941\n\n\n== Notes ==\n\n\n== References ==\n\n\n== Further reading ==\n\n\n=== Non-English ===\n\n\n==== Polish ====\n\n\n==== Russian ====\n\n\n== External links ==\nCentek, Jarosław: Polish-Soviet War 1920–1921 , in: 1914–1918-online. International Encyclopedia of the First World War.\nThe Bolsheviks and the \"Export of Revolution\": The Russo-Polish War.\nBibliography of the Polish-Soviet War by Anna M. Cienciala, University of Kansas.\nMaps of the Polish-Bolshevik War: Campaign Maps (Battle of Warsaw) by Robert Tarwacki at the Wayback Machine (archived 27 October 2009).\nA Knock on the Door – chapter three of Wesley Adamczyk's memoirs of the Polish-Soviet war When God Looked the Other Way.\nThe Russo-Polish War, 1919–1920: A Bibliography of Materials in English by John A. Drobnicki. Originally Published in the Polish Review, XLII, no. 1 (Mar. 1997), 95–104."