"The Polish–Soviet War (late autumn 1918 – 18 March 1921) was fought primarily between the Second Polish Republic and the Russian Soviet Federative Socialist Republic in the aftermath of World War I, on territories formerly held by the Russian Empire and the Austro-Hungarian Empire.\nOn 13 November 1918, Vladimir Lenin's Russia annulled the Treaty of Brest-Litovsk and soon started slowly moving forces in the western direction to recover and secure the lands vacated by the German forces that were lost by the Russian state under the treaty. Lenin saw the newly independent Poland as the bridge the Red Army had to cross to assist other communist movements and to bring about more European revolutions. At the same time, leading Polish politicians of different orientations pursued the general expectation of restoring the country's pre-1772 borders. Motivated by that idea, Polish Chief of State Józef Piłsudski began moving troops east.\nIn 1919, while the Red Army was preoccupied with the Russian Civil War, the Polish Army took most of Lithuania and Belarus. By July 1919, Polish forces had taken control of much of Western Ukraine and emerged victorious from the Polish–Ukrainian War. Meanwhile, in the eastern part of Ukraine bordering on Russia, Symon Petliura tried to defend the Ukrainian People's Republic, but as the Bolsheviks gained the upper hand in the civil war, they advanced westward towards the disputed Ukrainian lands and made Petliura's forces retreat. Reduced to a small amount of territory in the west, Petliura was compelled to seek an alliance with Piłsudski, which was officially formed in April 1920.\nPiłsudski believed that the best way for Poland to secure favorable borders was by military action and that he could easily defeat the Red Army forces. His Kiev Offensive, considered to have begun the Polish–Soviet War sensu stricto, commenced in late April 1920 and resulted in the takeover of Kiev by the Polish and allied Ukrainian forces on 7 May. The Soviet armies in the area, which were weaker, had not been defeated, as they avoided major confrontations and withdrew.\nThe Polish offensive was met by successful counterattacks by the Red Army, from 5 June on the southern Ukrainian front and from 4 July on the northern front. The Soviet operation pushed the Polish forces back westward all the way to Warsaw, the Polish capital, while the Directorate of Ukraine fled to Western Europe. Fears of Soviet troops arriving at the German borders increased the interest and involvement of the Western powers in the war. In mid-summer the fall of Warsaw seemed certain, but in mid-August the tide had turned again after the Polish forces achieved an unexpected and decisive victory at the Battle of Warsaw. In the wake of the eastward Polish advance that followed, the Soviets sued for peace, and the war ended with a ceasefire on 18 October 1920.\nThe Peace of Riga, signed on 18 March 1921, divided the disputed territories between Poland and Soviet Russia. The war and the treaty negotiations determined the Soviet–Polish border for the rest of the interwar period. Poland's eastern border was established at about 200 km east of the Curzon Line, a British proposal for Poland's border, previously approved by the Entente leaders as the limit of Poland's expansion in the eastern direction. Ukraine and Belarus became divided between Poland and the Soviet Union, which established the respective Soviet republics in its parts.\nThe peace negotiations, on the Polish side conducted chiefly by Piłsudski's opponents and against his will, ended with the official recognition of the two Soviet republics, which became parties to the treaty. This outcome and the new border agreed on precluded any possibility of the formation of the Intermarium Polish-led federation of states that Piłsudski had planned for or of meeting his other eastern policy goals. The Soviet Union later used the Ukrainian Soviet Republic and the Byelorussian Soviet Republic to claim their unification with parts of the Kresy territories where East Slavic people outnumbered ethnic Poles and which had remained, after the Peace of Riga, on the Polish side of the border, lacking any form of autonomy."