"Sir Richard Gresham (c.1485 – 21 February 1549) was an English mercer, Merchant Adventurer, Lord Mayor of London, and Member of Parliament. He was the father of Sir Thomas Gresham.\n\n\n== Biography ==\n\nThe Gresham family had been settled in the Norfolk village of Gresham since at least the late 14th century. Richard Gresham's grandfather, James Gresham, moved to Holt, Norfolk, about three miles from Gresham, where in the mid-fifteenth century he built a manor house in the centre of the small town. Richard Gresham, born about 1485 at Holt, was probably the third of four surviving sons of James Gresham's son, John Gresham, by his marriage to Alice Blythe of Long Stratton, Norfolk.Gresham was admitted a liveryman of the Worshipful Company of Mercers in 1507. As a mercer, he was in partnership with his brother, John Gresham, in exporting textiles and importing grain from the continent. He supplied King Henry VIII with arras, velvets, and satins. Most of his trade was with the Low Countries, which were the most significant area for English overseas trade for most of the sixteenth century, and he amassed a large fortune. He became Sheriff of London and Middlesex in 1531, and was knighted the same year. On 19 May 1536, he was present at the execution of Anne Boleyn in the Tower of London. He was elected as Lord Mayor of London in 1537, and when Cardinal Wolsey was on his death bed he called Gresham his \"fast-friend\". Gresham paid for the Cardinal's funeral.\nHe was elected as one of the four Members of Parliament for the City of London in 1539 and 1545.\nGresham supplied tapestries to Cardinal Wolsey for his new house of Hampton Court. In October 1520 he measured eighteen rooms and went to the mart in Flanders to order hangings to the value of 1000 marks or more. In part payment, in January 1521, Gresham asked Wolsey to obtain a licence for him to profit by international trade, including the right to send a ship to Turkey. Margaret, Duchess of Savoy, impounded one of his ships carrying wheat from Antwerp. Gresham asked Wolsey to sign a letter in his support in March 1521, and wrote that he had obtained eight cloths-of-gold for hanging in the Cardinal's closet at Hampton Court.The Gresham family motto is Fiat voluntas tua ('Thy will be done').\nGresham died at Bethnal Green on 21 February 1549.\n\n\n== Family ==\nRichard Gresham married firstly, Audrey Lynne (d. 28 December 1522), the daughter of William Lynne, of Southwick, Northamptonshire, by whom he had two sons and two daughters:\nJohn Gresham (d.1560), who married Frances Thwaytes, the daughter and coheir of Sir Henry Thwaytes of Lund, Yorkshire, by whom he had an only daughter and heir, Elizabeth Gresham (d. 6 November 1573), who married Sir Henry Neville of Billingbear House, Berkshire.\nSir Thomas Gresham, founder of the Royal Exchange.\nChristian Gresham, who married Sir John Thynne, steward of Edward Seymour, 1st Duke of Somerset, builder of Longleat. Gresham is thus an ancestor of Thomas Thynne, 1st Marquess of Bath.\nElizabeth Gresham.Richard Gresham married secondly Thomasyn, widow of Richard Thurston and daughter of John Worsopp. His third wife was Isabel, the widow of John Pyke, goldsmith, who survived him, dying in April 1565. The Dictionary of National Biography has mistakenly combined Thomasyn and Isabel.\n\n\n== See also ==\nList of Sheriffs of the City of London\nList of Lord Mayors of London\nCity of London (elections to the Parliament of England)\n\n\n== Notes ==\n\n\n== References ==\nBlanchard, Ian (2004). \"Gresham, Sir Richard (c.1485–1549)\". Oxford Dictionary of National Biography (online ed.). Oxford University Press. doi:10.1093/ref:odnb/11504. (Subscription or UK public library membership required.)\nBlanchard, Ian (2004a). \"Gresham, Sir Thomas (c.1518–1579)\". Oxford Dictionary of National Biography (online ed.). Oxford University Press. doi:10.1093/ref:odnb/11505. (Subscription or UK public library membership required.)\nLeveson-Gower, Granville (1883). Genealogy of the Family of Gresham. London: Mitchell and Hughes. pp. 7–12, 21–3, 29–35. Retrieved 25 March 2013. william harding sir john gresham.\nUrban, Sylvester (1845). \"The Law of Quartering Arms, by W.D.B.\" The Gentleman's Magazine. New Series. London: John Bowyer Nichols and Son. XXIV: 476–9. Retrieved 25 March 2013.\nWelch, Charles (1890). \"Gresham, Thomas\" .  In Stephen, Leslie; Lee, Sidney (eds.). Dictionary of National Biography. 23. London: Smith, Elder & Co. pp. 141–42.Attribution This article incorporates text from a publication now in the public domain: Chisholm, Hugh, ed. (1911). \"Gresham, Sir Thomas\". Encyclopædia Britannica. 12 (11th ed.). Cambridge University Press. p. 582.\n\n\n== Further reading ==\nBurgon, J. W. (1968) [1839]. Life and Times of Sir Thomas Gresham (new ed.). London."