"Red mud, formally termed bauxite residue, is an industrial waste generated during the processing of bauxite into alumina using the Bayer process. It is composed of various oxide compounds, including the iron oxides which give its red colour. Over 95% of the alumina produced globally is through the Bayer process; for every tonne of alumina produced, approximately 1 to 1.5 tonnes of red mud are also produced. Annual production of alumina in 2020 was over 133 million tonnes resulting in the generation of over 175 million tonnes of red mud.Due to this high level of production and the material's high alkalinity, it can pose a significant environmental hazard and storage problem. As a result, significant effort is being invested in finding better methods for dealing with it such as waste valorization in order to create useful materials for cement and concrete.Less commonly, this material is also known as bauxite tailings, red sludge, or alumina refinery residues.\n\n\n== Production ==\nRed mud is a side-product of the Bayer process, the principal means of refining bauxite en route to alumina. The resulting alumina is the raw material for producing aluminium by the Hall–Héroult process. A typical bauxite plant produces one to two times as much red mud as alumina. This ratio is dependent on the type of bauxite used in the refining process and the extraction conditions.More than 60 manufacturing operations across the world use the Bayer process to make alumina from bauxite ore. Bauxite ore is mined, normally in open cast mines, and transferred to an alumina refinery for processing. The alumina is extracted using sodium hydroxide under conditions of high temperature and pressure. The insoluble part of the bauxite (the residue) is removed, giving rise to a solution of sodium aluminate, which is then seeded with an aluminium hydroxide crystal and allowed to cool which causes the remaining aluminium hydroxide to precipitate from the solution. Some of the aluminium hydroxide is used to seed the next batch, while the remainder is calcined (heated) at over 1000 °C in rotary kilns or fluid flash calciners to produce aluminium oxide (alumina).\nThe alumina content of the bauxite used is normally between 45 and 50%, but ores with a wide range of alumina contents can be used. The aluminium compound may be present as gibbsite (Al(OH)3), boehmite (γ-AlO(OH)) or diaspore (α-AlO(OH)). The residue invariably has a high concentration of iron oxide which gives the product a characteristic red colour. A small residual amount of the sodium hydroxide used in the process remains with the residue, causing the material to have a high pH/alkalinity, normally >12. Various stages in the solid/liquid separation process are introduced to recycle as much sodium hydroxide as possible from the residue back into the Bayer Process in order to make the process as efficient as possible and reduce production costs. This also lowers the final alkalinity of the residue making it easier and safer to handle and store.\n\n\n== Composition ==\nRed mud is composed of a mixture of solid and metallic oxides. The red colour arises from iron oxides, which can comprise up to 60% of the mass. The mud is highly basic with a pH ranging from 10 to 13. In addition to iron, the other dominant components include silica, unleached residual aluminium compounds, and titanium oxide.The main constituents of the residue after the extraction of the aluminium component are insoluble metallic oxides. The percentage of these oxides produced by a particular alumina refinery will depend on the quality and nature of the bauxite ore and the extraction conditions. The table below shows the composition ranges for common chemical constituents, but the values vary widely:\n\nMineralogically expressed the components present are:\n\nIn general, the composition of the residue reflects that of the non-aluminium components, with the exception of part of the silicon component: crystalline silica (quartz) will not react but some of the silica present, often termed, reactive silica, will react under the extraction conditions and form sodium aluminium silicate as well as other related compounds.\n\n\n=== Environmental hazards ===\nDischarge of red mud can be hazardous environmentally because of its alkalinity and species components.\nIn 1972 there was a red mud discharge off the coast of Corsica by the Italian company Montedison. The case is important in international law governing the Mediterranean sea.In October 2010, approximately one million cubic meters of red mud from an alumina plant near Kolontár in Hungary was accidentally released into the surrounding countryside in the Ajka alumina plant accident, killing ten people and contaminating a large area. All life in the Marcal river was said to have been \"extinguished\" by the red mud, and within days the mud had reached the Danube. The long-term environmental effects of the spill have been minor after a €127 million remediation effort by the Hungarian government.\n\n\n== Residue storage areas ==\nResidue storage methods have changed substantially since the original plants were built. The practice in early years was to pump the slurry, at a concentration of about 20% solids, into lagoons or ponds sometimes created in former bauxite mines or depleted quarries. In other cases, impoundments were constructed with dams or levees, while for some operations valleys were dammed and the residue deposited in these holding areas.It was once common practice for the red mud to be discharged into rivers, estuaries, or the sea via pipelines or barges; in other instances the residue was shipped out to sea and disposed of in deep ocean trenches many kilometres offshore. From 2016, all disposal into the sea, estuaries and rivers was stopped.As residue storage space ran out and concern increased over wet storage, since the mid-1980s dry stacking has been increasingly adopted. In this method, residues are thickened to a high density slurry (48–55% solids or higher), and then deposited in a way that it consolidates and dries.An increasingly popular treatment process is filtration whereby a filter cake (typically resulting in 23–27% moisture) is produced. This cake can be washed with either water or steam to reduce alkalinity before being transported and stored as a semi-dried material. Residue produced in this form is ideal for reuse as it has lower alkalinity, is cheaper to transport, and is easier to handle and process.\nIn 2013 Vedanta Aluminium, Ltd. commissioned a red mud powder-producing unit at its Lanjigarh refinery in Odisha, India, describing it as the first of its kind in the alumina industry, tackling major environmental hazards.\n\n\n== Use ==\nSince the Bayer process was first adopted industrially in 1894, the value of the remaining oxides has been recognized. Attempts have been made to recover the principal components – especially the iron. Since mining began, an enormous amount of research effort has been devoted to seeking uses for the residue. Many studies are now being financed by the European Union under the Horizon Europe programme. Several studies have been conducted to develop uses of red mud. An estimated 3 to 4 million tonnes are used annually in the production of cement, road construction and as a source for iron. Potential applications include the production of low cost concrete, application to sandy soils to improve phosphorus cycling, amelioration of soil acidity, landfill capping and carbon sequestration.Reviews describing the current use of bauxite residue in Portland cement clinker, supplementary cementious materials/blended cements and special calcium sulfo-aluminate cements have been extensively researched and well documented.\nCement manufacture, use in concrete as a supplementary cementitious material. From 500,000 to 1,500,000 tonnes.\nRaw material recovery of specific components present in the residue: iron, titanium, steel and REE (rare-earth elements) production. From 400,000 to 1,500,000 tonnes;\nLandfill capping/roads/soil amelioration – 200,000 to 500,000 tonnes;\nUse as a component in building or construction materials (bricks, tiles, ceramics etc.) – 100,000 to 300,000 tonnes;\nOther (refractory, adsorbent, acid mine drainage (Virotec), catalyst etc.) – 100,000 tonnes.\nUse in building panels, bricks, foamed insulating bricks, tiles, gravel/railway ballast, calcium and silicon fertilizer, refuse tip capping/site restoration, lanthanides (rare earths) recovery, scandium recovery, gallium recovery, yttrium recovery, treatment of acid mine drainage, adsorbent of heavy metals, dyes, phosphates, fluoride, water treatment chemical, glass ceramics, ceramics, foamed glass, pigments, oil drilling or gas extraction, filler for PVC, wood substitute, geopolymers, catalysts, plasma spray coating of aluminium and copper, manufacture of aluminium titanate-Mullite composites for high temperature resistant coatings, desulfurisation of flue gas, arsenic removal, chromium removal.In 2020, the International Aluminium Institute, launched a Roadmap for maximising the use of bauxite residue in cement and concrete.In 2015 a major initiative was launched in Europe with funds from the European Union to address the valorisation of red mud. Some 15 Ph.D. students were recruited as part the European Training Network (ETN) for Zero-Waste Valorisation of Bauxite Residue. The key focus will be the recovery of iron, aluminium, titanium and rare-earth elements (including scandium) while valorising the residue into building materials.\nIn November 2020, The ReActiv: Industrial Residue Activation for Sustainable Cement Production research project was launched, this is being funded by the EU. One of the world's largest cement companies, LafargeHolcim, in cooperation with 20 partners across 12 European countries, launched the ambitious 4 year ReActiv project (reactivproject.eu). The ReActiv project will create a novel sustainable symbiotic value chain, linking the by-product of the alumina production industry and the cement production industry. In ReActiv modification will be made to both the alumina production and the cement production side of the chain, in order to link them through the new ReActiv technologies. The latter will modify the properties of the industrial residue, transforming it into a reactive material (with pozzolanic or hydraulic activity) suitable for new, low CO2 footprint, cement products. In this manner ReActiv proposes a win-win scenario for both industrial sectors (reducing wastes and CO2 emissions respectively).\n\n\n== See also ==\nChemical waste\nOlivier Dubuquoy\n\n\n== References ==\n\n\n== Additional references ==\nM. B. Cooper, “Naturally Occurring Radioactive Material (NORM) in Australian Industries”, EnviroRad report ERS-006 prepared for the Australian Radiation Health and Safety Advisory Council (2005).\nAgrawal, K. K. Sahu, B. D. Pandey, \"Solid waste management in non-ferrous industries in India\", Resources, Conservation and Recycling 42 (2004), 99–120.\nJongyeong Hyuna, Shigehisa Endoha, Kaoru Masudaa, Heeyoung Shinb, Hitoshi Ohyaa, \"Reduction of chlorine in bauxite residue by fine particle separation\", Int. J. Miner. Process., 76, 1–2, (2005), 13–20.\nClaudia Brunori, Carlo Cremisini, Paolo Massanisso, Valentina Pinto, Leonardo Torricelli, \"Reuse of a treated red mud bauxite waste: studies on environmental compatibility\", Journal of Hazardous Materials, 117(1), (2005), 55–63.\nH. Genc¸-Fuhrman, J. C. Tjell, D. McConchie, \"Increasing the arsenate adsorption capacity of neutralized red mud (Bauxsol™)\", J. Colloid Interface Sci. 271 (2004) 313–320.\nH. Genc¸-Fuhrman, J. C. Tjell, D. McConchie, O. Schuiling, \"Adsorption of arsenate from water using neutralized red mud\", J. Colloid Interface Sci. 264 (2003) 327–334.\n\n\n== External links and further reading ==\n\"Red Sludge\" on YouTube, from The Periodic Table of Videos (University of Nottingham)\nBabel, S.; Kurniawan, TA. (Feb 2003). \"Low-cost adsorbents for heavy metals uptake from contaminated water: a review\". J Hazard Mater. 97 (1–3): 219–43. doi:10.1016/S0304-3894(02)00263-7. PMID 12573840."