"Corporate governance is the collection of mechanisms, processes and relations used by various parties to control and to operate a corporation.Governance structures and principles identify the distribution of rights and responsibilities among different participants in the corporation (such as the board of directors, managers, shareholders, creditors, auditors, regulators, and other stakeholders) and include the rules and procedures for making decisions in corporate affairs. Corporate governance is necessary because of the possibility of conflicts of interests between stakeholders, primarily between shareholders and upper management or among shareholders.\nCorporate governance includes the processes through which corporations' objectives are set and pursued in the context of the social, regulatory and market environment. These include monitoring the actions, policies, practices, and decisions of corporations, their agents, and affected stakeholders. Corporate governance practices can be seen as attempts to align the interests of stakeholders.Interest in the corporate governance practices of modern corporations, particularly in relation to accountability, increased following the high-profile collapses of a number of large corporations in 2001–2002, many of which involved accounting fraud; and then again after the financial crisis in 2008.Corporate scandals of various forms have maintained public and political interest in the regulation of corporate governance. In the U.S. these have included scandals surrounding Enron and MCI Inc. (formerly WorldCom). Their demise led to the enactment of the Sarbanes–Oxley Act in 2002, a U.S. federal law intended to improve corporate governance in the United States. Comparable failures in Australia (HIH, One.Tel) are associated with the eventual passage of the CLERP 9 reforms there (2004), that similarly aimed to improve corporate governance. \nSimilar corporate failures in other countries stimulated increased regulatory interest (e.g., Parmalat in Italy)."