"Giles Antonini, O.E.S.A., commonly referred to as Giles of Viterbo (Latin: Ægidius Viterbensis, Italian: Egidio da Viterbo), was a 16th-century Italian Augustinian friar, bishop of Viterbo and cardinal, a reforming theologian, orator, humanist and poet. He was born in Viterbo and died in Rome.\n\n\n== Life ==\nHe was born to humble parents and his given name is not known; his father was Lorenzo Antonini, of Canepina, near Viterbo, and his mother, Maria del Testa. He entered the Order of St. Augustine in June 1488 at which time he was given the name Giles. After a course of studies at priories of the Order in Ameria, Padua, Istria, Florence and Rome, where he studied philosophy. He was later made a doctor of theology. In 1506 became Vicar General of his Order. Upon the death of the Prior General, and, under the patronage of Pope Julius II, he was confirmed by election as his successor at three successive General Chapters of the Order: in 1507, 1511 and 1515.\nAntonini was a noted preacher, presiding at several papal services at the order of Pope Alexander VI. He also traveled widely, due to his responsibilities as head of the Order. This allowed to be in touch with the leading intellectual figures of the period, with many of whom he formed working collaborations. One friend, Giovanni Pontano, dedicated a work to him, entitled Ægidius.Antonini is famous in ecclesiastical history for the boldness and earnestness of the discourse which he delivered at the opening of the Fifth Lateran Council, held in 1512, at the Lateran Palace.Following this service to his Order, Antonini was elevated to the rank of cardinal by Pope Leo X in the consistory of 1 July 1517, and given the titular church of San Bartolomeo all'Isola, which he immediately had changed to the Church of San Matteo in Via Merulana. He resigned the office of Prior General in February 1519. Pope Leo confided to him several sees in succession, employed him as legate on important missions, notably to Charles of Spain, soon to be Emperor. In 1523 Pope Leo gave him the title of Latin Patriarch of Constantinople.Antonini's zeal for the genuine reformation of conditions in the Catholic Church prompted him to present Pope Adrian VI with a Promemoria. He was universally esteemed as a learned and virtuous member of the great pontifical senate and many deemed him destined to succeed Pope Clement VII.\nWhen the forces of Emperor Charles sacked the city in 1527, Antonini's extensive library was destroyed. He spent the next year living in exile in Padua. In 1530 he requested the transfer of his titular church to that of the Church of San Marcello al Corso.Antonini died in Rome and was buried in the Basilica of Sant'Agostino.\n\n\n== Christian cabalist ==\nAntonini knew Marsilio Ficino from a visit to Florence, and he was familiar with Pico della Mirandola's interpretations of the Kabbalah, which he was to surpass in the depth of his understanding; his interest in the Talmud led him into correspondence with Johannes Reuchlin.In Jewish history, Antonini is coupled with the grammarian Elias Levita, who honed his knowledge of Hebrew and Aramaic. When the turmoil of war drove Levita from Padua to Rome, he was welcomed at the palace of the bishop, where, with his family, he lived and was supported for more than ten years. It was there that Levita's career as the foremost tutor of Christian notables in Hebrew lore commenced. The first edition of Levita's Baḥur (Rome, 1518) is dedicated to Aegidius. Aegidius introduced Levita to classical scholarship and the Greek language, thus enabling him to utilize Greek in his Hebrew lexicographic labors — a debt acknowledged by Levita, who, in 1521, dedicated his Concordance to the cardinal.\nAntonini's main motive was to penetrate the mysteries of the Cabala. Ægidius belonged to the group of sixteenth century Christian cabalists, among whom Johann Reuchlin and Pico della Mirandola also were prominent, who believed that Jewish mysticism, and particularly the Zohar, contained incontrovertible testimony to the truth of the Christian religion. In the course of Reuchlin's conflict with the obscurantists (1507–21), in which the preservation of the Jewish books was at issue, the cardinal wrote (1516) to his friend: \"While we labor on thy behalf, we defend not thee, but the law; not the Talmud, but the Church.\"\nAntonini also engaged another Jewish scholar, Baruch di Benevento, to translate for him the Zohar (the mystic Book of Splendor). The scholar last named may also have been partly responsible for the numerous cabalistic translations and treatises which appeared under the name of Ægidius. The cardinal was a collector of Hebrew manuscripts, of which many are still to be seen at the Munich Library, bearing both faint traces of his signature and brief Latin annotations.\nIn the Biblioteca Angelica at Rome an old Hebrew manuscript is extant, which was given to Antonini by Pope Leo X. The richly illuminated manuscript (Ms. Or 72), produced in the 14th century, contains Biblical texts in Hebrew, grammatical and rabbinic works. The British Museum contains a copy of Makiri and the Midrash on the minor Prophets, written for the cardinal at Tivoli, in the year 1514, by Johanan ben Jacob Sarkuse. The study of Jewish literature led the cardinal to a friendly interest in the Jews themselves, which he manifested both in his energetic encouragement of Reuchlin in the struggle referred to above and in a vain attempt which he made in the year 1531, in conjunction with the cardinal Geronimo de Ghinucci, to prevent the issue of the papal edict authorizing the introduction of the Inquisition against the Maranos.\n\n\n== Works ==\nAntonini was a profound student of the Scriptures and a good scholar in Greek as well as Hebrew. Giovanni Pontano dedicated to him one of his Dialoghi.\nThe writings commonly attributed to Antonini are numerous. Most of them are to be found in manuscript form in the Bibliothèque Nationale, Paris, but their authenticity is still to be established. Aside from minor works on the Hebrew language, the majority by far are of a cabalistic nature. There is scarcely a classic of Jewish medieval mysticism that he has not translated, annotated, or commented upon. Among these works may be mentioned the Zohar.\nOnly a few of Antonini's writings have been printed in the third volume of the Collectio Novissima of Martène. When urged by Pope Clement VII to publish his works, he is said, by the Augustinian historian, Friar Tomás de Herrera, O.E.S.A., to have replied that he feared to contradict famous and holy men by his exposition of Scripture. The Pope replied that human respect should not deter him; it was quite permissible to preach and write what was contrary to the opinions of others, provided one did not depart from the truth and from the common tradition of the Church.Antonini's major original work is an historical treatise: Historia viginti sæculorum per totidem psalmos conscripta. It deals in a philosophico-historical way with the history of the world before and after the birth of Christ, is valuable for the history of its own time, and offers a certain analogy with Bossuet's famous Discours sur l'histoire universelle.\nThe six books of Antonini's important correspondence (1497–1523) concerning the affairs of his Order, much of which is addressed to Friar Gabriel of Venice, his successor as Prior General, are preserved in Rome in the Biblioteca Angelica. Cardinal Joseph Hergenröther, a leading Church historian of the 19th century, praised particularly the circular letter in which Antonini made known (27 February 1519), his resignation of the office of Prior General of the Augustinian friars.Other of Antonini's known works are a commentary on the first book of the Sentences of Peter Lombard, three Eclogae Sacrae, a dictionary of Hebrew roots, a Libellus de ecclesiae incremento, a Liber dialogorum, and an Informatio pro sedis apostolicae auctoritate contra Lutheranam sectam.\n\n\n== Notes ==\n\n\n== References ==\n This article incorporates text from a publication now in the public domain: Herbermann, Charles, ed. (1913). Catholic Encyclopedia. New York: Robert Appleton Company. \n This article incorporates text from a publication now in the public domain: Singer, Isidore;  et al., eds. (1901–1906). \"Aegidius of Viterbo\". The Jewish Encyclopedia. New York: Funk & Wagnalls.\nSignorelli, Giuseppe, Il cardinal Egidio da Viterbo: Agostino, umanista e riformatore (1469-1532) (Florence, 1929).\nJohn W. O'Malley, S.J., Giles of Viterbo on Church and Reform: A Study in Renaissance Thought. Leiden: Brill, 1968.\n\n\n== External links ==\nbta.it\nPaper on Giles of Rome\n(in Italian) Egidio da Viterbo"