"Motörhead () were  a British rock band formed in June 1975 by bassist, singer, songwriter and only constant member Ian \"Lemmy\" Kilmister, guitarist Larry Wallis and drummer Lucas Fox. The band are often considered a precursor to the new wave of British heavy metal, which re-energised heavy metal in the late 1970s and early 1980s. Though several guitarists and drummers have played in Motörhead, most of their best-selling albums and singles feature the work of Phil \"Philthy Animal\" Taylor on drums and \"Fast\" Eddie Clarke on guitars.\nMotörhead released 22 studio albums, 10 live recordings, 12 compilation albums, and five EPs over a career spanning 40 years. Usually a power trio, they had particular success in the early 1980s with several successful singles in the UK Top 40 chart. The albums Overkill, Bomber, Ace of Spades, and particularly the live album No Sleep 'til Hammersmith cemented Motörhead's reputation as a top-tier rock band. The band are ranked number 26 on VH1's 100 Greatest Artists of Hard Rock. As of 2016, they have sold more than 15 million albums worldwide.Most often classified as heavy metal, Motörhead has been credited with being part of and influencing numerous musical scenes, thrash metal and speed metal especially. Lemmy, however, always insisted that they were a rock and roll band. He said that they had more in common with punk bands, but with their own unique sound, Motörhead is embraced in both punk and metal scenes. Their lyrics typically covered such topics as war, good versus evil, abuse of power, promiscuous sex, substance abuse, and, most famously, gambling, the latter theme being the focus of their hit song \"Ace of Spades\".Lemmy died on 28 December 2015 from cardiac arrhythmia and congestive heart failure, after being diagnosed with prostate cancer. The day after his death, drummer Mikkey Dee and guitarist Phil Campbell both confirmed that Motörhead had disbanded. By 2018, all three members of Motörhead's classic lineup (Lemmy, Taylor and Clarke) had died."