"Nicotine is a chiral alkaloid that is naturally produced in the nightshade family of plants (most predominantly in tobacco and Duboisia hopwoodii) and is widely used recreationally as a stimulant and anxiolytic. As a pharmaceutical drug, it is used for smoking cessation to relieve withdrawal symptoms. Nicotine acts as a receptor agonist at most nicotinic acetylcholine receptors (nAChRs), except at two nicotinic receptor subunits (nAChRα9 and nAChRα10) where it acts as a receptor antagonist.Nicotine constitutes approximately 0.6–3.0% of the dry weight of tobacco. Nicotine is also present at concentrations of millionths of a percent in the edible family Solanaceae, including potatoes, tomatoes, and eggplants, though sources disagree on whether this has any biological significance to human consumers. It functions as an antiherbivore chemical; consequently, nicotine was widely used as an insecticide in the past, and neonicotinoids, such as imidacloprid, are some of the most effective and widely used insecticides.\nNicotine is highly addictive, unless used in slow-release forms. Animal research suggests that monoamine oxidase inhibitors present in tobacco smoke may enhance nicotine's addictive properties. An average cigarette yields about 2 mg of absorbed nicotine. \nThe estimated lower dose limit for fatal outcomes is 500–1,000 mg of ingested nicotine for an adult (6.5–13 mg/kg). Nicotine addiction involves drug-reinforced behavior, compulsive use, and relapse following abstinence. Nicotine dependence involves tolerance, sensitization, physical dependence, and psychological dependence. Nicotine dependence causes distress. Nicotine withdrawal symptoms include depressed mood, stress, anxiety, irritability, difficulty concentrating, and sleep disturbances. Mild nicotine withdrawal symptoms are measurable in unrestricted smokers, who experience normal moods only as their blood nicotine levels peak, with each cigarette. On quitting, withdrawal symptoms worsen sharply, then gradually improve to a normal state.Nicotine use as a tool for quitting smoking has a good safety history. Animal studies suggest that nicotine may adversely affect cognitive development in adolescence, but the relevance of these findings to human brain development is disputed. At low amounts, it has a mild analgesic effect. According to the International Agency for Research on Cancer, \"nicotine is not generally considered to be a carcinogen.\"\nThe Surgeon General of the United States indicates that evidence is inadequate to infer the presence or absence of a causal relationship between exposure to nicotine and risk for cancer. Nicotine has been shown to produce birth defects in some animal species, but not others. It is considered a teratogen in humans. The median lethal dose of nicotine in humans is unknown, but high doses are known to cause nicotine poisoning."