"Isabel Martínez de Perón (Spanish pronunciation: [isaˈβel maɾˈtines də peˈɾon], born María Estela Martínez Cartas, 4 February 1931) is an Argentine politician who served as President of Argentina from 1974 to 1976. Serving as Vice President to her husband and succeeding him upon his death, she was the first female president in the world, by virtue of succession (Vigdís Finnbogadóttir of Iceland being the first so elected in 1980) although women had served as republican heads of state (Soong Ching-ling having served as \"chairman\" of China).\nIsabel Perón was the third wife of President Juan Perón. During her husband's third term as president from 1973 to 1974, she served as both Vice President and First Lady of Argentina. Following her husband's death in office in 1974, she served as President for almost two years before the military took over the government. Perón was then placed under house arrest for five years before exiled to Spain in 1981.\nIn 2007 an Argentine judge ordered Perón's arrest over the forced disappearance of an activist in February 1976, on the grounds that the disappearance was authorized by her signing of decrees allowing Argentina's armed forces to take action against \"subversives\". She was arrested near her home in Spain on 12 January 2007. Spanish courts subsequently refused her extradition to Argentina.Since the death of Carlos Menem, on 14 February 2021, Perón is the oldest living former Argentine president.\n\n\n== Early life and career ==\nMaría Estela Martínez Cartas was born in La Rioja, Argentina, daughter of María Josefa Cartas Olguín and Carmelo Martínez. She dropped out of school after the fifth grade. In the early 1950s she became a nightclub dancer, adopting the name Isabel, the saint's name (the Spanish form of that of Saint Elizabeth of Portugal) that she had chosen as a confirmation name.\n\n\n=== Juan Perón ===\nShe met her future husband during his exile in Panama. Juan Domingo Perón, who was 35 years her senior, was attracted by her beauty and believed she could provide him with the female companionship he had been lacking since the death of his beloved second wife Eva Perón (Evita) in 1952. Perón brought Isabel with him when he moved to Madrid, Spain, in 1960. Authorities did not approve of Perón's cohabitation with a young woman to whom he was not married, so on 15 November 1961 the former president reluctantly married for a third time.\n\n\n=== Early political career ===\nAs Perón resumed an active role in Argentine politics from exile, Isabel acted as a go-between from Spain to Argentina. Having been deposed in a coup in 1955, Perón was forbidden from returning to Argentina, so his new wife was appointed to travel in his stead. The CGT leader José Alonso became one of her main advisers in Perón's dispute against Steelworkers' leader Augusto Vandor's Popular Union faction during mid-term elections in 1965; Alonso and Vandor were both later assassinated in as-yet unexplained circumstances.\n\n\n==== José López Rega ====\nIsabel met José López Rega, who was a former policeman with an interest in occultism and fortune-telling, during a visit to Argentina in 1964. She was interested in occult matters (and as president reportedly employed astrological divination to determine national policy), so the two quickly became friends. Under pressure from Isabel, Perón appointed López as his personal secretary; López later founded the Argentine Anticommunist Alliance (Triple A), a death squad accused of perpetrating 1,500 crimes in the 1970s.\n\n\n==== Rise to power ====\n\nDr. Héctor Cámpora was nominated by Perón's Justicialist Party to run in the March 1973 presidential elections on the FREJULI ticket (a Peronist-led alliance). Cámpora won, but it was generally understood that Juan Perón held the real power; a popular phrase at the time was \"Cámpora al gobierno, Perón al poder\" (Cámpora in government, Perón in power). Later that year, Perón returned to Argentina, and Cámpora resigned to allow Perón to run for president. He chose Isabel as his nominee for the Vice Presidency to mollify feuding Peronist factions, as these could agree on no other running mate. His return from exile was marked by a growing rift between the right and left wings of the Peronist movement; while Cámpora represented the left wing, López Rega represented the right wing. The latter was, moreover, supported by the CGT labor federation leadership and Isabel herself, and this faction became known by the left as the entorno ('entourage') due to the inner circle status Perón afforded them. Juan Perón had long been inimical to the left, but cultivated their support while he was in exile. His sympathies ended, however, after the assassination of CGT leader José Ignacio Rucci by the leftist Montoneros in September.Perón's victory in a snap election called by Congress in September 1973 was always considered likely, and he won with 62% of the vote. He began his third term on 12 October, with Isabel as Vice President. Perón was by then in precarious health, however; a CIA cable at the time described him as alternating between a lucid state and that of senile dependency. Isabel had to take over as Acting President on several occasions during his tenure.\n\n\n== Presidency ==\n\nJuan Perón suffered a series of heart attacks on 28 June 1974; Isabel was summoned home from a European trade mission and secretly sworn in as acting president the next day. Juan Perón died on 1 July 1974, less than a year after his third election to office. As vice-president his widow formally ascended to the presidency, thus becoming the first woman in the world to hold the title of \"President\", although she was not the first woman to lead a country. She was popularly known as La Presidente.Although she lacked Evita Perón's charisma, the grieving widow at first attracted support from the nation. She pledged to uphold the social market economy policies embodied in the 1973 \"Social Pact\" as well her husband's long-held economic nationalism; her first significant economic policy decisions were the enactment of a new, pro-labor employment contract law and the granting to YPF a monopoly over filling stations. Even leftist groups, having fallen out with Juan Perón in previous months, publicly offered support to her. However she cancelled meetings with various constituent and political groups, and the sympathy resulting from her husband's death soon dissipated. Her government purged most leftists from university posts and the administration, and (as her husband and other Argentine presidents had done) used Federal intervention powers to unseat leftist governors. Following a string of political murders and a break by the Montoneros with the government, on 30 September Perón signed the Anti-Terrorism Law. This was the first in a series of measures which eroded constitutional rights, ostensibly for the sake of combating leftist violence.Another source of contention between her and the voters was the increasing impression that José López Rega, the Minister of Social Welfare, set the agenda for a broad swath of Perón's policies, vetting nearly all domestic and foreign policy. His public behaviour – which included bizarre actions such as silently mouthing her words as she spoke – began to cost the president much-needed support among the Argentine public. Known to have fascist sympathies, López Rega was also notably corrupt and used his position to secure business partnerships with (ODESSA network principal) Otto Skorzeny, (Libyan leader) Muammar Gaddafi, and (the Italian Fascist) Licio Gelli (to whose P-2 lodge López Rega belonged).López Rega's greatest influence upon Isabel Perón's presidency came through his recently formed Argentine Anticommunist Alliance (Triple A). A right-wing paramilitary force, between late 1973 and late 1974 the Triple A had already carried out nearly 300 murders, including that of Professor Silvio Frondizi (brother of former President Arturo Frondizi), Congressman Rodolfo Ortega Peña, activist Father Carlos Mugica, Buenos Aires Province Assistant Police Chief Julio Troxler, former Córdoba Vice-Governor Atilio López and former Chilean Army head Carlos Prats. Other prominent public servants, such as UCR Senator Hipólito Solari Yrigoyen, and left-wing University of Buenos Aires President Rodolfo Puiggrós, narrowly survived Triple A attacks; Puiggrós was then removed from his post.Atrocities were also being committed by left-wing extremists. Organized in 1968, the anarchist Montoneros murdered former head of state Pedro Aramburu, popular CGT union Secretary General José Ignacio Rucci, construction workers' union leader Rogelio Coria, former Interior Minister Arturo Mor Roig and U.S. Consul John Egan, among other murders and kidnappings. Throughout 1974, the rise of a new and nearly-as-violent Trotskyite group, the ERP, added to the cycle of violence. Having gained notoriety after the murder of FIAT executive Oberdan Sallustro, the ERP began the year with a violent assault on the Azul barracks. It murdered, among others, a criminal court judge, Jorge Quiroga; the writer Jordán Bruno Genta; and the publisher of La Plata's centrist El Día, David Kraiselburd. The kidnapping of Esso executive Victor Samuelson, freed for a ransom of US$12 million, ignited what would become a rash of such crimes. However, the government and paramilitaries used this environment to target and murder many legitimate opponents of the regime, as listed above.Following the murder of Buenos Aires Police Chief Alberto Villar (one of López Rega's closest collaborators in the Triple A) and his wife, as well as amid increasing activity by the ERP in the Province of Tucumán, Perón was persuaded to declare a state of siege on 6 November (suspending, among other rights, habeas corpus). Censorship also increased markedly, culminating in the closure by decree of one of the leading news dailies in Latin America (Crónica) and several other publications, as well as the banning of Argentine television figures such as talk show host Mirtha Legrand and comedian Tato Bores.Operation Independence began in Tucumán on 5 February 1975. This military campaign, though successful from a military standpoint, gained notoriety for its brutality; in addition to going after insurgents, it attacked elected officials, magistrates, University of Tucumán faculty, and even secondary school teachers.The government turned on the labor movement, the mainstay of Peronism for the better part of a quarter-century, classifying it as \"subversive\" and subject to reprisals. The November 1974 election of a left-wing union shop steward at a Villa Constitución steel mill and its disapproval by steelworkers' leader Lorenzo Miguel (a leading figure in the paramount CGT), resulted in a brutal 20 March 1975 police assault on the facility. The raid, executed jointly with Triple A heavies, led to the \"disappearances\" of many of the 300 workers arrested.\n\nStacking the State Intelligence Secretariat (SIDE) with Fascists loyal to him, Lopez Rega hastened unprecedented intrigue, culminating in the kidnapping of Jorge and Juan Born, prominent local executives who paid US$60 million for their release (a world record at the time). Using contacts from among the Montoneros' many double agents, the agency kept the Born brothers in a known SIDE safehouse for nine months until their June 1975 release without public suspicion of SIDE involvement, a successful false flag operation that led to others (albeit less ambitious ones) in the following months. López Rega, meanwhile, arranged the dismissal of many of the most competent policy makers Perón had inherited from her husband's brief presidency; by May 1975, both Economy Minister José Ber Gelbard and Central Bank President Alfredo Gómez Morales had been replaced with right-wing López Rega loyalists.Isabel Perón initially maintained the Social Pact inherited from her husband, and succeeded in enhancing it with reforms such as the enactment in December 1974 of payroll taxes to strengthen the Public Retirement System. Yielding to pressure from labor she ignored the incomes policy aspect of the Social Pact, however, and while the economy remained otherwise stable, a price/wage spiral ensued with inflation rising from a low of 12% a year at the height of the Social Pact in May 1974 to 80% a year later. The Social Pact also faced growing opposition by employers, particularly after conservative members of the General Economic Council (CGE) split from the conciliatory CGE in March 1975 to form the more combative APEGE; this group would later adopt the tactic of staging recurring lockouts against the administration.Faced with record trade and budget deficits, the new Economy Minister, Celestino Rodrigo, proceeded to apply economic shock therapy in June. These measures doubled rates and fares and ordered a surprise halving of the peso's value, which, by forcing those who could to stampede towards the U.S. dollar, destroyed the fragile financial balance that had been maintained to that point. Consumer prices doubled between May and August 1975 alone, and though sharp, mandatory wage hikes had been negotiated between the government, labor and employers, the resulting shock (known as the Rodrigazo) ignited protest across Argentina, including a two-day general strike by the CGT (the first ever against a Peronist administration). Following protests in front of his offices, the now hated José López Rega was hastily appointed Ambassador to Spain and boarded a flight into exile.\n\n\n=== Fall from power ===\nLópez Rega left the country on 19 July. Shortly afterward, Perón dismissed her protégés in the Economy Ministry, Celestino Rodrigo, and in the Armed Forces High Command, General Alberto Numa Laplane, whom she replaced in August with General Jorge Videla, a quiet career officer with an uneventful military record. The president's appointment of a pragmatic economist, Peronist wheelhorse Antonio Cafiero and her 13 September announcement of a leave of absence relieved ample sectors of society, from labor unions to business. Designating Senate President Ítalo Lúder, a moderately conservative Peronist, in her stead, it was widely hoped that her leave would become permanent; but, it was not to be.Limited largely to the murder of security forces and public figures during 1974, political violence escalated during 1975 to include soft targets in the population at large as Trotskyist ERP and fascist Triple A extremists began taking to midnight lightning strikes against each other and civilian targets such as banks, buses, yachts, parking lots, and restaurants. Over 700 lives were lost to political violence during Mrs. Perón's first 15 months in office, of which more than half were subversives and most of the remainder were security forces; by March 1976, civilians comprised fully half of the 1,358 deaths attributable to this conflict. The Montoneros, moreover, began a series of audacious attacks on military installations, including August dynamiting of the nearly finished destroyer Santísima Trinidad near the port of La Plata and the Operation Primicia, a terrorist attack on a military base in Formosa Province on 5 October. Anxious to placate the exasperated public, the military, hard-line labor leaders (particularly the steelworkers' Lorenzo Miguel), and most other Peronists, on 6 October she and Lúder signed new measures giving blanket immunity for the Armed Forces that they may (in her words) \"annihilate subversive elements throughout the country\" – in effect a nationwide extension of the state of siege that had been imposed in Tucumán. The measure won her just enough support to return from \"sick leave\" and on 17 October (on Peronists' historically central Loyalty Day), Perón appeared at the balcony of the Casa Rosada, back at her post.Her health remained fragile, however, and a gallbladder affliction forced her to take a second, shorter leave of absence in November. Interior Minister Ángel Robledo's proposal that elections (scheduled for March 1977) should instead be held in November 1976 was approved by the president during this leave, bringing renewed hope that an increasingly rumored coup d'état could yet be averted.Anxiety over inflation, meanwhile, continued to dominate daily life. Monthly inflation did slow from the (then-record) 35% logged in July, but remained at 10–15% monthly between September and January 1976. A sudden fall in business investment had by then sent the economy into a sharp recession, however. GDP growth had already slowed from a 6.8% rate in the fourth quarter of 1974 to 1.4% in the second quarter; following the Rodrigazo crisis, the economy shrank 4.4% by the first quarter of 1976, with fixed investment falling by one sixth and auto production by a third. The mid-year recession had significantly curbed the growth in imports; but because exports continued to fall, the trade deficit reached a record billion dollars in 1975, nearly depleting foreign exchange reserves. The government's 1975 budget had been derailed by the crisis and by earlier commitments to cancel its then still-modest foreign debt, something which even so cost Argentina US$2.5 billion that year, alone. The resulting budget deficits (over US$5 billion, in 1975) and a series of lockouts in the agricultural and commercial sectors began to reassert pressure on prices after November, leading to hoarding and shortages.The appointment of Brigadier General Héctor Fautario, a loyalist of Perón, to the branch's high command, fueled broader support in the Air Force for action against her administration, and on 18 December, General Jesús Capellini attempted a coup d'état by seizing the Morón Airport and Air Base. The military joint chiefs, however, who obtained Fautario's dismissal, stayed the mutiny's hand, secretly concluding that the timing was premature. Partly in response, the nearly defeated ERP on 23 December besieged the important Monte Chingolo Armory, which claimed the lives of six military personnel and 85 guerrilla members; this defeat marked the end of the ERP's violent campaign.Allegations had surfaced in August that Perón had embezzled large sums from the Cruzada de Solidaridad ('Solidarity Crusade'), a government-run charity, into her personal accounts in Spain. A congressional investigation launched in November over the charity fund embezzlement allegations had meanwhile dissipated her remaining support in Congress, prompting the departure of the second-largest party in the FREJULI alliance, the centrist MID, and dividing the Peronist caucus into \"Vericalist\" and \"Rebel\" factions. Her administration was dealt further political blows from within her own party by a break in December with the Governor of Buenos Aires Victorio Calabró, who declared that \"we won't make it [to the next elections]\" and with the resignation in January 1976 of Interior Minister Ángel Robledo, her chief legislative and military point man.Isabel Perón granted ever more significant policy concessions to the largely conservative military in the early months of 1976, from security matters to economic. Economy Minister Antonio Cafiero, supported by labor, was dismissed in February, and his replacement, Eugenio Mondelli, announced further shock therapy measures similar to the previous year's Rodrigazo – the Mondelazo. These measures included steep hikes in utility rates and a new devaluation of the already shredded peso, causing prices to more than double over the next three months (inflation reached a new record of over 700% by April) and leading a new wave of strikes and business lockouts.The UCR initiated impeachment proceedings against the President in February with the support of the \"Rebel\" Peronist faction in Congress. Near defeat though still active, the Montoneros detonated a bomb at Army headquarters on 15 March, killing one and injuring 29 people. The head of the CGE, Julio Broner, left Argentina with his family, altogether; CGT Secretary General Casildo Herreras followed suit, announcing from exile that he had \"erased\" himself. The leader of the opposition UCR Ricardo Balbín, while making efforts to form a multi-party congressional crisis committee, held a private meeting in February with Army Chief of Staff Videla and told him, \"If you're planning to stage a coup, do so as soon as possible – expect no applause from us, but no obstacles either.\" The media were by then openly counting down the days to the expected coup d'état, and several newspapers published editorials calling for Perón's overthrow. Even as the joint chiefs professed loyalty to La Presidente, the Armed Forces High Command had already given final approval to a coup, code-named 'Operation Aries', when the president returned from her leave of absence in October 1975.After working late into the evening of 23 March 1976, in the hope of averting a renewed business lockout, Perón celebrated her executive assistant's birthday with staff. Alerted to suspicious military exercises, she boarded the presidential helicopter shortly after midnight. It did not fly her to the Quinta de Olivos presidential residence but to an Air Force base in nearby Jorge Newbery International Airport, where she was formally deposed and arrested.\n\n\n== Detention and exile ==\nThe majority of Peronist officials in the national, provincial, and municipal governments were promptly arrested, and many \"disappeared\" permanently during the subsequent Dirty War, including numerous right-wing Peronists. Isabel Perón herself remained under house arrest in Villa La Angostura and other secluded locations for five years, and was eventually sent into exile in Spain in July 1981. She continued to serve as official head of her husband's Justicialist Party until her resignation in February 1985, nearly a decade after her fall from power. Though there were some who desired her return and wished for her return to power, she refused to stand for election to the presidency when elections were ultimately called in 1983. She lived in Madrid, maintained close links with Francisco Franco's family, and sometimes went to Marbella.Following the restoration of democracy in Argentina, she was pardoned from charges of corruption during her presidency and returned in December 1983 as a guest of honor at President Raúl Alfonsín's inauguration, and in May 1984 to participate in policy talks arranged by Alfonsín and opposition leaders. Still nominally head of Juan Perón's Justicialist Party, she played a constructive role in the talks, supporting cooperation between the restive CGT labor union (her party's political base) and Alfonsín. The talks concluded with a weak agreement, and she resigned from her post as titular head of the party. She returned to Argentina once more, in 1988, to resolve probate disputes concerning the Perón estate, then resumed residence in Spain under a very low profile.\n\n\n== Arrest in Spain ==\nA judge in Mendoza, Argentina in November 2006 demanded testimony from Isabel Perón, along with other Peronist ministers of her government, in a case involving forced disappearances during her presidency; on 12 January 2007, she was arrested in Madrid. She was charged by the Argentine authorities with the disappearance of Héctor Aldo Fagetti Gallego on 25 February 1976, and for crimes related to her issuance of 6 October 1975 decree calling the Armed Forces to \"annihilate subversive elements.\" The Nunca Más (\"Never Again\") report released in 1984 by the National Commission on the Disappearance of Persons recorded 600 disappearances and 500 assassinations under the Peronist governments from 1973 to 1976, and it is acknowledged that the Triple A alone murdered some 600 people.The 2006 capture in Spain of Triple A death-squad overseer Rodolfo Almirón, who had also been in charge of López Rega's and Isabel Perón's personal security, shed further light on the extent of Triple A involvement in the early stages of the Dirty War. Isabel Perón's extradition to Argentina was refused by Spain on 28 March 2008. Spain's National Court ruled twice that the charges against her did not constitute crimes against humanity, adding that the statute of limitations on the charges expired after 20 years.The Supreme Court of Justice of Argentina unanimously dismissed on 21 June 2017 the petitions to interrogate Isabel Perón either as a witness or as a defendant.\n\n\n== See also ==\nNational Reorganization Process\n\n\n== Notes ==\n\n\n== References ==\n\n\n== Further reading ==\nGuareschi, Roberto (5 November 2005). \"Not quite the Evita of Argentine legend\". New Straits Times. p. 21.\nSkard, Torild (2014) \"Isabel Péron\" in Women of Power – Half a century of female presidents and prime ministers worldwide. Bristol: Policy Press, ISBN 978-1-4473-1578-0.\n\n\n== External links ==\nFirst female president for Argentina"