"A metal umlaut is a diacritic that is sometimes used gratuitously or decoratively over letters in the names of hard rock or heavy metal bands—for example, those of Blue Öyster Cult, Queensrÿche, Motörhead, the Accüsed, Mötley Crüe and the parody band Spın̈al Tap.\n\n\n== Usage ==\nAmong English speakers, the use of umlaut marks and other diacritics with a blackletter typeface is a form of foreign branding which has been attributed to a desire for a \"gothic horror\" feel. The metal umlaut is not generally intended to affect the pronunciation of the band's name, unlike the umlaut in German (where the letters u and ü represent distinct vowels) and the Scandinavian languages (where å, ä and a, ö, ø and o are distinct letters).\n\n\n== History ==\nThe first gratuitous use of the umlaut in the name of a hard rock or metal band appears to have been by Blue Öyster Cult in 1970. Blue Öyster Cult's website states it was added by guitarist and keyboardist Allen Lanier, but rock critic Richard Meltzer claims to have suggested it to their producer and manager Sandy Pearlman just after Pearlman came up with the name: \"I said, 'How about an umlaut over the O?' Metal had a Wagnerian aspect anyway.\"\n\n\n== Reactions ==\nSpeakers of languages which use an umlaut to designate a pronunciation change may understand the intended effect, but perceive the result differently. When Mötley Crüe visited Germany, singer Vince Neil said the band couldn't figure out why \"the crowds were chanting, 'Mutley Cruh! Mutley Cruh!'\"These decorative umlauts have been parodied in film and fiction; in an interview about the mockumentary film This Is Spın̈al Tap, fictional rocker David St. Hubbins (Michael McKean) says, \"It's like a pair of eyes. You're looking at the umlaut, and it's looking at you.\" The heavy metal parody band Gwar parodied the use of metal umlauts in a lyric insert included with its first record, stylizing the song names with gratuitous diacritics. In 1997, the satirical newspaper The Onion published an article titled \"Ünited Stätes Toughens Image With Umlauts.\"\n\n\n== Band or album name examples ==\n\n\n=== English-speaking countries ===\nThe Accüsed – American сrossover thrash band.\nAssück – American grindcore band.\nBarbariön - Australian metal band.\nBeowülf – California thrash metal band.\nBlue Öyster Cult – American hard rock band.\nThe Crüxshadows – American alternative rock band.\nDälek – American hip-hop band.\nDeath in June – British dark folk/experimental band used umlauts and accented \"e\"s in their name and titles on the original releases of their albums The Wörld Thät Sümmer (1985) and Thé Wäll Öf Säcrificé (1989), spelling their name, Deäth In Jüne and Déäth In Jüné, respectively on each.\nDeströyer 666 – Thrash metal/Black metal band.\nDethklok – fictional metal band from the cartoon Metalocalypse, sometimes spelled as \"Dëthkløk\" in the band's logo.\nGreen Jellÿ – comedy metal band, originally spelled (and still pronounced) Green Jellö.\nG̈r̈oẗus̈ – Experimental band, their logo design has umlauts over only the consonants.\nHüsker Dü – American punk band (the game \"Hūsker Dū?\" was published with macrons instead of umlauts).\nInfernäl Mäjesty – Canadian thrash metal band.\nJack Ü – American EDM DJ duo, side group and collaborative project, consisting of Mad Decent founder Diplo and OWSLA founder Skrillex.\nKïll Cheerleadër – Canadian punk metal band.\nKing Creosote – Scottish band sometimes used a three-dot \"umlaut\" in some of their artwork, over the \"i\".\nLȧȧz Rockit – American thrash band (German pronunciation would be almost \"Let's rock it\").\nLäther – album of Frank Zappa, used an umlaut in its title.\nLeftöver Crack – American anarcho punk band.\nMaxïmo Park – British indie rock band.\nMöngöl Hörde – British hardcore punk/noise rock band.\nMötley Crüe – American glam metal band.\nMotörhead – English rock band.\nMoxy Früvous – Canadian political satire band.\nNight on Bröcken – debut album by American progressive metal band Fates Warning. Apparently a reference to the German mountain Brocken, which is not spelled with an umlaut.\nQueensrÿche – American progressive metal band.\nRrröööaaarrr and Dimension Hatröss – albums by Canadian thrash metal band Voivod. They also used it for their songs \"Korgüll the Exterminator\" and \"Chaosmöngers\", which appear on Rrröööaaarrr and Dimension Hatröss respectively.\nRuste⃛d Root – American jam band uses a three-dot umlaut over the \"e\" in its logo, as seen on its album covers.\nSpın̈al Tap – British semi-fictional band, with a dotless letter i and a metal umlaut over the n.\nToilet Böys – American laser punk band from New York City.\nÜnloco – alternative metal/hard rock band.\nYächtley Crëw - A Yacht rock band based out of the Los Angeles area using the metal umlaut for comedic effect\nZnöwhite – American thrash band.\n\n\n=== Other countries ===\nАквариум - Russian rock band, whose name is stylized as \"Åквариум\" on their logo, and they use \"Å\" as their symbol.\nCrashdïet – Swedish glam metal band.\nDie Ärzte – German punk band, have used three dots over the \"Ä\" since their 2003 album Geräusch. The normal two-dot umlaut, Die Ärzte, is simply correct German for The Doctors.\nGirugämesh – Japanese rock band often stylise their name with an umlaut over the a.\nInfernal – Danish electronic band, was stylized as Infërnal on their album Waiting for Daylight.\nInsidiöus Törment – Liechtenstein-based old school heavy metal band who use gratuitous umlauts, but pronounce them nonetheless.\nKobaïan – French progressive rock band Magma sing in this constructed language, which has many diereses in its written form.\nKözi – Japanese rock musician.\nMägo de Oz – Spanish folk metal band.\nMoottörin Jyrinä – Finnish heavy metal band, the umlaut in Moottörin is gratuitous, but the one in Jyrinä is not.\nMotör Militia – Bahraini thrash metal band.\nMütiilation – French black metal band.\nPüdelsi – Polish rock band.\nTörr – Czech black metal band.\n\n\n== Other examples ==\n\n\n=== Video games ===\nBrütal Legend – action-adventure video game\nDynamite Düx – a beat 'em up video game\nLars Ümlaüt – a character in Guitar Hero II and III\nDieselstörmers – a crowdfunded in 2014 pre-released steampunk multiplayer platformer\n\n\n=== Other ===\nHäagen-Dazs – an ice cream brand (introduced 1961)\nCröonchy Stars – a discontinued breakfast cereal (introduced 1988)\nTonfön – the Tongan telephone company (introduced 2002)\nBrüno – film by Sascha Baron Cohen (2009)\nLöded Diper – name of the band that Rodrick Heffley is a part of in the book series Diary Of A Wimpy Kid\nDeathtöngue – the original name of a metal band in the comic Bloom County (changed, after media publicity, to \"Billy and the Boingers\")\n\n\n== See also ==\nDevil horns, heavy metal hand signal\nFaux Cyrillic (Faцx Cyяillic)\nForeign branding (Häagen-Dazs, Fahrvergnügen)\nNu metal, also stylized as nü-metal\nSensational spelling\nÜber\nWord play\n\n\n== References ==\n\n\n== External links ==\n\nMy Life in Heavy Metal by Steve Almond (excerpt)\nThe Döts (Dave Krinsky)\nWould you like umlauts with that? (PDF) by Bruce Campbell\nThe Metal Umlaut in the Liff Dictionary"