"The Lotus Sūtra (Sanskrit: Saddharma Puṇḍarīka Sūtra, lit. 'Sūtra on the White Lotus of the True Dharma') is one of the most popular and influential Mahayana sutras, and the basis on which the Tiantai, Tendai, Cheontae, and Nichiren schools of Buddhism were established.\nAccording to British professor Paul Williams, \"For many East Asian Buddhists since early times, the Lotus Sutra contains the final teaching of Shakyamuni Buddha, complete and sufficient for salvation.\"\n\n\n== Title ==\n\nThe earliest known Sanskrit title for the sūtra is the सद्धर्मपुण्डरीक सूत्र, Saddharma Puṇḍarīka Sūtra, meaning 'Scripture of the Lotus Blossom of the Fine Dharma'. In English, the shortened form Lotus Sūtra is common. The Lotus Sūtra has also been highly regarded in a number of Asian countries where Mahāyāna Buddhism has been traditionally practiced.\nTranslations of this title into the languages include:\n\nChinese: 妙法蓮華經; pinyin: Miàofǎ Liánhuá jīng (shortened to 法華經; Fǎhuá jīng).\nJapanese: 妙法蓮華経, romanized: Myōhō Renge Kyō (short: 法華経, Ho(k)ke-kyō).\nKorean: 묘법연화경; RR: Myobeop Yeonhwa gyeong (short: 법화경; Beophwa gyeong).\nTibetan: དམ་ཆོས་པད་མ་དཀར་པོའི་མདོ, Wylie: dam chos padma dkar po'i mdo, THL: Damchö Pema Karpo'i do.\nVietnamese: Diệu pháp Liên hoa kinh (short: Pháp hoa kinh).The Japanese Buddhist priest Nichiren (1222-1282) regarded the title as the summary of the Lotus Sutra's teachings. The chanting of the title is the basic religious practice he advocated  during his lifetime.\n\n\n== History of the text ==\n\n\n=== Theories on early formation ===\nIn 1934, based on his text-critical analysis of Chinese and Sanskrit versions, Japanese researcher  Kogaku Fuse concluded that the Lotus Sūtra was composed in four main stages. He theorizes the following:\n\nThe verse sections of chapters 1-9 and 17 were probably composed in the 1st century B.C.\nThe prose sections of these chapters added in the 1st century CE.\nThe date of the 3rd stage (Chapters 10, 11, 13-16, 18-20 and 27) to be around 100 C.E.\nThe last stage (Chapters 21—26), around 150 C.E.Professors Stephen F. Teiser and Jacqueline Stone opines that there is consensus about the stages of composition but not about the dating of these strata.Author Yoisho Tamura argues that the first stage of composition (Chapters 2—9) was completed around 50 CE and expanded by chapters 10-21 around 100 CE. He dates the third stage (Chapters 22—27) around 150 CE.Professor Yuichi Karashima proposes another modified version of Fuse's hypothesis with the following sequence of composition:\nChapters 2–9 form the earliest stratum.\nThe first layer of this stratum includes the tristubh verses of these chapters which may have been transmitted orally in a Prakrit dialect.\nThe second layer consists of the sloka verses and the prose of chapters 2-9.\nChapters 1, 10–20, 27, and a part of chapter 5 that is missing in Kumarajiva's translation.\nChapters 21–26 and the section on Devadatta in chapter 11 of the Sanskrit version.\n\n\n== Translations into the Chinese language ==\nThree translations of the Lotus Sūtra into Chinese are extant.The Lotus Sūtra was originally translated from Sanskrit into Chinese by Dharmarakṣa´s team in 286 CE in Chang'an during the Western Jin Period (265-317 CE). However, the view that there is a high degree of probability that the base text for that translation was actually written in a Prakrit language has gained widespread acceptance. It may have originally been composed in a Prakrit dialect and then later translated into Sanskrit to lend it greater respectability.This early translation by Dharmarakṣa was superseded by a translation in seven fascicles by Kumārajīva's team in 406 CE. According to Jean-Noël Robert, Kumārajīva relied heavily on the earlier version. The Sanskrit editions are not widely used outside of academia.\nThe Supplemented Lotus Sūtra of the Wonderful Dharma (Tiān Pǐn Miàofǎ Liánhuá Jīng), in 7 volumes and 27 chapters, is a revised version of Kumarajiva's text, translated by Jnanagupta and Dharmagupta in 601 CE.In some East Asian traditions, the Lotus Sūtra has been compiled together with two other sutras which serve as a prologue and epilogue:\n\nthe Innumerable Meanings Sutra (Chinese: 無量義經; pinyin: Wúliángyì jīng; Japanese: Muryōgi kyō); and\nthe Samantabhadra Meditation Sutra (Chinese: 普賢經; pinyin: Pǔxián jīng; Japanese: Fugen kyō). This composite sutra is often called the Threefold Lotus Sūtra or Three-Part Dharma Flower Sutra (Chinese: 法華三部経; pinyin: Fǎhuá Sānbù jīng; Japanese: Hokke Sambu kyō).\n\n\n== Translations into other foreign languages ==\nEugene Burnouf's Introduction à l'histoire du Buddhisme indien (1844) marks the start of modern academic scholarship of Buddhism in the West. His translation of a Nepalese Sanskrit manuscript of the Lotus Sutra, \"Le Lotus de la bonne loi\", was published posthumously in 1852. Prior to publication, a chapter from the translation was included in the 1844 journal The Dial, a publication of the New England transcendentalists, translated from French to English by Elizabeth Palmer Peabody. A translation of the Lotus Sutra from two Sanskrit manuscripts copied in Nepal around the 11th century was completed by Hendrik Kern in 1884.Western interest in the Lotus Sutra waned in the latter 19th century as Indo-centric scholars focused on older Pali and Sanskrit texts. However, Christian missionaries in the late 19th and early 20th centuries, based predominantly in China, became interested in Kumārajīva's translation of the Lotus Sutra into Chinese. These scholars attempted to draw parallels between the Old and New Testaments to earlier Nikaya sutras and the Lotus Sutra. Abbreviated and \"christo-centric\" translations were published by Richard and Soothill.After the Second World War, scholarly attention to the Lotus Sutra was inspired by renewed interest in Japanese Buddhism as well as archeological research in Dunhuang in Gansu, China. This led to the 1976 publication by Leon Hurvitz of the Lotus Sutra based on Kumarajiva's translation. \nWhereas the Hurvitz work was independent scholarship, other modern translations were sponsored by Buddhist groups: \n\nKato Bunno —  (1975 via Nichiren-shu/Rissho-kosei-kai)\nMurano Senchu —  (1974 via Nichiren-shu)\nBurton Watson —  (1993 via Soka Gakkai)\nBuddhist Text Translation Society —  (Xuanhua).The translations into French, Spanish and German are based on Kumarajiva's Chinese text. Each of these translations incorporate different approaches and styles that range from complex to simplified.\n\n\n== Outline ==\nThe sutra is presented in the form of a drama consisting of several mythological scenes.According to British writer Sangharakshita, it uses the entire cosmos for its stage, employs a multitude of mythological beings as actors and \"speaks almost exclusively in the language of images.\"\n\n\n== Sectarian interpretations ==\n\n\n=== In the Tendai sect ===\nAccording to the Tendai Sect and later Nichiren Shoshu Buddhism interpretations, The Lotus Sutra can be divided into two parts:\n\n“Theoretical Teachings” ( “Gate of Tracing”, Jp: 迹 門  Shaku—mon) — Chapters 1 — 14.\n“Essential Teachings”  ( “Gate of Origin”, Jp: 本 門 Hon—mon) — Chapters 15 — 22, 23—28 (apocryphal).Both the Tendai and Nichiren Shoshu sects teach that a significant difference between the two lies with the standpoint of who is preaching them. The Theoretical Teachings (Chapters 1–14) are preached by Shakyamuni Buddha who reached Buddhahood in Bodhgaya, India. On the other hand, Shakyamuni declares in the Essential Teachings (Chapters 15–22) that his enlightenment in India was only temporal, and that he in fact already  attained Buddhahood in a mysterious, timeless point in the Universe. \nAs result of these interpretations of the Tendai school and Nichiren schools of thought, all the provisional Buddhas, such as Amida Nyorai, Dainichi Nyorai, and Yakushi Nyorai, were integrated into one single original Buddha.Another doctrine taught by the sect is that the Chapter 2 of the Lotus Sutra does not reveal the cause or “seed” of enlightenment gained by Shakyamuni Buddha. Rather, this secret was revealed in the Chapter 16 of the Lotus Sutra by Ākāśagarbha (“Heavenly Jewel”) Bodhisattva to Nichiren and his latter claim to the expressed public recitation of Nam-Myoho-Renge-Kyo through an alleged deeper understanding of the Buddhist text. \nNevertheless, the sect teaches that only from Chapter 15 — 22 lies the necessary or\n“essential teaching” taught by Nichiren.  The recitation of the Chapter 2 is taught by the sect as a self—declaration to reject the various religions and forms of Buddhism taught by Shakyamuni Buddha—while Chapter 16 (through a metaphysical reading) crystallizes this Buddhist secret (also called “Hidden Treasure”) which gains a person the state of Buddhahood. The sect teaches that this hidden mystical secret is the practice of “Jigyo—Keta” (自 行 化 他) or the widespread propagation of the practice to non-believers.\n\n\n=== Modern interpretations ===\nThe Soka Gakkai, a modern religious movement that was once a lay organization of its parent Head Temple Taisekiji no longer teaches the differences between the two gates or “divisions” to their adherents. Instead, the modern organization teaches that only the sincere recitation of Nam-Myoho-Renge-Kyo is the “Doctrine of Essential Teaching” and does not need the extraordinary distinguishments perpetrated by any clerical priesthood. \nAfter its expulsion, the organization in 1992 revised its own Buddhist Manual Booklet (“Gongyo Kyoten”) to remove the prose section of Chapter 16 from their self-published Sutra books, citing the versical “Jigage” form to be identical to the Prose format. This revision, coupled with the historical precedence achieved by former Soka Gakkai President Tsunesaburo Makiguchi to also remove the versicle portion of Chapter 2 called “Seoge” in the 1930s, was an approved change by the Head Temple leadership at the time is now cited per their own religious independence.\n\n\n== Overview of each Chapter ==\n\n\n=== Chapter 1 ===\n\nChapter 1: Introduction – During a gathering at Vulture Peak, Shakyamuni Buddha goes into a state of deep meditative absorption (samadhi), the earth shakes in six ways, and he brings forth a ray of light which illuminates thousands of buddha-fields in the east. Bodhisattva Manjusri then states that the Buddha is about to expound his ultimate teaching.\n\n\n=== Chapters 2-9 ===\nScholars suggest that chapters 2-9 contain the original form of the text. Chapter 2 explains the goals of early Buddhism, the Arhat and the Pratyekabuddha, as expedient means of teaching. The Buddha declares that there exists only one path, leading the bodhisattva to the full awakening of a Buddha. This concept is set forth in detail in chapters 3-9, using parables, narratives of previous existences and prophecies of enlightenment.Chapter 2: Expedient Means – Shakyamuni explains his use of skillful means to adapt his teachings according to the capacities of his audience. He reveals that the ultimate purpose of the Buddhas is to cause sentient beings \"to obtain the insight of the Buddha\" and \"to enter the way into the insight of the Buddha.\"Chapter 3: Simile and Parable – The Buddha teaches a parable in which a father uses the promise of various toy carts to get his children out of a burning house. Once they are outside, he gives them all one large cart to travel in instead. This symbolizes how the Buddha uses the Three Vehicles: Arhatship, Pratyekabuddhahood and Samyaksambuddhahood, as skillful means to liberate all beings – even though there is only one vehicle. The Buddha also promises Sariputra that he will attain Buddhahood.\nChapter 4: Belief and Understanding – Four senior disciples address the Buddha. They tell the parable of the poor son and his rich father, who guides him with pedagogically skillful devices to regain self-confidence and \"recognize his own Buddha-wisdom\".Chapter 5: The Parable of Medicinal Herbs – This parable says that the Dharma is like a great monsoon rain that nourishes many different kinds of plants who represent Śrāvakas, Pratyekabuddhas, and Bodhisattvas, and all beings receiving the teachings according to their respective capacities.Chapter 6: Bestowal of Prophecy – The Buddha prophesies the enlightenment of Mahakasyapa, Subhuti, Mahakatyayana and Mahamaudgalyayana.\nChapter 7: The Parable of Phantom City – The Buddha teaches a parable about a group of people seeking a great treasure who are tired of their journey and wish to quit. Their guide creates a magical phantom city for them to rest in and then makes it disappear. The Buddha explains that the magic city represents the \"Hinayana nirvana\" and the treasure is buddhahood.Chapter 8: Prophecy of Enlightenment for Five Hundred Disciples – 500 Arhats are assured of their future Buddhahood. They tell the parable of a man who has fallen asleep after drinking and whose friend sews a jewel into his garment. When he wakes up he continues a life of poverty without realizing he is really rich, he only discovers the jewel after meeting his old friend again. The hidden jewel has been interpreted as a symbol of Buddha-nature. Zimmermann noted the similarity with the nine parables in the Tathāgatagarbha Sūtra that illustrate how the indwelling Buddha in sentient beings is hidden by negative mental states.Chapter 9: Prophecies Conferred on Learners and Adepts – Ananda, Rahula and two thousand Śrāvakas are assured of their future Buddhahood.\n\n\n=== Chapters 10-22 ===\nChapters 10-22 expound the role of the bodhisattva and the concept of the eternal lifespan and omnipresence of the Buddha. The theme of propagating the Lotus Sūtra which starts in chapter 10, continues in the remaining chapters.Chapter 10: The Teacher of the Law – Presents the practices of teaching the sutra which includes accepting, embracing, reading, reciting, copying, explaining, propagating it, and living in accordance with its teachings. The teacher of the Dharma is praised as the messenger of the Buddha.\n\nChapter 11: The Emergence of the Treasure Tower – A great jeweled stupa rises from the earth and floats in the air; a voice is heard from within praising the Lotus Sūtra. Another Buddha resides in the tower, the Buddha Prabhūtaratna who is said to have made a vow to make an appearance to verify the truth of the Lotus Sutra whenever it is preached. Countless manifestations of Shakyamuni Buddha in the ten directions are now summoned by the Buddha. Thereafter Prabhūtaratna invites Shakyamuni to sit beside him in the jeweled stupa. This chapter reveals the existence of multiple Buddhas at the same time and the doctrine of the eternal nature of Buddhahood.\nChapter 12: Devadatta – Through the stories of the dragon king's daughter and Devadatta, the Buddha teaches that everyone can become enlightened – men, women, animals, and even the most sinful murderers.Chapter 13: Encouraging Devotion – The Buddha encourages all beings to embrace the teachings of the sutra in all times, even in the most difficult ages to come. The Buddha prophecies that 6000 nuns who are also present will become Buddhas.Chapter 14: Peaceful Practices – Manjusri asks how a bodhisattva should spread the teaching. In his reply Shakyamuni Buddha describes the proper conduct and the appropriate sphere of relations of a bodhisattva. A bodhisattva should not talk about the faults of other preachers or their teachings. He is encouraged to explain the Mahayana teachings when he answers questions. Virtues such as patience, gentleness, a calm mind, wisdom and compassion are to be cultivated.\nChapter 15: Emerging from the Earth – In this chapter countless bodhisattvas spring up from the earth, ready to teach, and the Buddha declares that he has trained these bodhisattvas in the remote past. This confuses some disciples including Maitreya, but the Buddha affirms that he has taught all of these bodhisattvas himself.Chapter 16: The Life Span of Thus Come One – The Buddha explains that he is truly eternal and omniscient. He then teaches the Parable of the Excellent Physician who entices his sons into taking his medicine by feigning his death.Chapter 17: Distinction in Benefits – The Buddha explains that since he has been teaching as many beings as the sands of the Ganges have been saved.\nChapter 18: The Benefits of Responding with Joy – Faith in the teachings of the sutra brings much merit and lead to good rebirths.\nChapter 19: Benefits of the Teacher of the Law - the Buddha praises the merits of those who teach the sutra. They will be able to purify the six senses.Chapter 20: The Bodhisattva Never Disparaging – The Buddha tells a story about a previous life when he was a Bodhisattva called sadāparibhūta ('never disparaging') and how he treated every person he met, good or bad, with respect, always remembering that they will become Buddhas.Chapter 21: Supernatural Powers of the Thus Come One – Reveals that the sutra contains all of the Eternal Buddha's secret spiritual powers. The bodhisattvas who have sprung from the earth (ch. 15) are entrusted with the task of propagating it.Chapter 22: Entrustment – The Buddha transmits the Lotus Sutra to all bodhisattvas in his congregation and entrusts them with its safekeeping. The Buddha Prabhūtaratna in his jeweled stupa and the countless manifestations of Shakyamuni Buddha return to their respective buddha-field.\n\n\n=== Chapters 23-28 ===\nChapter 22: \"Entrustment\" – the final chapter in the Sanskrit versions and the alternative Chinese translation. Shioiri suggests that an earlier version of the sutra ended with this chapter. He assumes that the chapters 23-28 were inserted later into the Sanskrit version. These chapters are devoted to the worship of bodhisattvas.Chapter 23: \"Former Affairs of Bodhisattva Medicine King\" – the Buddha tells the story of the 'Medicine King' Bodhisattva, who, in a previous life, burnt his body as a supreme offering to a Buddha. The hearing and chanting of the Lotus Sūtra' is also said to cure diseases. The Buddha uses nine similes to declare that the Lotus Sūtra is the king of all sutras.\n\nChapter 24: The Bodhisattva Wonderful Sound – Gadgadasvara ('Wonderful Voice'), a Bodhisattva from a distant world, visits Vulture Peak to worship the Buddha. Bodhisattva 'Wonderful Voice' once made offerings of various kinds of music to the Buddha \"Cloud-Thunder-King\". His accumulated merits enable him to take 34 different forms to propagate the Lotus Sutra.Chapter 25, The Universal Gateway of the Bodhisattva Perciever of the World's Sounds – The Bodhisattva is devoted to Avalokiteśvara, describing him as a compassionate bodhisattva who hears the cries of sentient beings, and rescues those who call upon his name.Chapter 26 – Dhāraṇī- Hariti and several Bodhisattvas offer sacred dhāraṇī ('formulae') in order to protect those who keep and recite the Lotus Sūtra.Chapter 27 – Former Affairs of King Wonderful Adornment - tells the story of the conversion of King 'Wonderful-Adornment' by his two sons.Chapter 28 – Encouragement of the Bodhisattva Universal Worthy- a bodhisattva called \"Universal Virtue\" asks the Buddha how to preserve the sutra in the future. Samantabhadra promises to protect and guard all those who keep this sutra in the future Age of Dharma Decline.\n\n\n== Teachings ==\n\n\n=== One vehicle, many skillful means ===\nThis Lotus Sūtra is known for its extensive instruction on the concept and usage of skillful means – (Sanskrit: upāya, Japanese: hōben), the seventh paramita or perfection of a Bodhisattva – mostly in the form of parables.\nThe many 'skillful' or 'expedient' means and the \"three vehicles\" are revealed to all be part of the One Vehicle (Ekayāna), which is also the Bodhisattva path. This is also one of the first sutras to use the term Mahāyāna, or \"Great Vehicle\". In the Lotus Sūtra, the One Vehicle encompasses so many different teachings because the Buddha's compassion and wish to save all beings led him to adapt the teaching to suit many different kinds of people. As Paul Williams explains:\nAlthough the corpus of teachings attributed to the Buddha, if taken as a whole, embodies many contradictions, these contradictions are only apparent. Teachings are appropriate to the context in which they are given and thus their contradictions evaporate. The Buddha's teachings are to be used like ladders, or, to apply an age-old Buddhist image, like a raft employed to cross a river. There is no point in carrying the raft once the journey has been completed and its function fulfilled. When used, such a teaching transcends itself.\nThe sutra emphasizes that all these seemingly different teachings are actually just skillful applications of the one Dharma and thus all constitute the \"One Buddha Vehicle and knowledge of all modes\". The Lotus Sūtra sees all other teachings are subservient to, propagated by and in the service of the ultimate truth of the One Vehicle leading to Buddhahood. The Lotus Sūtra also claims to be superior to other sūtras and states that full Buddhahood is only arrived at by exposure to its teachings and skillful means.\n\n\n=== All beings have the potential to become Buddhas ===\n\nThe One Vehicle doctrine defines the enlightenment of a Buddha (anuttara samyak sambhodi) as the ultimative goal and the sutra predicts that all those who hear the Dharma will eventually achieve this goal. Many of the Buddha's disciples receive prophecies that they will become future Buddhas. Devadatta, who, according to the Pali texts, had attempted to kill the Buddha, receives a prediction of enlightenment. Even those, who practice only simple forms of devotion, such as paying respect to the Buddha, or drawing a picture of the Buddha, are assured of their future Buddhahood.Although the term buddha-nature (buddhadhatu) is not mentioned once in the Lotus Sutra, Japanese scholars Hajime Nakamura and Akira Hirakawa suggest that the concept is implicitly present in the text. Vasubandhu (fl. 4th to 5th century CE), an influential scholar monk from Ghandara, interpreted the Lotus Sutra as a teaching of buddha-nature and later commentaries tended to adopt this view.\nBased on his analysis of chapter 5, Zhanran (711-778), a scholar monk of the Chinese Tiantai school, argued that insentient things also possess buddha-nature and in medieval Japan, the Tendai Lotus school developed its concept of original enlightenment which claimed the whole world to be originally enlighted.\n\n\n=== The nature of the Buddhas ===\nAnother key concept introduced by the Lotus Sūtra is the idea of the eternal Buddha, who achieved enlightenment innumerable eons ago, but remains in the world to help teach beings the Dharma time and again.\nThe life span of this primordial Buddha is beyond imagination, his biography and his apparent death are portrayed as skillful means to teach sentient beings. The Buddha of the Lotus Sūtra states:\n\nIn this way, since my attainment of Buddhahood it has been a very great interval of time. My life-span is incalculable asatkhyeyakalpas [rather a lot of aeons], ever enduring, never perishing. O good men! The life-span I achieved in my former treading of the bodhisattva path even now is not exhausted, for it is twice the above number. Yet even now, though in reality I am not to pass into extinction [enter final nirvana], yet I proclaim that I am about to accept extinction. By resort to these expedient devices [this skill-in-means] the Thus Come One [the Tathagata] teaches and converts the beings.\n\nThe idea that the physical death of a Buddha is the termination of that Buddha is graphically refuted by the appearance of another Buddha, Prabhûtaratna, who passed long before. In the vision of the Lotus Sūtra, Buddhas are ultimately immortal.\nCrucially, not only are there multiple Buddhas in this view, but an infinite stream of Buddhas extending infinitely in space in the ten directions and through unquantifiable eons of time. The Lotus Sūtra illustrates a sense of timelessness and the inconceivable, often using large numbers and measurements of time and space.According to Gene Reeves, the Lotus Sūtra also teaches that the Buddha has many embodiments and these are the countless bodhisattva disciples. These bodhisattvas choose to remain in the world to save all beings and to keep the teaching alive. Reeves writes, \"because the Buddha and his Dharma are alive in such bodhisattvas, he himself continues to be alive. The fantastically long life of the Buddha, in other words, is at least partly a function of and dependent on his being embodied in others.\" The Lotus Sūtra also teaches various dhāraṇīs or the prayers of different celestial bodhisattvas who out of compassion protect and teach all beings. The lotus flower imagery points to this quality of the bodhisattvas. The lotus symbolizes the bodhisattva who is rooted in the earthly mud and yet flowers above the water in the open air of enlightenment.\n\n\n== Impact ==\nAccording to American professor Donald Lopez, the Lotus Sutra is \"arguably the most famous of all Buddhist texts,\" presenting \"a radical re-vision of both the Buddhist path and of the person of the Buddha.\"The Lotus Sutra was frequently cited in Indian works by Nagarjuna, Vasubandhu, Candrakirti, Shantideva and several authors of the Madhyamaka and the Yogacara school. The only extant Indian commentary on the Lotus Sutra is attributed to Vasubandhu.\nAccording to Jonathan Silk, the influence of the Lotus Sūtra in India may have been limited, but \"it is a prominent scripture in East Asian Buddhism.\"  The sutra has most prominence in Tiantai (sometimes called \"The Lotus School\") and Nichiren Buddhism. It is also influential in Zen Buddhism.\n\n\n=== China ===\nTao Sheng, a fifth-century Chinese Buddhist monk wrote the earliest extant commentary on the Lotus Sūtra. Tao Sheng was known for promoting the concept of Buddha nature and the idea that even deluded people will attain enlightenment. Daoxuan (596-667) of the Tang Dynasty wrote that the Lotus Sutra was \"the most important sutra in China\".Zhiyi (538–597 CE), the generally credited founder of the Tiantai school of Buddhism, was the student of Nanyue Huisi who was the leading authority of his time on the Lotus Sūtra. Zhiyi's philosophical synthesis saw the Lotus Sūtra as the final teaching of the Buddha and the highest teaching of Buddhism. He wrote two commentaries on the sutra: Profound meanings of the Lotus Sūtra and Words and phrases of the Lotus Sūtra. Zhiyi also linked the teachings of the Lotus Sūtra with the Buddha nature teachings of the Mahāyāna Mahāparinirvāṇa Sūtra and made a distinction between the \"Eternal Buddha\" Vairocana and the manifestations. In Tiantai, Vairocana (the primeval Buddha) is seen as the 'Bliss body' – Sambhogakāya – of the historical Gautama Buddha.\n\n\n=== Japan ===\nThe Lotus Sūtra is a very important sutra in Tiantai and correspondingly, in Japanese Tendai (founded by Saicho, 767–822). Tendai Buddhism was the dominant form of mainstream Buddhism in Japan for many years and the influential founders of popular Japanese Buddhist sects including Nichiren, Honen, Shinran and Dogen were trained as Tendai monks. \n\nNichiren, a 13th-century Japanese Buddhist monk, founded an entire school of Buddhism based on his belief that the Lotus Sūtra is \"the Buddha's ultimate teaching\", and that the title is the essence of the sutra, \"the seed of Buddhahood\". Nichiren held that chanting the title of the Lotus Sūtra – Namu Myōhō Renge Kyō – was the only way to practice Buddhism in the degenerate age of Dharma decline and was the highest practice of Buddhism. Nichiren described chapters 10-22 as the \"third realm\" of the Lotus Sutra (Daisan hōmon) which emphasizes the need to endure the trials of life and bodhisattva practice of the true law in the real sahā world.Dogen, the 13th-century Japanese founder of Sōtō Zen Buddhism, used the Lotus Sūtra often in his writings. According to Taigen Dan Leighton, \"While Dogen's writings employ many sources, probably along with his own intuitive meditative awareness, his direct citations of the Lotus Sūtra indicate his conscious appropriation of its teachings as a significant source\" and that his writing \"demonstrates that Dogen himself saw the Lotus Sutra, 'expounded by all buddhas in the three times,' as an important source for this self-proclamatory rhetorical style of expounding.\" In his Shobogenzo, Dogen directly discusses the Lotus Sūtra in the essay Hokke-Ten-Hokke, \"The Dharma Flower Turns the Dharma Flower\". The essay uses a dialogue from the Platform Sutra between Huineng and a monk who has memorized the Lotus Sūtra to illustrate the non-dual nature of Dharma practice and sutra study. During his final days, Dogen spent his time reciting and writing the Lotus Sutra in his room which he named \"The Lotus Sutra Hermitage\".The Soto Zen monk Ryōkan also studied the Lotus Sūtra extensively and this sutra was the biggest inspiration for his poetry and calligraphy. The Rinzai Zen master Hakuin Ekaku achieved enlightenment while reading the third chapter of the Lotus Sūtra.According to Shields, \"modern(ist)\" interpretations of the Lotus Sutra begin with the early 20th century nationalist applications of the Lotus Sutra by Chigaku Tanaka, Nissho Honda, Seno'o, and Nisshō Inoue. Japanese new religions began forming in the 19th century and the trend accelerated after World War II. Some of these groups have pushed the study of the Lotus Sutra to a global scale.  While noting the importance of several Japanese New Religious Movements to Lotus Sutra scholarship, Lopez focuses on the contributions made by the Reiyukai and Soka Gakkai and Stone discusses the contributions of the Soka Gakkai and Risshō Kōsei Kai. Etai Yamada (1900–1999), the 253rd head priest of the Tendai denomination conducted ecumenical dialogues with religious leaders around the world based on his interpretation of the Lotus Sutra which culminated in a 1987 summit. He also used the Lotus Sutra to move his sect from a \"temple Buddhism\" perspective to one based on social engagement. Nichiren-inspired Buddhist organizations have shared their interpretations of the Lotus Sutra through publications, academic symposia, and exhibitions.\n\n\n=== Influence on East Asian culture ===\n\nThe Lotus Sūtra has had a great impact on East Asian literature, art, and folklore for over 1400 years.\n\n\n==== Art ====\nVarious events from it are depicted in religious art. Wang argues that the explosion of art inspired by the Lotus Sutra, starting from the 7th and 8th centuries in China, was a confluence of text and the topography of the Chinese medieval mind in which the latter dominated.Motifs from the Lotus Sutra figure prominently in the Dunhuang caves built in the Sui era. In the fifth century, the scene of Shakyamuni and Prabhutaratna Buddhas seated together as depicted in the 11th chapter of the Lotus Sutra became arguably the most popular theme in Chinese Buddhist art. Examples can be seen in a bronze plaque (year 686) at Hase-dera Temple in Japan and, in Korea, at Dabotap and Seokgatap Pagodas, built in 751, at Bulguksa Temple.\n\n\n==== Literature ====\nTamura refers to the \"Lotus Sutra literary genre.\" Its ideas and images are writ large in great works of Chinese and Japanese literature such as The Dream of the Red Chamber and The Tale of Genji. The Lotus Sutra has had an outsized influence on Japanese Buddhist poetry.  Far more poems have been Lotus Sutra-inspired than other sutras.  In the work Kanwa taisho myoho renge-kyo, a compendium of more than 120 collections of poetry from the Heian period, there are more than 1360 poems with references to the Lotus Sutra in just their titles.\n\n\n==== Folklore ====\nThe Lotus Sutra has inspired a branch of folklore based on figures in the sutra or subsequent people who have embraced it.  The story of the Dragon King's daughter, who attained enlightenment in the 12th (Devadatta) chapter of the Lotus Sutra, appears in the Complete Tale of Avalokiteśvara and the Southern Seas and the Precious Scroll of Sudhana and Longnü folkstories. The Miraculous Tales of the Lotus Sutra is a collection of 129 stories with folklore motifs based on \"Buddhist pseudo-biographies.\"\n\n\n== See also ==\nAmitabha Sutra\nFlower Sermon\nHeart Sutra\nHokke Gisho, an annotated Japanese version of the sutra.\nMahayana sutras\n\n\n== Notes ==\n\n\n== References ==\n\n\n== Sources ==\n\n\n== Further reading ==\n\n\n== External links ==\nAn 1884 English translation from Sanskrit by H.Kern from the Sacred Texts Web site\nAn English translation by the Buddhist Text Translation Society"