"Richard Glover is an Australian talk radio presenter, journalist and author. He is best known as presenter of the drive program on 702 ABC Sydney. His book Flesh Wounds was voted one of the top five books of 2015 by viewers of ABC television's The Book Club and was Readers Choice Award winner as Biography of the Year in the 2016 Australian Book Industry Awards.\n\n\n== Life and career ==\nGlover was born in Australia on 13 July 1958, but spent some of his early life in Papua New Guinea. He graduated from the University of Sydney with a Bachelor of Arts degree with first class honours. He lives with the playwright Debra Oswald and they have two sons. He has written 13 books, including the humour book Desperate Husbands, which was a bestseller in Australia and has been published in translation in Italy and Poland.Glover presents the radio show Drive from Monday to Friday, 3pm to 6 pm on 702 ABC Sydney. He joined 702 ABC Sydney in January 1996, taking over the Drive segment from Mike Carlton. In 2004 he was awarded the Broadcaster of the Year Award for ABC local radio.Glover's writing for the stage includes Lonestar Lemon, which has toured nationally with Genevieve Lemon, and A Christmas Story, which premiered at the Sydney Opera House Drama Theatre in December 1998, with Richard Wherrett directing.\nGlover is also a newspaper journalist. His weekly humour column has appeared in The Sydney Morning Herald since 1985. He has also worked as that paper's news editor, arts editor and European correspondent. He also writes for The Washington Post.\nIn December 2011 Glover and Peter Fitzsimons achieved a record for the world's longest radio interview, supervised by Guinness World Records.\n\n\n== Political views ==\nGlover is an atheist, and says he \"never managed a speck of interest in religion\" but believes Christianity and religion should be tolerated by non-believers. In 2015 he wrote that \"Marketplace economics is now the God of our time, and its priests are Microsoft, Apple and Google\". Glover supports same-sex marriage in Australia, which he says will be \"entirely positive\".\n\n\n== Books ==\n(1990) Grin and bear it: a survivor's guide to marriage, kids, family holidays, home renovations, the English and other horrors (ISBN 0731801814)\n(1992) The P-plate parent (with Angela Webber) (ISBN 1863731989)\n(1993) Laughing stock: one man's battle with sex, work and a son called Batboy (ISBN 1863735658)\n(1994) (with Angela Webber)The joy of blokes: a survivor's guide to the men in your life, how to meet them, how to love them, how to eat their cooking (ISBN 1863737529)\n(1998) Maps, dreams, history: race and representation in Aboriginal Australia\n(2000) In bed with Jocasta (ISBN 0732268648)\n(2004) The dag's dictionary: a humorous book of words that should exist, but don't (ISBN 0733314368)\n(2005) Desperate husbands (ISBN 0732282500)\n(2009) The mud house: four friends, one block of land, no power tools (ISBN 9780732290290)\n(2010) Why men are necessary and other news from nowhere  (ISBN 9780733329159)\n(2013) George Clooney's haircut and other cries for help  (ISBN 9781460700303)\n(2015) Flesh wounds  (ISBN 9780733334320)\n(2018) Land before avocado: journeys in a lost Australia (ISBN 9780733339813)\n(2020) Love, Clancy: a dog's letters home (ISBN 9780733341069)\n\n\n== Children's Books ==\n(2003) The dirt experiment (ISBN 0733616208)\n(2007) The joke trap (ISBN 9780733320552\n(2011) The no-minute noodler: dag's dictionary for kids (e-book) (ISBN 9780730497035\n\n\n== References ==\n\n\n== External links ==\nSydney Morning Herald column\nABC 702 Drive program\nABC profile\nA Cure for Saggy Breast? – Glover's contribution to an A Current Affair story. (Video link available)\nOfficial Website"