"The Arabs (singular Arab ; singular Arabic: عَرَبِيٌّ‎, ISO 233: ‘arabī, Arabic pronunciation: [ˈʕarabi], plural Arabic: عَرَبٌ‎, ISO 233: ‘arab, Arabic pronunciation: [ˈʕarab] (listen)) also known as the Arab People are an ethnic group and a nation mainly inhabiting the Arab world in Western Asia, Northern Africa, the Horn of Africa, Western Indian Ocean islands (including the Comoros), and Southern Europe (like Sicily, Malta, and formerly in Al-Andalus / Iberian Peninsula). The Arab diaspora is established around the world in significant numbers, in the Americas, Western Europe, Indonesia, Israel, Turkey, India and Iran. In modern usage the term refers to those whose native language is Arabic and identify as such, this contrasts with the narrower traditional definition which referred to the descendants of the Tribes of the Arabian Peninsula. Though Islam started in Arabia, Arabic is the language of Islamic scripture, and most Arabs are Muslims. However, only about 20% of Muslims are Arabs.The first mention of Arabs appeared in the mid-9th century BCE, as a tribal people in Eastern and Southern Syria and the northern Arabian Peninsula. The Arabs appear to have been under the vassalage of the Neo-Assyrian Empire (911–612 BCE), as well as the succeeding Neo-Babylonian (626–539 BCE), Achaemenid (539–332 BCE), Seleucid and Parthian empires. The Nabataeans, an Arab people, formed their Kingdom near Petra in the 3rd century BC. Arab tribes, most notably the Ghassanids and Lakhmids, begin to appear in the Southern Syrian Desert from the mid 3rd century CE onward, during the mid to later stages of the Roman and Sasanian empires.Before the expansion of the Rashidun Caliphate (632–661 C.E.), \"Arab\" referred to any of the largely nomadic and settled Semitic people from the Arabian Peninsula, Syrian Desert and Lower Mesopotamia, with some even reaching what is now northern Iraq. Today, according to Pan Arabs \"Arab\" refers to a large number of people whose native regions form the Arab world due to the spread of Arabs and the Arabic language throughout the region during the early Muslim conquests of the 7th and 8th centuries and the subsequent Arabisation of indigenous populations. The Arabs forged the Rashidun (632–661), Umayyad (661–750), Abbasid (750–1517) and the Fatimid (901–1071) caliphates, whose borders reached Southern France in the west, China in the east, Anatolia in the north and the Sudan in the south. This was one of the largest land empires in history. In the early 20th century, the First World War signalled the end of the Ottoman Empire, which had ruled much of the Arab world since conquering the Mamluk Sultanate in 1517. The end culminated in the 1922 defeat and dissolution of the empire and the partition of its territories, forming the modern Arab states. Following the adoption of the Alexandria Protocol in 1944, the Arab League was founded on 22 March 1945. The Charter of the Arab League endorsed the principle of an Arab homeland whilst respecting the individual sovereignty of its member states.Today, Arabs primarily inhabit the 22 member states of the Arab League. The Arab world stretches around 13 million km2, from the Atlantic Ocean in the west to the Arabian Sea in the east and from the Mediterranean Sea in the north to the Horn of Africa and the Indian Ocean in the southeast. People of non-Arab ethnicities associated with non-Arabic languages also live in these countries, sometimes as a majority. These include Somalis, Kurds, Berbers, the Afar people, Nubians and others. Beyond the boundaries of the League of Arab States, Arabs can also be found in the global diaspora. The ties that bind Arabs are ethnic, linguistic, cultural, historical, identical, nationalist, geographical and political. The Arabs have their own customs, language, architecture, art, literature, music, dance, media, cuisine, dress, society, sports and mythology.Arabs are a diverse group in terms of religious affiliations and practices. In the pre-Islamic era, most Arabs followed polytheistic religions. Some tribes had adopted Christianity or Judaism and a few individuals, the hanifs, apparently observed another form of monotheism. Today, about 93% of Arabs are adherents of Islam and there are sizable Christian minorities. Arab Muslims primarily belong to the Sunni, Shiite, Ibadi and Alawite denominations. Arab Christians generally follow one of the Eastern Christian Churches, such as those within the Oriental Orthodox churches, Eastern Catholic churches, or Eastern Protestant churches. There also exist small numbers of Arab Jews still living in Arab countries and a much larger population of Jews descended from Arab Jewish communities living in Israel and various Western countries, who may or may not consider themselves Arab today. Christian minorities in Arab-majority states may also not consider themselves Arab, such as Copts and Assyrians. Other smaller minority religions also exist, such as the Druze, Yazidism, Zoroastrianism and the Baháʼí Faith.\nLike every large culture group in history, Arabs have greatly influenced and contributed to diverse fields, notably the arts and architecture, language, philosophy, mythology, ethics, literature, politics, business, music, dance, cinema, medicine, science and technology in ancient and modern history."