"A European Economic Interest Grouping (EEIG) is a type of legal entity of the European corporate law created on 1985-07-25 under European Community (EC) Council Regulation 2137/85. It is designed to make it easier for companies in different countries to do business together, or to form consortia to take part in EU programmes. \nIts activities must be ancillary to those of its members, and, as with a partnership, any profit or loss it makes is attributed to its members. Thus, although it is liable for VAT and employees’ social insurance, it is not liable to corporation tax. It has unlimited liability. It was based on the pre-existing French groupement d´intérêt économique (G.i.e.).\nSeveral thousand EEIGs now exist, active in fields as varied as agricultural marketing, legal advice, research and development, osteopathy, motorcycle preservation and cat-breeding. One of the more famous EEIGs is the Franco-German television channel ARTE. Among other EEIGs:\n\nEURESA (fr) (operational and flexible tool for cooperation and collaboration among ten European insurance companies belonging to the Social Economy)\nEurocité basque Bayonne - San Sebastian (fr)\n\n\n== Abbreviations ==\nIn contrast to the SE and the SCE, the lack of a Latin name for the EEIG lead to different names in the languages of the European Union:\n\nBulgarian: Европейско обединение по икономически интереси (ЕОИИ)\nSerbian: Evropska Ekonomska Interesna Grupacija (EEIG)\nCroatian: Europsko gospodarsko interesno udruženje (EGIU)\nCzech: Evropské hospodářské zájmové sdružení (EHZS)\nDanish: Europæiske økonomiske firmagrupper (EØFG)\nDutch: Europees economisch samenwerkingsverband (EESV)\nEnglish: European Economic Interest Grouping (EEIG)\nEstonian: Euroopa majandushuvigrupp (EMHG)\nFinnish: Eurooppalainen taloudellinen etuyhtymä (ETEY)\nFrench: Groupement européen d'intérêt économique (GEIE)\nGerman: Europäische wirtschaftliche Interessenvereinigung (EWIV)\nGreek: Ευρωπαϊκός Όμιλος Οικονομικού Σκοπού (ΕΟΟΣ)\nHungarian: Európai gazdasági egyesülés (EGE)\nIrish: Grúpáil Eorpach um Leas Eacnamaíoch (GELE)\nItalian: Gruppo europeo di interesse economico (GEIE)\nLatvian: Eiropas Ekonomisko interešu grupa (EEIG)\nLithuanian: Europos ekonominių interesų grupė (EEIG)\nMaltese: Grupp Ewropew ta’ Interess Ekonomiku (GEIE)\nPolish: Europejskie Zgrupowanie Interesów Gospodarczych (EZIG)\nPortuguese: Agrupamento Europeu de Interesse Económico (AEIE)\nRomanian: Grup European de Interes Economic (GEIE)\nSlovak: Európske zoskupenie hospodárskych záujmov (EZHZ)\nSlovenian: Evropsko gospodarsko interesno združenje (EGIZ)\nSpanish: Agrupación europea de interés económico (AEIE)\nSwedish: Europeiska ekonomiska intressegrupperingar (EEIG)An EEIG is required to have the abbreviation in its legal name (Art. 5(a) of Council Regulation No. 2137/85).\n\n\n== See also ==\nEuropean Private Company\nTypes of business entity\nEuropean Grouping for Territorial Cooperation\nUK Companies House booklet GPO4\n\n\n== References =="