"Rosy retrospection refers to the psychological phenomenon of people sometimes judging the past disproportionately more positively than they judge the present. The Romans occasionally referred to this phenomenon with the Latin phrase \"memoria praeteritorum bonorum\", which translates into English roughly as \"the past is always well remembered\". Rosy retrospection is very closely related to the concept of nostalgia. The difference between the terms is that rosy retrospection could be understood as a cognitive bias, whereas the broader phenomenon of nostalgia is not usually seen as based on a biased perspective.\nAlthough according to this view rosy retrospection is a cognitive bias, which would distort a person's view of reality to some extent, some people theorize that it may in part serve a useful purpose in increasing self-esteem and a person's overall sense of well-being. For example, Terence Mitchell and Leigh Thompson mention this possibility in a chapter entitled \"A Theory of Temporal Adjustments of the Evaluation of Events\" in a book of collected research reports from various authors entitled \"Advances in Managerial Cognition and Organizational Information Processing\".Simplifications and exaggerations of memories (such as occurs in rosy retrospection) may also make it easier for people's brains to store long-term memories, as removing details may reduce the burden of those memories on the brain and make the brain require fewer neural connections to form and engrain memories. Mnemonics, psychological chunking, and subconscious distortions of memories may in part serve a similar purpose: memory compression by way of simplification. Data compression in computers works on similar principles: compression algorithms tend to either (1) remove unnecessary details from data or (2) reframe the details in a simpler way from which the data can subsequently be reconstructed as needed, or (3) both. Much the same can be said of human memories and the human brain's own process of memorization.\nIn English, the idiom \"rose-colored glasses\" or \"rose-tinted glasses\" is also sometimes used to refer to the phenomenon of rosy retrospection. Usually this idiom occurs as some variation of the phrase \"seeing things through rose-tinted glasses\" or some other roughly similar phrasing.Rosy retrospection is also related to the concept of declinism.\n\n\n== Research ==\nIn one group of experiments, three groups going on different vacations were interviewed before, during, and after their vacations. Most followed the pattern of initially positive anticipation, followed by mild disappointment thereafter. Generally, most subjects reviewed the events more favorably some time after the events had occurred than they did while experiencing them.\n\n\n== See also ==\n\n\n== References ==\n\n\n== Further reading ==\nMitchell, T.; Thompson, L. (1994). \"A theory of temporal adjustments of the evaluation of events: Rosy Prospection & Rosy Retrospection\" (PDF).  In Stubbart, C.; Porac, J.; Meindl, J. (eds.). Advances in managerial cognition and organizational information-processing. 5. Greenwich, CT: JAI press. pp. 85–114. ISBN 978-1-55938-447-6. Archived (PDF) from the original on 2015-12-02."