"Hello Kitty (Japanese: ハロー・キティ, Hepburn: Harō Kiti), also known by her full name Kitty White (キティ・ホワイト, Kiti Howaito), is a fictional character produced by the Japanese company Sanrio, created by Yuko Shimizu and currently designed by Yuko Yamaguchi. Sanrio depicts Hello Kitty as a young female gijinka (anthropomorphization) of a Japanese Bobtail cat with a red bow and no mouth. According to her backstory, she is a perpetual 3rd-grade student who lives outside of London. Kitty and her twin sister, Mimi, celebrate their birthday on 1 November 1974. Since the cartoon character's creation, the Hello Kitty media franchise has grown to include clothing, accessories, toys, games, books, manga, anime series, and music albums, along with other various product lines and media productions.\nShortly after Hello Kitty's creation in 1974, the Hello Kitty vinyl coin purse was introduced by Sanrio in March 1975. Sanrio brought the character to the United States in 1976. By 2010, Sanrio had turned Hello Kitty into a global marketing phenomenon, worth $6 billion a year. By 2014, when Hello Kitty was 40 years old, she was worth about $8 billion a year. Hello Kitty has become one of the highest-grossing media franchises of all time.\nHello Kitty is a staple of the kawaii segment of Japanese popular culture. First marketed toward pre-teenage girls, Hello Kitty's image found commercial success among not only her original target audience but adolescent and adult consumers as well. A variety of products ranging from school supplies to fashion accessories to motor oil have featured the character over the years. A number of Hello Kitty TV series targeted towards children have been produced, as well as several manga comics and anime films. There are Sanrio theme parks based on Hello Kitty: Harmonyland in Hiji, Ōita, Japan; Sanrio Puroland in Tama New Town, Tokyo, Japan; and the former Sanrio Hello Kitty Town in Iskandar Puteri, Johor, Malaysia."