"Blaže Koneski (Macedonian: Блаже Конески; 19 December 1921 – 7 December 1993) was a Macedonian poet, writer, literary translator, and linguistic scholar.\nHis major contribution was to the codification of the standard Macedonian language. He is the key figure who shaped Macedonian literature and intellectual life in the country however he has also been accused of serbianizing the Macedonian standard language.\n\n\n== Biography ==\n\nKoneski was born in Nebregovo, in the then province of South Serbia, part of the Kingdom of Serbs, Croats and Slovenes (current day North Macedonia). His family had strong pro-Serbian sentiments since Ottoman times, especially his mother's uncle Gligor Sokolović who was a famous Serbian Chetnik voivode. He received a Royal Serbian scholarship to study in the Kragujevac gymnasium or high school. Later, he studied medicine at the University of Belgrade, and then changed to Serbian language and literature. In 1941, after the defeat of Yugoslavia in Aufmarsch 25, he enrolled in the Law Faculty of Sofia University, but did not graduate. However, in 1945 at the age of 23 he became one of the most important contributor in standardization of the Macedonian language. He worked as a lector in the Macedonian National Theater, and in 1946, he joined the faculty at the Philosophy Department of the Ss. Cyril and Methodius University of Skopje, where he worked until his retirement.\nHe became a member of the Macedonian Academy of Sciences and Arts in 1967, and was elected its president in 1967 through 1975. Koneski was also a member of the Zagreb (Croatia), Belgrade (Serbia), Ljubljana (Slovenia) and Łódź (Poland) Academies of Sciences and Arts, and an honorary doctor of the Universities of Chicago, United States, and Kraków in Poland. The American Slavist Victor Friedman would mention Koneski as one of his mentors.Blaže Koneski died in Skopje on December 7, 1993. He received a state funeral for his distinguished literary career, and for his contributions to the codification of standard Macedonian.\n\n\n== Literary works ==\nKoneski wrote poetry and prose. His most famous collections of poetry are: Mostot, Pesni, Zemjata i ljubovta, Vezilka, Zapisi, Cesmite, Stari i novi pesni, Seizmograf, among others. His collection of short stories Vineyard Macedonian: Lozje is also famous.Koneski was a distinguished translator of poetry from German, Russian, Slovenian, Serbian and Polish; he translated the works of Njegos, Preshern, Heine, Blok, Neruda, and others.\n\n\n== Awards and recognitions ==\nBlaze Koneski won a number of literary prizes such as: the AVNOJ prize, the Njegoš prize, the Golden Wreath (\"Zlaten Venec\") of the Struga Poetry Evenings, the Award of the Writer’s Union of the USSR, Herder Prize and others.The Faculty of Philology at the Ss. Cyril and Methodius University of Skopje is named after Blaze Koneski.\n\n\n== Work on standard Macedonian ==\nKoneski is remembered for his work on codifying the Macedonian standard language. He is the author of On Standard Macedonian (Macedonian: За македонскиот литературен јазик), Grammar of Standard Macedonian (Macedonian: Граматика на македонскиот литературен јазик), History of Macedonian (Macedonian: Историја на македонскиот јазик), among other works.\nHe was one of the editors of Macedonian Dictionary (Macedonian: Речник на македонскиот јазик).\n\n\n== Criticism ==\nBulgarian linguists such as Iliya Talev, in his History of the Macedonian Language, have accused Koneski of plagiarizing Kiril Mirchev's Historical Grammar of the Bulgarian Language because both authors analyzed the same corpus of texts. In Bulgaria, he has also been accused of manipulating historical facts for political goals. There has been also claimed the Macedonian standard was Serbianized with the help of  Koneski. According to Christian Voss the turning point in the Serbianization of Macedonian took place in the late 1950s, that coincided with the preparation period for the dictionary of Koneski published between 1961 and 1966. Voss argues that it contains a consistent pro-Serbian bias. Today Historical revisionists in the Republic of North Macedonia, who questioned the narrative established in Communist Yugoslavia, have described the process of codifying the Macedonian language, to which Koneski was an important contributor, as 'Serbianization'. Macedonian nationalists have also accused Koneski and the communist elite of Serbianizing the Macedonian standard language. Similarly, Venko Markovski, who was one of the codifiers of the Macedonian standard, openly accused Koneski of Serbianizing the Macedonian language.\n\n\n== Bibliography ==\n\n\n== References ==\n\n\n== Further reading =="