"In plant morphology, thorns, spines, and prickles, and in general spinose structures (sometimes called spinose teeth or spinose apical processes), are hard, rigid extensions or modifications of leaves, roots, stems or buds with sharp, stiff ends, and generally serve the same function: physically deterring animals from eating the plant material.\n\n\n== Description ==\nIn common language the terms are used more or less interchangeably, but in botanical terms, thorns are derived from shoots (so that they may or may not be branched, they may or may not have leaves, and they may or may not arise from a bud), spines are derived from leaves (either the entire leaf or some part of the leaf that has vascular bundles inside, like the petiole or a stipule), and prickles are derived from epidermis tissue (so that they can be found anywhere on the plant and do not have vascular bundles inside).Leaf margins may also have teeth, and if those teeth are sharp, they are called spinose teeth on a spinose leaf margin (some authors consider them a kind of spine). On a leaf apex, if there is an apical process (generally an extension of the midvein), and if it is especially sharp, stiff, and spine-like, it may be referred to as spinose or as a pungent apical process (again, some authors call them a kind of spine). When the leaf epidermis is covered with very long, stiff trichomes (more correctly called bristles in this case; for some authors a kind of prickle), it may be referred to as a hispid vestiture; if the trichomes are stinging trichomes, it may be called a urent vestiture.There can be found also spines or spinose structures derived from roots.\n\n\n== Function ==\nThe predominant function of thorns, spines, and prickles is deterring herbivory in a mechanical form. For this reason, they are classified as physical or mechanical defenses, as opposed to chemical defenses.\nNot all functions of spines or glochids are limited to defense from physical attacks by herbivores and other animals. In some cases, spines have been shown to shade or insulate the plants that grow them, thereby protecting them from extreme temperatures. For example, saguaro cactus spines shade the apical meristem in summer, and in members of the Opuntioideae, glochids insulate the apical meristem in winter.\nAgrawal et al. (2000) found that spines seem to have little effect on specialist pollinators, on which many plants rely in order to reproduce.\n\n\n== Definitions and technical distinctions ==\nPointing or spinose processes can broadly be divided by the presence of vascular tissue: thorns and spines are derived from shoots and leaves respectively, and have vascular bundles inside, whereas prickles (like rose prickles) do not have vascular bundles inside, so that they can be removed more easily and cleanly than thorns and spines.\n\n\n=== Thorns ===\nThorns are modified branches or stems. They may be simple or branched.\n\n\t\t\n\t\t\n\n\n=== Spines ===\nSpines are modified leaves, stipules, or parts of leaves, such as extensions of leaf veins. Some authors prefer not to distinguish spines from thorns because, like thorns, and unlike prickles, they commonly contain vascular tissue.Spines are variously described as petiolar spines (as in Fouquieria), leaflet spines (as in Phoenix), or stipular spines (as in Euphorbia), all of which are examples of spines developing from a part of a leaf containing the petiole, midrib, or a secondary vein. The plants of the cactus family are particularly well known for their dense covering of spines. Some cacti have also glochids (or glochidia, singular glochidium) – a particular kind of spine of different origin, which are smaller and deciduous with numerous retrose barbs along its length (as found in areoles of Opuntia).\n\n\t\t\n\t\t\n\t\t\n\t\t\n\n\n=== Prickles ===\nPrickles are comparable to hairs but can be quite coarse (for example, rose prickles). They are extensions of the cortex and epidermis. Technically speaking, many plants commonly thought of as having thorns or spines actually have prickles. Roses, for instance, have prickles.\n\n\t\t\n\t\t\n\n\n=== Other structures ===\nOther similar structures are spinose teeth, spinose apical processes, and trichomes. Trichomes, in particular, are distinct from thorns, spines, and prickles in that they are much smaller (often microscopic) outgrowths of epidermal tissue, and they are less rigid and more hair-like in appearance; they typically consist of just a few cells of the outermost layer of epidermis, whereas prickles may include cortex tissue. Trichomes are often effective defenses against small insect herbivores; thorns, spines, and prickles are usually only effective against larger herbivores like birds and mammals.\n\n\t\t\n\t\t\n\t\t\nSpinescent is a term describing plants that bear any sharp structures that deter herbivory. It also can refer to the state of tending to be or become spiny in some sense or degree, as in: \"... the division of the African acacias on the basis of spinescent stipules versus non-spinescent stipules...\"\n\nThere are also spines derived from roots, like the ones on the trunk of the \"Root Spine Palms\" (Cryosophila spp.). The trunk roots of Cryosophila guagara grow downwards to a length of 6–12 cm, then stop growing and transform into a spine. The anatomy of crown roots on this species (roots among the bases of the living fronds) also alters during their life. They initially grow upwards and then turn down and finally they, too, become spinous. Lateral roots on these two types of roots, as well as those on the stilt roots on this species, also become spinous. Some authors believe that some of these short spiny laterals have a ventilating function so they are 'pneumorhizae'. Short spiny laterals that may have a ventilating function may also be found on roots of Iriartea exorrhiza.There are also spines that function as pneumorhizae on the palm Euterpe oleracea. In Cryosophila nana (formerly Acanthorhiza aculeata) there are spine roots or root spines, some authors may prefer \"root spines\" if the length of the root is less than 10x the thickness, and \"spine roots\" if the length is more than 10x the thickness. Adventitious spiny roots have also been described on the trunks of dicotyledonous trees from tropical Africa (e.g. Euphorbiaceae, as in Macaranga barteri, Bridelia micrantha and B. pubescens; Ixonanthaceae, Sterculiaceae), and may also be found protecting perennating organs such as tubers and corms (e.g. Dioscorea prehensilis -Dioscoreaceae- and Moraea spp. -Iridaceae- respectively). Short root spines cover the tuberous base of the epiphytic ant-plant Myrmecodia tuberosa (Rubiaceae), these probably give protection to ants which inhabit chambers within the tuber as they wander over the plant's surface. (Jackson 1986 and references therein). In many respects, the pattern of spine formation is similar to that which occurs in the development of thorns from lateral shoots. (Jackson 1986 and references therein).\n\n\n== Evolution ==\nIt has been proposed that thorny structures may have first evolved as a defense mechanism in plants growing in sandy environments that provided inadequate resources for fast regeneration of damage.\n\n\n== Morphological variation ==\nSpinose structures occur in a wide variety of ecologies, and their morphology also varies greatly. They occur as:\n\nsharpened branches (e.g. in Carissa, Citrus, Crataegus),\nspiky inflorescences (Tylecodon),\na tiny point at the tip of the leaf (mucronate leaves) (Sansevieria),\nleaves fully converted to spines (Opuntia),\nstipules converted to spines (many Vachellia),\nprickles on stems (Rosa, Erythrina and Ceiba speciosa),\nurticating (i.e. stinging) hairs,\nbristles, and\nfinely barbed spines called glochids.Some thorns are hollow and act as myrmecodomatia; others (e.g. in Crataegus monogyna) bear leaves. The thorns of many species are branched (e.g. in Crataegus crus-galli and Carissa macrocarpa).\n\n\n== Human uses ==\nPlants bearing thorns, spines, or prickles are often used as a defense against burglary, being strategically planted below windows or around the entire perimeter of a property. They also have been used to protect crops and livestock against marauding animals. Examples include hawthorn hedges in Europe, agaves in the Americas and in other countries where they have been introduced, Osage orange in the prairie states of the US, and Sansevieria in Africa.\n\n\n== See also ==\nAreole\nGlochid\nTrichome\nPlant defense against herbivory\n\n\n== References ==\nGeneral references\nSimpson, M. G. 2010. \"Plant Morphology\". In: Plant Systematics, 2nd. edition. Elsevier Academic Press. Chapter 9.\nJudd, Campbell, Kellogg, Stevens, Donoghue. 2007. \"Structural and Biochemical Characters\". In: Plant Systematics, a phylogenetic approach, third edition. Chapter 4.\nEsau, K. 1965. Plant Anatomy, 2nd Edition. John Wiley & Sons. 767 pp.\nLlamas, K. A. 2003. Tropical Flowering Plants. Timber Press, Portland. 423 pp.Footnotes\n\n\n== External links ==\n Texts on Wikisource:\n\"Thorn (plant)\". Collier's New Encyclopedia. 1921.\n\"Thorn\". The New Student's Reference Work. 1914."