"Isildur is a fictional character in J. R. R. Tolkien's Middle-earth, the elder son of Elendil. He was born in Númenor, and fled with his father when the island was drowned. He became King of Gondor. He cut the Ring from Sauron's hand, but instead of destroying it, claimed it for his own. He was killed by orcs, and the Ring was lost in the River Anduin, setting the stage for the Ring to pass to Gollum and then to Bilbo, as told in The Hobbit; that in turn provided the central theme for The Lord of the Rings. Isildur features briefly in the voiced-over opening sequence of Peter Jackson's The Lord of the Rings film trilogy.\n\n\n== Fictional history ==\n\n\n=== In Númenor ===\nIn Isildur's youth Ar-Pharazôn, King of Númenor, was corrupted by the fallen Maia Sauron, who urged that Nimloth the White Tree be cut down. Isildur went to the court of the king in disguise and stole a fruit of the tree. He was severely wounded during his escape, but his sacrifice was not in vain: Nimloth was cut down and burned shortly afterwards, but the line of the White Tree continued by way of the stolen fruit. When Númenor was destroyed by Ilúvatar Elendil's family escaped in nine ships.\n\n\n=== In Middle-earth ===\nThe refugees from Númenor fled east to the continent of Middle-earth. Isildur's father Elendil landed in the north and founded the realm of Arnor, while Isildur and his brother Anárion landed in the south, where they established the realm of Gondor and the cities of Osgiliath, Minas Ithil, and Minas Anor.  Isildur lived in Minas Ithil on the east side of the River Anduin and Anárion in Minas Anor on the west side; they ruled Gondor jointly from Osgiliath.Sauron captured Minas Ithil and destroyed the White Tree Isildur had planted there. Isildur and his family escaped down the Anduin by boat, bearing with them a seedling of the tree. They sailed to Lindon, seeking the Elven King Gil-galad and Elendil in Arnor. Anárion bought time for Gondor by defending Osgiliath and driving the Dark Lord back to the mountains, while Elendil and Gil-galad marshalled their forces.\nAs told in The Fellowship of the Ring, Isildur returned with Elendil and Gil-galad in the Last Alliance of Elves and Men. After the Alliance defeated Sauron's host at the Battle of Dagorlad they advanced into Mordor and laid siege to Barad-dûr. When Minas Ithil was recaptured Isildur sent his younger sons Aratan and Ciryon to man that fortress, which prevented Sauron and his forces from escaping that way. Isildur was accompanied throughout the war by his eldest son Elendur.  The campaign in Mordor was long and bitter, and Anárion was killed by a stone from the Dark Tower.\nBesieged in the Dark Tower for seven years, the enemy was all but defeated, and Sauron himself appeared to challenge the king. During the final battle on the slopes of Mount Doom, Elendil and Gil-galad were both killed in combat with the Dark Lord, but Sauron's mortal form was destroyed as well. The Second Age ended, and Isildur became King of both Arnor and Gondor.\nIsildur took up the hilt-shard of Narsil, Elendil's sword, and cut the One Ring from the hand of Sauron. Despite the urging of Elrond and Círdan, Gil-galad's lieutenants, Isildur did not throw the Ring into the fires of Mount Doom. He made a scroll with a description of the Ring and a copy of its fading inscription. This scroll was deposited in the archives of Minas Anor (which much later was renamed Minas Tirith), and the scroll was discovered by Gandalf nearly an Age later.\nAfter the fall of Sauron, the greater part of the army of Arnor returned home while Isildur stayed in Gondor for a year, restoring order and defining its boundaries. He planted the seedling of the White Tree in Minas Anor in memory of Anárion. As his brother's helmet had been crushed during his death at Barad-dûr, Isildur left his own helmet as Gondor's crown. He installed Anárion's son Meneldil as King of Gondor, and returned north en route to Arnor with his three sons. He made first for Rivendell, where his wife and his fourth son, Valandil, had stayed throughout the War of the Last Alliance.\n\n\n=== Isildur's death ===\n\nAt the Gladden Fields in the middle course of the River Anduin Isildur's party was ambushed by roaming Orcs from the Misty Mountains. It was 5 'October' in the second year of Isildur's reign, and the second year of the Third Age.Tolkien wrote two differing accounts of the battle leading to Isildur's end.\n\"Of the Rings of Power and the Third Age\", at the end of The Silmarillion, is told from the point of the view of the Eldar. It states that Isildur had set no guard in his camp at night, deeming that all his foes had been overthrown, and orcs attacked him there.In Unfinished Tales Tolkien gives a fuller account, writing that Isildur was ambushed on the march by orcs. Isildur had left Minas Anor with a party of some 200 soldiers. His men had to march, as their horses were mainly beasts of burden, not for riding. They had two dozen archers, but they were too few to be effective. Isildur chose the route along the Anduin rather than the safer but longer road North. Sauron, however, had deployed an army of orcs east of the Misty Mountains to attack stragglers of the Last Alliance. The orcs did not show themselves when the armies of the Elves and Men passed by, but they were more than a match for Isildur's small company. Isildur was assailed at sunset.  Though the first orc sortie was beaten off, the orcs regrouped and surrounded Isildur's party to prevent his escape. When nightfall came the orcs assaulted him from all sides.The Dúnedain were surrounded and outnumbered.  Ciryon was killed and Aratan was mortally wounded in a failed attempt to rescue Elendur, who urged his father to flee. Isildur put on the Ring, hoping to escape under the cover of invisibility. Fleeing to the Anduin, he cast off his armour and tried to swim to the other side of the river, but the Ring slipped (of its own volition) from his finger. Isildur felt that the Ring was missing and was momentarily dismayed, but with the burden of the Ring removed he rallied and made for the opposite bank. Despite the darkness, the Elendilmir that he was wearing betrayed his position to orcs on the far bank, who were seeking survivors from the attack, and they killed him with their poisoned arrows. Isildur's squire, Ohtar, saved Elendil's sword from the enemy, fleeing into the valley before the orcs encircled Isildur's company. Estelmo, Elendur's squire, was found alive under his master's body, stunned by a club.During the War of the Ring the Nazgûl searched the Gladden Fields, but failed to find any traces of Isildur's remains. Their efforts were hampered by Saruman, who had deceived the Nazgul, and who had got there first. After the overthrow of Saruman and the opening of Orthanc (in The Two Towers) Gimli found a hidden closet containing the original Elendilmir, which was presumed lost when Isildur died.\n\n\n== Development ==\nIn the short work The Fall of Númenor, written before 1937, Tolkien wrote of two brothers named Elendil and Valandil, who escaped the destruction of Númenor and founded two kingdoms in Middle-earth, Elendil in the north and Valandil in the south. Valandil was thus a precursor to the later Isildur, although in this work he was not Elendil's son but his brother.Soon afterwards Tolkien started a time-travel story, The Lost Road, in which a father and a son were to reappear time and again in human families throughout history. Only two chapters were written, one set in or near the present day, with the father named Oswin and the son Alboin, and one set in Númenor just before its fall, with the father named Elendil and the son Herendil. Here Valandil is the name of Elendil's father. It seems that Herendil (later Isildur) and his father were going to escape the destruction of Númenor as in The Fall of Númenor, but the story did not progress that far before it was abandoned.In one of the earliest manuscripts of The Lord of the Rings, written in 1938, in the chapter which came to be called The Shadow of the Past, Gandalf tells Frodo (then called Bingo) that his ring \"fell from the hand of an elf as he swam across a river\".  Although Isildur was not an elf, this was the earliest germ of the story of Isildur's death. In the next version of this part of the story Isildur himself appears, first named Ithildor, then changed to Isildor. He is described as a man who cut the One Ring from Sauron's finger after his father (here named Orendil) defeated Sauron in single combat, then lost it while swimming across a river to escape Orcs.\n\n\n== House of Elendil ==\n\n\n== Reception ==\nPaul H. Kocher writes that whereas Isildur claimed the Ring as his own, Aragorn, on hearing Frodo's exclamation that since he is Isildur's direct descendant the Ring must be his, at once renounces all claim to it. Aragorn explains that he searched for it to help Gandalf as \"it seemed fit that Isildur's heir should labour to repair Isildur's fault\", an inherited wrong. \nVedran Dodig writes that just as Jesus, in his role as king, is a descendant of King David, Aragorn is a descendant of Isildur. Nicholas Birns notes Isildur's survival, along with his father Elendil, of Númenor's catastrophic fall, an event that recalls to him Plato's Atlantis, the Biblical fall of man, and Noah's flood; he notes that Tolkien called Elendil a \"Noachian figure\", an echo of the biblical Noah.Tom Shippey writes that Gandalf's account to the Council of Elrond of Isildur's description of the Ring combines hints of the ancient time in which Isildur lived, with old words like \"glede\" (a hot coal) and obsolete endings as in \"fadeth\", and \"loseth\", but with a sudden reminder of Gollum's name for the Ring, with \"It is precious to me, though I buy it with great pain.\" His use of the \"ominous word 'precious'\" is, Shippey writes, quite enough for readers to guess that Isildur was already becoming addicted to the Ring.\n\n\n== Adaptations ==\n\n\n=== Film ===\nIn Ralph Bakshi's animated film version of The Lord of the Rings, released in 1978, Isildur is called Prince Isildur of the mighty Kings from across the Sea and appears as the events of the Last Alliance are portrayed in silhouette. He is called \"the heroic shadow who slipped in\" to chop off the One Ring from Sauron's finger. Later, as he sat at the base of a tree by the River Anduin examining the One Ring. he senses a disturbance, draws his sword, and is shot by Orc arrows a moment later.\n\nIn Peter Jackson's The Lord of the Rings film trilogy Isildur is played by Harry Sinclair. He briefly appears in the first scenes of The Fellowship of the Ring, and in an extended flashback scene later on. Isildur and Elrond go to Mount Doom where he refuses to destroy the Ring. The subsequent Disaster of the Gladden Fields is depicted; Isildur's column of mounted troops is ambushed on a dark forest road, he loses the Ring in the river Anduin, and is killed. In The Return of the King Legolas calls Isildur \"the last king of Gondor\", but in the extended edition both Arnor and the House of Anárion are mentioned, and it is clear that Isildur was not the last king. \nShippey writes that Jackson uses the voice-over to say of Isildur that he had \"this one chance to destroy evil for ever\", commenting that when Tolkien says \"for ever\", he at once indicates that that optimistic hope is wrong: Elrond says he recalls \"when Thangorodrim was broken, and the Elves deemed that evil was ended for ever, and it was not so.\" Shippey writes that there is a glimpse here of a sharp difference between Jackson's and Tolkien's concept of evil, and their respective media: Tolkien believed that even the best of men were fallen, victory always temporary, and portrayed that in his writings, whereas a dramatic medium like film required good on one side and bad on the other.\n\n\n=== Video games ===\nIn the video game Middle-earth: Shadow of War, Isildur's fate differs from the traditional accounts. After he was attacked by the orcs, they transported his lifeless body to Mordor at Sauron‘s behest, who then adorned Isildur with one of the nine rings. Isildur was then kept prisoner and tortured for an extended period of time and eventually became a Nazgûl after his spirit was broken. The specific power of his ring allowed him to raise the dead and have them fight by his side as mindless minions. Eventually, he was defeated by the game‘s protagonist, Talion, after several encounters. Instead of subduing him with his own ring of power, he chose to spare Isildur and release his spirit, finally allowing him to proceed into the afterlife after millennia of service to Sauron. Talion also obtained Isildur's ring and eventually took his place as a Nazgûl.\n\n\n== References ==\n\n\n=== Primary ===\nThis list identifies each item's location in Tolkien's writings.\n\n\n=== Secondary ===\n\n\n== Sources ==\nCarpenter, Humphrey, ed. (1981), The Letters of J. R. R. Tolkien, Boston: Houghton Mifflin, ISBN 0-395-31555-7\nTolkien, J. R. R. (1977),  Christopher Tolkien (ed.), The Silmarillion, Boston: Houghton Mifflin, ISBN 0-395-25730-1\nTolkien, J. R. R. (1980),  Christopher Tolkien (ed.), Unfinished Tales, Boston: Houghton Mifflin, ISBN 0-395-29917-9"