"The United States dollar (symbol: $; code: USD; also abbreviated US$ or U.S. Dollar, to distinguish it from other dollar-denominated currencies; referred to as the dollar, U.S. dollar, American dollar, or colloquially buck) is the official currency of the United States and its territories. The Coinage Act of 1792 introduced the U.S. dollar at par with the Spanish silver dollar, divided it into 100 cents, and authorized the minting of coins denominated in dollars and cents. U.S. banknotes are issued in the form of Federal Reserve Notes, popularly called greenbacks due to its historically predominantly green color.\nThe monetary policy of the United States is conducted by the Federal Reserve System, which acts as the nation's central bank.\nThe U.S. dollar was originally defined under a bimetallic standard of 371.25 grains (24.057 g) fine silver or, from 1837, 23.22 grains (1.505 g) fine gold, or $20.67 per troy ounce. The Gold Standard Act of 1900 linked the dollar solely to gold. From 1934 its equivalence to gold was revised to $35 per troy ounce. Since 1971 all links to gold have been repealed.\nThe U.S. dollar became an important international reserve currency after the First World War, and displaced the pound sterling as the world's primary reserve currency by the Bretton Woods Agreement towards the end of the Second World War. The dollar is the most widely used currency in international transactions.\n\nIt is also the official currency in several countries and the de facto currency in many others,\n\nwith Federal Reserve Notes (and, in a few cases, U.S. coins) used in circulation.\nAs of February 10, 2021, currency in circulation amounted to US$2.10 trillion, $2.05 trillion of which is in Federal Reserve Notes (the remaining $50 billion is in the form of U.S. notes and coins).\n\n\n== Overview ==\n\n\n=== In the Constitution ===\nArticle I, Section 8 of the U.S. Constitution provides that Congress has the power \"[t]o coin money.\" Laws implementing this power are currently codified in Title 31 of the U.S. Code, under Section 5112, which prescribes the forms in which the United States dollars should be issued. These coins are both designated in the section as \"legal tender\" in payment of debts. The Sacagawea dollar is one example of the copper alloy dollar, in contrast to the American Silver Eagle which is pure silver. Section 5112 also provides for the minting and issuance of other coins, which have values ranging from one cent (U.S. Penny) to 100 dollars. These other coins are more fully described in Coins of the United States dollar.\nArticle I, Section 9 of the Constitution provides that \"a regular Statement and Account of the Receipts and Expenditures of all public Money shall be published from time to time,\" which is further specified by Section 331 of Title 31 of the U.S. Code. The sums of money reported in the \"Statements\" are currently expressed in U.S. dollars, thus the U.S. dollar may be described as the unit of account of the United States. \"Dollar\" is one of the first words of Section 9, in which the term refers to the Spanish milled dollar, or the coin worth eight Spanish reales.\n\n\n=== The Coinage Act ===\nIn 1792, the U.S. Congress passed the Coinage Act, of which Section 9 authorized the production of various coins, including:Dollars or Units—each to be of the value of a Spanish milled dollar as the same is now current, and to contain three hundred and seventy-one grains and four sixteenth parts of a grain of pure, or four hundred and sixteen grains of standard silver.Section 20 of the Act designates the United States dollar as the unit of currency of the United States:[T]he money of account of the United States shall be expressed in dollars, or units…and that all accounts in the public offices and all proceedings in the courts of the United States shall be kept and had in conformity to this regulation.\n\n\n=== Decimal Units ===\nUnlike the Spanish milled dollar, the Continental Congress and the Coinage Act prescribed a decimal system of units to go with the unit dollar, as follows:\n\nthe mill, or one-thousandth of a dollar; \nthe cent, or one-hundredth of a dollar; \nthe dime, or one-tenth of a dollar; and \nthe eagle, or ten dollars.\nCurrent relevance of these units:\n\nOnly the cent (¢) is used as everyday division of the dollar.\nThe dime is used solely as the name of the coin with the value of 10 cents.\nThe mill (₥) is relatively unknown, but before the mid-20th century was familiarly used in matters of sales taxes, as well as gasoline prices, which are usually in the form of $ΧΧ.ΧΧ9 per gallon (e.g., $3.599, commonly written as $3.59+9⁄10).\nThe eagle is also largely unknown to the general public. This term was used in the Coinage Act of 1792 for the denomination of ten dollars, and subsequently was used in naming gold coins.The Spanish peso or dollar was historically divided into eight reales (colloquially, bits) - hence pieces of eight. Americans also learned counting in non-decimal bits of 121⁄2 cents before 1857 when Mexican bits were more frequently encountered than American cents; in fact this practice survived in New York Stock Exchange quotations until 2001.In 1854, Secretary of the Treasury James Guthrie proposed creating $100, $50, and $25 gold coins, to be referred to as a union, half union, and quarter union, respectively, thus implying a denomination of 1 Union = $100. However, no such coins were ever struck, and only patterns for the $50 half union exist.\nWhen currently issued in circulating form, denominations less than or equal to a dollar are emitted as U.S. coins, while denominations greater than or equal to a dollar are emitted as Federal Reserve Notes, disregarding these special cases:\n\nGold coins issued for circulation until the 1930s, up to the value of $20 (known as the double eagle)\nBullion or commemorative gold, silver, platinum, and palladium coins valued up to $100 as legal tender (though worth far more as bullion).\nCivil War paper currency issue in denominations below $1, i.e. fractional currency, sometimes pejoratively referred to as shinplasters.\n\n\n=== Etymology ===\n\nIn the 16th century, Count Hieronymus Schlick of Bohemia began minting coins known as joachimstalers, named for Joachimstal, the valley in which the silver was mined. In turn, the valley's name is titled after Saint Joachim, whereby thal or tal, a cognate of the English word dale, is German for 'valley.'\nThe joachimstaler was later shortened to the German taler, a word that eventually found its way into many languages, including:tolar (Czech and Slovak);\ndaler (Danish and Swedish);\ndalar and daler (Norwegian);\ndaler or daalder (Dutch); \ntalari (Ethiopian );\ntallér (Hungarian);\ntallero (Italian); \nدولار (Arabic); and\ndollar (English).\nThe taler also lent its name to coins in other places of similar size and weight.\nThe leeuwendaler ('lion dollar') was a Dutch coin depicting a lion.\nFrom the 17th century to the early 18th century it was a popular coin of choice for foreign trade in the Dutch East Indies, in the Dutch North American New Netherland Colony (today the New York metropolitan area), and the other Thirteen Colonies since it contained less silver than most other available large coins.\nWith the discontinuation of the lion dollar before 1690, and the improvement in quality of Spanish-American coins emanating from Mexico from the 1720s, it was the Spanish peso which American colonists have increasingly referred to the dollar. The Spanish dollar, famously known as the 'piece of eight,' was distributed widely in the Spanish colonies of the New World and in the Philippines.\nEventually, dollar became the name of the official American currency.\n\n\n=== Nicknames ===\n\n\n==== Dollars in general ====\nThe colloquialism buck(s) (much like the British quid for the pound sterling) is often used to refer to dollars of various nations, including the U.S. dollar. This term, dating to the 18th century, may have originated with the colonial leather trade, or it may also have originated from a poker term. Likewise, the $1 note has been nicknamed buck, as well as single.\nGreenback is another nickname, originally applied specifically to the 19th-century Demand Note dollars, which were printed black and green on the back side, created by Abraham Lincoln to finance the North for the Civil War. It is still used to refer to the U.S. dollar (but not to the dollars of other countries). The term greenback is also used by  the financial press in other countries, such as\nAustralia,New Zealand,South Africa,\nand India.Other well-known names of the dollar as a whole in denominations include greenmail, green, and dead presidents, the latter of which referring to the deceased presidents pictured on most bills. Dollars in general have also been known as bones (e.g. \"twenty bones\" = $20). The newer designs, with portraits displayed in the main body of the obverse (rather than in cameo insets), upon paper color-coded by denomination, are sometimes referred to as bigface notes or Monopoly money.\nPiastre was the original French word for the U.S. dollar, used for example in the French text of the Louisiana Purchase. Calling the dollar a piastre is still common among the speakers of Cajun French and New England French. Modern French uses dollar for this unit of currency as well. The term is still used as slang for U.S. dollars in the French-speaking Caribbean islands, most notably Haiti.\n\n\n==== Specific to denomination ====\nThe quarter dollar coin is known as two bits, betraying the dollar's origins as the \"piece of eight\" (bits or reales).The infrequently-used $2 note is sometimes called deuce, Tom, or Jefferson (after Thomas Jefferson). Contrastly, the $5 bill has been called Lincoln, fin, fiver, and five-spot. The $50 bill is occasionally called a yardstick, or a grant, after President Ulysses S. Grant, pictured on the obverse. The $20 note has been referred to as a double sawbuck, Jackson (after Andrew Jackson), and double eagle. The $10 note can be referred to as a sawbuck, ten-spot, or Hamilton (after Alexander Hamilton).\nBenjamin, Benji, Ben, or Franklin, refers to the $100 bill, which features the likeness of the eponymous Benjamin Franklin. Other nicknames include C-note (C being the Roman numeral for 100), century note, and bill (e.g. two bills = $200).\nA grand (sometimes shortened to simply G) is a common term for the amount of $1,000, though the thousand-dollar note is no longer in general use. The suffix K or k (from kilo) is also commonly used to denote this amount (e.g. $10k = $10,000). Likewise, a large or stack usually references to a multiple of 1,000 (e.g. \"fifty large\" = $50,000).\n\n\n=== Dollar sign ===\n\nThe symbol $, usually written before the numerical amount, is used for the U.S. dollar (as well as for many other currencies). The sign was the result of a late 18th-century evolution of the scribal abbreviation ps for the peso, the common name for the Spanish dollars that were in wide circulation in the New World from the 16th to the 19th centuries. The p and the s eventually came to be written over each other giving rise to $.Another popular explanation is that it is derived from the Pillars of Hercules on the Spanish Coat of arms of the Spanish dollar. These Pillars of Hercules on the silver Spanish dollar coins take the form of two vertical bars (||) and a swinging cloth band in the shape of an S.\nYet another explanation suggests that the dollar sign was formed from the capital letters U and S written or printed one on top of the other. This theory, popularized by novelist Ayn Rand in Atlas Shrugged, does not consider the fact that the symbol was already in use before the formation of the United States.\n\n\n== History ==\n\n\n=== Origins: the Spanish dollar ===\nThe US dollar was introduced at par with the Spanish-American silver dollar (or Spanish peso, Spanish milled dollar, eight-real coin, piece-of-eight). The latter was produced from the rich silver mine output of Spanish America; minted in Mexico City, Potosí (Bolivia), Lima (Peru) and elsewhere; and was in wide circulation throughout the Americas, Asia and Europe from the 16th to 19th centuries.\nAfter improvements of the Spanish dollar's minting in the 1720s it has displaced the use of other coins in the American colonies, most notably the lion dollar (occasionally called \"dog dollars\" for well-worn samples when the design is indistinguishable)\nwhich was used in the Dutch New Netherland Colony (New York) and the other English colonies from the 17th to early 18th century.\nEven after the United States Mint commenced issuing coins in 1792, locally minted dollars and cents were less abundant in circulation than Spanish American pesos and reales; hence Spanish, Mexican and American dollars all remained legal tender in the United States until the Coinage Act of 1857. In particular, Colonists' familiarity with the Spanish two-real quarter peso was the reason for issuing a quasi-decimal 25-cent quarter dollar coin rather than a 20-cent coin.\nFor the relationship between the Spanish dollar and the individual state colonial currencies, see Connecticut pound, Delaware pound, Georgia pound, Maryland pound, Massachusetts pound, New Hampshire pound, New Jersey pound, New York pound, North Carolina pound, Pennsylvania pound, Rhode Island pound, South Carolina pound, and Virginia pound.\n\n\n=== Coinage Act of 1792 ===\n\nOn the 6th of July 1785, the Continental Congress resolved that the money unit of the United States, the dollar, would contain 375.64 grains of fine silver; on the 8th of August 1786, the Continental Congress continued that definition and further resolved that the money of account, corresponding with the division of coins, would proceed in a decimal ratio, with the sub-units being mills at 0.001 of a dollar, cents at 0.010 of a dollar, and dimes at 0.100 of a dollar.After the adoption of the United States Constitution, the U.S. dollar was defined by the Coinage Act of 1792. It specified a \"dollar\" based on the Spanish milled dollar to contain 3714⁄16 grains of fine silver, or 416.0 grains (26.96 g) of \"standard silver\" of fineness 371.25/416 = 89.24%; as well as an \"eagle\" to contain 2474⁄8 grains of fine gold, or 270.0 grains (17.50 g) of 22 karat or 91.67% fine gold.Alexander Hamilton arrived at these numbers based on a treasury assay of the average fine silver content of a selection of worn Spanish dollars, which came out to be 371 grains. Combined with the prevailing gold-silver ratio of 15, the standard for gold was calculated at 371/15 = 24.73 grains fine gold or 26.98 grains 22K gold. Rounding the latter to 27.0 grains finalized the dollar's standard to 24.75 grains of fine gold or 24.75*15 = 371.25 grains fine silver.\nThe same coinage act also set the value of an eagle at 10 dollars, and the dollar at 1⁄10 eagle. It called for silver coins in denominations of 1, 1⁄2, 1⁄4, 1⁄10, and 1⁄20 dollar, as well as gold coins in denominations of 1, 1⁄2 and 1⁄4 eagle. The value of gold or silver contained in the dollar was then converted into relative value in the economy for the buying and selling of goods. This allowed the value of things to remain fairly constant over time, except for the influx and outflux of gold and silver in the nation's economy.Though a Spanish dollar freshly minted after 1772 theoretically contained 417.7 grains of silver of fineness 130/144 (or 377.1 grains fine silver), reliable assays of the period in fact confirmed a fine silver content of 370.95 grains (24.037 g) for the average Spanish dollar in circulation. \n\nThe new US silver dollar of 371.25 grains (24.057 g) therefore compared favorably and were received at par with the Spanish dollar for foreign payments, and after 1803 the United States Mint had to suspend making this coin out of its limited resources since it failed to stay in domestic circulation. It was only after Mexican independence in 1821 when their peso's fine silver content of 377.1 grains was firmly upheld, which the US later had to compete with using a heavier 378.0 grains (24.49 g) Trade dollar coin.\n\n\n=== Design ===\nThe early currency of the United States did not exhibit faces of presidents, as is the custom now; although today, by law, only the portrait of a deceased individual may appear on United States currency. In fact, the newly formed government was against having portraits of leaders on the currency, a practice compared to the policies of European monarchs. The currency as we know it today did not get the faces they currently have until after the early 20th century; before that \"heads\" side of coinage used profile faces and striding, seated, and standing figures from Greek and Roman mythology and composite Native Americans. The last coins to be converted to profiles of historic Americans were the dime (1946) and the Dollar (1971).\n\n\n=== Continental currency ===\n\nDuring the American Revolution the thirteen colonies became independent states. Freed from British monetary regulations, they each issued £sd paper money to pay for military expenses. The Continental Congress also began issuing \"Continental Currency\" denominated in Spanish dollars. For its value relative to states' currencies, see Early American currency#Continental currency.\nContinental currency depreciated badly during the war, giving rise to the famous phrase \"not worth a continental\". A primary problem was that monetary policy was not coordinated between Congress and the states, which continued to issue bills of credit. Additionally, neither Congress nor the governments of the several states had the will or the means to retire the bills from circulation through taxation or the sale of bonds. The currency was ultimately replaced by the silver dollar at the rate of 1 silver dollar to 1000 continental dollars. It gave rise to the phrase \"not worth a continental\", and was responsible for the clause in article 1, section 10 of the United States Constitution which reads: \"No state shall... make any thing but gold and silver coin a tender in payment of debts\".\n\n\n=== Silver and gold standards, 19th century ===\nFrom implementation of the 1792 Mint Act to the 1900 implementation of the gold standard the dollar was on a bimetallic silver-and-gold standard, defined as either 371.25 grains (24.056 g) of fine silver or 24.75 grains of fine gold (gold-silver ratio 15).\nSubsequent to the Coinage Act of 1834 the dollar's fine gold equivalent was revised to 23.2 grains; it was slightly adjusted to 23.22 grains (1.505 g) in 1837 (gold-silver ratio ~16). The same act also resolved the difficulty in minting the \"standard silver\" of 89.24% fineness by revising the dollar's alloy to 412.5 grains, 90% silver, still containing 371.25 grains fine silver. Gold was also revised to 90% fineness: 25.8 grains gross, 23.22 grains fine gold. \nSummary and links to coins issued in the 19th century:\n\nIn base metal: 1/2 cent, 1 cent, 5 cents.\nIn silver: half dime, dime, quarter dollar, half dollar, silver dollar.\nIn gold: gold $1, $2.50 quarter eagle, $5 half eagle, $10 eagle, $20 double eagle\nLess common denominations: bronze 2 cents, nickel 3 cents, silver 3 cents, silver 20 cents, gold $3.\n\n\n=== Note Issues, 19th century ===\n\nIn order to finance the War of 1812, Congress authorized the issuance of Treasury Notes, interest-bearing short-term debt that could be used to pay public dues. While they were intended to serve as debt, they did function \"to a limited extent\" as money. Treasury Notes were again printed to help resolve the reduction in public revenues resulting from the Panic of 1837 and the Panic of 1857, as well as to help finance the Mexican–American War and the Civil War.\nPaper money was issued again in 1862 without the backing of precious metals due to the Civil War. In addition to Treasury Notes, Congress in 1861 authorized the Treasury to borrow $50 million in the form of Demand Notes, which did not bear interest but could be redeemed on demand for precious metals. However, by December 1861, the Union government's supply of specie was outstripped by demand for redemption and they were forced to suspend redemption temporarily. In February 1862 Congress passed the Legal Tender Act of 1862, issuing United States Notes, which were not redeemable on demand and bore no interest, but were legal tender, meaning that creditors had to accept them at face value for any payment except for public debts and import tariffs. However, silver and gold coins continued to be issued, resulting in the depreciation of the newly printed notes through Gresham's Law. In 1869, Supreme Court ruled in Hepburn v. Griswold that Congress could not require creditors to accept United States Notes, but overturned that ruling the next year in the Legal Tender Cases. In 1875, Congress passed the Specie Payment Resumption Act, requiring the Treasury to allow US Notes to be redeemed for gold after January 1, 1879.\n\n\n=== Gold standard, 20th century ===\n\nThough the dollar came under the gold standard de jure only after 1900, the bimetallic era was ended de facto by the Coinage Act of 1873, which repealed the free silver right of individuals to convert their silver into fully legal tender silver dollars, and right at the onset of the silver rush from the Comstock Lode in the 1870s. This was the so-called \"Crime of '73\".\nThe Gold Standard Act of 1900 repealed the U.S. dollar's historic link to silver and defined it solely as 23.22 grains (1.505 g) of fine gold (or $20.67 per troy ounce of 480 grains). In 1933, gold coins were confiscated by Executive Order 6102 under Franklin D. Roosevelt, and in 1934 the standard was changed to $35 per troy ounce fine gold, or 13.71 grains (0.888 g) per dollar.\nAfter 1968 a series of revisions to the gold peg was implemented, culminating in the Nixon Shock of August 15, 1971 which suddenly ended the convertibility of dollars to gold. The U.S. dollar has since floated freely on the foreign exchange markets.\n\n\n=== Federal Reserve Notes, 20th century to present ===\n\nCongress continued to issue paper money after the Civil War, the latest of which being the Federal Reserve Note that was authorized by the Federal Reserve Act of 1913. Since the discontinuation of all other types of notes (Gold Certificates in 1933, Silver Certificates in 1963, and United States Notes in 1971), US dollar notes have since been issued exclusively as Federal Reserve Notes.\n\n\n=== Emergence as Reserve Currency ===\n\nThe U.S. dollar first emerged as an important international reserve currency in the 1920s, displacing the British pound sterling as it emerged from the First World War relatively unscathed and since the United States was a significant recipient of wartime gold inflows. After the United States emerged as an even stronger global superpower during the Second World War, the Bretton Woods Agreement of 1944 established the U.S. dollar as the world's primary reserve currency and the only post-war currency linked to gold. Despite all links to gold being severed in 1971, the dollar continues be the world's foremost reserve currency for international trade to this day.\nThe Bretton Woods Agreement of 1944 also defined the post-World War II monetary order and relations among modern-day independent states, by setting up a system of rules, institutions, and procedures to regulate the international monetary system. The agreement founded the International Monetary Fund and other institutions of the modern-day World Bank Group, establishing the infrastructure for conducting international payments and accessing the global capital markets using the U.S. dollar.\nThe monetary policy of the United States is conducted by the Federal Reserve System, which acts as the nation's central bank. It was founded in 1913 under the Federal Reserve Act in order to furnish an elastic currency for the United States and to supervise its banking system, particularly in the aftermath of the Panic of 1907.\nFor most of the post-war period the U.S. government has financed its own spending by borrowing heavily from the dollar-lubricated global capital markets, in debts denominated in its own currency and at minimal interest rates. This ability to borrow heavily without facing significant balance of payments crisis has been described as the United States's exorbitant privilege.\n\n\n== Coins ==\n\nThe United States Mint has issued legal tender coins every year from 1792 to the present. From 1934 to present, the only denominations produced for circulation have been the familiar penny, nickel, dime, quarter, half dollar and dollar.\n\nGold and silver coins have been previously minted for general circulation from the 18th to the 20th centuries. The last gold coins were minted in 1933. The last 90% silver coins were minted in 1964, and the last 40% silver half dollar was minted in 1970.\nThe nickel is the only coin whose size and composition (5 grams, 75% copper and 25% nickel) is still in use from 1865 to today, except for wartime 1942-1945 Jefferson nickels which contained silver.\nDue to the penny's low value, some efforts have been made to eliminate the penny as circulating coinage.\nFor a discussion of other discontinued and cancelled denominations, see Obsolete denominations of United States currency#Coinage and Canceled denominations of United States currency#Coinage.\n\n\n=== Collector coins ===\nCollector coins for which everyday transactions are non-existent:\n\nAmerican Eagles originally were not available from the Mint for individuals but had to be purchased from authorized dealers. In 2006, the Mint began direct sales to individuals of uncirculated bullion coins with a special finish, and bearing a \"W\" mintmark.\nAmerican Silver Eagle $1 (1 troy oz) Silver bullion coin 1986–present\nAmerican Gold Eagle $5 (1⁄10 troy oz), $10 (1⁄4 troy oz), $25 (1⁄2 troy oz), and $50 (1 troy oz) Gold bullion coin 1986–present\nAmerican Platinum Eagle $10 (1⁄10 troy oz), $25 (1⁄4 troy oz), $50 (1⁄2 troy oz), and $100 (1 troy oz) Platinum bullion coin 1997–present\nAmerican Palladium Eagle $25 (1 troy oz) Palladium bullion coin 2017–present\nUnited States commemorative coins—special issue coins\n$50.00 (Half Union) 1915\nPresidential Proofs (see below) 2007–presentTechnically, all these coins are still legal tender at face value, though some are far more valuable today for their numismatic value, and for gold and silver coins, their precious metal value. No silver coin has been issued since 1970; however, since 1992, the U.S. Mint has produced special Silver Proof Sets in addition to the regular yearly proof sets with silver dimes, quarters, and half dollars in place of the standard copper-nickel versions. In addition, an experimental $4.00 (Stella) coin was also minted in 1879, but never placed into circulation, and is properly considered to be a pattern rather than an actual coin denomination.\nThe $50 coin mentioned was only produced in 1915 for the Panama-Pacific International Exposition (1915) celebrating the opening of the Panama Canal. Only 1,128 were made, 645 of which were octagonal; this remains the only U.S. coin that was not round as well as the largest and heaviest U.S. coin ever produced. A $100 gold coin was produced in High relief during 2015, although it was primarily produced for collectors, not for general circulation.Proof Sets: The United States Mint produces Proof Sets specifically for collectors and speculators. Silver Proofs tend to be the standard designs but with the dime, quarter, and half dollar containing 90% silver. Starting in 1983 and ending in 1997, the Mint also produced proof sets containing the year's commemorative coins alongside the regular coins. Another type of proof set is the Presidential Dollar Proof Set where the four special $1 coins are minted each year featuring a president. Because of budget constraints and increasing stockpiles of these relatively unpopular coins, the production of new presidential dollar coins for circulation was suspended on December 13, 2011, by U.S. Treasury Secretary Timothy F. Geithner. Presidential dollars (along with all other dollar coin series) minted from 2012 onward were made solely for collectors. See link Presidential dollar coins for the sequence in which past presidents appeared in the series.\n\n\n=== Dollar coins ===\nThe standard silver dollar coin has been minted from 1794 to 1935 with a diameter of 1.50 inches (38 mm) and contained 371.25 grains (24.057 g) fine silver. This coin has never been popular in circulation for various reasons:\n\nFrom 1792 to 1803 the $1 coin compared favorably with the Spanish dollar and was accepted at par for overseas purchases. Its coinage was suspended in 1803 since it did not remain long in domestic circulation.\nIn the mid-1850s the price of gold dropped during the California gold rush, and the silver dollar was exported to places where it could fetch over $1 in gold.\nWhile substantial numbers of silver Morgan dollars were minted from 1878 pursuant to the Bland-Allison Act, there also existed an option to hold silver certificates fully backed by silver dollars kept in reserves. The majority of citizens therefore opted to use silver certificates while silver dollars languished inside vaults.Succeeding non-precious metal $1 coins from 1971 onwards did not circulate widely as well, the most important reason being the continued circulation of the $1 bill.\n\nFrom 1971 to 1978 the large-size copper-nickel Eisenhower dollar was minted. It was not popular due to its large size relative to its gradually diminishing value; further discussed under Eisenhower dollar.\nIn 1979 the smaller-sized Susan B. Anthony dollar coin was introduced; it was highly unpopular because they were often mistaken for quarters, due to their nearly equal size, their milled edge, and their similar color. For details about its subsequent issuance see Susan B. Anthony dollar.\nIn 2000 the Sacagawea dollar coin was introduced, correcting the various problems of the Anthony dollar by having a smooth edge, a gold color, same weight, and same electromagnetic signature that would avoid requiring changes to vending machines that accept the Anthony dollar. Again, it was rarely used since the $1 bill still widely circulates and continues to be popular; more details in link Sacagawea dollar\nFor the same reason, $1 coins issued under the Presidential $1 Coin Act of 2005 from 2007 to present rarely circulate; details of coins issued under this program contained in link Presidential dollar coins.\n\n\n=== Mint marks ===\n\n\n== Banknotes ==\n\nThe U.S. Constitution provides that Congress shall have the power to \"borrow money on the credit of the United States.\" Congress has exercised that power by authorizing Federal Reserve Banks to issue Federal Reserve Notes. Those notes are \"obligations of the United States\" and \"shall be redeemed in lawful money on demand at the Treasury Department of the United States, in the city of Washington, District of Columbia, or at any Federal Reserve bank\". Federal Reserve Notes are designated by law as \"legal tender\" for the payment of debts. Congress has also authorized the issuance of more than 10 other types of banknotes, including the United States Note and the Federal Reserve Bank Note. The Federal Reserve Note is the only type that remains in circulation since the 1970s.\nFederal Reserve Notes are printed by the Bureau of Engraving and Printing and are made from cotton fiber paper (as opposed to wood fiber used to make common paper). The \"large-sized notes\" issued before 1928 measured 7.42 in × 3.125 in (188.5 mm × 79.4 mm), while small-sized notes introduced that year measure 6.14 in × 2.61 in × 0.0043 in (155.96 mm × 66.29 mm × 0.11 mm). The dimensions of the modern (small-size) U.S. currency is identical to the size of Philippine peso banknotes issued under United States administration after 1903, which had proven highly successful.Currently printed denominations are $1, $2, $5, $10, $20, $50, and $100. Notes above the $100 denomination stopped being printed in 1946 and were officially withdrawn from circulation in 1969. These notes were used primarily in inter-bank transactions or by organized crime; it was the latter usage that prompted President Richard Nixon to issue an executive order in 1969 halting their use. With the advent of electronic banking, they became less necessary. Notes in denominations of $500, $1,000, $5,000, $10,000, and $100,000 were all produced at one time; see large denomination bills in U.S. currency for details. With the exception of the $100,000 bill (which was only issued as a Series 1934 Gold Certificate and was never publicly circulated; thus it is illegal to own), these notes are now collectors' items and are worth more than their face value to collectors.\nThough still predominantly green, post-2004 series incorporate other colors to better distinguish different denominations. As a result of a 2008 decision in an accessibility lawsuit filed by the American Council of the Blind, the Bureau of Engraving and Printing is planning to implement a raised tactile feature in the next redesign of each note, except the $1 and the current version of the $100 bill. It also plans larger, higher-contrast numerals, more color differences, and distribution of currency readers to assist the visually impaired during the transition period.\n\n\n== Monetary policy ==\n\nThe Federal Reserve Act created the Federal Reserve System in 1913 as the central bank of the United States. Its primary task is\nto conduct the nation’s monetary policy to promote maximum employment, stable prices, and moderate long-term interest rates in the U.S. economy. It is also tasked to promote the stability of the financial system and regulate financial institutions, and to act as lender of last resort.\nThe Monetary policy of the United States is conducted by the Federal Open Market Committee, which is composed of the Federal Reserve Board of Governors and 5 out of the 12 Federal Reserve Bank presidents, and is implemented by all twelve regional Federal Reserve Banks.\nMonetary policy refers to actions made by central banks which determine the size and growth rate of the money supply available in the economy, and which would result in desired objectives like low inflation, low unemployment and stable financial systems. The economy's aggregate money supply is the total of\n\nM0 money, or Monetary Base - \"dollars\" in currency and bank money balances credited to the central bank's depositors, which are backed by the central bank's assets,\nplus M1, M2, M3 money - \"dollars\" in the form of bank money balances credited to banks' depositors, which are backed by the bank's assets and investments.The FOMC influences the level of money available to the economy by the following means:\n\nReserve requirements - specifies a required minimum percentage of deposits in a commercial bank that should be held as reserve (i.e. as deposits with the Federal Reserve), with the rest available to loan or invest. Higher requirements mean less money loaned or invested, helping keep inflation in check. Raising the federal funds rate earned on those reserves also helps achieve this objective.\nOpen market operations - the Federal Reserve buys or sells US Treasury bonds and other securities held by banks in exchange for reserves; more reserves increase a bank's capacity to loan or invest elsewhere.\nDiscount window lending - banks can borrow from the Federal Reserve.Monetary policy directly affects interest rates; it indirectly affects stock prices, wealth, and currency exchange rates. Through these channels, monetary policy influences spending, investment, production, employment, and inflation in the United States. Effective monetary policy complements fiscal policy to support economic growth.\nThe adjusted monetary base has increased from approximately $400 billion in 1994, to $800 billion in 2005, and to over $3,000 billion in 2013.When the Federal Reserve makes a purchase, it credits the seller's reserve account (with the Federal Reserve). This money is not transferred from any existing funds—it is at this point that the Federal Reserve has created new high-powered money. Commercial banks then decide how much money to keep in deposit with the Federal Reserve and how much to hold as physical currency. In the latter case the Federal Reserve places an order for printed money from the U.S. Treasury Department. The Treasury Department, in turn, sends these requests to the Bureau of Engraving and Printing (to print new dollar bills) and the Bureau of the Mint (to stamp the coins).\nThe Federal Reserve's monetary policy objectives to keep prices stable and unemployment low is often called the dual mandate. This replaces past practices under a gold standard where the main concern is the gold equivalent of the local currency, or under a gold exchange standard where the concern is fixing the exchange rate versus another gold-convertible currency (previously practiced worldwide under the Bretton Woods Agreement of 1944 via fixed exchange rates to the U.S. dollar).\n\n\n== International use as reserve currency ==\n\n\n=== Ascendancy ===\nThe primary currency used for global trade between Europe, Asia and the Americas has historically been the Spanish-American silver dollar, which created a global silver standard system from the 16th to 19th centuries, due to abundant silver supplies in Spanish America.\nThe U.S. dollar itself was derived from this coin. The Spanish dollar was later displaced by the British pound sterling in the advent of the international gold standard in the last quarter of the 19th century.\nThe U.S. dollar began to displace the pound sterling as international reserve currency from the 1920s since it emerged from the First World War relatively unscathed and since the United States was a significant recipient of wartime gold inflows.\n\nAfter the U.S. emerged as an even stronger global superpower during the Second World War, the Bretton Woods Agreement of 1944 established the post-war international monetary system, with the U.S. dollar ascending to become the world's primary reserve currency for international trade, and the only post-war currency linked to gold at $35 per troy ounce.\n\nDespite all links to gold being severed in 1971, the dollar continues to play this role to this day.\n\n\n=== As international reserve currency ===\nThe U.S. dollar is joined by the world's other major currencies - the euro, pound sterling, Japanese yen and Chinese renminbi - in the currency basket of the Special drawing rights of the International Monetary Fund. Central banks worldwide have huge reserves of U.S. dollars in its holdings, and are significant buyers of U.S. treasury bills and notes.Foreign companies, entities and private individuals hold U.S. dollars in foreign deposit accounts called eurodollars (not to be confused with the euro), which are outside the jurisdiction of the Federal Reserve System. Private individuals also hold dollars outside the banking system mostly in the form of US$100 bills, of which 80% of its supply are held overseas.\nThe United States Department of the Treasury exercises considerable oversight over the SWIFT financial transfers network,\nand consequently has a huge sway on the global financial transactions systems, with the ability to impose sanctions on foreign entities and individuals.\n\n\n=== In the global markets ===\nThe U.S. dollar is predominantly the standard currency unit in which goods are quoted and traded, and with which payments are settled in, in the global commodity markets.\nThe U.S. Dollar Index is an important indicator of the dollar's strength or weakness versus a basket of six foreign currencies.\nThe United States Government is capable of borrowing trillions of dollars from the global capital markets in U.S. dollars issued by the Federal Reserve, which is itself under US government purview, at minimal interest rates and with virtually zero default risk. In contrast, foreign governments and corporations incapable of raising money in their own local currencies are forced to issue debt denominated in U.S. dollars, along with its consequent higher interest rates and risks of default.\nThe United States's ability to borrow in its own currency without facing significant balance of payments crisis has been frequently described as its exorbitant privilege.A frequent topic of debate is whether the strong dollar policy of the United States is indeed in America's own best interests, as well as in the best interest of the international community.\n\n\n=== Currencies fixed to the U.S. dollar ===\nFor a more exhaustive discussion of countries using the U.S. dollar as official or customary currency, or using currencies which are pegged to the U.S. dollar, see International use of the U.S. dollar#Dollarization and fixed exchange rates and Currency substitution#US dollar.\nCountries using the U.S. dollar as its official currency include:\n\nIn the Americas: Panama, Ecuador, El Salvador, British Virgin Islands, Turks and Caicos Islands, and the Caribbean Netherlands.\nThe constituent states of the former Trust Territory of the Pacific Islands: Palau, the Federated States of Micronesia, and the Marshall Islands.\nOthers: East Timor.Among the countries using the U.S. dollar together with other foreign currencies and its local currency are Cambodia and Zimbabwe.\nCurrencies pegged to the U.S. dollar include:\n\nIn the Caribbean: the Bahamian dollar, Barbadian dollar, Belize dollar, Bermudan dollar, Cayman Islands dollar, East Caribbean dollar, Netherlands Antillean guilder and the Aruban florin.\nThe currencies of the oil-producing Arab countries: the Saudi riyal, United Arab Emirates dirham, Omani rial, Qatari riyal and the Bahraini dinar.\nOthers: the Hong Kong dollar and the Macanese pataca.\n\n\n== Value ==\n\nThe 6th paragraph of Section 8 of Article 1 of the U.S. Constitution provides that the U.S. Congress shall have the power to \"coin money\" and to \"regulate the value\" of domestic and foreign coins. Congress exercised those powers when it enacted the Coinage Act of 1792. That Act provided for the minting of the first U.S. dollar and it declared that the U.S. dollar shall have \"the value of a Spanish milled dollar as the same is now current\".The table above shows the equivalent amount of goods that, in a particular year, could be purchased with $1. The table shows that from 1774 through 2012 the U.S. dollar has lost about 97.0% of its buying power.The decline in the value of the U.S. dollar corresponds to price inflation, which is a rise in the general level of prices of goods and services in an economy over a period of time. A consumer price index (CPI) is a measure estimating the average price of consumer goods and services purchased by households. The United States Consumer Price Index, published by the Bureau of Labor Statistics, is a measure estimating the average price of consumer goods and services in the United States. It reflects inflation as experienced by consumers in their day-to-day living expenses. A graph showing the U.S. CPI relative to 1982–1984 and the annual year-over-year change in CPI is shown at right.\nThe value of the U.S. dollar declined significantly during wartime, especially during the American Civil War, World War I, and World War II. The Federal Reserve, which was established in 1913, was designed to furnish an \"elastic\" currency subject to \"substantial changes of quantity over short periods\", which differed significantly from previous forms of high-powered money such as gold, national bank notes, and silver coins. Over the very long run, the prior gold standard kept prices stable—for instance, the price level and the value of the U.S. dollar in 1914 was not very different from the price level in the 1880s. The Federal Reserve initially succeeded in maintaining the value of the U.S. dollar and price stability, reversing the inflation caused by the First World War and stabilizing the value of the dollar during the 1920s, before presiding over a 30% deflation in U.S. prices in the 1930s.Under the Bretton Woods system established after World War II, the value of gold was fixed to $35 per ounce, and the value of the U.S. dollar was thus anchored to the value of gold. Rising government spending in the 1960s, however, led to doubts about the ability of the United States to maintain this convertibility, gold stocks dwindled as banks and international investors began to convert dollars to gold, and as a result the value of the dollar began to decline. Facing an emerging currency crisis and the imminent danger that the United States would no longer be able to redeem dollars for gold, gold convertibility was finally terminated in 1971 by President Nixon, resulting in the \"Nixon shock\".The value of the U.S. dollar was therefore no longer anchored to gold, and it fell upon the Federal Reserve to maintain the value of the U.S. currency. The Federal Reserve, however, continued to increase the money supply, resulting in stagflation and a rapidly declining value of the U.S. dollar in the 1970s. This was largely due to the prevailing economic view at the time that inflation and real economic growth were linked (the Phillips curve), and so inflation was regarded as relatively benign. Between 1965 and 1981, the U.S. dollar lost two thirds of its value.In 1979, President Carter appointed Paul Volcker Chairman of the Federal Reserve. The Federal Reserve tightened the money supply and inflation was substantially lower in the 1980s, and hence the value of the U.S. dollar stabilized.Over the thirty-year period from 1981 to 2009, the U.S. dollar lost over half its value. This is because the Federal Reserve has targeted not zero inflation, but a low, stable rate of inflation—between 1987 and 1997, the rate of inflation was approximately 3.5%, and between 1997 and 2007 it was approximately 2%. The so-called \"Great Moderation\" of economic conditions since the 1970s is credited to monetary policy targeting price stability.There is ongoing debate about whether central banks should target zero inflation (which would mean a constant value for the U.S. dollar over time) or low, stable inflation (which would mean a continuously but slowly declining value of the dollar over time, as is the case now). Although some economists are in favor of a zero inflation policy and therefore a constant value for the U.S. dollar, others contend that such a policy limits the ability of the central bank to control interest rates and stimulate the economy when needed.\n\n\n== Exchange rates ==\n\n\n=== Historical exchange rates ===\n\n\n=== Current exchange rates ===\n\n\n== See also ==\n\nCounterfeit United States currency\nDedollarisation\nInternational use of the U.S. dollar\nList of the largest trading partners of the United States\nMonetary policy of the United States\nPetrodollar recycling\nStrong dollar policy\nU.S. Dollar Index\n\n\n== Notes ==\n\n\n== References ==\n\n\n== Further reading ==\n\n\n== External links ==\n\nU.S. Bureau of Engraving and Printing Archived May 30, 1997, at the Wayback Machine\nU.S. Currency and Coin Outstanding and in Circulation\nAmerican Currency Exhibit at the San Francisco Federal Reserve Bank\nRelative values of the U.S. dollar, from 1774 to present\nHistorical Currency Converter\nSummary of BEP Production Statistics\n\n\n=== Images of U.S. currency and coins ===\nU.S. Currency Education Program page with images of all current banknotes\nU.S. Mint: Image Library\nHistorical and current banknotes of the United States (in English and German)"