"William Hubbs Rehnquist ( REN-kwist; October 1, 1924 – September 3, 2005) was an American lawyer and jurist who served on the Supreme Court of the United States for 33 years, as an associate justice from 1972 to 1986 and as Chief Justice from 1986 until his death in 2005. Considered a conservative, Rehnquist favored a conception of federalism that emphasized the Tenth Amendment's reservation of powers to the states. Under this view of federalism, the court, for the first time since the 1930s, struck down an act of Congress as exceeding its power under the Commerce Clause.\nRehnquist grew up in Milwaukee, Wisconsin, and served in the U.S. Army Air Forces during the final years of World War II. After the war's end in 1945, he studied political science at Stanford University and Harvard University, then graduated from Stanford Law School. He clerked for Associate Justice Robert H. Jackson during the Supreme Court's 1952–53 term, then entered private practice in Phoenix, Arizona. Rehnquist served as a legal adviser for Republican presidential nominee Barry Goldwater in the 1964 election, and in 1969 President Richard Nixon appointed him Assistant Attorney General of the Office of Legal Counsel. In 1971, Nixon nominated Rehnquist to succeed Associate Justice John Marshall Harlan II, and the U.S. Senate confirmed him that year. Rehnquist quickly established himself as the Burger Court's most conservative member. In 1986, President Ronald Reagan nominated Rehnquist to succeed retiring Chief Justice Warren Burger, and the Senate confirmed him.\nRehnquist served as Chief Justice for nearly 19 years, making him the fourth-longest-serving Chief and the eighth-longest-serving Justice. He became an intellectual and social leader of the Rehnquist Court, earning respect even from the justices who frequently opposed his opinions. Though he remained a member of the conservative wing of the court, Associate Justices Antonin Scalia and Clarence Thomas were often regarded as more conservative. As Chief Justice, Rehnquist presided over the impeachment trial of President Bill Clinton.\nRehnquist wrote the majority opinions in United States v. Lopez (1995) and United States v. Morrison (2000), holding in both cases that Congress had exceeded its power under the Commerce Clause. He opposed Roe v. Wade and continued to argue that Roe had been incorrectly decided in Planned Parenthood v. Casey. In Bush v. Gore, he voted with the court's majority to end the Florida recount in the 2000 presidential election.\n\n\n== Early life ==\nRehnquist was born on October 1, 1924, and grew up in the Milwaukee suburb of Shorewood. His father, William Benjamin Rehnquist, was a sales manager at various times for printing equipment, paper, and medical supplies and devices; his mother, Margery Peck Rehnquist—the daughter of a local hardware store owner who also served as an officer and director of a small insurance company—was a local civic activist, as well as translator and homemaker. His paternal grandparents immigrated from Sweden.Rehnquist graduated from Shorewood High School in 1942. He attended Kenyon College, in Gambier, Ohio, for one quarter in the fall of 1942 before entering the U.S. Army Air Forces. He served from 1943 to 1946, mostly in assignments in the United States. He was put into a pre-meteorology program and assigned to Denison University until February 1944, when the program was shut down. He served three months at Will Rogers Field in Oklahoma City, three months in Carlsbad, New Mexico, and then went to Hondo, Texas, for a few months. He was then chosen for another training program, which began at Chanute Field, Illinois, and ended at Fort Monmouth, New Jersey. The program was designed to teach maintenance and repair of weather instruments. In the summer of 1945, Rehnquist went overseas as a weather observer in North Africa.After the war, Rehnquist attended Stanford University with assistance under the provisions of the G.I. Bill. In 1948, he received Bachelor of Arts and Master of Arts degrees in political science, as well as an election to Phi Beta Kappa. In 1950, he attended Harvard University, where he received another Master of Arts, in government. He later returned to Stanford to attend the Stanford Law School, where he became an editor of the Stanford Law Review and graduated first in his class in 1952 with a Bachelor of Laws. Rehnquist was in the same class at Stanford Law as Sandra Day O'Connor, with whom he would later serve on the Supreme Court. They briefly dated during law school, and Rehnquist proposed marriage to her. O'Connor declined as she was by then dating her future husband (this was not publicly known until 2018).\n\n\n== Law clerk at the Supreme Court ==\nRehnquist went to Washington, D.C., to work as a law clerk for Justice Robert H. Jackson of the United States Supreme Court during the court's 1952–53 term. There, he wrote a memorandum arguing against federal court-ordered school desegregation while the court was considering the landmark case Brown v. Board of Education, which was decided in 1954. Rehnquist's 1952 memo, \"A Random Thought on the Segregation Cases\", defended the separate-but-equal doctrine. In the memo, Rehnquist wrote:\n\nTo the argument that a majority may not deprive a minority of its constitutional right, the answer must be made that while this is sound in theory, in the long run it is the majority who will determine what the constitutional rights of the minority are... I realize that it is an unpopular and unhumanitarian position, for which I have been excoriated by \"liberal\" colleagues, but I think Plessy v. Ferguson was right and should be reaffirmed.\nIn both his 1971 Senate confirmation hearing for associate justice and his 1986 hearing for chief justice, Rehnquist testified that the memorandum reflected Jackson's views rather than his own. Rehnquist said, \"I believe that the memorandum was prepared by me as a statement of Justice Jackson's tentative views for his own use.\" Jackson's longtime secretary and confidante Elsie Douglas said during Rehnquist's 1986 hearings that his allegation was \"a smear of a great man, for whom I served as secretary for many years. Justice Jackson did not ask law clerks to express his views. He expressed his own and they expressed theirs. That is what happened in this instance.\" But Justices Douglas's and Frankfurter's papers indicate that Jackson voted for Brown in 1954 only after changing his mind.At his 1986 hearings for chief justice, Rehnquist tried to further distance himself from the 1952 memo, saying, \"The bald statement that 'Plessy was right and should be reaffirmed' was not an accurate reflection of my own views at the time.\" But he acknowledged defending Plessy in arguments with fellow law clerks.Several commentators have concluded that the memo reflected Rehnquist's own views, not Jackson's. A biography of Jackson corroborates this, stating that Jackson instructed his clerks to express their views, not his. Further corroboration is found in a 2012 Boston College Law Review article that analyzes a 1955 letter to Frankfurter that criticized Jackson.In any event, while serving on the Supreme Court, Rehnquist made no effort to reverse or undermine Brown and often relied on it as precedent. In 1985, he said there was a \"perfectly reasonable\" argument against Brown and in favor of Plessy, even though he now saw Brown as correct.In a memorandum to Jackson about Terry v. Adams, which involved the right of blacks to vote in an allegedly private Texas election, Rehnquist wrote:\n\nThe Constitution does not prevent the majority from banding together, nor does it attaint success in the effort. It is about time the Court faced the fact that the white people of the south do not like the colored people. The constitution restrains them from effecting this dislike through state action, but it most assuredly did not appoint the Court as a sociological watchdog to rear up every time private discrimination raises its admittedly ugly head.\nIn another memorandum to Jackson about the same case, Rehnquist wrote:\n\nClerks began screaming as soon as they saw this that 'Now we can show those damn southerners, etc.' I take a dim view of this pathological search for discrimination and as a result I now have something of a mental block against the case.\nNevertheless, Rehnquist recommended to Jackson that the Supreme Court should agree to hear Terry.\n\n\n== Private practice ==\nRehnquist practiced law privately in Phoenix, Arizona, from 1953 to 1969. He began his legal work in the firm of Denison Kitchel, subsequently serving as the national manager of Barry M. Goldwater's 1964 presidential campaign. Prominent clients included Jim Hensley, John McCain's future father-in-law. During these years, Rehnquist was active in the Republican Party and served as a legal advisor under Kitchel to Goldwater's campaign. He collaborated with Harry Jaffa on Goldwater's speeches.Many years later, during his 1971 hearing for associate justice and his 1986 hearings for chief justice, several people came forward to complain about Rehnquist's participation in Operation Eagle Eye, a Republican attempt to discourage minority voters in Arizona elections, when he served as a poll watcher in the early 1960s. Rehnquist denied the charges, and Vincent Maggiore, then chairman of the Phoenix-area Democratic Party, said he had never heard any negative reports about Rehnquist's Election Day activities. \"All of these things\", Maggiore said, \"would have come through me.\"\n\n\n== Justice Department ==\nWhen President Richard Nixon was elected in 1968, Rehnquist returned to work in Washington. He served as Assistant Attorney General of the Office of Legal Counsel from 1969 to 1971. In this role, he served as the chief lawyer to Attorney General John Mitchell. Nixon mistakenly called him \"Renchburg\" in several of the tapes of Oval Office conversations revealed during the Watergate investigations.Because he was well-placed in the Justice Department, many suspected Rehnquist could have been the source known as Deep Throat during the Watergate scandal. Once Bob Woodward revealed on May 31, 2005, that W. Mark Felt was Deep Throat, this speculation ended.\nIn fall 1971, Nixon received the resignations of two Supreme Court justices, Hugo Black and John Marshall Harlan II. After compiling an initial list of possible appointees that ran afoul of Chief Justice Burger and the American Bar Association, Nixon considered Rehnquist for one of the slots. Henry Kissinger discussed the possible pick with presidential advisor H.R. Haldeman and asked, \"Rehnquist is pretty far right, isn't he?\" Haldeman responded, \"Oh, Christ! He's way to the right of Buchanan,\" referring to then-presidential advisor Patrick Buchanan.\n\n\n== Associate Justice ==\n\nNixon nominated Rehnquist to replace John Marshall Harlan II on the Supreme Court upon Harlan's retirement, and after being confirmed by the Senate by a 68–26 vote on December 10, 1971, took his seat as an associate justice on January 7, 1972. There were two vacancies on the court at the time; Nixon nominated Lewis Franklin Powell Jr. to fill the other, left by the retirement of Hugo Black. Black died on September 25, 1971, and Harlan died on December 29 of that year.\nOn the Burger Court, Rehnquist promptly established himself as Nixon's most conservative appointee, taking a narrow view of the Fourteenth Amendment and a broad view of state power. He almost always voted \"with the prosecution in criminal cases, with business in antitrust cases, with employers in labor cases, and with the government in speech cases.\" Although Rehnquist was often a lone dissenter in cases early on, his views later often became the Court's majority view.\n\n\n=== Federalism ===\nFor years, Rehnquist was determined to keep cases involving individual rights in state courts away from federal reach. In National League of Cities v. Usery (1977), his majority opinion invalidated a federal law extending minimum wage and maximum hours provisions to state and local government employees. Rehnquist wrote, \"this exercise of congressional authority does not comport with the federal system of government embodied in the Constitution.\"As chief justice, Rehnquist presided over what law professor Erwin Chemerinsky called a \"federalist revolution\", during which the Court limited federal power in cases such as New York v. United States, United States v. Lopez, Printz v. United States, and United States v. Morrison. Similarly, Cato Institute scholar Roger Pilon has said that \"[t]he Rehnquist court has revived the doctrine of federalism . . . only at the edges and in very easy cases.\"\n\n\n=== Equal protection, civil rights, and abortion ===\nRehnquist rejected a broad view of the Fourteenth Amendment. In 1952, while clerking for Jackson, Rehnquist wrote a memorandum concluding that \"Plessy v. Ferguson was right and should be re-affirmed. If the Fourteenth Amendment did not enact Spencer's Social Statics, it just as surely did not enact Myrddahl's American Dilemma\" (An American Dilemma), by which he meant that the Court should not \"read its own sociological views into the Constitution.\" Rehnquist believed the Fourteenth Amendment was meant only as a solution to the problems of slavery, and was not to be applied to abortion rights or prisoner's rights. He believed the Court \"had no business reflecting society's changing and expanding values\" and that this was Congress's domain. Rehnquist tried to weave his view of the amendment into his opinion for Fitzpatrick v. Bitzer, but the other justices rejected it. He later extended what he said he saw as the amendment's scope, writing in Trimble v. Gordon, \"except in the area of the law in which the Framers obviously meant it to apply—classifications based on race or on national origin\". During the Burger Court's deliberations over Roe v. Wade, Rehnquist promoted his view that court's jurisdiction does not apply to abortion.Rehnquist voted against the expansion of school desegregation plans and the establishment of legalized abortions, dissenting in Roe v. Wade. He expressed his views about the Equal Protection Clause in cases like Trimble v. Gordon:\nUnfortunately, more than a century of decisions under this Clause of the Fourteenth Amendment have produced ... a syndrome wherein this Court seems to regard the Equal Protection Clause as a cat-o'-nine-tails to be kept in the judicial closet as a threat to legislatures which may, in the view of the judiciary, get out of hand and pass \"arbitrary\", \"illogical\", or \"unreasonable\" laws. Except in the area of the law in which the Framers obviously meant it to apply—classifications based on race or on national origin, the first cousin of race—the Court's decisions can fairly be described as an endless tinkering with legislative judgments, a series of conclusions unsupported by any central guiding principle.\n\n\n=== Other issues ===\nRehnquist consistently defended state-sanctioned prayer in public schools. He held a restrictive view of criminals' and prisoners' rights and believed capital punishment to be constitutional. He supported the view that the Fourth Amendment permitted a warrantless search incident to a valid arrest.In Nixon v. Administrator of General Services (1977), Rehnquist dissented from a decision upholding the constitutionality of an act that gave a federal agency administrator certain authority over former President Nixon's presidential papers and tape recordings. He dissented solely on the ground that the law was \"a clear violation of the constitutional principle of separation of powers\".During oral argument in Duren v. Missouri (1978), the court faced a challenge to laws and practices that made jury duty voluntary for women in that state. At the end of Ruth Bader Ginsburg's oral presentation, Rehnquist asked her, \"You will not settle for putting Susan B. Anthony on the new dollar, then?\"Rehnquist wrote the majority opinion in Diamond v. Diehr, 450 U.S. 175 (1981), which began a gradual trend toward overturning the ban on software patents in the United States first established in Parker v. Flook, 437 U.S. 584 (1978). In Sony Corp. of America v. Universal City Studios, Inc., pertaining to video cassette recorders such as the Betamax system, Justice John Paul Stevens wrote an opinion providing a broad fair use doctrine while Rehnquist joined the dissent supporting stronger copyrights. In Eldred v. Ashcroft, 537 U.S. 186 (2003), Rehnquist was in the majority favoring the copyright holders, with Justices Stevens and Stephen Breyer dissenting in favor of a narrower construction of copyright law.\n\n\n=== Rehnquist's view of the rational basis test ===\nDavid Shapiro, professor of law at Harvard University, wrote that while Rehnquist was an associate justice, he disliked even minimal inquiries into legislative objectives except in the areas of race, national origin, and infringement of specific constitutional guarantees. For Rehnquist, the rational basis test was not a standard for weighing the interests of the government against the individual but a label to describe a preordained result. In 1978 Shapiro pointed out that Rehnquist had avoided joining rational basis determinations for years, except in one case, Weinberger v. Wiesenfeld. In Trimble v. Gordon, Rehnquist eschewed the majority's approach to equal protection, writing in dissent in that the state's distinction should be sustained because it was not \"mindless and patently irrational\". (The court struck down an Illinois law allowing illegitimate children to inherit by intestate succession only from their mothers.) Shapiro wrote that Rehnquist seemed content to find a sufficient relationship between a challenged classification and perceived governmental interests \"no matter how tenuous or speculative that relationship might be\".A practical result of Rehnquist's view of rational basis can be seen in Cleveland Board of Education v. LaFleur, wherein the Court's majority struck down a school board rule that required every pregnant teacher to take unpaid maternity leave beginning five months before the expected birth of her child. Justice Powell wrote an opinion resting on the ground that the school board rule was too inclusive to survive equal protection analysis. In dissent, Rehnquist attacked Powell's opinion, saying:\n\nIf legislative bodies are to be permitted to draw a line anywhere short of the delivery room, I can find no judicial standard of measurement which says the ones drawn here were invalid.\nShapiro writes that Rehnquist's opinion implied:\n\nThat there is no constitutionally significant difference between a classification that encompasses virtually no one outside the scope of its purpose and a classification so overinclusive that the vast majority of those falling within are beyond its intended scope.\nRehnquist's dissent in United States Department of Agriculture v. Murry illuminates his view that a classification should pass muster under the rational basis test so long as that classification is not entirely counterproductive with respect to the purposes of the legislation in which it is contained. Shapiro alleges that Rehnquist's stance \"makes rational basis a virtual nullity\".\n\n\n=== Relations on the Court ===\nRehnquist built warm personal relations with his colleagues, even with ideological opposites. Justice William Brennan Jr. \"startled one acquaintance by informing him that 'Bill Rehnquist is my best friend up here.'\" Rehnquist and Justice William O. Douglas bonded over a shared iconoclasm and love of the West. The Brethren claims that the court's \"liberals found it hard not to like the good-natured, thoughtful Rehnquist\", despite finding his legal philosophy \"extreme\", and that Justice Stewart regarded Rehnquist as \"excellent\" and \"a \"team player, a part of the group in the center of the court, even though he usually ended up in the conservative bloc\".Since Rehnquist's first years on the Supreme Court, other justices criticized what they saw as his \"willingness to cut corners to reach a conservative result\", \"gloss[ing] over inconsistencies of logic or fact\" or distinguishing indistinct cases to reach their destination. In Jefferson v. Hackney, for example, Douglas and Justice Thurgood Marshall charged that Rehnquist's opinion \"misrepresented the legislative history\" of a federal welfare program. Rehnquist did not correct what The Brethren characterizes as an \"outright misstatement, ... [and thus] publish[ed] an opinion that twisted the facts\". His \"misuse\" of precedents in another case \"shocked\" Justice Stevens. For his part, Rehnquist was often \"contemptuous of Brennan's opinions\", seeing them as \"bending the facts or law to suit his purposes\".Reluctant to compromise, Rehnquist was the most frequent sole dissenter during the Burger years, garnering the nickname \"the Lone Ranger\". He usually voted with Burger, and—recognizing \"the importance of his relationship with Burger\"—often went along to get along, joining Burger's majority opinions even when he disagreed with them, and, in important cases, \"tr[ying] to straighten him out\".\n\n\n== Chief Justice ==\n\nWhen Burger retired in 1986, President Ronald Reagan nominated Rehnquist for Chief Justice. Although Rehnquist was to Burger's right, \"his colleagues were unanimously pleased and supportive\", even his \"ideological opposites\". The nomination \"was met with 'genuine enthusiasm on the part of not only his colleagues on the Court but others who served the Court in a staff capacity and some of the relatively lowly paid individuals at the Court. There was almost a unanimous feeling of joy.'\" Justice Thurgood Marshall later called him \"a great chief justice\".During confirmation hearings, Senator Edward Kennedy challenged Rehnquist on his unwitting ownership of property that had a restrictive covenant against sale to Jews (such covenants were held to be unenforceable under the 1948 Supreme Court case Shelley v. Kraemer). Despite this and other controversies, including concern over his membership in the Alfalfa Club (which at the time did not allow women to join), the Senate confirmed his appointment, 65–33 (49–2 in the Senate Republican Conference, with Barry Goldwater and Jake Garn abstaining, and 16–31 in the Senate Democratic Caucus), and he took office on September 26. Rehnquist's seat as an associate justice was filled by newly appointed Antonin Scalia. Rehnquist was the first person since Harlan F. Stone to serve as both an associate justice and Chief Justice.\nRehnquist had no prior experience as a judge upon his appointment to the Court. His only experience in presiding over a case at the trial level was in 1984, when Judge D. Dortch Warriner invited him to preside over a civil case, Julian D. Heislup, Sr. and Linda L. Dixon, Appellees, v. Town of Colonial Beach, Virginia, et al. Exercising the authority of a Supreme Court justice to preside over lower court proceedings, he oversaw the jury trial involving allegations that police department employees' civil rights were violated when they testified in a matter involving alleged police brutality against a teenage boy. Rehnquist ruled for the plaintiffs in a number of motions, allowing the case to go to the jury. When the jury found for the plaintiffs and awarded damages, the defendants appealed. The appeal was argued before the Fourth Circuit Court of Appeals on June 4, 1986–16 days before Rehnquist was nominated as Chief Justice. Forty-three days after Rehnquist was sworn in as Chief Justice, the Fourth Circuit reversed the judgment, overruling Rehnquist, and concluding that there was insufficient evidence to have sent the matter to the jury.In 1999, Rehnquist became the second chief justice (after Salmon P. Chase) to preside over a presidential impeachment trial, during the proceedings against President Bill Clinton. In 2000, he wrote a concurring opinion in Bush v. Gore, the case that ended the presidential election controversy in Florida, agreeing with four other justices that the Equal Protection Clause barred a \"standardless\" manual recount of the votes as ordered by the Florida Supreme Court.\nIn his capacity as chief justice, Rehnquist administered the Oath of Office to the following presidents of the United States:\n\nGeorge H. W. Bush in 1989\nBill Clinton in 1993 and 1997\nGeorge W. Bush in 2001 and 2005\n\n\n=== Leadership of the Court ===\nRehnquist's predecessor as chief justice, Warren Burger, had floundered as a leader, alienating his colleagues with his overbearing manner, his inability to effectively manage the justices' conference sessions, and abuse of his seniority—in particular, his tendency to change his vote on important cases so that he could maintain control over opinion assignments. By contrast, Rehnquist won fellow justices over with his easygoing, humorous, and unpretentious personality. He also tightened up the justices' conferences, keeping justices from going too long or off track and not allowing any justice to speak twice until all had spoken once, and gained a reputation for scrupulous fairness in assigning opinions: Rehnquist assigned no justice (including himself) two opinions before everyone had been assigned one, and made no attempts to interfere with assignments for cases in which he was in the minority. Most significantly, he successfully lobbied Congress in 1988 to give the Court control of its own docket, cutting back on mandatory appeals and certiorari grants in general.\n\nRehnquist added four yellow stripes to the sleeves of his robe in 1995. A lifelong fan of Gilbert and Sullivan operas, he liked the Lord Chancellor's costume in a community theater production of Iolanthe, and thereafter appeared in court with the same striped sleeves. (The Lord Chancellor was traditionally the senior member of the British judiciary.) His successor, Chief Justice John Roberts, chose not to continue the practice.\n\n\n=== Federalism doctrine ===\nScholars expected Rehnquist to push the Supreme Court in a more conservative direction during his tenure. Many commentators expected to see the federal government's power limited and state governments' power increased. But legal reporter Jan Crawford has said that some of Rehnquist's victories toward the federalist goal of scaling back congressional power over the states had little practical impact.Rehnquist voted with the majority in City of Boerne v. Flores (1997), and referred to that decision as precedent for requiring Congress to defer to the Court when interpreting the Fourteenth Amendment (including the Equal Protection Clause) in a number of cases. Boerne held that any statute that Congress enacted to enforce the Fourteenth Amendment (including the Equal Protection Clause) had to show \"a congruence and proportionality between the injury to be prevented or remedied and the means adopted to that end\". The Rehnquist Court's congruence and proportionality theory replaced the \"ratchet\" theory that had arguably been advanced in Katzenbach v. Morgan (1966). According to the ratchet theory, Congress could \"ratchet up\" civil rights beyond what the Court had recognized, but Congress could not \"ratchet down\" judicially recognized rights. According to the majority opinion of Justice Anthony Kennedy, which Rehnquist joined in Boerne:\n\nThere is language in our opinion in Katzenbach v. Morgan, 384 U.S. 641 (1966), which could be interpreted as acknowledging a power in Congress to enact legislation that expands the rights contained in §1 of the Fourteenth Amendment. This is not a necessary interpretation, however, or even the best one.... If Congress could define its own powers by altering the Fourteenth Amendment's meaning, no longer would the Constitution be \"superior paramount law, unchangeable by ordinary means\".\nThe Rehnquist Court's congruence and proportionality standard made it easier to revive older precedents preventing Congress from going too far in enforcing equal protection of the laws.One of the Rehnquist Court's major developments involved reinforcing and extending the doctrine of sovereign immunity, which limits the ability of Congress to subject non-consenting states to lawsuits by individual citizens seeking money damages.\nIn both Kimel v. Florida Board of Regents (2000) and Board of Trustees of the University of Alabama v. Garrett (2001), the Court held that Congress had exceeded its power to enforce the Equal Protection Clause. In both cases, Rehnquist was in the majority that held discrimination by states based upon age or disability (as opposed to race or gender) need satisfy only rational basis review as opposed to strict scrutiny.\n\nThough the Eleventh Amendment by its terms applies only to suits against a state by citizens of another state, the Rehnquist Court often extended this principle to suits by citizens against their own states. One such case was Alden v. Maine (1999), in which the Court held that the authority to subject states to private suits does not follow from any of the express enumerated powers in Article I of the Constitution, and therefore looked to the Necessary and Proper Clause to see whether it authorized Congress to subject the states to lawsuits by the state's own citizens. Rehnquist agreed with Kennedy's statement that such lawsuits were not \"necessary and proper\":\n\nNor can we conclude that the specific Article I powers delegated to Congress necessarily include, by virtue of the Necessary and Proper Clause or otherwise, the incidental authority to subject the States to private suits as a means of achieving objectives otherwise within the scope of the enumerated powers.\nRehnquist also led the Court toward a more limited view of Congressional power under the Commerce Clause. For example, he wrote for a 5-to-4 majority in United States v. Lopez, 514 U.S. 549 (1995), striking down a federal law as exceeding congressional power under the Clause.\nLopez was followed by United States v. Morrison, 529 U.S. 598 (2000), in which Rehnquist wrote the Court's opinion striking down the civil damages portion of the Violence Against Women Act of 1994 as regulating conduct that has no significant direct effect on interstate commerce. Rehnquist's majority opinion in Morrison also rejected an Equal Protection argument on the Act's behalf. All four dissenters disagreed with the Court's interpretation of the Commerce Clause, and two dissenters, Stevens and Breyer, also took issue with the Court's Equal Protection analysis. Justice David Souter asserted that the Court was improperly seeking to convert the judiciary into a \"shield against the commerce power\".\nRehnquist's majority opinion in Morrison cited precedents limiting the Equal Protection Clause's scope, such as United States v. Cruikshank (1876), which held that the Fourteenth Amendment applied only to state actions, not private acts of violence. Breyer, joined by Stevens, agreed with the majority that it \"is certainly so\" that Congress may not \"use the Fourteenth Amendment as a source of power to remedy the conduct of private persons\", but took issue with another aspect of the Morrison Court's Equal Protection analysis, arguing that cases that the majority had cited (including United States v. Harris and the Civil Rights Cases regarding lynching and segregation respectively) did not consider \"this kind of claim\" in which state actors \"failed to provide adequate (or any) state remedies\". In response, the Morrison majority asserted that the Violence Against Women Act was \"directed not at any State or state actor, but at individuals who have committed criminal acts motivated by gender bias\".\nThe federalist trend Lopez and Morrison set was seemingly halted by Gonzales v. Raich (2005), in which the court broadly interpreted the Commerce Clause to allow Congress to prohibit the intrastate cultivation of medicinal cannabis. Rehnquist, O'Connor and Justice Clarence Thomas dissented in Raich.\nRehnquist authored the majority opinion in South Dakota v. Dole (1987), upholding Congress's reduction of funds to states not complying with the national 21-year-old drinking age. Rehnquist's broad reading of Congress's spending power was also seen as a major limitation on the Rehnquist Court's push to redistribute power from the federal government to the states.\n\n\n=== Stare decisis ===\nSome commentators expected the Rehnquist Court to overrule several controversial decisions broadly interpreting the Bill of Rights. But the Rehnquist Court expressly declined to overrule Miranda v. Arizona in Dickerson v. United States. Rehnquist believed that federal judges should not impose their personal views on the law or stray beyond the framers' intent by reading broad meaning into the Constitution; he saw himself as an \"apostle of judicial restraint\". Columbia Law School Professor Vincent Blasi said of Rehnquist in 1986 that \"[n]obody since the 1930s has been so niggardly in interpreting the Bill of Rights, so blatant in simply ignoring years and years of precedent.\" In the same article, Rehnquist was quoted as retorting that \"such attacks come from liberal academics and that 'on occasion, they write somewhat disingenuously about me'.\"\nRehnquist disagreed with Roe v. Wade. In 1992, Roe survived by a 5–4 vote in Planned Parenthood v. Casey, which relied heavily on the doctrine of stare decisis. Dissenting in Casey, Rehnquist criticized the Court's \"newly minted variation on stare decisis\", and asserted \"that Roe was wrongly decided, and that it can and should be overruled consistently with our traditional approach to stare decisis in constitutional cases\".The Court decided another abortion case, this time dealing with partial birth abortion, in Stenberg v. Carhart (2000). Again, the vote was 5–4, and again Rehnquist dissented, urging that stare decisis not be the sole consideration: \"I did not join the joint opinion in Planned Parenthood of Southeastern Pa. v. Casey, 505 U. S. 833 (1992), and continue to believe that case is wrongly decided.\"\n\n\n=== LGBT rights ===\nAmong the many closely watched decisions during Rehnquist's tenure was Romer v. Evans (1996). Colorado had adopted an amendment to the state constitution (\"Amendment 2\") that the Court majority said would have prevented any city, town, or county in the state from taking any legislative, executive, or judicial action to protect citizens from discrimination on the basis of their sexual orientation. Rehnquist joined Scalia's dissent, which argued that since the Constitution says nothing about this subject, \"it is left to be resolved by normal democratic means\". The dissent argued as follows (some punctuation omitted):\n\nGeneral laws and policies that prohibit arbitrary discrimination would continue to prohibit discrimination on the basis of homosexual conduct as well. This ... lays to rest such horribles, raised in the course of oral argument, as the prospect that assaults upon homosexuals could not be prosecuted. The amendment prohibits special treatment of homosexuals, and nothing more. It would not affect, for example, a requirement of state law that pensions be paid to all retiring state employees with a certain length of service; homosexual employees, as well as others, would be entitled to that benefit.\nThe dissent mentioned the Court's then-existing precedent in Bowers v. Hardwick (1986), that \"the Constitution does not prohibit what virtually all States had done from the founding of the Republic until very recent years—making homosexual conduct a crime.\" By analogy, the Romer dissent reasoned that:\n\nIf it is rational to criminalize the conduct, surely it is rational to deny special favor and protection to those with a self avowed tendency or desire to engage in the conduct.\nThe dissent listed murder, polygamy, and cruelty to animals as behaviors that the Constitution allows states to be very hostile toward, and stated: \"the degree of hostility reflected by Amendment 2 is the smallest conceivable.\" It added:\n\nI would not myself indulge in ... official praise for heterosexual monogamy, because I think it no business of the courts (as opposed to the political branches) to take sides in this culture war. But the Court today has done so, not only by inventing a novel and extravagant constitutional doctrine to take the victory away from traditional forces, but even by verbally disparaging as bigotry adherence to traditional attitudes.\nIn Lawrence v. Texas (2003), the Supreme Court overruled Bowers. Rehnquist again dissented, along with Scalia and Thomas. The Court's result in Romer had described the struck-down statute as \"a status-based enactment divorced from any factual context from which we could discern a relationship to legitimate state interests\". The sentiment behind that statute had led the court to evaluate it with a \"more searching\" form of review. Similarly, in Lawrence, \"moral disapproval\" was found to be an unconstitutional basis for condemning a group of people. The Court protected homosexual behavior in the name of liberty and autonomy.Rehnquist sometimes reached results favorable to homosexuals, for example voting to allow a gay CIA employee to sue on the basis of constitutional law for improper personnel practices (although barring suit on the basis of administrative law in deference to a claim of national security reasons), to allow same-sex sexual harassment claims to be adjudicated, and to allow the University of Wisconsin–Madison to require students to pay a mandatory fee that subsidized gay groups along with other student organizations.\n\n\n=== Civil Rights Act ===\nIn Alexander v. Sandoval (2001), which involved the issue of whether a citizen could sue a state for not providing driver's license exams in languages other than English, Rehnquist voted with the majority in denying a private right to sue for discrimination based on race or national origin involving disparate impact under Title VI of the Civil Rights Act of 1964. Sandoval cited Cannon v. University of Chicago (1979) as precedent. The Court ruled 5–4 that various facts (regarding disparate impact) mentioned in a footnote of Cannon were not part of the holding of Cannon. The majority also viewed it as significant that §602 of Title VI did not repeat the rights-creating language (race, color, or national origin) in §601.\n\n\n=== Religion clauses ===\nIn 1992, Rehnquist joined a dissenting opinion in Lee v. Weisman that the Free Exercise Clause of the First Amendment only forbids government from preferring one particular religion over another. Souter wrote a dissent specifically addressed to Rehnquist on this issue in 1992.Rehnquist also led the way in allowing greater state assistance to religious schools, writing another 5-to-4 majority opinion in Zelman v. Simmons-Harris that approved a school voucher program that aided church schools along with other private schools.\nIn Van Orden v. Perry (2005), Rehnquist wrote the plurality opinion upholding the constitutionality of a display of the Ten Commandments at the Texas state capitol in Austin. He wrote:\n\nOur cases, Janus like, point in two directions in applying the Establishment Clause. One face looks toward the strong role played by religion and religious traditions throughout our Nation's history.... The other face looks toward the principle that governmental intervention in religious matters can itself endanger religious freedom.\nThis opinion was joined by Scalia, Thomas, Breyer, and Kennedy.\n\n\n=== First Amendment ===\nUniversity of Chicago Law School Professor Geoffrey Stone has written that Rehnquist was by an impressive margin the justice least likely to invalidate a law as violating \"the freedom of speech, or of the press\". Burger was 1.8 times more likely to vote in favor of the First Amendment; Scalia, 1.6 times; Thomas, 1.5 times. Excluding unanimous Court decisions, Rehnquist voted to reject First Amendment claims 92% of the time. In issues involving freedom of the press, he rejected First Amendment claims 100% of the time. Stone wrote:\n\nThere were only three areas in which Rehnquist showed any interest in enforcing the constitutional guarantee of free expression: in cases involving advertising, religious expression, and campaign finance regulation. But, as he did in Bigelow v. Commonwealth of Virginia, Rehnquist voted against freedom of advertising if an advertisement involved birth control or abortion.\n\n\n=== Fourteenth Amendment ===\nRehnquist wrote a concurrence agreeing to strike down the male-only admissions policy of the Virginia Military Institute as violating the Equal Protection Clause, but declined to join the majority opinion's basis for using the Fourteenth Amendment, writing:\n\nHad Virginia made a genuine effort to devote comparable public resources to a facility for women, and followed through on such a plan, it might well have avoided an equal protection violation.\nThis rationale supported facilities separated on the basis of gender:\n\nIt is not the 'exclusion of women' that violates the Equal Protection Clause, but the maintenance of an all-men school without providing any—much less a comparable—institution for women.... It would be a sufficient remedy, I think, if the two institutions offered the same quality of education and were of the same overall caliber.\nRehnquist remained skeptical about the Court's Equal Protection Clause jurisprudence; some of his opinions most favorable to equality resulted from statutory rather than constitutional interpretation. For example, in Meritor Savings Bank v. Vinson (1986), Rehnquist established a hostile-environment sexual harassment cause of action under Title VII of the Civil Rights Act of 1964, including protection against psychological aspects of harassment in the workplace.\n\n\n== Legacy ==\nJeffery Rosen has argued that Rehnquist's \"tactical flexibility was more effective than the rigid purity of Scalia and Thomas.\" Rosen writes:\n\nIn truth, Rehnquist carefully staked out a limbo between the right and the left and showed that it was a very good place to be. With exceptional efficiency and amiability he led a Court that put the brakes on some of the excesses of the Earl Warren era while keeping pace with the sentiments of a majority of the country—generally siding with economic conservatives and against cultural conservatives. As for judicial temperament, he was far more devoted to preserving tradition and majority rule than the generation of fire-breathing conservatives who followed him. And his administration of the Court was brilliantly if quietly effective, making him one of the most impressive chief justices of the past hundred years.\nIn The Partisan: The Life of William Rehnquist, biographer John A. Jenkins was critical of Rehnquist's history with racial discrimination. He noted that, as a private citizen, Rehnquist had protested Brown v. Board of Education, and as a justice, consistently ruled against racial minorities in affirmative action cases. Only when white males began to make reverse discrimination claims did he become sympathetic to equal protection arguments.Charles Fried has described the Rehnquist Court's \"project\" as \"to reverse not the course of history but the course of constitutional doctrine's abdication to politics\". Legal reporter Jan Greenburg has said that conservative critics noted that the Rehnquist court did little to overturn the left's successes in the lower courts, and in some cases actively furthered them. But in 2005, law professor John Yoo wrote, \"It is telling to see how many of Rehnquist's views, considered outside the mainstream at the time by professors and commentators, the court has now adopted.\"\n\n\n== Personal health ==\nAfter Rehnquist's death in 2005, the FBI honored a Freedom of Information Act request detailing the Bureau's background investigation before Rehnquist's nomination as chief justice. The files reveal that for a period, Rehnquist had been addicted to Placidyl, a drug widely prescribed for insomnia. It was not until he was hospitalized that doctors learned of the extent of his dependency.\nDr. Freeman Cary, a U.S. Capitol physician, prescribed Rehnquist Placidyl for insomnia and back pain from 1972 to 1981 in doses exceeding the recommended limits, but the FBI report concluded that Rehnquist was already taking the drug as early as 1970. By the time he sought treatment, Rehnquist was taking three times the prescribed dose of the drug nightly. On December 27, 1981, Rehnquist entered George Washington University Hospital for treatment of back pain and Placidyl dependency. There, he underwent a month-long detoxification process. While hospitalized, he had typical withdrawal symptoms, including hallucinations and paranoia. For example, \"One doctor said Rehnquist thought he heard voices outside his hospital room plotting against him and had 'bizarre ideas and outrageous thoughts', including imagining 'a CIA plot against him' and seeming to see the design patterns on the hospital curtains change configuration.\"For several weeks before his hospitalization, Rehnquist had slurred his words, but there were no indications he was otherwise impaired. Law professor Michael Dorf observed that \"none of the Justices, law clerks or others who served with Rehnquist have so much as hinted that his Placidyl addiction affected his work, beyond its impact on his speech.\"\n\n\n== Failing health and death ==\n\nOn October 26, 2004, the Supreme Court press office announced that Rehnquist had recently been diagnosed with anaplastic thyroid cancer. In the summer of 2004, Rehnquist traveled to England to teach a constitutional law class at Tulane University Law School's program abroad. After several months out of the public eye, Rehnquist administered the oath of office to President George W. Bush at his second inauguration on January 20, 2005, despite doubts over whether his health would permit it. He arrived using a cane, walked very slowly, and left immediately after the oath was administered.Rehnquist missed 44 oral arguments before the Court in late 2004 and early 2005, returning to the bench on March 21, 2005. But during his absence, he remained involved in Court business, participating in many decisions and deliberations.On July 1, 2005, Justice O'Connor announced her impending retirement from the Court, after consulting with Rehnquist and learning that he had no intention to retire. To a reporter who asked whether he would be retiring, Rehnquist replied, \"That's for me to know and you to find out.\"Rehnquist died at his Arlington, Virginia, home on September 3, 2005, four weeks before his 81st birthday. He was the first justice to die in office since Robert H. Jackson in 1954 and the first chief justice to die in office since Fred M. Vinson in 1953. He was also the last serving justice appointed by Nixon.\nOn September 6, 2005, eight of Rehnquist's former law clerks, including Judge John Roberts, his eventual successor, served as pallbearers as his casket was placed on the same catafalque that bore Abraham Lincoln's casket as he lay in state in 1865. Rehnquist's body lay in repose in the Great Hall of the United States Supreme Court Building until his funeral on September 7, a Lutheran service conducted at the Roman Catholic Cathedral of St. Matthew the Apostle in Washington, D.C. President George W. Bush and Justice O'Connor eulogized Rehnquist, as did members of his family. Rehnquist's funeral was the largest gathering of political dignitaries at the cathedral since President John F. Kennedy's funeral in 1963. It was followed by a private burial service, in which he was interred next to his wife, Nan, at Arlington National Cemetery.\n\n\n== Replacement as Chief Justice ==\nRehnquist's death, just over two months after O'Connor announced her impending retirement, left two vacancies for President Bush to fill. On September 5, 2005, Bush withdrew the nomination of Judge John Roberts of the D.C. Circuit Court of Appeals to replace O'Connor as associate justice and instead nominated him to replace Rehnquist as chief justice. Roberts was confirmed by the U.S. Senate and sworn in as the new chief justice on September 29, 2005. He had clerked for Rehnquist in 1980–81. O'Connor, who had made the effective date of her resignation the confirmation of her successor, continued to serve on the Court until Samuel Alito was confirmed and sworn in in January 2006.\nEulogizing Rehnquist in the Harvard Law Review, Roberts wrote that he was \"direct, straightforward, utterly without pretense—and a patriot who loved and served his country. He was completely unaffected in manner.\"\n\n\n== Family life ==\nRehnquist's paternal grandparents immigrated separately from Sweden in 1880. His grandfather Olof Andersson, who changed his surname from the patronymic Andersson to the family name Rehnquist, was born in the province of Värmland; his grandmother was born Adolfina Ternberg in the Vreta Kloster parish in Östergötland. Rehnquist is one of two chief justices of Swedish descent, the other being Earl Warren, who had Norwegian and Swedish ancestry.Rehnquist married Natalie \"Nan\" Cornell on August 29, 1953. The daughter of a San Diego physician, she worked as an analyst on the CIA's Austria desk before their marriage. The couple had three children: James, a lawyer and college basketball star; Janet, a lawyer; and Nancy, an editor (including of her father's books) and homemaker. Nan Rehnquist died on October 17, 1991, aged 62, of ovarian cancer. Rehnquist was survived by nine grandchildren.Shortly after moving to Washington, D.C., the Rehnquists purchased a home in Greensboro, Vermont, where they spent many vacations.\n\n\n== Books authored ==\nThe Centennial Crisis: The Disputed Election of 1876. New York: Knopf Publishing Group. 2004. ISBN 0-375-41387-1.\nAll the Laws but One: Civil Liberties in Wartime. New York: William Morrow & Co. 1998. ISBN 0-688-05142-1.\nGrand Inquests: The Historic Impeachments of Justice Samuel Chase and President Andrew Johnson. New York: Knopf Publishing Group. 1992. ISBN 0-679-44661-3.\nThe Supreme Court: How It Was, How It Is. New York: William Morrow & Co. 1987. ISBN 0-688-05714-4.\nThe Supreme Court: A new edition of the Chief Justice's classic history (Revised ed.). New York: Knopf Publishing Group. 2001. ISBN 0-375-40943-2.\n\n\n== See also ==\n\nDemographics of the Supreme Court of the United States\nList of Justices of the Supreme Court of the United States\nList of law clerks of the Supreme Court of the United States\nList of United States Chief Justices by time in office\nList of U.S. Supreme Court Justices by time in office\nUnited States Supreme Court cases during the Burger Court\nUnited States Supreme Court cases during the Rehnquist Court\n\n\n== References ==\n\n\n== Further reading ==\n\n\n== External links ==\nWilliam Hubbs Rehnquist at the Biographical Directory of Federal Judges, a public domain publication of the Federal Judicial Center.\nWilliam Rehnquist at Ballotpedia\nIssue positions and quotes at OnTheIssues\nAppearances on C-SPAN\nBooknotes interview with David Savage on Turning Right: The Making of the Rehnquist Supreme Court, June 28, 1992.\nBooknotes interview with Rehnquist on Grand Inquests: The Historic Impeachments of Justice Samuel Chase and President Andrew Johnson, July 5, 1992.\nProfile at Answers.com\n\"In Memoriam: William H. Rehnquist\", 119 Harvard Law Review 2005 (tributes to Rehnquist)\nOriginal source William Rehnquist FBI file\n1986 Senate confirmation hearing\nWilliam Rehnquist's FBI files, hosted at the Internet Archive:\nPart 1\nPart 2\nPart 3\nPart 4\nPart 5\nPart 6\nSupreme Court Associate Justice Nomination Hearings on William Hubbs Rehnquist in November 1971 United States Government Publishing Office\nSupreme Court Chief Justice Nomination Hearings on William Hubbs Rehnquist in July 1986 United States Government Publishing Office\n\n\n=== Opinions ===\nSupreme Court Justice Rehnquist's Key Decisions – The Washington Post\nThe Legacy of William H. Rehnquist – Majority and Dissenting Opinions in Major Supreme Court Cases"