"Theme music is a musical composition that is often written specifically for radio programming, television shows, video games, or films and is usually played during the title sequence, opening credits, closing credits, and in some instances at some point during the program.The phrase theme song or signature tune may also be used to refer to a signature song that has become especially associated with a particular performer or dignitary, often used as they make an entrance.\nThe purpose of a theme song is often similar to that of a leitmotif. Such songs can also be used in other ways. One author has made extensive use of them in an effort to explore the feelings behind worldview.\n\n\n== Purpose ==\nFrom the 1950s onwards, theme music, and especially theme songs also became a valuable source of additional revenue for Hollywood film studios, many of which launched their own recording arms. This period saw the beginning of more methodical cross-promotion of music and movies. One of the first big successes, which proved very influential, was the theme song for High Noon (1952).\n\n\n== Celebrities ==\nIn the early years of radio and television, celebrities often had a signature song associated with them that became their theme music. Such music would be played when a celebrity was about to appear, often played by a band if the celebrity were appearing on the talk show. For example, Bob Hope's theme song, which almost always preceded his appearance, was \"Thanks for the Memory\". In another example, Lucille Ball's theme music was \"Hey, Look Me Over\". Other celebrities will have the theme music played for their most notable role; for example, playing the theme from Indiana Jones when Harrison Ford is the guest.\nThe practice of playing specific theme music for a celebrity extends to modern-day television talk shows. If a talk show guest doesn't have theme music, the band will sometimes provide them one, which can often involve surreptitious messages from the band about the celebrity. For example, when politician Michele Bachmann appeared on Late Night with Jimmy Fallon during her campaign for president, the all-black house band The Roots played the song Lyin' Ass Bitch, as the band supported opposing candidate Barack Obama. This controversy led to Fallon allegedly placing the band on \"probation\" for such rudeness, although no punishment or upbraiding of the band was demonstrated to the public.\n\n\n=== Television ===\nTheme music has been a feature of the majority of television programs since the medium's inception, as it was for the ancestral radio shows that provided their inspiration. Programs have used theme music in a large variety of styles, sometimes adapted from existing tunes, and with some composed specifically for the purpose. A few have been released commercially and become popular hits; examples include the title theme from Rawhide, performed and recorded by popular singer Frankie Laine; the theme to Happy Days (from 1974 to 1984), performed by Pratt & McClain (in Top 5, 1976); the theme to Laverne & Shirley, performed by Cyndi Grecco (#25, 1976); the theme to Friends, \"I'll Be There For You\", which was a hit for The Rembrandts; the theme from S.W.A.T., which was a hit for Rhythm Heritage, the theme song from Pokémon (known as \"Pokémon Theme\" in the Pokémon 2.B.A. Master soundtrack), which is a long time hit for Jason Paige, and the theme song from Drake & Josh, \"Found a Way\", which was a hit for Drake Bell. The theme song from iCarly, \"Leave It All to Me\", was a hit for Miranda Cosgrove and features her Drake & Josh co-star Drake Bell, hitting number 100 on the Billboard Hot 100. Jan Hammer had a major hit with the theme from Miami Vice in the 1980s. \"Theme From Dr. Kildare (Three Stars Will Shine Tonight)\", recorded by Richard Chamberlain, the star of the television series, was in 1962 a top 10 hit in the U.S. and a top 20 in the UK and \"Theme from The Greatest American Hero (Believe It or Not)\", from The Greatest American Hero, a #2 hit for Joey Scarbury in 1981. The theme to the anime Baka and Test, \"Perfect-area Complete!\" was a hit for Natsuko Aso, peaking at number 18 on the Oricon Singles Chart.\nOther themes, like the music for The Young and the Restless, Days of Our Lives, and Coronation Street have become iconic mostly due to the shows' respective longevities. Unlike others, these serials have not strayed from the original theme mix much, if at all, allowing them to be known by multiple generations of television viewers.\nIn the United Kingdom and Ireland, iconic sports shows have such strong associations with their theme music that the sports themselves are synonymous with the theme tunes, such as association football (The Match of the Day, Grandstand and The Big Match theme tunes), cricket (\"Soul Limbo\" by Booker T. & the M.G.'s, \"Soul Limbo\"), motorsport (Roger Barsotti's Motor Sport and the bassline from Fleetwood Mac's \"The Chain\"), tennis (Keith Mansfield's \"Light and Tuneful\"), snooker (\"Drag Racer\" by the Doug Wood Band), skiing (\"Pop Goes Bach\", the theme to Ski Sunday) and gaelic games (\"Jägerlatein\" by James Last). Themes in the United States that have become associated with a sport include Johnny Pearson's \"Heavy Action\" (used for many years as an intro to Monday Night Football), \"Roundball Rock\" (composed by John Tesh) as the theme for the NBA on NBC during the 1990s and early 2000s, and for Fox College Hoops (from 2018–19 to present) and Jr. NBA Championships (2019–present), \"Bugler's Dream\" (used in ABC and NBC's coverage of the Olympic Games) and the theme to ESPN's sports highlight show, SportsCenter. A notable theme that was once associated with a sport, but because of its popularity, spread network-wide was the NFL on Fox theme, which is now used for Major League Baseball on Fox (2010–present) and NASCAR on Fox (2011–2015) and Fox UFC (2012–2018) and Premier Boxing Champions (December 2018 to July/August 2019) and Jr. NBA Championships (unknown-2018) broadcasts, and is regarded as the network's single theme by October 2010. CBS's longtime March Madness theme is considered one of the masterpieces of Americans sports theme music, said to deliver a euphoric feeling to many sports fans. In Canada, the soaring backbeats of the Hockey Night in Canada theme, \"The Hockey Theme\", became so iconic that the piece was sometimes called Canada's second national anthem. It became something of a national scandal when broadcaster CBC Television lost the rights to use the theme in 2008.Most television shows have specific, melodic theme music, even if just a few notes (such as the clip of music that fades in and out in the title sequence for Lost, or the pulsing sound of helicopter blades in the theme music for Airwolf). One exception is 60 Minutes, which features only the ticking hand of a TAG Heuer stopwatch. Another recent exception is Body of Proof which has no theme song, and barely even has a title sequence.\nIn most television series, the theme song is played during the opening sequence. One exception to this rule is Regular Show, the theme music of which is played only during its ending credits in most episodes. In lieu of its theme music, its opening sequence instead features a tone played on a synthesizer overlaid with a ticking sound effect.\n\n\n=== Remixes ===\nNotable is the Law & Order series, which started out with one theme song for Law & Order, and remixed it for its four spinoffs (Law & Order: Special Victims Unit, Law & Order: Criminal Intent, Law & Order: Trial by Jury and Law & Order: LA). The related shows Crime & Punishment, New York Undercover. Arrest & Trial and Stars Earn Stripes also aired with a remix of the theme.CSI: NY uses the first strophe of \"Baba O'Riley\" for its opening sequence, but with a remixed version of the instrumental track.\n\n\n=== Radio ===\n\nRadio programs with notable theme music include Just a Minute, which uses a high-speed rendition of the Minute Waltz by Frédéric Chopin; The Archers, which has Barwick Green; Desert Island Discs which has By the Sleepy Lagoon, and The Rush Limbaugh Show, which uses the instrumental from \"My City Was Gone.\"\nIn talk radio, a different theme song is often used to introduce each segment, and the music (usually popular music of some sort) will often relate to the topic being discussed. John Batchelor is noted for his use of highly dramatic orchestral scores leading in and out of each segment of his weekly show.\n\n\n=== Video games ===\n\nMany video games feature a theme song that is distinctive to the series. A popular one to date is the \"Prelude Theme\" from the Final Fantasy series, which is played on most, if not all, of the title screens of the original games, most notably Final Fantasy I to Final Fantasy IV. The newer ones also feature the theme, albeit usually modernized, and played during the ending credits.\n\n\n== See also ==\nBumper music\nList of television theme music\nShow tune\nList of signature songs\nTelevision news music\nTrademark look\n\n\n== References ==\n\n\n== External links ==\nBBC Theme music experiment\nOxford Music Online: Television music\nCMS Theme experiment"