"Wesley Lawrence Willis (May 31, 1963 – August 21, 2003) was an American singer-songwriter and visual artist. Diagnosed with schizophrenia in 1989, Willis began a career as an underground singer-songwriter in the outsider music tradition. Willis' songs are typically partially spoken in an MC style, and partially sung in a nasal and out-of-tune manner reminiscent of punk rock vocals. They feature bizarre, humorous and sometimes obscene or absurd lyrics sung over melodies created by using the auto accompaniment feature on his Technics KN keyboard. His songs cover a wide variety of topics, with mental illness and consumerism being the most prominent themes.Willis gained a large cult following in the 1990s, particularly after the release of his 1995 Greatest Hits album on the Alternative Tentacles label. Jello Biafra compiled the album's track list. In addition to a large body of solo musical work, Willis fronted his own punk rock band, the Wesley Willis Fiasco, during the 1990s. He was a visual artist long before he developed an interest in music, and produced hundreds of intricate, unusual, colored ink-pen drawings, most of them depicting Chicago streetscapes; he frequently sold these on the street for between $20 and $40.Despite his mainly underground career, Willis has influenced a variety of media. For example, music software company Nullsoft took their slogan \"It really whips the llama's ass!\" for Winamp from Willis's song \"Whip the Llama's Ass\".\n\n\n== Life and career ==\nWillis was born in Chicago, Illinois on May 31, 1963, to Walter and Annie Willis. He had a brother named Ricky, who is also a disabled artist. According to the Los Angeles Times, \"Willis grew up in Chicago's projects as one of 10 children of parents who had a violent relationship and separated when he was young; he spent time in several foster homes and was essentially raised by two older brothers, who went with him from home to home.\" Willis began hearing voices during a period of living at his mother's home in the 1980s, when her abusive boyfriend Roger Lee Carpenter held a gun to his head and robbed him of $600 Willis had saved. By the end of the 1980s, he was diagnosed with paranoid schizophrenia and institutionalized for two months after his diagnosis.During childhood, Willis developed an interest in art, and in 1988, he was featured in a Chicago public access documentary feature created by Carl W. Hart titled Wesley Willis: Artist of the Streets. In Artist of the Streets, he was shown walking through Chicago's Loop neighborhood, producing his ink pen drawings outside of the Marshall Field and Company Building, and interacting with people curious about his art. The drawings typically encompass detailed Chicago streetscapes, including buildings, vehicles, trees, and landmarks. Willis was known for his ability to draw from memory a completely different location than the one in which he was sitting. During his lifetime, he frequently gave his drawings away to friends or sold them for small amounts (typically $10 or $20) in Chicago parks. However, after his death, Willis began to receive recognition in the art community for his large body of visual art. In 2008 his artwork was exhibited at the Mohamed Khalil Museum of Egypt, and he was the subject of a special exhibit entitled Drawn By Wesley Willis at Dominican University.In 1991, after befriending some musicians from Chicago's alternative rock scene and recording several solo albums, he formed the punk rock band The Wesley Willis Fiasco. The band developed a popular underground following as well as attention from musicians such as Eddie Vedder, Henry Rollins, Mike D., Jello Biafra, and the members of White Zombie; and soon caught the attention of Rick Rubin at American Recordings, an independent label distributed by The Warner Group. In early 1994, Willis recorded with the Canadian industrial-metal band Monster Voodoo Machine and appeared on their Juno Award-winning debut album Suffersystem (RCA Records). In 1995, American Recordings signed Willis as a solo musician; the Wesley Willis Fiasco subsequently broke up in 1996. He went on to record numerous solo albums of novelty rock (two for American Recordings and the remainder for several independent labels or recorded, marketed and released independently by Willis himself), toured frequently, and was profiled on MTV. On September 26, 1996, he was a guest on The Howard Stern Show where he played nearly identical songs about Baba Booey and Howard Stern. During his many tours and live appearances, Willis became \"famous for greeting fans with a headbutt\"; this left him with a distinctive permanent bruise on his forehead.In early 2003 the documentary The Daddy of Rock 'n' Roll was released, chronicling Willis' daily life and interests.\nIn 2004, Willis's song \"Rock N Roll McDonald's\", about the McDonald's restaurant of the same name, was used in the soundtrack of the documentary Super Size Me.\n\n\n== Death ==\nOn August 21, 2003, Willis died due to complications from chronic myelogenous leukemia in Skokie, Illinois.\n\n\n== Legacy ==\nIn 2013, a supporting character named Milan was introduced for the ongoing Wonder Woman comic. A blind demigod with the power of far-sight and half-brother to Wonder Woman, his physical appearance and mannerisms are based on Wesley Willis.Willis has been honored with a star on the outside mural of the Minneapolis nightclub First Avenue, recognizing performers that have played sold-out shows or have otherwise demonstrated a major contribution to the culture at the iconic venue. Receiving a star \"might be the most prestigious public honor an artist can receive in Minneapolis\", according to journalist Steve Marsh.Willis is referenced on the song \"Get Famous\" by American indie rock band The Mountain Goats, released on September 14, 2020, with the line \"Wesley Willis taught me how to write about you\". The song references themes of fame and the exploitation and downfall of those who achieve it.\n\n\n== Song structure and themes ==\n\"Hellride\" was the term used by Willis to describe his encounters with \"demons\" (delusions brought on by schizophrenia), which occurred mainly on the CTA bus lines in Chicago. According to Willis, his demons were trying to ruin his \"Harmony Joy Music\" or \"Joy Rides\". He used the term in many of his songs, such as \"I Deserve a Warhellride\".\nThe Wesley Willis Fiasco songs were punk rock songs with Willis howling his obscene, absurd rants as lyrics. The band recorded three cover songs: Thin Lizzy's \"Jailbreak\", Pure Prairie League's \"Amie\", and Duran Duran's \"Girls on Film\", the last of which was recorded for a 1997 Duran Duran tribute album. Another song by the Wesley Willis Fiasco, \"The Bar Is Closed\", recreates a section of Rush's \"Tom Sawyer\"; the song \"Casper the Homosexual Friendly Ghost\" does the same with Van Halen's \"Jamie's Cryin'\".\nAs a solo artist, Willis filled his albums with funny, bizarre, tense, and often obscene statements about crime, fast food, cultural trends, bus routes, violent confrontations with superheroes, commands for his \"demons\" to engage in bestiality (in The Daddy of Rock 'n' Roll, Willis explained that these songs would \"gross out\" the demons enough to make them leave him alone), and praise for his favorite actors, friends, politicians, and hip hop and rock artists. Songs about rock artists were usually confined to describing a show performed by the band that Willis had attended or opened for, recycling key phrases such as \"The crowd roared like a lion\", \"A lot of people met the band\", or \"The band got down like a Magikist\". Many songs end with the phrase \"Rock over London, rock on, Chicago\", followed by a product slogan, such as \"Wheaties: Breakfast of Champions\", \"Ford: Quality is Job One\", \"Diet Pepsi: Uh-Huh!\" or \"Blockbuster Video: Wow, What a Difference!\"\nCritic Stephen Thomas Erlewine of Allmusic wrote that despite Willis' prolific output his songs were essentially variations on the same simple structure, melody and lyrical themes. He also questioned record company motives for releasing albums by Willis: \"It's certainly admirable that Willis has decided to not be tied down by his schizophrenia, but it often seems that his audience is laughing at him, not with him.\" Erlewine also wrote that listening to a Willis record felt \"exploitive\".\n\n\n== Partial discography ==\n\n\n== References ==\n\n\n== External links ==\nWesley Willis discography at MusicBrainz\nWesley Willis discography at Discogs\nWesley Willis Art (archive), drawings by Willis of scenes in Chicago"