"A realm  is a community or territory over which a sovereign rules. The term is commonly used to describe a monarchical or dynastic state. A realm may also be a subdivision within an empire, if it has its own monarch, e.g. the German Empire.\n\n\n== Etymology ==\nThe Old French word reaume, modern French royaume, was the word first adopted in English; the fixed modern spelling does not appear until the beginning of the 17th century. The word supposedly derives from medieval Latin regalimen, from regalis, of or belonging to a rex (king). The word rex itself is derived from the Latin verb regere, which means \"to rule\". Thus the literal meaning of the word realm is the territory of a ruler, traditionally a monarch (emperor, king, grand duke, prince, etc.).\n\n\n== Usage ==\n\n\"Realm\" is particularly used for those states whose name includes the word kingdom (for example, the United Kingdom), as elegant variation, to avoid clumsy repetition of the word in a sentence (for example, \"The Queen's realm, the United Kingdom...\"). It is also useful to describe those countries whose monarchs are called something other than \"king\" or \"queen\"; for example, the Grand Duchy of Luxembourg is a realm but not a kingdom, since its monarch holds the title Grand Duke rather than King. \nThe term may commonly be used to describe any of the \"Commonwealth realms\", which are kingdoms in their own right and share the same person as monarch, though they are fully independent of each other.\nMore broadly, a \"realm\" may encompass territories that are subject to a monarch, yet are not a physical part of his or her \"kingdom\"; for example, the Cook Islands and Niue are considered parts of the Realm of New Zealand, although they are not part of New Zealand proper.\nRealm may also be used metaphorically to refer to an area of knowledge, expertise or habitat within which an individual or denizen is pre-eminent or dominant, e.g., \"Shakespeare's realm was English drama,\" or \"A lion's realm is the jungle\".\n\n\n== See also ==\nMonarchy\nEmpire\nBiogeographical realm\nKingdom\nReich\n\n\n== References ==\n\nAttribution\n\n This article incorporates text from a publication now in the public domain: Chisholm, Hugh, ed. (1911). \"Realm\". Encyclopædia Britannica. 22 (11th ed.). Cambridge University Press. p. 941."