"Norman Kingsley Mailer (January 31, 1923 – November 10, 2007) was an American novelist, journalist, essayist, playwright, activist, film-maker and actor. In a career spanning over six decades, Mailer had 11 best-selling books, at least one in each of the seven decades after World War II—more than any other post-war American writer.His novel The Naked and the Dead was published in 1948 and brought him early and wide renown. His 1968 nonfiction novel Armies of the Night won the Pulitzer Prize for non-fiction as well as the National Book Award. His best-known work is widely considered to be The Executioner's Song, the 1979 winner of the Pulitzer Prize for fiction.\nMailer is considered an innovator of \"creative non-fiction\" or \"New Journalism\", along with Truman Capote, Joan Didion, Hunter S. Thompson, and Tom Wolfe, a genre which uses the style and devices of literary fiction in fact-based journalism. He was a cultural commentator and critic, expressing his views through his novels, journalism, frequent media appearances, and essays, the most famous and reprinted of which is \"The White Negro\".\nIn 1955, he and three others founded The Village Voice, an arts- and politics-oriented weekly newspaper distributed in Greenwich Village. In 1960, he was convicted of assault and served a three-year probation after he stabbed his wife Adele Morales with a penknife, nearly killing her. In 1969, he ran an unsuccessful campaign to become the mayor of New York. Mailer was married six times and had nine children.\n\n\n== Early life ==\nNachem \"Norman\" Malech (\"King\") Mailer was born to a Jewish family in Long Branch, New Jersey on January 31, 1923. His father, Isaac Barnett Mailer, popularly known as \"Barney\", was an accountant born in South Africa, and his mother, Fanny (née Schneider), ran a housekeeping and nursing agency. Mailer's sister, Barbara, was born in 1927.Raised in Brooklyn, New York, Mailer graduated from Boys High School and entered Harvard College in 1939, when he was 16 years old. As an undergraduate, he was a member of the Signet Society. At Harvard, he majored in engineering sciences, but took the majority of his electives as writing courses. He published his first story, \"The Greatest Thing in the World,\" at the age of 18, winning Story magazine's college contest in 1941.After graduating in 1943, Mailer married his first wife Beatrice \"Bea\" Silverman in January 1944, just before being drafted into the U.S. Army. Hoping to gain a deferment from service, Mailer argued that he was writing an \"important literary work\" which pertained to the war. This deferral was denied, and Mailer was forced to enter the Army. After training at Fort Bragg, Mailer was stationed in the Philippines with the 112th Cavalry.During his time in the Philippines, Mailer was first assigned to regimental headquarters as a typist, then assigned as a wire lineman. In early 1945, after volunteering for a reconnaissance platoon, he completed more than two dozen patrols in contested territory, and engaged in a few firefights and skirmishes. After the Japanese surrender, he was sent to Japan as part of the army of occupation, was promoted to sergeant, and became a first cook.When asked about his war experiences, he said that the army was \"the worst experience of my life, and also the most important\". While in Japan and the Philippines, Mailer wrote to his wife Bea almost daily, and these approximately 400 letters became the foundation of The Naked and the Dead. He drew on his experience as a reconnaissance rifleman for the central action of the novel: a long patrol behind enemy lines.\n\n\n== Novelist ==\nMailer wrote 12 novels in 59 years. After completing courses in French language and culture at the University of Paris in 1947–48, he returned to the U.S. shortly after The Naked and the Dead was published in May 1948. A New York Times best seller for 62 weeks, it was the only one of Mailer's novels to reach the number one position. It was hailed by many as one of the best American wartime novels and included in a list of the hundred best English-language novels of the twentieth century by the Modern Library. The book that made his reputation sold over a million copies in its first year, (three million by 1981) and has never gone out of print. It is still considered to be one of the finest depictions of Americans in combat during World War II.Barbary Shore (1951) was not well received by the critics. It was a surreal parable of Cold War leftist politics set in a Brooklyn rooming-house, and Mailer's most autobiographical novel. His 1955 novel, The Deer Park drew on his experiences working as a screenwriter in Hollywood from 1949 to 1950. It was initially rejected by seven publishers due to its purportedly sexual content before being published by Putnam's. It was not a critical success, but it made the best-seller list, sold over 50,000 copies its first year, and is considered by some critics to be the best Hollywood novel since Nathanael West's The Day of the Locust.Mailer wrote his fourth novel, An American Dream, as a serial in Esquire magazine over eight months (January to August 1964), publishing the first chapter two months after he wrote it. In March 1965, Dial Press published a revised version. The novel generally received mixed reviews, but was a best seller. Joan Didion praised it in a review in National Review (April 20, 1965) and John W. Aldridge did the same in Life  (March 19, 1965), while Elizabeth Hardwick panned it in Partisan Review (spring 1965).In 1980, The Executioner's Song, Mailer's \"real-life novel\" of the life and death of murderer Gary Gilmore, won the Pulitzer Prize for fiction. Joan Didion reflected the views of many readers when she called the novel \"an absolutely astonishing book\" at the end of her front-page review in the New York Times Book Review.Mailer spent a longer time writing Ancient Evenings, his novel of Egypt in the Twentieth Dynasty (about 1100 BC), than any of his other books. He worked on it for periods from 1972 until 1983. It was also a bestseller, although reviews were generally negative. Harold Bloom, in his review said the book \"gives every sign of truncation\", and \"could be half again as long, but no reader will wish so\", while Richard Poirier called it Mailer's \"most audacious book\".Harlot's Ghost, Mailer's longest novel (1310 pages), appeared in 1991 and received his best reviews since The Executioner's Song. It is an exploration of the untold dramas of the CIA from the end of World War II to 1965. He performed a huge amount of research for the novel, which is still on CIA reading lists. He ended the novel with the words \"To be continued\" and planned to write a sequel, titled Harlot's Grave, but other projects intervened and he never wrote it. Harlot's Ghost sold well.\nHis final novel, The Castle in the Forest, which focused on Hitler's childhood, reached number five on the Times best-seller list after publication in January 2007. It received reviews that were more positive than any of his books since The Executioner's Song. Castle was intended to be the first volume of a trilogy, but Mailer died several months after it was completed. The Castle in the Forest received a laudatory 6,200-word front-page review by Lee Siegel in the New York Times Book Review, as well as a Bad Sex in Fiction Award by the Literary Review magazine.\n\n\n== Journalist ==\nFrom the mid-1950s, Mailer became known for his countercultural essays. In 1955, he co-founded The Village Voice and was initially an investor and silent partner, but later he wrote a column called \"Quickly: A Column for Slow Readers\" from January to April 1956. His articles published in this column, 17 in total, were important in his development of a philosophy of hip, or \"American existentialism,\" and allowed him to discover his penchant for journalism.\nMailer's famous essay \"The White Negro\" (1957) fleshes out the hipster figure who stands in opposition of forces that seek debilitating conformity in American society.\nIt is believed to be among the most anthologized, and controversial, essays of the postwar period. Mailer republished it in 1959 in his miscellany Advertisements for Myself, which he described as \"The first work I wrote with a style I could call my own.\" The reviews were positive, and most commentators referred to it as his breakthrough work.In 1960, Mailer wrote \"Superman Comes to the Supermarket\" for Esquire magazine, an account of the emergence of John F. Kennedy during the Democratic Party convention. The essay was an important breakthrough for the New Journalism of the 1960s, but when the magazine's editors changed the title to \"Superman Comes to the Supermart\", Mailer was enraged, and would not write for Esquire for years. (The magazine later apologized. Subsequent references are to the original title.)\nMailer took part in the October 1967 march on the Pentagon, but initially had no intention of writing a book about it. After conversations with his friend, Willie Morris, editor of Harper's magazine, he agreed to produce a long essay describing the march. In a concentrated effort, he produced a 90,000-word piece in two months, and it appeared in Harper's March issue. It was the longest nonfiction piece to be published by an American magazine. As one commentator states, \"Mailer disarmed the literary world with Armies. The combination of detached, ironic self-presentation [he described himself in the third person], deft portraiture of literary figures (especially Robert Lowell, Dwight Macdonald, and Paul Goodman), a reported flawless account of the March itself, and a passionate argument addressed to a divided nation, resulted in a sui generis narrative praised by even some of his most inveterate revilers.\" Alfred Kazin, writing in the New York Times Book Review, said, \"Mailer's intuition is that the times demand a new form. He has found it.\" He later expanded the article to a book, The Armies of the Night (1968), awarded a National Book Award and a Pulitzer Prize.\nMailer's major new journalism, or creative nonfiction, books also include Miami and the Siege of Chicago (1968), an account of the 1968 political conventions; Of a Fire on the Moon (1971), a long report on the Apollo 11 mission to the moon; The Prisoner of Sex (1971), his response to Kate Millett's critique of the patriarchal myths in the works of Mailer, Jean Genet, Henry Miller and D.H. Lawrence; and The Fight (1975), an account of Muhammad Ali's 1974 defeat in Zaire of George Foreman for the heavyweight boxing championship. Miami, Fire and Prisoner were all finalists for the National Book Award. The hallmark of his five New Journalism works in his use of illeism, or referring to oneself in the third person, rather than the first. Mailer said he got the idea from reading The Education of Henry Adams (1918) when he was a Harvard freshman. Mailer also employs many of the most common techniques of fiction in his creative nonfiction.\n\n\n== Film-maker ==\nIn addition to his experimental fiction and nonfiction novels, Mailer produced a play version of The Deer Park (staged at the Theatre De Lys in Greenwich Village in 1967), which had a four-month run and generally good reviews. In 2007, months before he died, he re-wrote the script, and asked his son Michael, a film producer, to film a staged production in Provincetown, but had to cancel because of his declining health. Mailer obsessed over The Deer Park more than any he did over any other work.In the late 1960s, Mailer directed three improvisational avant-garde films: Wild 90 (1968), Beyond the Law (1968), and Maidstone (1970). The latter includes a spontaneous and brutal brawl between Norman T. Kingsley, played by Mailer, and Kingsley's half-brother Raoul, played by Rip Torn. Mailer received a head injury when Torn struck him with a hammer, and Torn's ear became infected when Mailer bit it. In 2012, the Criterion Collection released Mailer's experimental films in a box set, \"Maidstone and Other Films by Norman Mailer\".\nIn 1987, he adapted and directed a film version of his novel Tough Guys Don't Dance starring Ryan O'Neal and Isabella Rossellini, which has become a minor camp classic.\nMailer took on an acting role in the 1981 Milos Forman film version of E.L. Doctorow's novel Ragtime, playing Stanford White. In 1999, he played Harry Houdini in Matthew Barney's Cremaster 2, which was inspired by the events surrounding the life of Gary Gilmore.In 1976, Mailer went to Italy for several weeks to collaborate with Italian Spaghetti Western filmmaker Sergio Leone on an adaptation of the Harry Grey novel The Hoods.\nAlthough Leone would pursue other writers shortly thereafter, elements of Mailer's first two drafts of the commissioned screenplay would appear in the Italian filmmaker's final magnum opus, Once Upon A Time in America (1984), starring Robert DeNiro.Mailer starred alongside writer/feminist Germaine Greer in D.A. Pennebaker's Town Bloody Hall, which was shot in 1971 but not released until 1979.In 1982, Mailer and Lawrence Schiller would collaborate on a television adaptation of The Executioner's Song, starring Tommy Lee Jones, Roseanna Arquette, and Eli Wallach. Airing on November 28 and 29, The Executioner's Song received strong critical reviews and four Emmy nominations, including one for Mailer's screenplay. It won two: for sound production and for Jones as best actor.In 1987, Mailer was to appear in Jean-Luc Godard's experimental film version of Shakespeare's King Lear, to be shot in Switzerland. Originally, Mailer was to play the lead character, Don Learo, in Godard's unscripted film alongside his daughter, Kate Mailer. The film also featured a variable list of Hollywood stars such as Woody Allen and Peter Sellers. However, tensions surfaced between Mailer and Godard early in the production when Godard insisted that Mailer play a character who had a carnal relationship with his own daughter. Mailer left Switzerland after just one day of shooting.In 2001, he adapted the screenplay for the movie: Master Spy: The Robert Hanssen Story.In 2005, Mailer served as a technical consultant on the Ron Howard boxing movie Cinderella Man, about legendary boxer Jim Braddock.\n\n\n== Biographer ==\nMailer's approach to biography came from his interest in the ego of the artist as an \"exemplary type\". His own biographer, J. Michael Lennon, explains that Mailer would use \"himself as a species of divining rod to explore the psychic depths\" of disparate personalities, like Pablo Picasso, Muhammad Ali, Gary Gilmore, Lee Harvey Oswald, and Marilyn Monroe. \"Ego,\" states Lennon, \"can be seen as the beginning of a major phase in his writing career: Mailer as biographer.\"Beginning as an assignment from Lawrence Schiller to write a short preface to a collection of photographs, Mailer's 1973 biography of Monroe (usually designated Marilyn: A Biography) was not approached as a traditional biography. Mailer read the available biographies, watched Monroe's films, and looked at photographs of Monroe; for the rest of it, Mailer stated, \"I speculated.\" Since Mailer did not have the time to thoroughly research the facts surrounding her death, his speculation led to the biography's controversy. The book's final chapter theorizes that Monroe was murdered by rogue agents of the FBI and CIA who resented her supposed affair with Robert F. Kennedy. Mailer later admitted that he embellished the book with speculations about Monroe's sex life and death that he did not himself believe to ensure its commercial success. In his own autobiography, Monroe's former husband Arthur Miller wrote that Mailer saw himself as Monroe \"in drag, acting out his own Hollywood fantasies of fame and sex unlimited and power.\"The book was enormously successful; it sold more copies than did any of Mailer's works except The Naked and the Dead, and it is Mailer's most widely reviewed book. It was the inspiration for the Emmy-nominated TV movie Marilyn: The Untold Story, which aired in 1980. Two later works co-written by Mailer presented imagined words and thoughts in Monroe's voice: the 1980 book Of Women and Their Elegance and the 1986 play Strawhead, which was produced off Broadway starring his daughter Kate Mailer.In the wake of the Marilyn controversy, Mailer attempted to explain his unique approach to biography. He suggests that his biography must be seen as a \"species of novel ready to play by the rules of biography.\" Exemplary egos, he explains, are best explained by other exemplary egos, and personalities like Monroe's are best left in the hands of a novelist.\n\n\n== Activist ==\nA number of Mailer's nonfiction works, such as The Armies of the Night and The Presidential Papers, are political. He covered the Republican and Democratic National Conventions in 1960, 1964, 1968, 1972, 1992, and 1996, although his account of the 1996 Democratic convention has never been published. In the early 1960s he was fixated on the figure of President John F. Kennedy, whom he regarded as an \"existential hero\". In the late 1950s and throughout the 1960s and 1970s, his work mingled autobiography, social commentary, history, fiction, and poetry in a formally original way that influenced the development of New Journalism.\nMailer held the position that the Cold War was not a positive ideal for America.  It allowed the state to become strong and invested in the daily lives of the people. He critiqued conservative politics as they, specifically those of Barry Goldwater, supported the Cold War and an increase in government spending and oversight.  This, Mailer argued, stood in opposition with conservative principles such as lower taxes and smaller government. He believed that conservatives were pro-Cold War because that was politically relevant to them and would therefore help them win.Indeed, Mailer was outspoken about his mistrust of politics in general as a way of meaningful change in America. In Miami and the Siege of Chicago (1968), he explained his view of \"politics-as-property\", likening a politician to a property holder who is \"never ambivalent about his land, he does not mock it or see other adjacent estates as more deserving than his own.\" Thus politics is just people trading their influence as capital in an attempt to serve their own interests. This cynical view of politicians serving only themselves perhaps explains his views on Watergate. Mailer saw politics as a sporting event: \"If you played for a team, you did your best to play very well, but there was something obscene ... in starting to think there was more moral worth to Michigan than Ohio State.\" Mailer thought that Nixon lost and was demonized only because he played for the wrong team. President Johnson, Mailer thought, was just as bad as Nixon had been, but he had good charisma so all was forgiven.In September 1961, Mailer was one of 29 original prominent American sponsors of the Fair Play for Cuba Committee organization with which John F. Kennedy assassin Lee Harvey Oswald was associated in 1963. In December 1963, Mailer and several of the other sponsors left the organization.In October 1967, Mailer was arrested for his involvement in an anti-Vietnam War demonstration at the Pentagon sponsored by the National Mobilization Committee to End the War in Vietnam. In 1968, he signed the Writers and Editors War Tax Protest pledge, vowing to refuse tax payments in protest against the war.In 1980, Mailer spearheaded convicted killer Jack Abbott's successful bid for parole. In 1977, Abbott had read about Mailer's work on The Executioner's Song and wrote to Mailer, offering to enlighten the author about Abbott's time behind bars and the conditions he was experiencing. Mailer, impressed, helped to publish In the Belly of the Beast, a book on life in the prison system consisting of Abbott's letters to Mailer. Once paroled, Abbott committed a murder in New York City six weeks after his release, stabbing 22-year-old Richard Adan to death. Consequently, Mailer was subject to criticism for his role. In a 1992 interview with the Buffalo News, he conceded that his involvement was \"another episode in my life in which I can find nothing to cheer about or nothing to take pride in.\"The 1986 meeting of P.E.N. in New York City featured key speeches by Secretary of State George P. Shultz and Mailer. The appearance of a government official was derided by many, and as Shultz ended his speech, the crowd seethed, with some calling to \"read the protest\" that had been circulated to criticize Shultz's appearance. Mailer, who was next to speak, responded by shouting to the crowd: \"Up yours!\"In 1989, Mailer joined with a number of other prominent authors in publicly expressing support for colleague Salman Rushdie, whose The Satanic Verses led to a fatwa issued by Iran's Islamic government calling for Rushdie's assassination.In 2003, in a speech to the Commonwealth Club in San Francisco, just before the Iraq War, Mailer said: \"Fascism is more of a natural state than democracy. To assume blithely that we can export democracy into any country we choose can serve paradoxically to encourage more fascism at home and abroad. Democracy is a state of grace that is attained only by those countries who have a host of individuals not only ready to enjoy freedom but to undergo the heavy labor of maintaining it.\"From 1980 until his death in 2007, Mailer contributed to Democratic Party candidates for political office.\n\n\n== Politician ==\n\nIn 1969, at the suggestion of feminist Gloria Steinem, his friend the political essayist Noel Parmentel and others, Mailer ran unsuccessfully in the Democratic Party primary for mayor of New York City, allied with columnist Jimmy Breslin (who ran for city council president), proposing the creation of a 51st state through New York City secession. Although Mailer took stands on a wide range of issues, from opposing \"compulsory fluoridation of the water supply\" to advocating the release of Black Panther Party leader Huey Newton, decentralization was the overriding issue of the campaign. Mailer \"foresaw the city, its independence secured, splintering into townships and neighborhoods, with their own school systems, police departments, housing programs, and governing philosophies.\" Their slogan was \"throw the rascals in.\" Mailer was endorsed by libertarian economist Murray Rothbard, who \"believed that 'smashing the urban government apparatus and fragmenting it into a myriad of constituent fragments' offered the only answer to the ills plaguing American cities,\" and called Mailer's campaign \"the most refreshing libertarian political campaign in decades.\" Mailer finished fourth in a field of five. Looking back on the campaign, journalist and historian Theodore H. White called it \"one of the most serious campaigns run in the United States in the last five years. . . . [H]is campaign was considered and thoughtful, the beginning of an attempt to apply ideas to a political situation.\" Characterizing his campaign, Mailer said: \"The difference between me and the other candidates is that I'm no good and I can prove it.\"\n\n\n== Artist ==\nMailer enjoyed drawing and drew prolifically, particularly toward the end of his life. While his work is not widely known, his drawings, which were inspired by Picasso's style, were exhibited at the Berta Walker Gallery in Provincetown in 2007, and are now displayed on the online arts community POBA - Where the Arts Live.\n\n\n== Recurring themes ==\n\n\n=== Style and views on the body and sex ===\nBodily urges are fundamental to Mailer's approach to novels and short works. These urges are in tension with the themes of \"apocalypse\" and morality. Stemming from his Freudian philosophical basis, bodily urges are integral to Mailer's work. The \"psychopath\" presented in The White Negro continues to occupy the central narrative of much of Mailer's work throughout his career. The drama of this psychopath for Mailer is that he or she seeks love—but love as the search for an orgasm more \"apocalyptic\" than the ones that preceded it. These views on sex were not light vices for Mailer. In Armies of the Night he postulates at length on \"earned manhood,\" \"onanism and sexuality,\" and \"psychic profit derived from the existential assertion of yourself\". The Mailer–reader relationship is also integral to Mailer's literary body trope. Mailer uses frequent allusion and direct use of body-oriented language to describe power structures in Miami and the Siege of Chicago in the form of the \"military spine of the liberal party\" and in the \"knifelike entrance into culture\" of jazz in The White Negro. Power over bodies, societies, political entities, etc. is a constant presence in Mailer's work. In addition - and notable for such a prominent mainstream American writer of his generation - Mailer, throughout his work and personal communications, repeatedly expresses interest in, includes episodes of or makes references to bisexuality or homosexuality. He even directly addresses the subject publicly in his essay The Homosexual Villain, for One magazine.Moments of physical and sexual power or powerlessness are the climax of The Naked and the Dead, \"The Time of Her Time\", and The Armies of the Night. His prose presentation of an existential struggle is frequently conveyed to the reader via references to the body. The body is an entity to be poked, prodded, broken, even snuffed into non-existence. By filling his work with graphic depictions of sex, violence, and even rock and roll, Mailer elevates the experience of the reader. Mailer invokes a particularly poignant, violent portrayal of the body, authority, and sexuality in The Time of Her Time.  Consistent use of bodily reference or allusion is clearly integral to his depiction of human existence. Mailer elevates the reader experience, and wrestles the reader for domination while allowing room for interpretation. Critiques of Mailer based on sexuality, race, and gender, have been levied by authors such as Kate Millett and bell hooks, among others. Kate Millett, in her Sexual Politics, critiques Mailer: \"His considerable insights into the practice of sexuality as a power game never seem to affect his vivid personal enthusiasm for the fight nor his sturdy conviction that it's kill or be killed.\"\n\n\n=== Race ===\nThroughout his writing, Mailer never presents a very clear perspective on race. His works range from a profound understanding of the African American condition in America to extremely stereotypical depictions of race. For the majority of Mailer's career he does not delve directly into race, but chose to pursue the matter only as a side note to the larger currents of the 1960s and 1970s. Mailer does, however, spend some time working through the issue in \"The White Negro\", Of a Fire on the Moon, and in his work The Fight about the heavyweight title bout between Muhammad Ali and George Foreman.\nIn \"The White Negro\" Mailer argues that African Americans are psychopaths because they live in a society that hates them (meaning white society), which in turn causes them to hate themselves. Mailer goes on to argue that because of this innate psychopathy, African Americans are left to explore the least virtuous areas of civilized life.  Mailer's analysis culminates in his expression that if African Americans were to achieve equality it would have violent and chaotic effects on white society.In Of a Fire on the Moon Mailer discusses that the space flight was an exclusive action on the part of white America, as they have left African Americans behind on Earth. African Americans can only look on as whites move even farther past them in not just society, but their earthly constraints. Mailer uses African Americans to criticize the moon landing, as he reflects on the fact that many problems still exist on Earth, and within America.\n\n\n=== Mailer's personal encounters with race ===\nMailer often directly engaged with racial issues in his works, but some have seen his writings on the subject of race to be problematic. Mailer focused on Jazz as the ultimate expression of African-American bravado, and figures like Miles Davis would become represented in works like An American Dream. To Mailer, African-American men reflected a challenge to his own notions of masculinity.While in Paris in 1956, Mailer met the famous African-American author James Baldwin. Mailer became even more fascinated with African-Americans after meeting Baldwin, and this friendship inspired Mailer to write \"The White Negro\". To Mailer, Baldwin was a natural point of intrigue as Baldwin was both gay and an African-American author, similar to Mailer's stature. Their relationship was never a close friendship nor contemptuous, but one of mutual intrigue and a sense of competition existed between the two writers. Mailer often commented on Baldwin's work, and Baldwin did the same to Mailer. These comments became increasingly critical as their careers progressed despite their respect for one another. Baldwin wrote a letter disapproving of Mailer's comments on race and sexuality in \"The White Negro\". He stated the reason for the decline in his relationship with Mailer was \"that myth of the sexuality of Negroes which Norman, like so many others, refused to give up\". Baldwin said a white American writer \"affords too many opportunities to avoid reality\". He believed that Mailer did not fully recognize the benefits from his status as a heterosexual male.\n\n\n=== Concept of masculinity ===\nThe subject of masculinity shows up frequently throughout Mailer's works. Critics have argued that while Mailer says he supports feminism, he unconsciously intertwines his own masculine biases which can be seen through Naked and the Dead and Prisoner of Sex. In Naked and the Dead, Norman Mailer examines Cummings's struggle with sexuality while on the frontline during World War II. Based on the Good War narrative that has been taught, it is not acknowledged that many men sought comfort with men and women. Mailer's issues of masculinity can be seen in Cummings and Hearn's relationship. Cummings views this relationship more than a friendship, while Hearn does not reciprocate the feeling. Another example of the concept of masculinity being examined is the reason why Cummings was forced to go to military school. Cummings states that \"he hears the argument raging about him, conducted in hoarse passionate whispers as a sop to his sleeping brother. I won't have him actin' like a goddamn woman, you're to stop feedin' him all these books, all this womanish...claptrap\"In The Prisoner of Sex, Mailer questions the Women's Liberation Movement and the role of women in the society around him. He viewed women as questioning societal roles that posed a risk to interfering with masculine roles that had already been established. In Mailer's eyes, he does not fully comprehend what women were fighting for.\n\n\n== Personal life ==\n\n\n=== Marriages and children ===\nMailer was married six times and had nine children.  He fathered eight children by his various wives and informally adopted his sixth wife's son from another marriage.\nMailer's first marriage was to Beatrice Silverman. They eloped in January 1944 because neither family would likely have approved. They had one child, Susan, and divorced in 1952 because of Mailer's infidelities with Adele Morales.Morales moved in with Mailer during 1951 into an apartment on First Avenue near Second Street in the East Village, and they married in 1954. They had two daughters, Danielle and Elizabeth. After attending a party on Saturday, November 19, 1960, Mailer stabbed Adele twice with a two-and-a-half inch blade that he used to clean his nails, nearly killing her by puncturing her pericardium. He stabbed her once in the chest and once in the back. Adele required emergency surgery but made a quick recovery. Mailer claimed he had stabbed Adele \"to relieve her of cancer\". He was involuntarily committed to Bellevue Hospital for 17 days. While Adele did not press charges, saying she wanted to protect their daughters, Mailer later pleaded guilty to a reduced charge of assault saying, \"I feel I did a lousy, dirty, cowardly thing\", and received a suspended sentence of three years' probation. In 1962, the two divorced. In 1997, Adele published a memoir of their marriage entitled The Last Party, which recounted her husband stabbing her at a party and the aftermath.  This incident has been a focal point for feminist critics of Mailer, who point to themes of sexual violence in his work.His third wife, whom he married in 1962, and divorced in 1963, was the British heiress and journalist Lady Jeanne Campbell (1929–2007). She was the only daughter of Ian Campbell, 11th Duke of Argyll, a Scottish aristocrat and clan chief with a notorious private life, and a granddaughter of the press baron Lord Beaverbrook. The couple had a daughter, Kate Mailer, who is an actress.His fourth marriage, in 1963, was to Beverly Bentley, a former model turned actress. She was the mother of two of his sons, producer Michael Mailer and actor Stephen Mailer. They divorced in 1980.\nHis fifth wife was Carol Stevens, a jazz singer whom he married on November 7, 1980, and divorced in Haiti on November 8, 1980, thereby legitimating their daughter Maggie, born in 1971.His sixth and last wife, whom he married in 1980, was Norris Church Mailer (born Barbara Jean Davis, 1949–2010), an art teacher.  They had one son together, John Buffalo Mailer, a writer and actor. Mailer raised and informally adopted Matthew Norris, Church's son by her first husband, Larry Norris. Living in Brooklyn, New York and Provincetown, Massachusetts with Mailer, Church worked as a model, wrote and painted.\n\n\n=== Works with his children ===\nIn 2005, Mailer co-wrote a book with his youngest child, John Buffalo Mailer, titled The Big Empty. Mailer appeared in a 2004 episode of Gilmore Girls titled \"Norman Mailer, I'm Pregnant!\" with his son Stephen Mailer.\n\n\n=== Other relationships ===\nOver the course of his life, Mailer was connected with several women other than his wives, including Carole Mallory, who wrote a \"tell all\" biography, Loving Mailer, after his death.In a chance meeting in an Upper East Side New York restaurant in 1982, Gloria Leonard first met Mailer. He struck up a conversation with Leonard after recognizing her. The meeting was rumored to have led to a brief affair between the two. Later, Leonard was approached by a group of movie distributors from the Midwest to finance what was described as \"the world's first million-dollar pornographic movie\". She invited Mailer to lunch and made her pitch for his services as a writer. In an interview Leonard said that the author \"sat straight up in his chair and said, 'I always knew I'd one day make a porny.'\" Leonard then asked what his fee would be and Mailer responded with \"Two-hundred fifty thousand\". Leonard then asked if he'd be interested in adapting his novel-biography of Marilyn Monroe, but Mailer replied that he wanted to do something original. The project later ended due to scheduling conflicts between the two.\n\n\n=== Personality ===\nAt the December 15, 1971, taping of The Dick Cavett Show, with Janet Flanner and Gore Vidal, Mailer, annoyed with a less-than-stellar review by Vidal of Prisoner of Sex, apparently insulted then head-butted Vidal backstage. As the show began taping, a visibly belligerent Mailer, who admitted he had been drinking, goaded Vidal and Cavett into trading insults with him on-air and referred to his own \"greater intellect\". He openly taunted and mocked Vidal (who responded in kind), finally earning the ire of Flanner, who announced during the discussion that she was \"becoming very, very bored\", telling Mailer and Vidal \"you act as if you're the only people here.\" As Cavett made jokes comparing Mailer's intellect to his ego, Mailer stated \"Why don't you look at your question sheet and ask your question?\", to which Cavett responded \"Why don't you fold it five ways and put it where the moon don't shine?\" A long laugh ensued, after which Mailer asked Cavett if he had come up with that line, and Cavett replied \"I have to tell you a quote from Tolstoy?\". The head-butting and later on-air altercation was described by Mailer himself in his essay \"Of a Small and Modest Malignancy, Wicked and Bristling with Dots\".\nAccording to his obituary in The Independent, his \"relentless machismo seemed out of place in a man who was actually quite small – though perhaps that was where the aggression originated.\"Alan Dershowitz, in his book, Taking the Stand, recounts when Claus von Bülow had a dinner party after he was found not guilty at his trial. Dershowitz countered that he would not attend if it was a \"victory party\", and von Bulow assured him that it was only a dinner for \"several interesting friends\". Norman Mailer attended the dinner where, among other things, Dershowitz explained why the evidence pointed to von Bülow's innocence. As Dershowitz recounted, Mailer grabbed his wife's arm, and said: \"Let's get out of here. I think this guy is innocent. I thought we were going to be having dinner with a man who actually tried to kill his wife. This is boring.\"\n\n\n== Death and legacy ==\n\nMailer died of acute renal failure on November 10, 2007, a month after undergoing lung surgery at Mount Sinai Hospital in Manhattan, New York. He is buried in Provincetown Cemetery, Provincetown, Massachusetts.The papers of the two-time Pulitzer Prize author may be found at the Harry Ransom Humanities Research Center at the University of Texas, Austin.In 2008, Carole Mallory, a former mistress, sold seven boxes of documents and photographs to Harvard University, Norman Mailer's alma mater. They contain extracts of her letters, books and journals.In 2003, the Norman Mailer Society was founded to help ensure the legacy of Mailer's work. In 2008, The Norman Mailer Center and The Norman Mailer Writers Colony, a non-profit organization for educational purposes, was established to honor Norman Mailer.\nAmong its programs is the Norman Mailer Prize established in 2009.Throughout his lifetime, Mailer wrote over 45,000 letters. In 2014, Mailer's biographer J. Michael Lennon chose 712 of those letters and published them in Selected Letters of Norman Mailer, which covers the period between the 1940s and the early 2000s.In March 2018, the Library of America published a two-volume collection of Mailer's works from the sixties: Four Books of the 1960s and Collected Essays of the 1960s. Critic David Denby suggests that based on Mailer's observations about the fractured political atmosphere in America that led to the 1967 march on the Pentagon, Mailer's work seems to be as relevant today as it was fifty years ago and that \"Mailer may be due for reappraisal and revival.\"In May 2018, the Norman Mailer Society and the city of Long Branch, New Jersey co-sponsored the installation of a bronze plaque where the Mailer family's Queen-Anne style hotel, the Scarboro, used to stand on the city's beachfront.In October, 2019, Wilkes University's Farley Library opened a replica of Mailer's last study in Provincetown, MA, replete with \"some of his private library, manuscripts and revisions dating from 1984 as well as his studio furniture\". The archive also houses \"Mailer's entire 4,000-volume library from his home in Brooklyn, N.Y.\" and an original portrait of Mailer by painter Nancy Ellen Craig donated by Mailer's daughter Danielle. The room opened with an event on October 10, 2019, to coincide with the annual conference of the Norman Mailer Society and was attended by several members of Mailer's family.In 2019, Susan Mailer, Norman's eldest daughter, published a memoir about her relationship with her father. In Another Place: With and Without My Father Norman Mailer explores her \"intense and complex\" relationship with her father and the extended Mailer family. Reviewer Nicole DePolo writes that Susan Mailer, a psychoanalyst, provides sharp insights about her father in \"crisp, vibrant prose that captures the essence of moments that are both remarkable and universally resonant\".\n\n\n== Works ==\n\n\n== Decorations and awards ==\n1969: Pulitzer Prize, George Polk Award, and National Book Award for The Armies of the Night; Honorary Doctor of Letters from Rutgers University\n1970: Harvard University's Signet Society Medal for Achievement in the Arts\n1973: Edward MacDowell Medal\n1975: Playboy's Best Nonfiction Award for The Fight\n1976: Gold Medal for Literature by the National Arts Club; Playboy's Best Major Work in Fiction Award\n1979: Best Major Work in Fiction Award from Playboy for The Executioner's Song\n1980: Pulitzer Prize for Executioner's Song\n1984: Honorary Doctor of Letters from Mercy College in White Plains, NY; Inducted into the American Academy of Arts and Letters\n1985: Lord and Taylor's Rose Award\n1987: Independent Spirit Award for best film and Golden Raspberry Award for Worst Director (both for Tough Guys Don't Dance)\n1989: PEN Oakland / Josephine Miles Award; Emerson-Thoreau Medal\n1991: New York State Edith Wharton Citation of Merit\n1994: Harvard University's Signet Society Medal for Achievement in the Arts\n1995: Honorary Doctor of Letters from Wilkes University, in Wilkes-Barre, PA\n2000: F. Scott Fitzgerald Award for Achievement in American Literature\n2002: Lifetime Achievement Award from the James Jones Literary Society, June 22; Austrian Cross of Honour for Science and Art, 1st class\n2004: Golden Plate Award of the American Academy of Achievement\n2005: National Book Award for Distinguished Contribution to American Letters\n\n\n== See also ==\nList of peace activists\n\n\n== References ==\n\n\n=== Notes ===\n\n\n=== Citations ===\n\n\n=== Selected bibliography ===\nContains important books and articles about Mailer and his works, many of which are cited in this article. See Works above for a list of Mailer's first editions and Mailer's individual works for reviews.\n\n\n==== Bibliographies ====\n\n\n==== Biographical studies ====\n\n\n==== Critical studies ====\n\n\n==== Interviews ====\n\n\n==== News ====\n\n\n==== Other sources ====\n\n\n===== Primary texts =====\n\n\n== External links ==\nThe Norman Mailer Society\nThe Norman Mailer Center and Writers Colony\nProject Mailer — the Digital Humanities initiative of the NMS.\nNorman Mailer at IMDb\nNorman Mailer at the Internet Off-Broadway Database\nWorks by or about Norman Mailer at Internet Archive\nFBI Records: The Vault - Norman Mailer at vault.fbi.gov\nNorman Mailer on American Masters (PBS Broadcast)\nNorman Mailer: The American (Documentary)\nNorman Mailer's writing on The Huffington Post\nAppearances on C-SPAN\nThe short film We Are in Love with the Word, Part I (1986) is available for free download at the Internet Archive\nThe short film We Are in Love with the Word, Part II (1986) is available for free download at the Internet Archive"