"The Velvet Underground was an American rock band formed in New York City in 1964. The original line-up consisted of singer/guitarist Lou Reed, multi-instrumentalist John Cale, guitarist Sterling Morrison, and drummer Angus MacLise. MacLise was replaced by Moe Tucker in 1965, who played on most of the band's recordings. Their integration of rock and the avant-garde achieved little commercial success during the group's existence, but they are now recognized as one of the most influential bands in rock, underground, experimental, and alternative music. The group's provocative subject matter, musical experiments, and often nihilistic attitudes also proved influential in the development of punk rock and new wave music.Originally, the group performed under a number of names before settling on The Velvet Underground in 1965.  Pop artist Andy Warhol became their manager in 1966, and they served as the house band at Warhol's art collective known as \"the Factory\" and Warhol's traveling multimedia show, the Exploding Plastic Inevitable, from 1966 to 1967. Their debut album, The Velvet Underground & Nico (with German singer and model Nico), was released in 1967 to critical indifference and poor sales but has since drawn wide acclaim. They released three more albums, White Light/White Heat (1968), The Velvet Underground (1969), and Loaded (1970), with Doug Yule replacing Cale for the final two, and with none performing up to the expectations of record labels or of Reed, the band's leader.\nThe group functionally disbanded in the early 1970s as everyone except Yule left the band.  An abortive UK tour with Yule as the band leader and with new musicians followed in 1973, and a final album released in the band's name, Squeeze (1973), consisting mostly of Yule with a few session musicians, marked the end of the band for some time.  All of the members continued to collaborate on each other's solo work throughout the 1970s and 1980s, and a retrospective \"rarities\" album, VU, was released in 1985.  A full reunion of the band came in the early 1990s, with the Reed-Cale-Tucker-Morrison lineup playing a series of well-received shows in 1993, and releasing a live album from the tour, Live MCMXCIII.\nAfter Morrison's death in 1995, the remaining three members played together for a single performance at their Rock and Roll Hall of Fame induction in 1996, the last time the band performed together musically. In 2004, the Velvet Underground were ranked number 19 on Rolling Stone's list of the \"100 Greatest Artists of All Time\". In 2017, a study of AllMusic's catalog indicated the group as the fifth most frequently cited artist influence in its database."