"Open matte is a filming technique that involves matting out the top and bottom of the film frame in the movie projector (known as a soft matte) for the widescreen theatrical release and then scanning the film without a matte (at Academy ratio) for a full screen home video release.\nOpen matte can be used with non-anamorphic films presented in 2.20:1 or 2.39:1, but it isn't used as often, mainly because it adds too much additional headroom, depending upon how well the framing was protected or if the director chooses to create a certain visual aesthetic. Instead, those films will employ either pan and scan or reframing using either the well-protected areas or the areas of interest. Films shot anamorphically use the entire 35 mm frame (except for the soundtrack area), so they must use pan and scan as a result.\n\n\n== History ==\nThe rise of new film exhibition technologies in 1950s like Cinerama and anamorphic lenses, led to shooting wide aspect ratios for theatrical films. This coincided with the rise of television and home media with a much different, narrow aspect ratio of 4:3. To avoid letterboxing for broadcast releases, films were therefore reframed and cropped shot by shot to fit appropriately the full screen with the 4:3 aspect, with a process called pan and scan. Hence, only a cropped small portion of the theatrical frame was broadcast.\nMany films over the years have used the open matte technique for home video releases and television broadcasts, the most prominent of which include the Back to the Future trilogy, the Jurassic Park trilogy, Schindler's List, Titanic, Top Gun, National Lampoon's Animal House, and The Blues Brothers, as well as many films that have been specially formatted for the IMAX expanded aspect ratio of 1.90:1 and 1.43:1. Stanley Kubrick also used this technique for his last three films The Shining (1980), Full Metal Jacket (1987) and Eyes Wide Shut (1999). Sam Raimi's Spider-Man (2002), James Cameron's Terminator 2: Judgment Day (1991), Roger Donaldson's The Recruit (2003), and Zack Snyder's Justice League (2021) are also examples of open matte.\n\n\n== Difference between open matte and pan and scan ==\nPan and scan deals with only the 2.39:1 master of a film. For HDTV, the film is panned and scanned to a portion of a frame, usually in accordance to the most important details in a shot. Open matte involves opening up the top and bottom of a frame to show more information, which is usually done with non-anamorphic films with a wide 2.39:1 aspect ratio to fill a 16:9 display for HDTV broadcasts. Additionally, filmmakers may choose to open up the frame for a film's home video release, such as with James Cameron's Avatar and the Blu-ray 3D release of Titanic.\nIf footage with taller ratios were shot (digitally or on film), for example IMAX scenes for various films, then the screen area is cropped in accordance to the deliverable ratio. This helps in preserving headroom and composition for the film beyond the theatrical release.\n\n\n== Usage ==\nUsually, non-anamorphic 4-perf films are filmed directly on the entire full frame silent aperture gate (1.33:1). When a married print is created, this frame is slightly re-cropped by the frame line and optical soundtrack down to Academy ratio (1.37:1). The movie projector then uses an aperture mask to soft matte the Academy frame to the intended aspect ratio (1.85:1 or 1.66:1). When the 4:3 full-screen video master is created, many filmmakers may prefer to use the full Academy frame (\"open matte\") instead of creating a pan and scan version from within the 1.85 framing. Because the framing is increased vertically in the open matte process, the decision to use it needs to be made prior to shooting, so that the camera operator can frame for 1.85:1 and \"protect\" for 4:3; otherwise unintended objects such as boom microphones, cables, and light stands may appear in the open matte frame, thus requiring some amount of pan and scan in some or all scenes. Additionally, the un-matted 4:3 version may often throw off an otherwise tightly framed shot and add an inordinate amount of headroom above actors (particularly with 1.85:1), depending upon how well the framing was protected or if the director chooses to create a certain visual aesthetic.  With high-definition television now in common usage (with its standardized 16:9 (1.78:1) aspect ratio), the need to reformat 1.85:1 movies for television viewing has virtually evaporated, although television broadcasts still reformat 2.39:1 movies by means of using open matte or pan and scan. For films with wider aspect ratios (2.39:1, for example) the matting bars will appear on the top and bottom of the screen of the broadcast image, thus preserving each director's framing intent.\n\n\n== See also ==\nShoot and protect\nAspect ratio (image)"