"Ungoliant (Sindarin pronunciation: /ʊŋ.gɔl.jant/) is a fictional character in J. R. R. Tolkien's legendarium, described as an evil spirit in the form of a spider. She is mentioned briefly in The Lord of the Rings, and plays a supporting role in The Silmarillion. Her origins are unclear, as Tolkien's writings do not explicitly reveal her nature, other than that she is from \"before the world\". She is one of a few instances, along with Tom Bombadil and the Cats of Queen Berúthiel, where Tolkien does not provide a clear background for an element of his fiction.\n\n\n== Etymology ==\nUngoliant /ʊŋ.gɔl.jant/ means \"dark spider\" in Tolkien's invented language of Sindarin. It is a loan word from Quenya: Ungwë liantë /uŋ.wɛ li.an.tɛ/. She is also known as Gloomweaver (Sindarin: Gwerlum /gwɛr.lʊm/, Quenya: Wirilomë /wi.ri.lɔ.mɛ/).\n\n\n== Internal history ==\n\nTolkien's original writings say that Ungoliant was a primeval spirit of night, named Móru, who aided Melkor in his attack upon the Two Trees of Valinor, draining them of their sap after Melkor had injured them. She also consumed the reserves of light from the wells of Varda. Afterward the light of the trees persisted only within the Silmarils of Fëanor. Ungoliant helped Melkor evade the Valar by shrouding them both in the impenetrable darkness she produced.Melkor had promised Ungoliant to yield anything she wished in return for her aid, but betrayed this promise by withholding the Silmarils, and summoned the Balrogs to repel her. Ungoliant fled to the Ered Gorgoroth in Beleriand. At some point she gave birth to the Giant Spiders, including the character Shelob in The Lord of the Rings. In The Silmarillion, it is stated that when she went into hiding her hunger was such that she would mate with other spiders only to devour them later, with her offspring used as food once fully grown. The Silmarillion hints that Ungoliant's unremitting hunger drove her to devour herself.\n\n\n== Literary origins ==\nAccording to Tolkien scholar John Wm. Houghton, the story of Ungoliant and Morgoth is comparable to the account in Milton's Paradise Lost in which Sin conceives a child, Death, by Satan. Both Sin and Death are always hungry; Satan says he will feed them, and leads them to the world.\n\n\n== In science ==\n\nUngoliant is the namesake of two species of spider: Nemesia ungoliant, a species of Nemesiidae which was described in 2007, and Ochyrocera ungoliant, an Ochyroceratidae species that was described in 2018.\n\n\n== In popular media ==\nUngoliant has been the subject of several heavy metal music songs. Her conflict with Morgoth over the Silmaril was the subject of Blind Guardian's song \"Into the Storm\", from their 1998 album Nightfall in Middle-Earth. Austrian black metal band Summoning had a song called \"Ungolianth\" on their 1995 album Minas Morgul. On their 2006 album The Morrigan's Call, the Irish Celtic metal band Cruachan featured a song \"Ungoliant\" as well as one named after Shelob.Ungoliant is mentioned in the 2012 film The Hobbit: An Unexpected Journey, the first film of Peter Jackson's film trilogy of The Hobbit, when the wizard Radagast the Brown conjectures on the origin of malevolent giant spiders endemic to Mirkwood.\n\n\n== References ==\n\n\n=== Primary ===\nThis list identifies each item's location in Tolkien's writings.\n\n\n=== Secondary ===\n\n\n=== Sources ===\nTolkien, J. R. R. (1977),  Christopher Tolkien (ed.), The Silmarillion, Boston: Houghton Mifflin, ISBN 0-395-25730-1\nTolkien, J. R. R. (1984),  Christopher Tolkien (ed.), The Book of Lost Tales, 1, Boston: Houghton Mifflin, ISBN 0-395-35439-0"