"Slovak Paradise (Slovak: Slovenský raj) is a mountain range in eastern Slovakia. It is a part of the Spiš-Gemer Karst, which in turn is a part of the Slovak Ore Mountains, a major subdivision of the Western Carpathians. It is located between the towns of Spišská Nová Ves in the north and Dobšiná in the south. It is particularly known for its gorges and waterfalls. It is very popular with hikers as it has a number of unusual routes through gorges and waterfalls. There are numerous sections where fixed ladders are used to climb. The area is protected by Slovak Paradise National Park (Národný park Slovenský raj).\n\n\n== Characteristics ==\nSlovak Paradise is a plain with high plateaus (800–1000 m AMSL). The highest mountain is  Ondrejisko at 1,270 m. The area is mainly built of karst limestone (Geravy, Glac, Pelc and Skala plains) and dolomite (Tri kopce). The karst plateaus show phenomena such as sinkholes and limestone pavements (lapies). The climate is moderately cold.\nTypical features are canyons, gorges, and ravines (Sokol, Suchá Belá, Piecky and Kyseľ), which form picturesque rocky scenes with waterfalls, and which were created mainly by the Hnilec and Hornád rivers and their tributaries. Eighty percent of the area is covered with spruce forests combined with yew trees.\nThere are more than 200 caves and underground abysses. Among the caves, Dobšiná Ice Cave and Medvedia jaskyňa (Bear Cave) are the best known ones.\nThere were many settlements of woodcutters, colliers and smelters in Slovak Paradise once, which were turned into tourist centers; for example, Dobšinská Maša, Dedinky, Mlynky, and Stratená.\n\n\n== Fauna ==\nNotable and rare animals include the brown bear (Ursus arctos), golden eagle, common kestrel and the black stork. Quite common are red deer and wild boars, wolf (Canis lupus), lynx (Lynx lynx), and the otter (Lutra lutra).\n\n\n== Flora ==\nThe area is covered with Norway spruce (Picea abies), European beech (Fagus sylvatica), fir, larch, and Scots  pine (Pinus sylvestris).\nImportant endemic plants in the area are the Carpathian harebell (Campanula carpatica), Pulsatilla slavica, Hesperis silvestris, Liguria sibirica, and Saxifraga paniculate. Other plants found in this area are the mountain tassel flower (Soldanella montana), martagon lily (Lilium martagon), and variegated monk's hood (Aconitum variegatum).\n\n\n== See also ==\nSlovak Paradise National Park\nMountain Rescue Service (Slovakia)\n\n\n== References ==\n\n\n== External links ==\nwww.slovenskyraj.sk/en.html"