"The buttocks (singular: buttock) are two rounded portions of the exterior anatomy of most mammals, located on the posterior of the pelvic region. In humans, the buttocks are located between the lower back and the perineum. They are composed of a layer of exterior skin and  underlying subcutaneous fat superimposed on a left and right gluteus maximus and gluteus medius muscles. The two gluteus maximus muscles are the largest muscles in the  human body. They are responsible for achieving the upright posture when the body is bent at the waist; maintaining the body in the upright posture by keeping the hip joints extended; and propelling the body forward via further leg (hip) extension when walking or running. In the seated position, the buttocks bear the weight of the upper body and take that weight off the feet. \nIn many cultures, the buttocks play a role in sexual attraction. Many cultures have also used the buttocks as a primary target for corporal punishment, as the buttocks' layer of subcutaneous fat offers protection against injury while still allowing for the infliction of pain. There are several connotations of buttocks in art, fashion, culture and humor. The English language is replete with many popular synonyms that range from polite colloquialisms (\"posterior\", \"backside\" or \"bottom\") to vulgar slang (\"arse,\" \"ass,\" \"bum,\" \"butt,\" \"booty,\" \"prat\").\n\n\n== Anatomy ==\nThe buttocks are formed by the masses of the gluteal muscles or \"glutes\" (the gluteus maximus muscle and the gluteus medius muscle) superimposed by a layer of fat. The superior aspect of the buttock ends at the iliac crest, and the lower aspect is outlined by the horizontal gluteal crease. The gluteus maximus has two insertion points: 1⁄3 superior portion of the linea aspera of the femur, and the superior portion of the iliotibial tractus. The masses of the gluteus maximus muscle are separated by an intermediate intergluteal cleft or \"crack\" in which the anus is situated.\nThe buttocks allow primates to sit upright without needing to rest their weight on their feet as four-legged animals do. Females of certain species of baboon have red buttocks that blush to attract males. In the case of humans, females tend to have proportionally wider and thicker buttocks due to higher subcutaneous fat and proportionally wider hips. In humans they also have a role in propelling the body in a forward motion and aiding bowel movement.Some baboons and all gibbons, though otherwise fur-covered, have characteristic naked callosities on their buttocks. While human children generally have smooth buttocks, mature males and females have varying degrees of hair growth, as on other parts of their body. Females may have hair growth in the gluteal cleft (including around the anus), sometimes extending laterally onto the lower aspect of the cheeks. Males may have hair growth over some or all of the buttocks.\n\n\n== Society and culture ==\n\n\n=== Connotations ===\n\nThe English word of Greek origin \"callipygian\" indicates someone who has beautiful buttocks.\nDepending on the context, exposure of the buttocks in non-intimate situations can cause feelings of embarrassment or humiliation, and embarrassment or amusement in an onlooker (see pantsing). Willfully exposing one's own bare buttocks as a protest, a provocation, or just for fun is called mooning.\nIn many punitive traditions, the buttocks are a common target for corporal punishment, which can be meted out with no risk of long-term physical harm compared with the dangers of applying it to other parts of the body, such as the hands, which could easily be damaged. Within the Victorian school system in England, the buttocks have been described as \"the place provided by nature\" for this purpose. A modern-day example can be seen in some Southeast Asian countries, such as Singapore. Caning in Singapore is widely used as a form of judicial corporal punishment, with male convicts being sentenced to a caning on their bare buttocks.\nIn Western and some other cultures, many comedians, writers and others rely on the buttocks as a source of amusement, camaraderie and fun. There are numerous colloquial terms for the buttocks.\nIn American English, phrases use the buttocks or synonyms (especially \"butt\" and \"ass\") as a synecdoche or pars pro toto for a whole person, often with a negative connotation. For example, terminating an employee may be described as \"firing his ass\". One might say \"move your ass\" or \"haul ass\" as an exhortation to greater haste or urgency. Expressed as a function of punishment, defeat or assault becomes \"kicking one's ass\". Such phrases also may suggest a person's characteristics, e.g. difficult people are termed \"hard asses\". In America an annoying person or any source of frustration may be termed \"a pain in the ass\" (a synonym for \"a pain in the neck\"). People deemed excessively puritanical or proper may be termed \"tight asses\" (in Australia and New Zealand, \"tight arse\" refers to someone who is excessively miserly).\nCertain physical dispositions of the buttocks—particularly size—are sometimes identified, controversially, as a racial characteristic (see race). A famous example was the case of Saartjie Baartman, the so-called \"Hottentot Venus\".\n\n\n=== Synonyms ===\n\nThe Latin name for the buttocks is nates (English pronunciation  NAY-teez, classical pronunciation nătes [ˈnateːs]) which is plural; the singular, natis (buttock), is rarely used. There are many colloquial terms to refer to them, including:\n\nBackside, posterior, behind and its derivates (hind-quarters, hinder or the childish diminutive \"heinie\" (US usage only), strictly the whole body behind the hind leg-trunk attachment), rear or rear-end, derrière (French for \"behind\")—all strictly positional descriptions, as the inaccurate use of rump (as in 'rump roast', after a 'hot' spanking), thighs, upper legs; analogous are:\nAft, stern and poop, naval in origin; in  nautical jargon, buttocks also designates the aftermost portion of a hull above the water line and in front of the rudder, merging with the run below the water line\nCaboose, originally a ship's galley in wooden cabin on deck; also the \"rear end\" car of a freight train, considered a cute synonym suitable for any audience\nBottom (and the shortening \"bot\" as well as childish diminutives \"bottie\" or \"botty\"), but the use of similar-sounding \"booty\" or \"bootie\" may be related.\nTail (strictly anatomically a zoomorphism, humans only have a tail-bone, yet the illogical \"tail feather\" was popularized by musicians. When used to refer to a woman or to women in general, the term is derogatory; also used for the even more sensual phallus) and tail-end\nTrunk, in American English, particularly when describing large buttocks: \"junk in the trunk\"\nApple, referring to the similar shape of the fruit, derived from the 1970s. Also likened to an upside-down heart, attributed from various, popular ads of the 1970s.\nArse or ass, arsehole or asshole, and (butt-)hole: a pars pro toto (strictly only the actual body cavity and directly adjoining anal region); also used as an insult for a person. The term arse or ass is Anglo-Saxon, and over a thousand years old.\nBadonkadonk: onomatopoeic US slang meaning the voluptuously bouncing, large yet firm buttocks of a woman\nBatty: Jamaican Patois, commonly used in certain communities within the UK and Canada.\nBooty, US slang, used in the popular slang expression \"booty call\".  It has been suggested that the word derives from a Bambara (West African) word for anus, buda.\nBreech, a metaphorical sense derived from on older form of the garment breeches (as the French culotte meaning pantoloons, via cul from Latin culus \"butt\"), so 'bare breech' means without breeches, i.e., trouserless butt\nBum: in British English, used frequently in the United Kingdom, Ireland, Canada, Australia, New Zealand and many other English-speaking Commonwealth countries, also historically in the United States, is a mild often humorous term for buttocks, not necessarily in a vulgar or sexual context: \"I've a boil on my bum, thrice as large as my thumb\" (The Judge With The Sore Rump, St. George Tucker). A bum boy is an insulting term for a male homosexual.\nBumpy: a euphemistic term for the buttocks, used primarily with children\nBuns, from Gaelic bun \"bottom, base\", mounds (cfr. Butte, a geographical mound, known since 1805 in American English, from (Old) French butte \"mound, knoll\") and orbs—shape-metaphors.\nBund: derived from Punjabi\nBunda: Brazilian Portuguese slang for buttocks, from Kimbundu mbunda, with same meaning.\nButt: the common term for a pair of buttocks in the US (singular, as one body-part; cognate but neither its root nor an abbreviation), used in everyday speech.\nCakes: slang word for buttocks\nCan (a container) had an unusual development: the slang meaning \"toilet\" is recorded c. 1900, said to be a shortening of piss-can, the meaning \"buttocks\" from c. 1910, and the verb meaning \"fire an employee\" (to flush=dump?) from 1905.\nCheeks, a shape-metaphor within human anatomy, but also used in the singular: left cheek and right cheek; sounds particularly naughty because of the homonym and the adjective cheeky, lending themselves to word puns\nCulo: (From Spanish/Italian) slang, usually meaning a woman's voluptuous, round and firm buttocks. Derived from a term for booty; in Spanish the term is considered vulgar and offensive, but less so in Spain than in Latin America.\nDuffs: Ulster Irish origin\nDumper sometimes denotes the buttocks, especially when they are large.\nFanny: a socially acceptable term in print, in Canada and the United States at least, for many years before some of the bolder terms came along; and a subject of jokes, since \"Fannie\" can be a woman's name, diminutive of \"Frances\"; however, in British English fanny refers to the female genitals or vulva and is considered vulgar. The figure of a bare-bottomed lass named Fanny is ubiquitous in Provence (the southeast of France) wherever pétanque is played: traditionally when a player loses 13 to 0 it is said that “il est fanny” (he's fanny), and he has to kiss the bottom of a girl called Fanny; as there is rarely an obliging Fanny, there is always a substitute picture, woodcarving or pottery so that Fanny’s bottom is always available.\nFourth point of contact: in military slang, because of the sequence of textbook parachute jump landing\nFundament (literally \"foundation\", not common in this general sense in English, but for the buttocks since 1297)\nGand or Gaand: a Hindi derivative\nHams, like buttocks generally as a plural, after the meat cut from the analogous part of a hog ; pressed ham refers to mooning against a window; brawn, a singular derived from the Frankish for ham or roast, is also used for both a muscular body part (but either on arms or legs) or boar meat, especially roast\nHurdies: Scots, origin unknown, also applied to the whole rump\nHaunches\nMoon was a common shape-metaphor for the butt in English since 1756, and the verb to moon meant 'to expose to (moon)light' since 1601, long before they were combined in US student slang in the verb (al expression) mooning \"to flash the buttocks\" in 1968.\nPrat (British English, origin unknown; as in pratfall, a music hall term; also a term of abuse for a person)\nSeat (of the trousers; or metaphorically): another long-standing socially acceptable term, referring to the use for sitting—but compare the sarcastic use of seat of wisdom and similar expressions, such as 'seat of learning', referring to use as target for an 'educational' spanking.\nSit-upon; has various independent counterparts in other languages, e.g., Dutch zitvlak (\"sitting plain\"), German Gesäß  Italian sedere\nSix; in military terminology, particularly in the United States Navy, it refers to the term \"six o'clock\", i.e., a point directly behind the referenced person.\nTuchis: Yiddish.\nTush or tushy (from the Yiddish language \"tuchis\" or \"tochis\" meaning \"under\" or \"beneath\")\nUltimatum (Latin, literally 'the furthest part') was used in slang c.1820s.\n\n\n=== Related terms ===\nThe word \"callipygian\" is sometimes used to describe someone with notably attractive buttocks. The term comes from the Greek kallipygos, (first used for the Venus Kallipygos) which literally means \"beautiful buttocks\"; the prefix is also a root of \"calligraphy\" (beautiful writing) and \"calliope\" (beautiful voice); callimammapygian means having both beautiful breasts and buttocks.\nBoth the English (in) tails and the Dutch billentikker ('tapping the buttocks') are ironic terms for very formal coats with a significantly longer tail end as part of festive (especially wedding party) dress\nMacropygia means 'heaving large buttocks, hindquarter', and occurs in biological species names,\nA pygopag(ous) (from the Greek pygè 'buttock' and pagein 'attached') was a monster in Ancient (Greek) mythology consisting of two bodies joint by common buttocks, now a medical term for 'Siamese' twins thus joint back-to-back\nPygophilia is sexual arousal or excitement caused by seeing, playing with or touching the buttocks; people who have strong attraction to buttocks are called pygophilists.\nPygoscopia means observing someone's rear; pygoscopophobia a pathological fear to be its unwilling object\nPygalgia is soreness in the buttocks, i.e. a pain in the rump.\nSteatopygia is a marked accumulation of fat in and around the buttocks.\nUropygial in ornithology means situated on or belonging to the uropygium, i.e. the rump of a bird.\n\"Bubble butt\" has at least two connotations, which are at odds with each other: either a small, round and firm pair of buttocks resembling a pair of soap bubbles next to each other, or a large rear end, seemingly about to burst from the strain. In both cases, the term implies an appealing shapeliness about the buttocks.\n\n\n=== Fashion ===\n\nThe 1880s were well known for the fashion trend among women called the bustle, which made even the smallest buttocks appear huge. The popularity of this fashion is shown in the famous Georges Seurat painting A Sunday Afternoon on the Island of La Grande Jatte in the two women to the far left and right. Like long underwear with the ubiquitous \"butt flap\" (used to allow baring only the bottom with a simple gesture, as for hygiene), this clothing style was acknowledged in popular media such as cartoons and comics for generations afterward.\nMore recently, the cleavage of the buttocks is sometimes exposed by some women, deliberately or accidentally, as fashion dictated trousers be worn lower, as with hip-hugger pants.\nAn example of another attitude in an otherwise hardly exhibitionist culture is the Japanese fundoshi.\n\n\n=== In popular culture ===\n\nIn 1966 Yoko Ono made a roughly 90 minute-long experimental film called No. 4, which is colloquially known as Bottoms. It consists of footage of human buttocks in motion while the person walks on a turntable.\nThe 1984 Heavy metal music mockumentary This Is Spinal Tap contained the song \"Big Bottom\" featuring the lyrics Big bottom, big bottom, Talk about bum cakes, my girl's got 'em, Big bottom drive me out of my mind, How could I leave this behind? The band performs the song using three simultaneous bass guitars, a pun on the song title, as the bass is often colloquially referred to as the \"bottom end\" of the rock sound.\nNumerous songs have been released which glorify this body part.  As early as 1961, the American Folk band The Limeliters recorded the song \"Vicki Dougan\" [sic], which pays a humorous tribute to the pin-up star Vikki Dougan who wore infamously low-cut, backless dresses. A risque song for the time, the lyrics  mention her \"callipygian cleft\" by name. Other English-language examples include:\n\"(Shake, Shake, Shake) Shake Your Booty\" by KC and the Sunshine Band (1976)\n\"Peaches\" by The Stranglers (1977)\nThe singles \"Fat Bottomed Girls\" and \"Bicycle Race\" by Queen (1978)\n\"Baby Got Back\" by Sir Mix-a-Lot (1992)\n\"I See You Baby (Shakin' That Ass)\" by Groove Armada (1999)\n\"Bootylicious\" by Destiny's Child (2001)\n\"Pop That Booty\" by Marques Houston (2003)\n\"My Humps\" (in the back and in the front) by The Black Eyed Peas (2005)\n\"Ms. New Booty\" by Bubba Sparxxx and Ying Yang Twins (2005)\n\"All About That Bass\" by Meghan Trainor (2014)\n\"Booty\" by Jennifer Lopez (2014)\nRolling Stone magazine named the 1990s the \"Decade of the Butt\" because many buttock-related songs were released in that decade.\nIn the United Kingdom there is an annual award given to the male and female winners of the celebrity voted to have the Rear of the Year for that year.  Past Winners have included Sarah Lancashire and Jane Danson.\nIn 2008, Hong Kong lifestyle retail store G.O.D. collaborated with Kee Wah Bakery to design mooncakes for the Chinese Mid-Autumn Festival. They presented the traditional treats in the shape of bottoms in eight different designs, but still filled with traditional white lotus seed paste and salted yolks.\nBeauty pageants exist globally to judge the females with the best buttocks, such as Miss Bum Bum (Brazil), Miss Reef (South American countries) and got ass? (USA).\n\n\n== Gallery of art ==\n\n\t\t\n\t\t\n\n\n== See also ==\nButtock augmentation\nButtock cleavage\nCultural history of the buttocks\nCellulite\nCoccyx\nDimples of Venus\nHip and buttock padding\nIntimate part\nWaist–hip ratio\n\n\n== References ==\nNotes\nSourcesEtymology on line one can also search for most synonyms\nFor synonyms: On-line thesaurus\n This article incorporates text from a publication now in the public domain: Herbermann, Charles, ed. (1913). Catholic Encyclopedia. New York: Robert Appleton Company.  passim\n\n\n== External links ==\n\"The Muscles and Fasciæ of the Thigh\" (by Henry Gray) at \"Anatomy of the Human Body\", 1918."