"Public relations (PR) is the practice of managing and disseminating information from an individual or an organization (such as a business, government agency, or a nonprofit organization) to the public in order to affect public perception. Public relations (PR) and publicity differ in that PR is controlled internally, whereas publicity is not controlled and contributed by external parties. Public relations may include an organization or individual gaining exposure to their audiences using topics of public interest and news items that do not require direct payment. This differentiates it from advertising as a form of marketing communications. Public relations aims to create or obtain coverage for clients for free, also known as earned media, rather than paying for marketing or advertising. But in the early 21st century, advertising is also a part of broader PR activities.An example of good public relations would be generating an article featuring a PR firm's client, rather than paying for the client to be advertised next to the article. The aim of public relations is to inform the public, prospective customers, investors, partners, employees, and other stakeholders, and ultimately persuade them to maintain a positive or favorable view about the organization, its leadership, products, or political decisions. Public relations professionals typically work for PR and marketing firms, businesses and companies, government, and public officials as public information officers and nongovernmental organizations, and nonprofit organizations. Jobs central to public relations include account coordinator, account executive, account supervisor, and media relations manager.Public relations specialists establish and maintain relationships with an organization's target audience, the media, relevant trade media, and other opinion leaders. Common responsibilities include designing communications campaigns, writing press releases and other content for news, working with the press, arranging interviews for company spokespeople, writing speeches for company leaders, acting as an organization's spokesperson, preparing clients for press conferences, media interviews and speeches, writing website and social media content, managing company reputation (crisis management), managing internal communications, and marketing activities like brand awareness and event management. Success in the field of public relations requires a deep understanding of the interests and concerns of each of the company's many stakeholders. The public relations professional must know how to effectively address those concerns using the most powerful tool of the public relations trade, which is publicity."