"An archangel  is an angel of high rank. The word archangel itself is usually associated with the Abrahamic religions, but beings that are very similar to archangels are found in a number of religious traditions.\nThe English word archangel is derived from Greek ἀρχάγγελος, literally 'chief angel' or 'angel of origin'. It appears only twice in the New Testament in the phrase \"with the voice of the archangel, and with the trumpet call of God\" (1 Thessalonians 4:16) and in relation to \"the archangel Michael\" (Jude 9). The corresponding but different Hebrew word in the Hebrew Scripture (Old Testament) is found in two places as in \"Michael, one of the chief princes\" (Dan 10:13) and in \"Michael, the great prince\" (Dan 12:1).\n\n\n== Description ==\n\nMichael and Gabriel are recognized as archangels in Judaism, Islam, and by most Christians. Some Protestants consider Michael to be the only archangel. Raphael—mentioned in the deuterocanonical Book of Tobit—is also recognized as a chief angel in the Catholic and Orthodox churches. Gabriel, Michael, and Raphael are venerated in the Roman Catholic Church with a feast on September 29 (between 1921 and 1969, March 24 for Gabriel and October 24 for Raphael), and in the Eastern Orthodox Church on November 8 (if the Julian calendar is used, this corresponds to November 21 in the Gregorian). The named archangels in Islam are Jibrael, Mikael, Israfil, and Azrael. Jewish literature, such as the Book of Enoch, also mentions Metatron as an archangel, called the \"highest of the angels\", though the acceptance of this angel is not canonical in all branches of the faith.\nSome branches of the faiths mentioned have identified a group of seven Archangels, but the named angels vary, depending on the source. Gabriel, Michael, and Raphael are always mentioned; the other archangels vary, but most commonly include Uriel, who is mentioned in 2 Esdras.\nIn Zoroastrianism, sacred texts allude to the six great Amesha Spenta (literally \"Bounteous/Holy Immortals\") of Ahura Mazda.\n\n\n== In Zoroastrianism ==\n\nAn increasing number of experts in anthropology, theology and philosophy, believe that Zoroastrianism contains the earliest distillation of prehistoric belief in angels.The Amesha Spentas (Avestan: Aməša Spəṇta, meaning \"immortal holiness\") of Zoroastrianism are likened to archangels. They individually inhabit immortal bodies that operate in the physical world to protect, guide, and inspire humanity and the spirit world. The Avesta explains the origin and nature of archangels or Amesha Spentas.To maintain equilibrium, Ahura Mazda engaged in the first act of creation, distinguishing his Holy Spirit Spenta Mainyu, the Archangel of righteousness. Ahura Mazda also distinguished from himself six more Amesha Spentas, who, along with Spenta Mainyu, aided in the creation of the physical universe. Then he oversaw the development of sixteen lands, each imbued with a unique cultural catalyst calculated to encourage the formation of distinct human populations. The Amesha Spentas were charged with protecting these holy lands and through their emanation, also believed to align each respective population in service to God.The Amesha Spentas as attributes of God are:\n\nSpenta Mainyu (Pahlavi: Spenamino): lit. \"Bountiful Spirit\"\nAsha Vahishta (Phl. Ardwahisht): lit. \"Highest Truth\"\nVohu Mano (Phl. Vohuman): lit. \"Righteous Mind\"\nKhshathra Vairya (Phl. Shahrewar): lit. \"Desirable Dominion\"\nSpenta Armaiti (Phl. Spandarmad): lit. \"Holy Devotion\"\nHaurvatat (Phl. Hordad): lit. \"Perfection or Health\"\nAmeretat (Phl. Amurdad): lit. \"Immortality\"\n\n\n== In Judaism ==\n\nThe Hebrew Bible uses the term מלאכי אלוהים (malakhi Elohim; Angels of God), The Hebrew word for angel is \"malach,\" which means messenger, for the angels מלאכי יי (malakhi Adonai; Angels of the Lord) are God's messengers to perform various missions - e.g. 'angel of death'; בני אלוהים (b'nei elohim; sons of God) and הקדושים (ha-q'doshim; the holy ones) to refer to beings traditionally interpreted as angelic messengers. Other terms are used in later texts, such as העליונים (ha-elyonim, the upper ones, or the supreme ones). References to angels are uncommon in Jewish literature except in later works such as the Book of Daniel, though they are mentioned briefly in the stories of Jacob (who according to one interpretation wrestled with an angel) and Lot (who was warned by angels of the impending destruction of the cities of Sodom and Gomorrah). Daniel is the first biblical figure to refer to individual angels by name. It is therefore widely speculated that Jewish interest in angels developed during the Babylonian captivity. According to Rabbi Simeon ben Lakish of Tiberias (230–270 A.D.), specific names for the angels were brought back by the Jews from Babylon.\nThere are no explicit references to archangels in the canonical texts of the Hebrew Bible. In post-Biblical Judaism, certain angels came to take on a particular significance and developed unique personalities and roles. Though these archangels were believed to have ranked amongst the heavenly host, no systematic hierarchy ever developed. Metatron is considered one of the highest of the angels in Merkavah and Kabbalist mysticism and often serves as a scribe. He is briefly mentioned in the Talmud, and figures prominently in Merkavah mystical texts. Michael, who serves as a warrior and advocate for Israel, is looked upon particularly fondly. Gabriel is mentioned in the Book of Daniel and briefly in the Talmud, as well as many Merkavah mystical texts. The earliest references to archangels are in the literature of the intertestamental periods (e.g., 4 Esdras 4:36).\nIn the Kabbalah there are ten archangels, each assigned to one sephira: Metatron, Raziel (other times Jophiel), Tzaphkiel, Tzadkiel, Khamael, Raphael, Haniel, Michael, Gabriel, and Sandalphon. Chapter 20 of the Book of Enoch mentions seven holy angels who watch, that often are considered the seven archangels: Michael, Raphael, Gabriel, Uriel, Saraqael, Raguel, and Remiel. The Life of Adam and Eve lists the archangels as well: Michael, Gabriel, Uriel, Raphael and Joel. \nMedieval Jewish philosopher Maimonides made a Jewish angelic hierarchy.\n\n\n== In Christianity ==\n\nThe New Testament makes over a hundred references to angels, but uses the word \"archangel\" only twice, in 1 Thessalonians 4:16 (\"For the Lord himself shall descend from heaven with a shout, with the voice of the archangel, and with the trump of God: and the dead in Christ shall rise first\", KJV) and Jude 1:9 (\"Yet Michael the archangel, when contending with the devil he disputed about the body of Moses, durst not bring against him a railing accusation, but said, The Lord rebuke thee\", KJV).\n\n\n=== Catholic ===\n\nIn Catholicism, three are mentioned by name:\n\nGabriel\nMichael\nRaphaelThese three are commemorated together liturgically on September 29. Each formerly had his own feast (see individual articles).\nThe latter of these identifies himself in Tobit 12:15(NAB) thus: \"I am Raphael, one of the seven angels who stand and serve before the Glory of the Lord.\"\nThe Fourth Book of Esdras, which mentions the angel Uriel (and also the \"archangel\" Jeremiel), was popular in the West and was frequently quoted by Church Fathers, especially Ambrose, but was never considered part of the Catholic biblical canon.The Catholic Church gives no official recognition to the names given in some apocryphal sources, such as Raguel, Saraqael and Remiel (in the Book of Enoch) or Izidkiel, Hanael, and Kepharel (in other such sources).\n\n\n=== Eastern Orthodox ===\n\nEastern Orthodox Tradition mentions \"thousands of archangels\"; however, only seven archangels are venerated by name. Uriel is included, and the other three are most often named Selaphiel, Jegudiel, and Barachiel (an eighth, Jeremiel, is sometimes included as archangel). The Orthodox Church celebrates the Synaxis of the Archangel Michael and the Other Bodiless Powers on November 8 of the Eastern Orthodox liturgical calendar (for those churches which follow the Julian Calendar, November 8 falls on November 21 of the modern Gregorian Calendar). Other feast days of the Archangels include the Synaxis of the Archangel Gabriel on March 26 (April 8), and the Miracle of the Archangel Michael at Colossae on September 6 (September 19). In addition, every Monday throughout the year is dedicated to the Angels, with special mention being made in the church hymns of Michael and Gabriel. In Orthodox iconography, each angel has a symbolic representation:\nMichael in the Hebrew language means \"Who is like God?\" or \"Who is equal to God?\" Michael has been depicted from earliest Christian times as a commander, who holds in his right hand a spear with which he attacks Lucifer/Satan, and in his left hand a green palm branch. At the top of the spear, there is a linen ribbon with a red cross. The Archangel Michael is especially considered to be the Guardian of the Orthodox Faith and a fighter against heresies.\nGabriel means \"God is my strength\" or \"Might of God\". He is the herald of the mysteries of God, especially the Incarnation of God and all other mysteries related to it. He is depicted as follows: In his right hand, he holds a lantern with a lighted taper inside, and in his left hand, a mirror of green jasper. The mirror signifies the wisdom of God as a hidden mystery.\nRaphael means \"It is God who heals\" or \"God Heals\". Raphael is depicted leading Tobit (who is carrying a fish caught in the Tigris) with his right hand and holding a physician's alabaster jar in his left hand.\nUriel means \"God is my light\", or \"Light of God\" (II Esdras 4:1, 5:20). He is depicted holding a sword in his right hand, and a flame in his left.\nSealtiel means \"Intercessor of God\". He is depicted with his face and eyes lowered, holding his hands on his bosom in prayer.\nJegudiel means \"Glorifier of God\". He is depicted bearing a golden wreath in his right hand and a triple-thonged whip in his left hand.\nBarachiel means \"Blessed by God\". He is depicted holding a white rose in his hand against his breast.\nJerahmeel means \"God's exaltation\". He is venerated as an inspirer and awakener of exalted thoughts that raise a person toward God (2 Esdras 4:36). As an eighth, he is sometimes included as an archangel.\n\n\n=== Coptic Orthodox ===\n\nIn addition to Michael, Gabriel and Raphael, the Coptic Orthodox Church recognises four more archangels by name:\nSuriel means \"Prince of God\"\nZedekiel means \"Grace of God\"\nSarathiel (Unknown)\nAnaniel means \"Rain of God\"\n\n\n=== Ethiopian Orthodox ===\n\nThe Ethiopian Orthodox Tewahedo Church venerates the four archangels Michael, Gabriel, Raphael, and Uriel, as well as:\nPhanuel, meaning \"Face of God\"\nRaguel, meaning \"Friend of God\"\nRamuel or Remiel, meaning \"Thunder of God\"In the canon of the Ethiopian Orthodox Tewahedo Church, 1 Enoch describes Saraqael as one of the angels who watch over \"the spirits that sin in the spirit\" (Enoch 20:7–8).\n\n\n=== Protestant ===\nThe standard Protestant Bible provides names for three angels: \"Michael the archangel\", the angel Gabriel, who is called \"the man Gabriel\" in Daniel 9:21 and third \"Abaddon\"/\"Apollyon\" in Revelation 9:11. Among Protestant communities, the Anglican and many Methodist traditions recognize four angels as archangels: Michael the Archangel, Raphael the Archangel, Gabriel the Archangel, and Uriel the Archangel. But a depiction of seven archangels in stained-glass windows can be found in some Anglican churches. In this case, in addition to the aforementioned angels, Chamuel, Jophiel and Zadkiel are also depicted. They are commemorated on 29 September, “Michaelmas”, in the church calendar. The evangelist Billy Graham wrote that in Sacred Scripture, there is only one individual explicitly described as an archangel—Michael—in Jude 1:9.Seventh-day Adventists hold that the titles \"Michael\" and \"archangel\" are in reference to Jesus. However, in the Adventist view, they only signify his role as the chief of angels and make no reference to the nature of Jesus, who is fully divine. Adventists credit nonconformist minister Matthew Henry as supporting this view.\n\n\t\t\n\n\n=== Restorationist ===\nSeventh-day Adventists, citing a reference to \"the voice of the archangel\" at 1 Thessalonians 4:16, also believe that \"Michael\" is another name for Jesus in heaven. They believe Jesus is an archangel in the true sense of the word—the supreme leader of angels.The Church of Jesus Christ of Latter-day Saints (LDS Church) interprets the term \"archangel\" as meaning \"Chief Angel\", Michael is the only individual so designated in the Latter Day Saints canon. It is believed that he is the head of all of the angels. LDS Church doctrine also states that the archangel Michael was the first man, Adam. Though no other being is identified as an \"archangel\", Joseph Smith taught that the angel Gabriel was known in mortality as Noah and the angel Raphael is a being of significant standing, even though he has never been identified with any mortal prophet.\n\n\n== In Islam ==\n\nIn Islam, the mentioned archangels in the Islamic exegetical traditions are:\n\nGabriel (Jibrail or Jibril in Arabic). Gabriel is said to be the archangel responsible for transmitting God's revelations to all prophets, including revealing the Quran to Muhammad and inducing him to recite it. Various hadiths (traditions) mention his role in delivering messages from \"God the Almighty\" to the prophets.\nMichael (Mīka'īl or Mīkal in Arabic). Michael is often depicted as the archangel of mercy who is responsible for bringing rain and thunder to Earth.\nRaphael (Israfil in Arabic). The name is not mentioned in the Quran. Considered in Islam by some to be the angel of the trumpet responsible for signaling the coming of Judgment Day.\nAzrael (Azra’il in Arabic, also called Malak al-Maut, literally “angel of death”). Taking the soul of the dead to heaven or hell. The name is not mentioned in the Quran.\n\n\n== Other traditions ==\nOccultists sometimes associate archangels in Kabbalistic fashion with various seasons or elements, or even colors. In some Kabbalah-based systems of ceremonial magic, all four of the main archangels (Gabriel, Michael, Raphael and Uriel) are invoked as guarding the four quarters, or directions, and their corresponding colors are associated with magical properties. Lucifer or Satan in Christian traditions, or Iblis in Islam, is considered an archangel by Satanists and many non-Satanists, but most non-Satanists consider him evil and fallen from God's grace.\n\n\n== Cultural references ==\n\nIn art, archangels are sometimes depicted with larger wings. Some of the more commonly represented archangels are Gabriel, Michael, Raphael, and Uriel.In the lesser ritual of the pentagram, the invocation includes the words \"Before me Raphael; Behind me Gabriel; On my right hand Michael; On my left hand Auriel [Uriel]...\"\n\n\n== See also ==\n\n\n== References ==\n\n\n=== Citations ===\n\n\n=== Bibliography ===\n\n\n== External links ==\nThe World of Djinn and Its Secrets\nThe Zoroastrian Religion and its Progeny\nSynaxis of the Archangel Michael and the Other Bodiless Powers—Orthodox icon and synaxarion"