"The sling swimsuit is a one-piece swimsuit which is supported by fabric at the neck. Sling swimsuits provide as little coverage (or as much exposure) as, or even less than, a bikini. Monokini types also exist. The sling swimsuit is also known by a variety of names including \"suspender bikini\", \"sling bikini\", \"slingkini\", \"suspender thong\", \"slingshot swimsuit\" or just \"slingshot\". It is so named because of its resemblance to the Y-shape frame of a slingshot. It is sometimes listed as a bikini variant. When designed for or worn by a man, it is often called a \"mankini\".\n\n\n== Design ==\nUsually, a sling swimsuit comprises a bikini bottom of any style, with side straps extending upwards to cover the breasts, then going over the shoulders and behind the neck or extending down the back. The sling swimsuit leaves the sides of the torso uncovered, while covering the nipples and pubic area. Behind the neck, the straps may join and reach down the back to the buttocks thong or string style.The variation of sling swimsuits is a pretzel swimsuit, which has the straps behind the neck and another set of straps around the midriff, instead of straps down the back. Even more \"risqué\" European designs include the bodyform-suspender (by German manufacturer Nixxxe) and other open bust and/or crotchless variants such as the \"peekaboo\" slingshot (by Spanish manufacturer the-Bikinis) and \"ouvert\" sling bikini (by German manufacturer Tangaland).A sling swimsuit worn by men is often called a mankini. It was popularized by Sacha Baron Cohen, who donned one in the film Borat. The buzz around the film started building during the Cannes Film Festival in May 2006, when Baron Cohen posed in character on the beach in a fluorescent green mankini, alongside four models. A garden gnome in the 2011 film Gnomeo and Juliet was also shown wearing a mankini, which gets referred to as a Borat-Mankini by newspapers.\n\n\n== History ==\nCorresponding to the introduction of Lycra into swimwear, sling swimsuits emerged in the early 1990s. They are more popular on some beaches of Europe, including Saint-Tropez, Marbella, Mykonos and Ibiza. Suspender-like straps running between the breasts and around the neck that held the suit up were introduced in the mainstream in 1994. News reports said that within a week of putting the suit on their racks, New York's major stores had sold 150. By season's end, the tally sold was over 3000, at a cost of $24 a suit.\n\n\n== References =="