"Homeric Greek is the form of the Greek language that was used by Homer in the Iliad and Odyssey and in the Homeric Hymns. It is a literary dialect of Ancient Greek consisting mainly of Ionic and Aeolic, with a few forms from Arcadocypriot, and a written form influenced by Attic. It was later named Epic Greek because it was used as the language of epic poetry, typically in dactylic hexameter, by poets such as Hesiod and Theognis of Megara. Compositions in Epic Greek may date from as late as the 3rd century BC, but it disappeared with the rise of Koine Greek.\n\n\n== Main features ==\nIn the following description, only forms that differ from those of later Greek are discussed. Omitted forms can usually be predicted from patterns seen in Ionic Greek.\n\n\n=== Phonology ===\nHomeric Greek is like Ionic Greek, and unlike Classical Attic, in shifting almost all cases of long ᾱ to η: thus, Homeric Τροίη, ὥρη, πύλῃσι for Attic Τροίᾱ, ὥρᾱ, πύλαις/πύλαισι \"Troy\", \"hour\", \"gates (dat.)\". Exceptions include nouns like θεᾱ́ \"goddess\", and the genitive plural of first-declension nouns and the genitive singular of masculine first-declension nouns: θεᾱ́ων, Ἀτρεΐδᾱο \"of goddesses, of the son of Atreus\".\n\n\n=== Nouns ===\nFirst declension\nThe nominative singular of most feminine nouns ends in -η, rather than long -ᾱ, even after ρ, ε, and ι (an Ionic feature): χώρη for χώρᾱ. However, θεᾱ́ and some names end in long -ᾱ.\nSome masculine nouns have a nominative singular in short -ᾰ rather than -ης (ναύτης, Ἀτρεΐδης): ἱππότᾰ for Attic ἱππότης.\nThe genitive singular of masculine nouns ends in -ᾱο or -εω, rather than -ου: Ἀτρεΐδᾱο for Attic Ἀτρείδου.\nThe genitive plural usually ends in -ᾱων or -εων: νυμφᾱ́ων for Attic νυμφῶν.\nThe dative plural almost always end in -ῃσι(ν) or -ῃς: πύλῃσιν for Attic πύλαις.Second declension\nGenitive singular: ends in -οιο, as well as -ου. For example, πεδίοιο, as well as πεδίου.\nGenitive and dative dual: ends in -οιϊν. Thus, ἵπποιϊν appears, rather than ἵπποιν.\nDative plural: ends in -οισι(ν) and -οις. For example, φύλλοισι, as well as φύλλοις.\nThird declension\nAccusative singular: ends in -ιν, as well as -ιδα. For example, γλαυκῶπιν, as well as γλαυκώπιδα.\nDative plural: ends in -εσσι and -σι. For example, πόδεσσι or ἔπεσσι.\nHomeric Greek lacks the quantitative metathesis present in later Greek (except in certain masculine α-stem genitive singulars):\nHomeric βασιλῆος instead of βασιλέως, πόληος instead of πόλεως\nβασιλῆα instead of βασιλέᾱ\nβασιλῆας instead of βασιλέᾱς\nβασιλήων instead of βασιλέων\nHomeric Greek sometimes uses different endings:\nπόληος alternates with πόλιοςA note on nouns:\n\nAfter short vowels, the reflex of Proto-Greek *ts can alternate between -σ- and -σσ- in Homeric Greek. This can be of metrical use. For example, τόσος and τόσσος are equivalent; μέσος and μέσσος; ποσί and ποσσί.\nA relic of the Proto-Greek instrumental case, the ending -φι(ν) (-οφι(ν)) can be used for the dative singular and plural of nouns and adjectives (occasionally for the genitive singular and plural, as well). For example, βίηφι (...by force), δακρυόφιν (...with tears), and ὄρεσφιν (...in the mountains).\n\n\n=== Pronouns ===\nThird-person singular pronoun (\"he, she, it\") (the relative) or rarely singular article (\"the\"): ὁ, ἡ, τό\nThird-person plural pronoun (\"they\") (the relative) or rarely plural article (\"the\"): nominative οἰ, αἰ, τοί, ταί, dative τοῖς, τοῖσι, τῇς, τῇσι, ταῖς.\n\n\n=== Verbs ===\nPerson endings\n-ν appears rather than -σαν. For example, ἔσταν for ἔστησαν in the third-person plural active.\nThe third plural middle/passive often ends in -αται or -ατο; for example, ἥατο is equivalent to ἧντο.Tenses\nFuture: Generally remains uncontracted. For example, ἐρέω appears instead of ἐρῶ or τελέω instead of τελῶ.\nPresent or imperfect: These tenses sometimes take iterative form with the letters -σκ- penultimate with the ending. For example, φύγεσκον: 'they kept on running away'\nAorist or imperfect: Both tenses can occasionally drop their augments. For example, βάλον may appear instead of ἔβαλον, and ἔμβαλε may appear instead of ἐνέβαλε.\nHomeric Greek does not have a historical present tense, but rather uses injunctives. Injunctives are replaced by the historical present in the post-Homeric writings of Thucydides and Herodotus.\nSubjunctive\nThe subjunctive appears with a short vowel. Thus, the form ἴομεν, rather than ἴωμεν.\nThe second singular middle subjunctive ending appears as both -ηαι and -εαι.\nThe third singular active subjunctive ends in -σι(ν). Thus, we see the form φορεῇσι, instead of φορῇ.\nOccasionally, the subjunctive is used in place of the future and in general remarks.Infinitive\nThe infinitive appears with the endings -μεν, -μεναι, and -ναι, in place of -ειν and -ναι. For example, δόμεναι for δοῦναι; ἴμεν instead of ἰέναι; ἔμεν, ἔμμεν, or ἔμμεναι for εἶναι; and ἀκουέμεν(αι) in place of ἀκούειν.Contracted verbs\nIn contracted verbs, where Attic employs an -ω-, Homeric Greek will use -οω- or -ωω- in place of -αο-. For example, Attic ὁρῶντες becomes ὁρόωντες.\nSimilarly, in places where -αε- contracts to -α- or -αει- contracts to -ᾳ-, Homeric Greek will show either αα or αᾳ.\n\n\n=== Adverbs ===\nAdverbial suffixes\n-δε conveys a sense of 'to where'; πόλεμόνδε 'to the war'\n-δον conveys a sense of 'how'; κλαγγηδόν 'with cries'\n-θεν conveys a sense of 'from where'; ὑψόθεν 'from above'\n-θι conveys a sense of 'where'; ὑψόθι 'on high'\n\n\n=== Particles ===\nἄρα, ἄρ, ῥα  'so' or 'next' (transition)\nτε  'and' (a general remark or a connective)Emphatics\nδή 'indeed'\nἦ  'surely'\nπερ 'just' or 'even'\nτοι 'I tell you ...' (assertion)\n\n\n=== Other features ===\nIn most circumstances, Homeric Greek did not have available a true definite article. Ὁ, ἡ, τό and their inflected forms do occur, but they are in origin demonstrative pronouns.\n\n\n== Vocabulary ==\nHomer (in the Iliad and the Odyssey) uses about 9,000 words, of which 1,382 are proper names. Of the 7,618 remaining words 2,307 are hapax legomena.\n\n\n== Sample ==\nThe Iliad, lines 1–7\n\nRobert Fitzgerald (1974):\n\n\n== See also ==\nAncient Greek dialects\nHomeric texts\n\n\n== Notes ==\n\n\n== References ==\n\n\n== Bibliography ==\nPharr, Clyde.  Homeric Greek: A Book for Beginners.  University of Oklahoma Press, Norman, new edition, 1959. Revised edition: John Wright, 1985.  ISBN 0-8061-1937-3. First edition of 1920 in public domain.\nStanford, William Bedell (1959) [1947]. \"Introduction, Grammatical Introduction\". Homer: Odyssey I-XII. 1 (2nd ed.). Macmillan Education Ltd. pp. ix–lxxxvi. ISBN 1-85399-502-9.\n\n\n== Further reading ==\nBakker, Egbert J., ed. 2010. A companion to the Ancient Greek language. Oxford: Wiley-Blackwell.\nChristidis, Anastasios-Phoivos, ed. 2007. A history of Ancient Greek: From the beginnings to Late Antiquity. Cambridge, UK: Cambridge University Press.\nColvin, Stephen C. 2007. A historical Greek reader: Mycenaean to the koiné. Oxford: Oxford University Press.\nEdwards, G. Patrick. 1971. The language of Hesiod in its traditional context. Oxford: Blackwell.\nHackstein, Olav. 2010. \"The Greek of epic.\" In A companion to the Ancient Greek language. Edited by Egbert J. Bakker, 401–23. Oxford: Wiley-Blackwell.\nHorrocks, Geoffrey C. 1987. \"The Ionian epic tradition: Was there an Aeolic phase in its development?\" Minos 20–22: 269–94.\n––––. 2010. Greek: A history of the language and its speakers. 2nd ed. Oxford: Wiley-Blackwell.\nJanko, Richard. 1982. Homer, Hesiod, and the Hymns: Diachronic development in epic diction. Cambridge, UK: Cambridge University Press.\n––––. 1992. \"The origins and evolution of the Epic diction.\" In The Iliad: A commentary. Vol. 4, Books 13–16. Edited by Richard Janko, 8–19. Cambridge, UK: Cambridge University Press.\nLord, Albert B. 1960. The singer of tales. Cambridge, MA: Harvard University Press.\nNagy, Gregory. 1995. \"An evolutionary model for the making of Homeric poetry: Comparative perspectives.\" In The ages of Homer. Edited by Jane Burr Carter and Sarah Morris, 163–79. Austin: University of Texas Press.\nPalmer, Leonard R. 1980. The Greek language. London: Faber & Faber.\nParry, Milman. 1971. The making of Homeric verse: The collected papers of Milman Parry. Edited by Adam Parry. Oxford: Clarendon.\nReece, Steve. 2009. Homer's Winged Words: the Evolution of Early Greek Epic Diction in the Light of Oral Theory. Amsterdam: Brill.\nWest, Martin L. 1988. \"The rise of the Greek epic.\" Journal of Hellenic Studies 108: 151–72."