"The COVID-19 pandemic in Taiwan is part of the worldwide pandemic of coronavirus disease 2019 (COVID-19) caused by severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2). The pandemic has had a smaller impact in Taiwan than in most other industrialized countries, with a total of eleven deaths as of 11 April 2021, a rate of 0.042 deaths per 100,000 people. The number of active cases peaked on 6 April 2020 at 307 cases, the overwhelming majority of which were imported.The virus was confirmed to have spread to Taiwan on 21 January 2020, with the first case being a 50-year-old woman who had been teaching in Wuhan, China. The Taiwanese government integrated data from the national health care system, immigration, and customs authorities to aid in the identification and response to the virus. Government efforts are coordinated through the National Health Command Center (NHCC) of the Taiwan Centers for Disease Control, established to aid in disaster management for epidemics following the 2004 SARS outbreak.The Journal of the American Medical Association says Taiwan engaged in 124 discrete action items to prevent the spread of the disease, including early screening of flights from Mainland China and the tracking of individual cases.Taiwan's handling of the outbreak has received international praise for its effectiveness in quarantining people. As of 16 May, 571,259 tests had been conducted in Taiwan, with the vast majority not confirming a COVID-19 diagnosis.Starting 19 March 2020, foreign nationals were barred from entering Taiwan, with some exceptions, such as those carrying out the remainder of business contracts, and those holding valid Alien Resident Certificates, diplomatic credentials, or other official documentation and special permits. Restrictions have since been relaxed for foreign university students and those seeking medical treatment in Taiwan, subject to prior government approval. All who are admitted into the country must complete a fourteen-day quarantine upon arrival, except for business travelers from countries determined to be at low or moderate risk, who are subject to five- or seven-day quarantines and must submit to a COVID-19 test.However, in response to a worldwide spike in cases in October and November 2020, Taiwan announced that all travelers to and through Taiwan, regardless of nationality, origin, or purpose, must submit a negative COVID-19 test performed within three working days of arrival. Exceptions are granted to travelers responding to family emergencies or arriving from countries where on-demand or self-paid tests are unavailable, who must be seated apart from other passengers and take a self-paid test immediately on arrival in Taiwan.\n\n\n== Timeline ==\n\nAs of 16 May, there are 1,682 confirmed cases in Taiwan, including 12 deaths and 1,116 recoveries.\n\n\n=== 2020 ===\n\n\n==== Q1 ====\n\nOn 21 January, the first case in Taiwan was confirmed in a 50-year-old woman who had just returned to Taoyuan International Airport from her teaching job in Wuhan. She self-reported on her own initiative, and was hospitalized without formal domestic entry. The first domestic case was diagnosed in Taiwan on 28 January. A man in his 50s was believed to have acquired the disease from his wife, who had traveled to Wuhan and was confirmed before him. Among the first confirmed cases was a Taiwanese man in his 50s who was fined NT$300,000 for failure to report his symptoms and attempting to conceal his subsequent activities, leading to a potential contamination incident at a ballroom in Kaohsiung.The first death in Taiwan was confirmed on 16 February involving a man in his 60s who had both Hepatitis B and diabetes. His was the fifth death in the world outside mainland China. A woman in Taiwan was reported to have tested positive for novel coronavirus on 19 February 2020, though she had not traveled outside of Taiwan for two years. Five new cases of COVID-19 were reported in Taiwan on 29 February 2020, four of which marked the first transmission of the disease in a hospital setting. Taiwan's fiftieth case of coronavirus was confirmed on 13 March 2020, an American expatriate who hosted four United States citizens at his home in Taiwan. The next day, three new cases of coronavirus were confirmed to have been imported from Europe. A Taiwanese national aboard the Diamond Princess tested positive on 6 February. As of 19 February, five Taiwanese nationals aboard the ship tested positive. Two Taiwanese who fell ill on the Diamond Princess were discharged from Japanese hospitals in February 2020. The nineteen other Taiwanese passengers on the Diamond Princess were quarantined in Taiwan until 7 March 2020. All tested negative for coronavirus, and were released. The index case for coronavirus in Taiwan recovered from the disease and was discharged from hospital on 6 February 2020. Approximately a week later, a second Taiwanese national, the tenth case of coronavirus, had also recovered. Though community spread within the Taiwanese society did not necessarily break out, a hospital cluster was recorded after case 34. A female patient with diabetes and numerous cardiovascular diseases transmitted the virus to eight people contacted throughout February and March. She later died due to heart failure on 30 March.On 15 March, Taiwan announced six new cases, all imported. Subsequently, Taiwan's health minister advised people to remain in Taiwan and avoid travel. After discovering the mass imports of foreign cases, on 17 March, the CECC announced that it would trace the contacts of travelers that had arrived from Europe between 3 and 14 March. On 20 March 2020, Taiwan reported 27 new cases, the highest single-day increase. The second death linked to coronavirus in Taiwan was announced on 20 March, and involved a man in his 80s, who had no recent travel history, but did have hypertension, diabetes and relied on kidney dialysis. The death of a guide who had led tours to Austria and the Czech Republic was reported on 29 March. The next day, two Taiwanese nationals who had traveled to Spain were reported to have died of coronavirus.\n\n\n==== Q2 ====\nA Taiwanese man who had toured Egypt in March died of coronavirus on 9 April. On 18 April 2020, three Republic of China Navy cadets were confirmed to have contracted coronavirus following a military operation in Palau. Other personnel on the ship were confirmed to have contracted the disease as part of the first cluster to affect the Republic of China Armed Forces. As more cases from that cluster were identified, President Tsai Ing-wen asked the Ministry of National Defense to investigate the situation. Defense Minister Yen Teh-fa said vice admiral Kao Chia-pin and rear admiral Chen Tao-hui had been removed from their posts as commander of Republic of China Naval Fleet Command and leader of the ROCN's Friendship Fleet, respectively. On 30 April 2020, an employee of the Taipei Representative Office in France was confirmed to have fallen ill with coronavirus, becoming the first Taiwanese diplomat stationed overseas to contract the disease.On 10 May, Taiwan recorded 28 consecutive days or two cycles of the average incubation period of the virus without newly recorded domestic cases. Therefore, the CECC deems the risk of being infected within Taiwan is low. The death of a man who had visited the United States and contracted coronavirus was confirmed on 11 May. On 26 May, Chang Shan-chwen announced an end to the Central Epidemic Command Center's investigation on COVID-19 cases from ROCS Panshih. The ship's index case was likely to have been infected in Taiwan. Though the probe closed without finding a more specific location, it did find that sailors were infected with a Southeast Asian strain present in the Philippines, and that infections occurred in four waves, around 10 March 20 March, the beginning of April, and the middle of April. On 30 May, a second member of Taiwan's diplomatic corps was confirmed to have contracted COVID-19 in Honduras.By 7 June, Taiwan had not reported local cases for over four incubation periods which is 56 days. As a result, Taiwan began lifting pandemic-related restrictions. Starting 10 June, press briefings held by the Central Epidemic Command Center were scheduled weekly. On 12 June, the Ministry of National Defense disclosed further conclusions regarding the ROCS Panshih cluster, attributing the cluster to substandard health testing. Subsequently, Chen Tao-hui and Kao Chia-pin returned to their posts. The patient involved in the longest hospitalization in Taiwan due to COVID-19 spent 75 days in hospital, and was released in mid-June.On 24 June, the CECC announced that a Japanese university student who had returned to Japan on 20 June had been diagnosed with COVID-19 by Japanese health authorities. Analysis of the student's test results led the CECC to conclude that she was a weak positive, although the agency did not rule out the possibility of infection in Taiwan, or potential for a false positive. The case was not added to Taiwan's total, as the student was not tested in Taiwan. The CECC confirmed that the student did not spread COVID-19 to others during her stay in Taiwan.\n\n\n==== Q3 ====\nOn 2 July, the Chinese Taipei Basketball Association announced that the 2020 William Jones Cup would not be held due to the pandemic. This was the third cancellation since the competition's founding in 1977. The tournament had been previously canceled in 1989 because of a fire in the host venue, and again in 2003, during the SARS outbreak.Taiwan's annual public air raid drill was held on 14 July, albeit with significant changes. The thirty-minute drills typically require citizens to clear the streets and remain indoors until the drill concludes. On the advice of the CECC, however, the Ministry of National Defense did not restrict the movement of citizens to prevent the formation of crowds, especially in public transit stations.A case of COVID-19 that possibly originated in Taiwan was found by Thai health authorities on 25 July. A Thai migrant worker who had entered Taiwan on 17 January 2018 and returned to Thailand on 21 July 2020 and had not left Taiwan during that time frame tested positive for the virus while in quarantine. The CECC reported it had learned of the positive result on 27 July and immediately ordered workers who shared a company dormitory with the migrant worker to go into quarantine. By 28 July, the CECC identified 189 contacts to be tested for COVID-19. 18 people were placed in quarantine, including one in full hospital isolation due to having symptoms consistent with COVID-19. The CECC also tested the contacts for COVID-19 antibodies to see if any of them had contracted and recovered from COVID-19 earlier, but reported on 29 July that no positive cases nor antibodies were found. The CECC is continuing its investigation.\nOn 1 August, another possible domestically transmitted case was identified in a Belgian engineer who had worked in Taiwan for two months before his diagnosis. 89 contacts have been identified by the CECC to quarantine and test for COVID-19. The CECC has not yet classified the case as imported or domestic because it described the test as a \"weak positive\" and has received test results for COVID-19 antibodies which suggest the infection may already have passed. It is now testing his contacts to \"more accurately\" determine if it is more likely he acquired the infection before or after entering Taiwan. On 4 August, it reported it was testing 441 possible contacts for COVID-19 antibodies.On 19 August, the CECC announced it was closing the investigations of four cases where COVID-19 had possibly been acquired in Taiwan. Two cases were regarded as solved: that of the Belgian engineer and that of a Vietnamese migrant worker. The CECC said the Belgian engineer had likely contracted the virus in Belgium several weeks before he entered Taiwan and had not been contagious during his stay. The Vietnamese migrant worker had likely been infected in a quarantine facility by his roommates shortly after returning to his home country. The other two cases' origins could not be identified, but tracing and testing of all four cases' contacts in Taiwan failed to detect either active COVID-19 infections or antibodies that indicated past and resolved infections. As such, the CECC regarded the cases as closed.On 9 August, National Taiwan University announced that the preliminary results of a mass-testing study conducted by its College of Public Health in partnership with the government of Changhua County, located on the west coast of central Taiwan, had found COVID-19 antibodies in four target groups that included recovered patients, their close contacts, people who had been in home isolation or quarantine, and healthcare personnel in Changhua. The CECC said the study may indicate that hidden domestic cases have occurred that may be the source of ten cases whose origins are unknown, but if so, they have not caused large community outbreaks. The study has tested 3,000 people out of a target of 10,000, and further results and analysis will be released on 25 August.However, the study came under fire from the CECC for discussing preliminary results before they had been peer reviewed, which intensified when the results were delayed in order to allow them to be reviewed by six experts. Partial results were released on 27 August, which found COVID-19 antibodies in four out of 4,841 subjects. Full results will be released at a later date, but the study appears to indicate that any incidence of undiagnosed COVID-19 cases in the general Taiwanese population has been very low.Throughout September, the CECC announced that Taiwan had received notifications from Vietnam (2 September), Japan, the Philippines, and China that travelers that had recently arrived from Taiwan had tested positive for COVID-19 or its antibodies. Contact tracing and testing revealed no active cases or antibodies from past infections.\nOn 3 September a pharmacist in New Taipei City found evidence that masks received from the government's face-mask rationing program, which is supposed to supply domestically made, medical grade masks, were in fact non-medical grade masks imported from China. The company, identified as Carry Masks, had apparently imported the masks from China, relabeled them as \"made in Taiwan\" and as medical grade, and then distributed via the name-based rationing system. The owner of Carry Masks, Lin Ming-chin, admitted the next day in comments to the press that the masks were imported from China. However, he claimed that they were not of an inferior grade and had been imported to meet the excessive demand placed on his company by the government's rationing system, which was denied by multiple government officials. It was also revealed that the government had caught Carry Masks importing masks in March 2020 and had confiscated the masks and fined the company, but did not inform the public at the time. One other company was also under investigation for importing masks.On 22 September, a Kaohsiung-based manufacturer was accused on adding new production equipment without notifying or gaining approval from the mask rationing program, raising questions on their origin and quality. On 24 September, further arrests were made in Taichung of individuals suspected of also importing non-medical grade masks from China, though these were not distributed via the mask rationing program.\nIn response to these criminal probes, the government mandated that all masks distributed by the National Health Insurance system would be imprinted with the letters MD for \"Medical Device\" and MIT for \"Made in Taiwan\" to help combat mask fraud and assure their quality.\n\n\n==== Q4 ====\nOn 28 October, the CECC reported that one person had mistakenly been diagnosed with COVID-19 due to a mix-up of test samples taken upon arrival in Taiwan on 11 October. The patient, designated as Case 530, was initially diagnosed with COVID-19 and hospitalized, but a subsequent test showed no trace of the virus, prompting an investigation of all 30 individuals who had arrived at the same time. A DNA test of the sample proved that Case 530's sample had been misidentified for that of another patient, Case 536. Case 536 had mistakenly been allowed to return home for the mandatory 14-day quarantine period but was later correctly tested and diagnosed with COVID-19 on 16 October after developing symptoms. The error was apparently the result of incorrect manual operation of testing equipment, and the CECC implemented stronger \"error-proofing mechanisms\" to prevent misidentification of test samples and recommended an increase of personnel at ports of entry to prevent fatigue from causing more mistakes.On 29 October, Taiwan reported 200 days without local transmission of the coronavirus, becoming one of the only nations in the world to reach the milestone.On 9 November, it was announced the Taiwan was not invited to an assembly of the World Health Assembly of the World Health Organization, despite the country's success in the COVID-19 pandemic and petitions in support of its inclusion by over 2,000 legislators and diplomats from over seventy countries worldwide. It was stated that mainland China had \"obstructed\" Taiwan from entering the meeting. However, the 14 countries who recognize Taiwan as a sovereign state may introduce Taiwan's membership for discussion at the meeting.On 18 November, the CECC announced three major measures in response to the arrival of winter, a worldwide rise in cases (which led to active cases, all imported from abroad, tripling from 33 on 1 November to 103 on 30 November), and an expected rise in passenger traffic for several holidays. The measures will take effect from 1 December through 28 February 2021. First, all travelers, regardless of nationality, origin, or purpose for traveling to or transiting through Taiwan, must submit proof of testing negative for COVID-19 within three working days of arrival, with exceptions made for travelers arriving from countries where on-demand or self-paid tests are not available or travelers responding to family emergencies. Such travelers must be seated in a dedicated separate section of the aircraft and take a test immediately on arrival in Taiwan. Second, masks must be worn in high transmission risk areas, namely medical settings, public transportation, markets of any kind, educational institutions, entertainment venues, religious events, public events, and businesses, with the failure to do so subject to fines up to NT$15,000 (US$490). Third, it asked all medical institutions and local governments to step up screening measures for symptoms of COVID-19 in patients, noting that a major goal was to prevent the healthcare system from facing the double burden of seasonal influenza combined with an outbreak of COVID-19, as seen in other countries.A spike in imported COVID-19 cases among Indonesian migrant workers began on approximately 27 November but extended into December, prompting the CECC to suspend all migrant workers arriving from Indonesia from 4–17 December. Taiwan also banned eight Indonesian manpower agencies from operating in the country due to a large number of infected personnel they had sent to Taiwan. After bilateral talks between the two nations, Indonesia's Agency for the Protection of Indonesian Migrant Workers announced that it would investigate manpower agencies to help ensure none were negligent in observing health measures.On 16 December, the CECC announced it was \"indefinitely\" suspending the entry of Indonesian migrant workers.Two migrant workers were diagnosed after they had been released from quarantine and had shared a crowded open dormitory. There was a possibility that one had infected the other at that time, but the CECC announced it had determined that both workers were infected prior to arrival in Taiwan. However, in response to the risks posed by open dormitories, which are commonly used to house migrant workers across Taiwan while waiting to complete mandatory health checks unrelated to COVID-19, it issued new regulations requiring migrant workers to either stay in individual rooms or in dormitories with social distancing and sanitization measures for at least seven days after being released from quarantine. In addition, all migrant workers, with the exception of those originating in Malaysia, will be tested for COVID-19 at the end of their 14-day quarantine, with the cost of the test itself covered by the CECC and transportation costs to be covered by employers and labor brokers.On 22 December, a contact of a New Zealand pilot working for EVA Air who flew into Taiwan on 4 December was diagnosed with COVID-19, marking the first local transmission since April 2020. Local authorities stated they would fine the man NTD$300,000 (US$10,563) for not recording all the contacts and places he had visited and not wearing a face mask.\n\n\n=== 2021 ===\n\n\n==== Q1 ====\nOn 1 January 2021, new, stricter quarantine rules went into effect. Foreign flight crew were required to quarantine for seven days, and all entries must quarantine alone. Transit passengers are banned, as are most foreign entries.A domestic infection cluster was identified beginning 11 January at a hospital in northern Taiwan. Taiwanese media reported on 12 January that a mass evacuation of patients had begun and that the hospital had told local first responders to take emergency patients elsewhere. Later that day, the CECC confirmed that a doctor involved in treating COVID-19 patients had contracted the virus, making him the first medical professional in Taiwan to become infected in the course of their duties. At that time it was reported he had also infected his girlfriend, a nurse at the same hospital who did not treat COVID-19 patients.On 16 and 17 January, another nurse and doctor, respectively, at the same hospital were confirmed to be infected. They had come into contact with the first doctor. All the new cases' movements have been documented and publicized, with some sites around Taoyuan City undergoing disinfection after cases were confirmed to have visited them.Health and Welfare Minister and head of the CECC, Chen Shih-chung, was criticized for not naming the hospital in question, which he explained was out of concern of possible ostracization of hospital staff and patients. Depending on the level of contact with the infected doctors and nurses, their families, coworkers, and patients have been told whether to quarantine at home, monitor their own health, or continue as normal, and those with closest contact have been tested, some multiple times. As of 14 January, it was not deemed necessary to identify the hospital. However, on 18 January, he accidentally revealed to a reporter that the outbreak was occurring at Taoyuan General Hospital, and it has been generally acknowledged as such in the press since.As of 23 January the cluster had expanded to thirteen people involving 2 doctors, 4 nurses (plus three of their family members), 1 caregiver, and 1 patient (plus two of his family members). 967 people had been identified by contact tracing as possibly exposed to the virus and placed in quarantine.The cluster has prompted several cities, organizations, and event planners to cancel or postpone various celebrations for the upcoming Lunar New Year and Lantern Festival, and the Taiwan Railway Administration announced several measures to help curb potential spread during the high traffic volumes typically seen during the holidays, including partitions in food court areas and more infrared temperature sensors to bolster those already in place at station entrances.On 24 January, two more cases in the hospital cluster were identified, bringing the total to fifteen. However, neither had contact with the other cases during their treatment, and the circumstances of their infection remain unknown. In response, all inpatients present at Taoyuan General Hospital between 6 and 19 January, plus their close contacts, were required to go into 14-day quarantine. If fourteen days had already elapsed as of 24 January, they are required to adhere to self-health management protocols for seven days, such as recording their body temperature twice a day and avoiding all unnecessary travel.On 30 January, four more cases related to the cluster were diagnosed, bringing the total to nineteen, and among them was Taiwan's eighth death since the pandemic began, a relative of one of the infected nurses who was in her 80s and suffered from diabetes, high blood pressure, and heart problems. As a close contact of a confirmed case, she had been in home isolation since 18 January. She developed COVID-19 symptoms on 28 January and was diagnosed shortly before she died the night of 29 January. She was Taiwan's first COVID-19-related death since 11 May 2020. Two of the other cases were also relatives of the nurse. \nThe fourth domestic case was a man who visited his mother while she was being treated at another hospital in the Taoyuan area. He came into contact with an infected person who had been treated at Taoyuan General Hospital and was seeking medical attention again at another location.On 4 February, the CECC announced the death of the ninth victim of COVID-19 in Taiwan the night before on 3 February. The victim was a British national in his 70s who had come to visit family, developed symptoms in quarantine, and was admitted to a hospital on 29 December. He eventually developed several complications and died due in part to his age and cardiovascular disease. He was the first foreign national to die of COVID-19 in Taiwan.On 5 and 9 February two more domestic cases were identified, both of whom were family members of previously diagnosed nurses in the Taoyuan General Hospital cluster. The number of infected in the cluster stood at twenty-one as of 9 February. However, since the new cases had already been identified as close contacts of previous cases, they had been in quarantine for several days or weeks before they were diagnosed, and thus presented little risk of spreading the disease further.On 15 February, Health Minister Chen declared that the cluster had been successfully capped at twenty-one cases and one death. Taoyuan General Hospital reopened at reduced capacity on 19 February, and plans were announced to upgrade its COVID-19 wards to specialize in patients in serious condition from the virus, as well as gradually increase admittance to full capacity after several reviews of its readiness.\n\n\n==== Q2 ====\nOn 23 April, Taiwan confirmed its first locally-transmitted case of COVID-19 since 9 February. The patient is the teenage son of an Indonesian airline pilot for China Airlines living in Taiwan. The pilot was diagnosed in Australia after flying a cargo flight from Taiwan and experiencing symptoms, prompting Taiwanese health authorities to begin contact tracing. The pilot may have been infected by a coworker, also a pilot, who was recently in the United States. The three attended a religious service at the Taipei Grand Mosque on 16 April. It is still unclear whether this indicates a cluster infection, as the investigation is on-going. The cluster of infections eventually grew to over 30 cases.On 24 April, Taiwan reported its twelfth COVID-19-related death. The victim was a Taiwanese national in his seventies returning from the Philippines. He was staying at a quarantine hospital when he reported having no appetite on 19 April and was given a medical examination which found no other symptoms of COVID-19, so he returned to the hotel. On 21 April he was found in his room by hotel staff with no heartbeat. A post-mortem test revealed he was infected with the virus at the time of his death.In mid May, Taiwan saw a spike in cases. Seven new local cases were reported on 11 May, and 16 such cases – a record high in the pandemic – on 12 May. The government identified by 13 May, via DNA sequencing, the outbreak as having a link with the cluster at China airlines from April. President Tsai Ing-wen urged people not to panic. On 14 May, with 29 new community transmission cases  reported nationwide, business closures in Taipei and other northern counties were announced by local governments, to take effect the following day. Rapid testing stations were set up in Wanhua District, to which 16 of these cases were linked; this was a first in Taiwan during the pandemic. In the wake of 180 new domestic infections reported on 15 May, the alert level was raised in the Taipei area, which entailed shutting cinemas and entertainment spots, limiting gatherings to five indoors and 10 outdoors, and an encouragement by the government to work and study from home. The new restrictions did not affect the high-tech manufacturing hub in Hsinchu County.\n\n\n== Preventive measures ==\n\n\n=== Before first case reported ===\nOn 31 December 2019, Taiwan Centers for Disease Control (CDC) implemented inspection measures for inbound flights from Wuhan, China in response to reports of an unidentified outbreak. The passengers of all such flights were inspected by health officials before disembarking. Taiwan's Central News Agency reported that Luo Yi-jun, deputy director for Taiwan's Centers for Disease Control, had been reading on PTT in the early hours of New Year's Eve when a thread about an unknown disease causing pneumonia in Wuhan caught his attention. He saw a post including screenshots from a group chat with Li Wenliang. He immediately emailed colleagues and put the country on alert.A six-year-old passenger who arrived in Taiwan on 31 December after transferring in Wuhan and developed a fever was closely monitored by the CDC. At this time, there were 27 reported cases of the new pneumonia in Wuhan.By 5 January 2020, the Taiwan CDC began monitoring all individuals who had traveled to Wuhan within fourteen days and exhibited a fever or symptoms of upper respiratory tract infections. Said people were screened for 26 known pathogens, including SARS and Middle East respiratory syndrome; those testing positive were quarantined.On 20 January, the government deemed the risk posed by the outbreak sufficient to activate the Central Epidemic Command Center (CECC). Originally established as a level 3 government entity, the CECC was promoted to level 1 on 28 February. The CECC has coordinated government responses across areas including logistics for citizens on the Diamond Princess, disinfection of public spaces around schools, and providing briefings with Chen Shih-chung, the Minister of Health and Welfare.\n\n\n=== After first case reported ===\nOn 21 January, the same day that Taiwan's CDC reported the first confirmed case of the novel coronavirus in Taiwan, a level 3 travel alert to Wuhan was issued, recommending avoidance of all non-essential travels to the city.On 26 January, Taiwan suspended all air travel to and from China, and put in place quarantine measures for passengers who flew from China.On 24 January, the Taiwanese government announced a temporary ban on the export of face masks for one month to secure a supply of masks for its own citizens. The ban was extended twice; on 13 February until the end of April, and on 13 April until the end of June. On 6 February, the government instituted a mask rationing system, requiring citizens to present their National Health Insurance card. Prior to its implementation, the system was extended to holders of the Alien Resident Certificate, and people with valid entry permits. People with odd-numbered identity documents were permitted to buy masks on Mondays, Wednesdays, and Fridays; those with even-numbered identity documents were to buy masks on Tuesdays, Thursdays, and Saturdays; anyone is allowed to buy masks on Sundays. Adults were allowed to buy two masks each visit and children four, with the restriction that a minimum of seven days must elapse since the last purchase. The date restriction for children under thirteen years of age was revoked on 27 February. Starting on 5 March, adults were permitted to buy three masks weekly; the children's quota was raised to five. After 12 March, masks were available for preorder online. In April, the mask rationing system was revised, so that adults could buy nine masks every two weeks. From 9 April, the specific date restrictions are to be removed. In addition, Taiwanese nationals can send 30 masks every two months overseas to first or second-degree relatives. Taiwan's Ministry of Foreign Affairs assumed responsibility for distribution of masks to families of diplomats.\n\nOn 2 February 2020, Taiwan's Central Epidemic Command Center postponed the opening of primary and secondary schools until 25 February (originally 11 February). In early February 2020, Taiwan's \"Central Epidemic Command Center\" requested the mobilization of the Taiwanese Armed Forces in both containing the spread of the virus and in building up defenses against it. Soldiers were dispatched to the factory floors of major mask manufacturers to help staff the 62 additional mask production lines that were being set up at the time. In early March, Taiwan's average production of surgical face masks reached 9.2 million per day. By the end of March, the daily production of surgical face masks reached 13 million.\n\nThe Taiwan Tobacco and Liquor Corporation and the Taiwan Sugar Corporation increased production of 75 per cent alcohol for use in sanitation. On 25 February 2020, the Heping Women and Children's Hospital, a branch of the Taipei City Hospital, was specially designated to care for patients with coronavirus. From 4–31 March, the export of digital thermometers was banned. On 16 March, the Tsai Ing-wen presidential administration announced that Makalot Industrial and other Taiwanese companies would begin domestic mass production of protective gowns, ending a reliance on American imports from DuPont during the pandemic. A ban on the export of hand sanitizers and other disinfectants was announced on 1 May 2020.The Special Act for Prevention, Relief and Revitalization Measures for COVID-19 was passed by the Legislative Yuan on 25 February 2020, followed by a special budget for coronavirus expenses on 13 March 2020. The special budget was raised by an amendment passed on 21 April.As of 14 March, persons returning to Taiwan from most of Europe, plus persons who have transferred through China, Hong Kong, Macau, and Dubai, must quarantine in-home for 14 days. As of 17 March, foreign nationals permitted in the country, namely, those who hold Alien Resident Certificates or who are on urgent diplomatic, business or other special missions, can rent a room in a public quarantine center. On 20 March, the CECC has raised global travel notice to level 3; Taiwanese citizens are advised to avoid all nonessential travel. On 31 March, transportation and communications minister Lin Chia-lung announced that all passengers on trains and intercity buses were required to wear masks, as were people at highway rest stops. The Taiwan High Speed Rail Corporation installed thermal cameras at entrances to all twelve high speed rail stations. The Taiwan Railways Administration did the same for every one of its 239 stations. The CECC said on 3 April that passengers who refuse to wear masks after being asked to do so would be assessed a fine of NT$3,000 to NT$15,000, as stipulated by the Communicable Disease Control Act (傳染病防治法).\n\n\n=== Travel notices and border control ===\nDue to the coronavirus outbreak, Level 3 travel alerts have been issued by Taiwan for every country or region globally.\nTaiwanese authorities suspended tours to China starting in February 2020. The ban's duration was extended through April 2020, and expanded to cover Hong Kong and Macau.\nOn 31 January, Italy banned flights from Mainland China, Hong Kong, Macau, and Taiwan. However, China Airlines was permitted to fly Taiwanese nationals in Italy to Taiwan.Taiwan announced a ban on cruise ships entering all Taiwanese ports from 6 February.On 10 February, the Philippines announced a ban on the entry of Taiwanese citizens due to the One-China Policy. Later on 14 February, Presidential Spokesperson of Philippines, Salvador Panelo, announced the lifting of the temporary ban on Taiwan.On 23 February 2020, Taiwan banned frontline medical professionals working in hospitals from traveling to areas placed under a Level 3 travel alert. The ban is to remain in place until 30 June.\nOn 16 March, the Executive Yuan announced that teachers and students at the secondary school level and below were prohibited from overseas travel until July.Effective 19 March, foreign nationals were barred from entering Taiwan, with some exceptions, such as those carrying out the term of a business contract, holding valid Alien Resident Certificates, diplomatic credentials, or other official documentation and special permits. From 22 June, business travelers that remained within New Zealand, Australia, Macau, Palau, Fiji, Brunei, Vietnam, Hong Kong, Thailand, Mongolia, and Bhutan for fourteen days and planned to stay in Taiwan for less than three months were allowed to enter the country alongside a five-day mandatory quarantine instead of fourteen days. Starting on 25 June, passengers on China Airlines, EVA Air, and Cathay Pacific were permitted to transit through Taoyuan International Airport if they were connecting to another flight operated by the same airline, and their total stopover time was less than eight hours.On 8 July, the Ministry of Education announced that international students from eighteen countries, based on relative levels of COVID-19 infections, would be allowed to reenter Taiwan after their universities secured a permit on their behalf. Students from the selected countries of any year of study could qualify. On 22 July, the CECC announced it would further relax border control by allowing all international students in their final year of study at Taiwanese universities to return to complete their degrees. Accommodations for non-citizens seeking medical care in Taiwan were announced at the same time. Stipulations applied to both groups, including obtaining government permission beforehand and a mandatory 14-day quarantine in private or government facilities at the cost of the individual. International students and their universities may apply to return immediately; visitors seeking medical treatment may apply beginning 1 August.On 18 November, the CECC announced that from 1 December 2020 to 28 February 2021, all travelers arriving in or transiting through Taiwan must provide proof of testing negative for COVID-19 within three working days of arrival. This will apply to all persons regardless of nationality, origin, or purpose for entering the country.\n\n\n=== Face masks policy ===\n\nThe Taiwanese government announced on 24 January a ban on the export of face masks before the epidemic had spread to many countries, which caused controversy; however, after the outbreak of the epidemic, people rushed to buy masks in many countries around the world. (Incidents of face-mask confiscation by a government occurred in mainland China, the world's top face-mask manufacturer.)\nIn early February 2020 the Executive Yuan adopted the recommendations of professors Huang Li-min (黃立民) and Chang Shang-chwen of the National Taiwan University Medical School, advocating that healthy people do not need to wear masks in open spaces. On 8 February, Chen Shih-chung, commander of the Central Epidemic Prevention Center, further said there was no need to wear a mask on public transportation. This caused a storm of protest, concentrating on the point that public transportation such as buses and MRT carriages are confined spaces, and viruses are transmitted more easily there than in open spaces. (Mask-wearing has a tradition of social acceptance in East Asia – regardless of scientific debates over the effectiveness of masks in impeding the transmission of viruses.)\nIn early April, Taiwan President Tsai Ing-wen announced the donation of 10 million masks to countries which suffered severely from the coronavirus pandemic. In response to the donation, European Commission President Ursula von der Leyen wrote in a tweet that the European Union \"really appreciate[d] this gesture of solidarity\". The U.S. National Security Council also wrote a tweet thanking Taiwan's willingness to \"support and collaborate\" with the U.S. In a press conference on 1 April, the Chinese Ministry of Foreign Affairs spokesperson Hua Chunying responded to questions about the mask donations, advising anyone in Taiwan who would seek to politicize the pandemic to \"think twice and act prudently\".\n\n\n=== Vaccinations ===\nTaiwan has ordered 10 million doses of the AstraZeneca vaccine, 5 million doses of the Moderna vaccine, and 5 million doses through COVAX (of which 1.3 million are AstraZeneca vaccines).  Two domestic vaccines by Medigen Vaccine Biologics and United Biomedical are expected by July 2021.  A deal to purchase 5 million doses of the Pfizer-BioNTech vaccine is on hold indefinitely.On 3 March 2021, the first shipment of 117,000 doses of AstraZeneca vaccines arrived, with expiry date June 15.  It cleared regulatory approval on 18 March 2021 under an expedited process. On 4 April, the first shipment of vaccines through the COVAX program arrived, consisting of about 200,000 doses of the AstraZeneca vaccine with expiry date 31 May.  On 5 May, the Moderna vaccine received authorization for emergency use, in anticipation of delivery of its first batch.Taiwan's national immunization campaign aims to vaccinate 15 million people, or 64% of the population, in ten categories. Since the virus is not in free circulation among the populace, hospital and quarantine-center personnel will be the first to be vaccinated. When asked if top political leaders would be among the first to receive the vaccine, Health Minister Chen said that if there was widespread reluctance to receive the vaccine, President Tsai, Premier Su and Chen himself would be willing to demonstrate its safety, but will otherwise adhere to the current plan.  Chen and Su received their first doses on 22 March 2021.  As of 14 May 2021, 186,149 doses have been administered in Taiwan.\n\n\n== Statistics ==\n\nImported cases: 1,079; Locally transmitted cases: 550; Navy cases: 36; En route to Taiwan via aircraft: 2; Unknown: 1; Under investigation: 14; Misdiagnosed: 1\n\n\n== Economic impact ==\nAmid Taiwan's success in avoiding a mass lockdown that could have devastated the economy, the International Monetary Fund (IMF) forecasted Taiwan's 2020 annual gross domestic product (GDP) with a decline of 4%, lower than 6% average decline of most developed economies. Private analysts predict a contraction of just 1.2% of the GDP while the government remains optimistic of a growth of 1.92%.In an effort to mitigate the economic impact of this pandemic, the Executive Yuan proposed a stimulus package worth NT$60 billion (US$2 billion). On 25 February, the Legislative Yuan passed the stimulus package and Special Act for Prevention, Relief and Revitalization Measures for COVID-19. The Ministry of Economic Affairs had also introduced stimulus coupons to encourage citizens to buy commodities. Taiwan Capitalization Weighted Stock Index had decreased over 13.1% due to the coronavirus as of 12 March. Foreign investors have sold over NT$200 billion. Therefore, National Stabilization Fund decided on 19 March that it is essential to intervene in the stock market. On 3 April, Premier Su Tseng-chang announced an expansion of the stimulus package to NT$1.05 trillion.On 30 April, Taiwan published its GDP in the first quarter of 2020 which saw a growth of 1.52% year-on-year despite decreasing exports. In 31 July, the Directorate General of Budget, Accounting and Statistics publicize Taiwan's second quarter's GDP which contracted by 0.58%. (Preliminary GDP growth was 0.73%) But as the nation furtherly controlled the epidemic, the economy has begun to revive. After reporting a preliminary 3.33% growth in the Q3 GDP, the DGBAS furtherly finalized the GDP growth for the 3rd quarter which saw a steep increase to a 3.92% growth. Moreover, in late January 2021, the statistic bureau had published a preliminary forecast of 4.94% growth in Q4, marking the fastest growth by a single quarter since Q1 of 2011. Later, the DGBAS adjusted the preliminary estimates, increasing to 5.09% in Q4 and overall growth of 3.11% in 2020.Economic stimulus vouchers with a range of monetary values were made available in mid-July to Taiwanese citizens and foreign residents with a Taiwanese spouse. Vouchers were available via purchase and via special lotteries. They are targeted at specific industries, such as agriculture and tourism, and are set to expire on 31 December to help boost the sectors most affected by the pandemic.\n\n\n=== Aviation and tourism ===\nIn the aviation industry, Taiwanese carrier China Airlines's direct flights to Rome have first been rejected and cancelled since Italy has announced the ban on Taiwanese flights. The second-largest Taiwanese airline, EVA Air, has also postponed the launch of Milan and Phuket flights. Both Taiwanese airlines have cut numerous cross-strait destinations, leaving just three Chinese cities still served. As global cases emerge, air demands for traveling have been decreasing, leaving the country's largest airport, Taoyuan International Airport, with just 669 passengers arriving or departing without any passenger in Terminal 1 at the lowest point. This led to a reconsideration of reducing the number of boarding gates to 18. On 13 May, EVA Air reported a net loss of NT$1.2 billion because of low demand caused by the pandemic.Starlux Airlines, a start-up airline that launched its first flights on 23 January 2020, shut down most of its routes only a month after its launch.Subsequent to the ease of COVID-19 in Taiwan, domestic tourism has substantially increased especially in Penghu. As a result, Penghu has been overwhelmed by the barrage of visitors. Therefore, the local government has considered to charge each traveler traveling fees to maintain the quality of local tourism, although this charge has not eventuated as of the beginning of September 2020.\n\n\n=== Sports ===\nOn 12 April, the Chinese Professional Baseball League (CPBL) resumed its 2020 regular-season play before empty stadiums.  The league quickly hired English announcers as this proved to be the only professional baseball season being played in the world.  James Lin, a representative of CPBL's international affairs division, said, \"It shows that it's possible to contain the situation, and to return to some semblance of normality.\" To protect player health, the league banned the consumption of sunflower seeds and dipping tobacco, as the use of those products requires spitting. Starting 8 May, a maximum of 1,000 fans were permitted to attend games. However, concession stands at ballparks remained closed, and spectators were not allowed to bring their own food. From 15 May, 2,000 spectators were allowed into ballparks, and the league began providing fans with lunchboxes, as the ban on outside food remained in effect. Starting on 7 June, stadiums admitted fans to half capacity.\n\n\n== Evacuations related to the pandemic ==\n\n\n== Domestic response ==\nIn an opinion poll conducted by Taiwan's TVBS published on 26 March, health minister Chen Shih-chung received an approval rating of 91%, much higher than any other Taiwanese politician, including Tsai Ing-wen. Taiwanese are particularly reassured by Chen's swift response, timely orders and candid communication style. In the same TVBS poll, 84% of respondents approved of COVID-19 measures taken by the Tsai administration. In another poll conducted by the Taiwanese Public Opinion Foundation after the government's inauguration of the second term shows a 71% approval rate of Tsai Ing-wen's handling of national affairs, 69% faithfulness of the DPP government, and 55% satisfactory of the government's financial relief measures.\n\n\n== International responses ==\nTaiwan's early deployment of epidemic control measures and follow-up actions have received international praise and approval. On 13 March 2020, the Taiwanese Ministry of Foreign Affairs arranged for the Minister of Health, Chen Shih-chung, to have a meeting with envoys and representatives from various countries, and the epidemic prevention methods were affirmed. Taiwan donated a total of 10 million masks with 7 million masks to Europe (Italy, Spain, Germany, France, Belgium, Netherland, Luxembourg, Czechia, Poland, the United Kingdom, and Switzerland), 2 million to United States, and 1 million to diplomatic allies on 1 April 2020.\n\n\n=== Australia ===\nIn an interview, medical researcher Ih-Jen Su told Australian media not to trust the accuracy of data from China or the World Health Organization (WHO). He told them that data from WHO lags behind the real situation. Journalist Eryk Bradshaw wrote an article about Taiwan entitled: A population the same as Australia's but a fraction of the coronavirus cases.\n\n\n=== Canada ===\nThe Canadian Broadcasting Corporation (CBC) pointed out several measures that Taiwan has taken to prevent community spread of the coronavirus, emphasizing that Taiwan has used lessons learned during the 2002–2004 SARS outbreak to combat the coronavirus pandemic. On 8 May, Canadian Prime Minister Justin Trudeau thanked Taiwan for its donation of 500,000 masks after his foreign minister, François-Philippe Champagne, refused to do so.\n\n\n=== Czech Republic ===\nAfter Prague established sister city ties with the capital city of Taiwan, Taipei, on 13 January 2020, Shanghai announced an end to its relationship with Prague. Later in April, Prague Mayor Zdeněk Hřib, a physician who interned at a hospital at Taipei as a student, criticized the Chinese government for \"manipulating the pandemic\": specifically, seizing a business opportunity to sell medical equipment to the Czech Republic instead of donating. In addition, several countries including the Czech Republic had returned test kits and ventilators sold by the Chinese authorities after discovering that they were unusable.\n\n\n=== Denmark ===\nFormer Prime Minister of Denmark, Anders Fogh Rasmussen, wrote an article for Time in favor of Taiwanese participation within international organizations such as the World Health Organization in an effort to prevent future deaths. He has compared preventive actions taken by the Taiwanese government vis-à-vis other countries, and expressed the belief that other nations should have implemented such measures.\n\n\n=== Germany ===\nGerman politician Sandra Bubendorfer-Licht described the Taiwanese response to the virus as outstanding.\n\n\n=== Israel ===\nIsraeli Prime Minister Benjamin Netanyahu indicated that the Israeli government would use Taiwan's experience to fight the epidemic.\n\n\n=== Japan ===\nOn 10 March, the Japanese news site Foresight published an article by a freelance journalist familiar with Taiwan affairs, Nojima, analyzing Taiwan's policy decisions regarding the epidemic. Japanese media also carried out long reports on Chen Shih-chung, Audrey Tang, with Tang receiving the most attention in Japan.\n\n\n=== People's Republic of China ===\nFalse reports of the outbreak spreading out of control in Southern Taiwan from PRC netizens began in early January.\n\n\n=== New Zealand ===\nOn 15 March, Prime Minister Jacinda Ardern said New Zealand would follow Taiwan's example in their strategy to fight the epidemic. Several news outlets in New Zealand have also mentioned what Taiwan has done to prevent the coronavirus. TVNZ1 also reported Taiwan in the Saturday 6 pm Headline. New Zealand Foreign Minister Winston Peters voiced support for Taiwan's participation in the World Health Assembly on 12 May despite China's protest. Commentaries have praised Taiwan as the de facto inspiration and role model behind New Zealand's success.\n\n\n=== South Korea ===\nDuring late February, when South Korea was suffering from its own domestic outbreak, supplies of masks were running out. The South Korean media started to emphasize Taiwan's masks policies, including ban on masks exports and masks selling policies, while criticizing the South Korean government for being too slow to react.\n\n\n=== United States ===\nU.S. newspapers and magazines have suggested Taiwan and other Asian nations have done a better job at combating the coronavirus than the U.S., and mentioned how Taiwan has banned the export of masks and boosted mask production. On 28 May, Guam announced to allow South Korean, Japanese, and Taiwanese tourists to enter the American territory without mandatory quarantine starting from 1 July. However, on 26 June, the reopening of tourism in Guam has been pushed back 30 days.\n\n\n== International status ==\n\n\n=== International Civil Aviation Organization ===\nThe International Civil Aviation Organization (ICAO), a specialized civil aviation agency of the United Nations, rejected Taiwan's participation amid the novel coronavirus outbreak, which impacted Taiwan's ability to gather relevant information from said international organization. The Republic of China was the founding member of the ICAO until 1971, when its membership was transferred to the PRC despite losing much of its territory in the late stages of the Chinese Civil War.In response to public inquiry regarding the organization's decision on Twitter, ICAO commented that their action is intended to \"defend the integrity of the information\". The United Nations Secretary General described these inquiries as a misinformation campaign targeting ICAO.\n\n\n=== World Health Organization ===\nThe World Health Organization (WHO) have listed Taiwan as part of China, which resulted in multiple countries including Italy, Vietnam, and the Philippines briefly banning flights from Taiwan in January and February 2020, despite the disease not then having reached epidemic status in Taiwan.Johns Hopkins University Coronavirus Research Center hosted an interactive map which initially listed Taiwan under the category \"country/region\", along with Mainland China, Hong Kong, and Macau. On 10 March, Taiwan's name was switched to \"Taipei and environs,\" a designation used by the World Health Organization. When a news organization reached out, the associate professor in charge of the project claimed they would be changing it back to Taiwan immediately. By 12 March, Taiwan was restored to the map, and the university said it would adhere to naming conventions developed by the United States Department of State.Although Taiwan is excluded from the World Health Organization due to opposition from China, and thus has limited access to shared scientific information and data, the country's response has been lauded in international press. Despite its proximity to China and large human flows, Taiwan has recorded the lowest incidence rate per capita – around 1 in every 500,000 people. Success factors cited have included the fact that the country's vice president, Chen Chien-jen, is an epidemiologist who had obtained a doctoral degree at the Johns Hopkins Bloomberg School of Public Health; and the lessons learned from the SARS epidemic in 2003, which had hit Taiwan hard. Infrastructure, including the establishment of a national health command center integrating relevant agencies; data analytics; policies aimed at keeping health care affordable; and extensive educational outreach were put in place following the SARS outbreak. Researchers at Stanford Health Policy researcher published an article in the Journal of the American Medical Association arguing that Taiwan's action plan – which included 124 discrete actions and coordination to be implemented in the first instance – including travel bans, quarantines, surveillance steps, social distancing – had saved Taiwan from a serious epidemic.\n\n\n=== Allegation of Racist Abuse of WHO Director-General ===\nOn 8 April 2020, Tedros Adhanom, the Director-General of WHO, claimed that he was subjected to racist abuse and death threats emanating from Taiwan. He also claimed that the Taiwanese authorities not only knew about the abuse, but also criticized him rather than disassociate themselves from said racist attacks.On 9 April, Taiwan demanded an immediate apology from Tedros and called his accusations \"imaginary\". The Taiwanese media claimed that Taiwan is open and friendly to all races and noted that it has historically given African doctors medical training. An Ethiopian doctor living in Taiwan, interviewed by Taiwan News, claimed that Taiwan is not a racist country.\n\n\n=== Interview with Bruce Aylward ===\nOn 28 March, Yvonne Tong of the Hong Kong-based news channel The Pulse interviewed Bruce Aylward, assistant director-general of the World Health Organization. In response to a question on whether the WHO would reconsider Taiwan's membership after Taiwan accused China of denying it entry, he asked if he was still on the line, claiming that he did not hear the question, blaming internet connection issues. Tong offered to repeat the question, but was interrupted by Aylward, who suggested she move on. Tong repeated the question, at which point Aylward terminated the call. When Tong called back and asked him to \"comment a bit on how Taiwan has done so far,\" Aylward said he had \"already talked about China\" and proceeded to end the interview.Aylward's response was met with outrage and mockery. His biography was subsequently removed from the World Health Organization's website. However, a spokesman for the WHO explained that it was removed after a request from Aylward's staff on 27 March to archive it, because he was being misidentified by media. \"The timing was unfortunate as the video interview went viral shortly after this,\" the spokesman said. As of August 2020, his biography is still included on the WHO website.\n\n\n=== Renaming China Airlines ===\nTaiwan's national carrier China Airlines aided the distribution of face masks and other medical equipment abroad, which led to a reconsideration of a name change, due to worries of confusion in differing itself from China-based carriers. In the Legislative Yuan, Minister of Transportation and Communications Lin Chia-lung expressed his concerns of confusion over the nationality of the country's largest air carrier. Lin acknowledged that shareholders and members of the public would need to approve any new name. Although the monetary cost and possible slot time losses were potential obstacles to the airline's renaming, both Lin and Premier Su Tseng-chang supported the renaming. Su and deputy transportation minister Wang Kwo-tsai said that the government would consider adding Taiwan-centric elements to China Airlines aircraft. Subsequently, bills were proposed by the Democratic Progressive Party and New Power Party regarding a redesign of aircraft livery. On 22 July 2020, a legislative resolution passed, stating that China Airlines should place Taiwanese motifs on aircraft fuselages, while a formal English-language name change for the airline should be considered by the Ministry of Transportation and Communications.\n\n\n=== United States ===\n\nOn 4 March, the House of Representatives unanimously (415–0) passed a modified version of the TAIPEI Act, with the goal of supporting Taiwan's attempts to join international organizations. On 11 March, the Senate unanimously passed the House's version of the TAIPEI Act. On 27 March, U.S. President Donald Trump signed the TAIPEI Act into law. The TAIPEI Act was denounced by the Chinese (PRC) government.On 18 March, the American Institute in Taiwan announced that the United States would cooperate with Taiwan on researching and developing vaccines and rapid tests. The United States and Taiwan jointly held an online forum which focused on the participation of Taiwan in the World Health Organization, and how to share the success that Taiwan has achieved throughout the pandemic. Chinese Foreign Ministry spokesperson Hua Chunying criticized this action as political manipulation.\n\n\n== Gallery ==\n\n\t\t\n\t\t\n\t\t\n\n\n== See also ==\nAfrican swine fever virus prevention efforts in Taiwan\n\n\n== References ==\n\n\n== External links ==\n\nTwitter追蹤破百萬 小英總統有話要說！A Message from President Of the Republic of China, Tsai Ing-wen to the International Community (in English)\n防疫大作戰團結一心 守護臺灣 Message from Vice President Chen Chien-jen (in Min Nan Chinese)"