"The COVID-19 pandemic in Taiwan is part of the worldwide pandemic of coronavirus disease 2019 (COVID-19) caused by severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2). The pandemic has had a smaller impact in Taiwan than in most other industrialized countries, with a total of eleven deaths as of 11 April 2021, a rate of 0.042 deaths per 100,000 people. The number of active cases peaked on 6 April 2020 at 307 cases, the overwhelming majority of which were imported.The virus was confirmed to have spread to Taiwan on 21 January 2020, with the first case being a 50-year-old woman who had been teaching in Wuhan, China. The Taiwanese government integrated data from the national health care system, immigration, and customs authorities to aid in the identification and response to the virus. Government efforts are coordinated through the National Health Command Center (NHCC) of the Taiwan Centers for Disease Control, established to aid in disaster management for epidemics following the 2004 SARS outbreak.The Journal of the American Medical Association says Taiwan engaged in 124 discrete action items to prevent the spread of the disease, including early screening of flights from Mainland China and the tracking of individual cases.Taiwan's handling of the outbreak has received international praise for its effectiveness in quarantining people. As of 16 May, 571,259 tests had been conducted in Taiwan, with the vast majority not confirming a COVID-19 diagnosis.Starting 19 March 2020, foreign nationals were barred from entering Taiwan, with some exceptions, such as those carrying out the remainder of business contracts, and those holding valid Alien Resident Certificates, diplomatic credentials, or other official documentation and special permits. Restrictions have since been relaxed for foreign university students and those seeking medical treatment in Taiwan, subject to prior government approval. All who are admitted into the country must complete a fourteen-day quarantine upon arrival, except for business travelers from countries determined to be at low or moderate risk, who are subject to five- or seven-day quarantines and must submit to a COVID-19 test.However, in response to a worldwide spike in cases in October and November 2020, Taiwan announced that all travelers to and through Taiwan, regardless of nationality, origin, or purpose, must submit a negative COVID-19 test performed within three working days of arrival. Exceptions are granted to travelers responding to family emergencies or arriving from countries where on-demand or self-paid tests are unavailable, who must be seated apart from other passengers and take a self-paid test immediately on arrival in Taiwan."