"Planet Master is the name of two fictional characters appearing in comics published by DC Comics. The first Planet Master, a scientist called Irving Norbert and his lab assistant, who would later take on the name and costume, first appeared in Detective Comics #296 in October, 1961. The characters were created by writer Bill Finger and artist Jim Mooney.\n\n\n== Fictional character biographies ==\n\n\n=== Irving Norbert ===\nProfessor Irving Norbert is a scientist who was exposed to the gases of a meteor. The result caused him to develop a Jekyll and Hyde-type personality with the bad one turning to a life of crime. Using his knowledge of astronomy, Norbert became a costumed villain named Planet Master and used weapons based on the nine planets. He managed to outwit Batman and Robin in the first battle. Norbert's unscrupulous assistant Edward Burke discovered the double identity of his boss and decided to either join forces with Planet Master or to use his equipment on his own. Ultimately though, the effects of the gas wore off. Norbert's criminal self was erased and Batman brought Burke to justice.\n\n\n=== Edward Burke ===\nWhen Kobra was creating a strike-force called Strike Force Kobra to usurp Stagg Enterprises in his goal of world domination, one of the villains he created was patterned after the original Planet Master. What makes this version different from the original is that he can simulate the abilities of the other planets. He, alongside the other members of Strike Force Kobra, fought the Outsiders and was defeated.Although never stated, it is possible that this Planet Master is Edward Burke (who was the former assistant of the first Planet Master). Even years ago, Burke planned to use the original Planet Master's equipment in crime.\nEither way, this Planet Master popped up during the \"Infinite Crisis\" storyline as a member of Alexander Luthor Jr.'s Secret Society of Super Villains where he was seen during the Battle of Metropolis.\n\n\n== Powers and abilities ==\nThe first Planet Master uses weapons based on the planets.\nThe second Planet Master could simulate the conditions typical to any of the nine planets in our solar system. For example, he can use the speed of Mercury, the heat of Mars, the strength of Jupiter, the rings of Saturn, and the cold of Pluto.\n\n\n== In other media ==\nA hybridized version of Planet Master appears in the Batman: The Brave and the Bold animated television series, voiced by Stephen Root. While this version resembles the Irving Norbert incarnation, his powers are similar to the Edward Burke incarnation. In the episode \"Aquaman's Outrageous Adventure\", the eponymous character is on vacation when he sees Planet Master fighting the Blue Beetle on the news. While his family is busy, Aquaman leaves to assist the latter in defeating the former. Planet Master also makes a non-speaking cameo appearance in the episode \"A Bad Divided.Edward Burke can be heard in the \"A Matter of Family\" DLC for the video game Batman: Arkham Knight, voiced by JB Blanc. Throughout several audio tapes, this version is depicted as a billionaire whose daughter is dying of cancer. He is approached by Dr. Penelope Young, Dr. Harleen Quinzel, and the Joker under the alias of \"Jack White\" to cure her while Burke built the Seaside Amusement Park as a favor to White, though Burke's daughter died regardless. Devastated, Burke gives ownership of the park to White and is driven to suicide with pills that were later revealed to have been laced with Joker venom.\n\n\n== See also ==\nList of Batman family enemies\n\n\n== References ==\n\n\n== External links ==\nPlanet Master I's bio\nPlanet Master II's bio"