"Muromtsevsky District (Russian: Му́ромцевский райо́н) is an administrative and municipal district (raion), one of the thirty-two in Omsk Oblast, Russia. It is located in the east of the oblast. The area of the district is 6,700 square kilometers (2,600 sq mi). Its administrative center is the urban locality (a work settlement) of Muromtsevo. Population: 23,795 (2010 Census);  28,380 (2002 Census); 31,935 (1989 Census). The population of Muromtsevo accounts for 45.3% of the district's total population.\n\n\n== References ==\n\n\n=== Notes ===\n\n\n=== Sources ===\nЗаконодательное Собрание Омской области. Закон №467-ОЗ от 15 октября 2003 г. «Об административно-территориальном устройстве Омской области и о порядке его изменения», в ред. Закона №1591-ОЗ от 10 декабря 2013 г. «О внесении изменений в отдельные Законы Омской области в связи с принятием Федерального Закона \"Об образовании в Российской Федерации\"». Вступил в силу через три месяца со дня официального опубликования. Опубликован: \"Омский вестник\", №69, 31 октября 2003 г. (Legislative Assembly of Omsk Oblast. Law #467-OZ of October 15, 2003 On the Administrative-Territorial Structure of Omsk Oblast and on the Procedures of Its Change, as amended by the Law #1591-OZ of December 10, 2013 On Amending Various Laws of Omsk Oblast Due to the Adoption of the Federal Law \"On Education in the Russian Federation\". Effective as of the day three months after the official publication date.).\nЗаконодательное Собрание Омской области. Закон №548-ОЗ от 30 июля 2004 г. «О границах и статусе муниципальных образований Омской области», в ред. Закона №1642-ОЗ от 27 июня 2014 г. «О внесении изменений в Закон Омской области \"О границах и статусе муниципальных образований Омской области\"». Вступил в силу со дня официального опубликования. Опубликован: \"Омский вестник\", №45, №47, №49, 13, 20, 27 августа 2004 г. (Legislative Assembly of Omsk Oblast. Law #548-OZ of July 30, 2004 On the Borders and Status of the Municipal Formations of Omsk Oblast, as amended by the Law #1642-OZ of June 27, 2014 On Amending the Law of Omsk Oblast \"On the Borders and Status of the Municipal Formations of Omsk Oblast\". Effective as of the day of the official publication.)."