{
  "title": "INASRA",
  "spine": [
    [
      "F",
      "R",
      "a",
      "n",
      "c",
      "e",
      " ",
      " ",
      " ",
      " ",
      " ",
      " "
    ],
    [
      " ",
      "o",
      " ",
      " ",
      " ",
      " ",
      " ",
      " ",
      " ",
      " ",
      " ",
      " "
    ],
    [
      " ",
      "m",
      " ",
      " ",
      " ",
      " ",
      " ",
      " ",
      " ",
      " ",
      " ",
      " "
    ],
    [
      " ",
      "A",
      "l",
      "L",
      "o",
      "b",
      "r",
      "o",
      "g",
      "e",
      "s",
      " "
    ],
    [
      " ",
      "n",
      " ",
      "i",
      " ",
      " ",
      " ",
      " ",
      " ",
      " ",
      " ",
      " "
    ],
    [
      " ",
      "G",
      " ",
      "N",
      "e",
      "m",
      "e",
      "t",
      "u",
      "r",
      "i",
      "i"
    ],
    [
      " ",
      "a",
      " ",
      "g",
      " ",
      " ",
      " ",
      " ",
      " ",
      " ",
      " ",
      " "
    ],
    [
      " ",
      "u",
      " ",
      "o",
      " ",
      " ",
      " ",
      " ",
      " ",
      " ",
      " ",
      " "
    ],
    [
      " ",
      "l",
      " ",
      "n",
      " ",
      " ",
      " ",
      " ",
      " ",
      " ",
      " ",
      " "
    ],
    [
      " ",
      " ",
      " ",
      "e",
      " ",
      " ",
      " ",
      " ",
      " ",
      " ",
      " ",
      " "
    ],
    [
      " ",
      " ",
      " ",
      "s",
      " ",
      " ",
      " ",
      " ",
      " ",
      " ",
      " ",
      " "
    ]
  ],
  "metadata": {
    "Nemeturii": {
      "links": [
        "Azovo, Omsk Oblast",
        "Krasny Yar, Omsk Oblast",
        "Tevrizsky District",
        "Moskalensky District",
        "Germans",
        "Isilkulsky District",
        "Lyubinsky District",
        "List of rural localities in Omsk Oblast",
        "Selsoviet",
        "Kormilovsky District",
        "Ukrainians",
        "Urban-type settlement",
        "Tavricheskoye, Omsk Oblast",
        "OKTMO",
        "Coat of arms of Azovsky Nemetsky National District",
        "Tyukalinsky District",
        "Poltavka, Poltavsky District, Omsk Oblast",
        "Pavlogradsky District",
        "Tyukalinsk",
        "Sargatsky District",
        "Kalachinsky District",
        "Poltavsky District",
        "Krutinsky District",
        "Cherlak, Cherlaksky District, Omsk Oblast",
        "Muromtsevo, Omsk Oblast",
        "Muromtsevsky District",
        "Rural area",
        "Azovsky District",
        "Bolsherechye, Omsk Oblast",
        "Lyubinsky ",
        "Bolsherechensky District",
        "UTC+six",
        "Maryanovka, Omsk Oblast",
        "Urban area",
        "Russko-Polyansky District",
        "Nazyvayevsky District",
        "Bolshegrivskoye",
        "Moskalenki, Omsk Oblast",
        "Isilkul",
        "Sedelnikovsky District",
        "Time zone",
        "Russian Census ",
        "Volga Germans",
        "Omsky District",
        "Kolosovsky District",
        "History of Germans in Russia, Ukraine and the Soviet Union",
        "Okoneshnikovo",
        "Village",
        "Novovarshavka",
        "Omsk Oblast",
        "Kazakhs",
        "Geographic coordinate system",
        "Maryanovsky District",
        "Russia",
        "Sherbakul",
        "Krutinka",
        "VIAF ",
        "Types of inhabited localities in Russia",
        "Omsk Time",
        "Russian language",
        "Federal subjects of Russia",
        "Kormilovka",
        "Ust-Ishimsky District",
        "Nazyvayevsk",
        "Sherbakulsky District",
        "Nizhneomsky District",
        "WorldCat Identities ",
        "Russians",
        "Administrative divisions of Omsk Oblast",
        "Kalachinsk",
        "Cherlaksky District",
        "Subdivisions of Russia",
        "Pavlogradka",
        "Flag of Azovsky Nemetsky National District",
        "Tara, Omsk Oblast",
        "History of Germans in Russia and the Soviet Union",
        "Sargatskoye",
        "Tevriz",
        "Russkaya Polyana ",
        "Gorkovskoye, Omsk Oblast",
        "Gorkovsky District",
        "Novovarshavsky District",
        "Odessky District",
        "Oblast",
        "Tavrichesky District",
        "Tarsky District",
        "Omsk",
        "Russian Federal State Statistics Service",
        "German language",
        "Chernoluchinsky",
        "Administrative center",
        "Nemetsky National District",
        "Districts of Russia",
        "Raion",
        "Okoneshnikovsky District",
        "Bolsheukovsky District",
        "Znamensky District, Omsk Oblast"
      ],
      "content": "Azovsky Nemetsky (German) National District (Russian: \u0410\u0437\u043e\u0301\u0432\u0441\u043a\u0438\u0439 \u041d\u0435\u043c\u0435\u0301\u0446\u043a\u0438\u0439 \u043d\u0430\u0446\u0438\u043e\u043d\u0430\u0301\u043b\u044c\u043d\u044b\u0439 \u0440\u0430\u0439\u043e\u0301\u043d; German: Deutscher Nationalkreis Asowo) is an administrative and municipal district (raion), one of the thirty-two in Omsk Oblast, Russia. It is located in the south of the oblast. The area of the district is 1,400 square kilometers (540 sq mi). Its administrative center is the rural locality (a selo) of Azovo. In the Russian Census of 2010, the population was 22,925. The population of Azovo accounts for 26.2% of the district's total population.\n\n\n== History ==\nThe first villages in what is now Azovsky Nemetsky National District were founded in 1893 by the Volga Germans.\n\n\n== Politics ==\nHeads of the district administration were Bruno Heinrich Reuters (1992-2010) and Viktor Sabelfeld (2010-present).\n\n\n== Demographics ==\nThe population of the district as of January 1, 2007 was 22,246, of which 56% were Russians, 24% Germans, 8.3% Kazakhs, and 6.8% Ukrainians.Being considered a cultural heritage, and in order for the Azovsky Nemetsky National District to be a refuge for the dispersed and diminished Russlanddeutsche, the German language is officially endorsed, i.e., protected, supported and promoted.\n\n\n== See also ==\nHistory of Germans in Russia and the Soviet Union\n\n\n== References ==\n\n\n=== Notes ===\n\n\n=== Sources ===\n\u0417\u0430\u043a\u043e\u043d\u043e\u0434\u0430\u0442\u0435\u043b\u044c\u043d\u043e\u0435 \u0421\u043e\u0431\u0440\u0430\u043d\u0438\u0435 \u041e\u043c\u0441\u043a\u043e\u0439 \u043e\u0431\u043b\u0430\u0441\u0442\u0438. \u0417\u0430\u043a\u043e\u043d \u2116467-\u041e\u0417 \u043e\u0442 15 \u043e\u043a\u0442\u044f\u0431\u0440\u044f 2003 \u0433. \u00ab\u041e\u0431 \u0430\u0434\u043c\u0438\u043d\u0438\u0441\u0442\u0440\u0430\u0442\u0438\u0432\u043d\u043e-\u0442\u0435\u0440\u0440\u0438\u0442\u043e\u0440\u0438\u0430\u043b\u044c\u043d\u043e\u043c \u0443\u0441\u0442\u0440\u043e\u0439\u0441\u0442\u0432\u0435 \u041e\u043c\u0441\u043a\u043e\u0439 \u043e\u0431\u043b\u0430\u0441\u0442\u0438 \u0438 \u043e \u043f\u043e\u0440\u044f\u0434\u043a\u0435 \u0435\u0433\u043e \u0438\u0437\u043c\u0435\u043d\u0435\u043d\u0438\u044f\u00bb, \u0432 \u0440\u0435\u0434. \u0417\u0430\u043a\u043e\u043d\u0430 \u21161591-\u041e\u0417 \u043e\u0442 10 \u0434\u0435\u043a\u0430\u0431\u0440\u044f 2013 \u0433. \u00ab\u041e \u0432\u043d\u0435\u0441\u0435\u043d\u0438\u0438 \u0438\u0437\u043c\u0435\u043d\u0435\u043d\u0438\u0439 \u0432 \u043e\u0442\u0434\u0435\u043b\u044c\u043d\u044b\u0435 \u0417\u0430\u043a\u043e\u043d\u044b \u041e\u043c\u0441\u043a\u043e\u0439 \u043e\u0431\u043b\u0430\u0441\u0442\u0438 \u0432 \u0441\u0432\u044f\u0437\u0438 \u0441 \u043f\u0440\u0438\u043d\u044f\u0442\u0438\u0435\u043c \u0424\u0435\u0434\u0435\u0440\u0430\u043b\u044c\u043d\u043e\u0433\u043e \u0417\u0430\u043a\u043e\u043d\u0430 \"\u041e\u0431 \u043e\u0431\u0440\u0430\u0437\u043e\u0432\u0430\u043d\u0438\u0438 \u0432 \u0420\u043e\u0441\u0441\u0438\u0439\u0441\u043a\u043e\u0439 \u0424\u0435\u0434\u0435\u0440\u0430\u0446\u0438\u0438\"\u00bb. \u0412\u0441\u0442\u0443\u043f\u0438\u043b \u0432 \u0441\u0438\u043b\u0443 \u0447\u0435\u0440\u0435\u0437 \u0442\u0440\u0438 \u043c\u0435\u0441\u044f\u0446\u0430 \u0441\u043e \u0434\u043d\u044f \u043e\u0444\u0438\u0446\u0438\u0430\u043b\u044c\u043d\u043e\u0433\u043e \u043e\u043f\u0443\u0431\u043b\u0438\u043a\u043e\u0432\u0430\u043d\u0438\u044f. \u041e\u043f\u0443\u0431\u043b\u0438\u043a\u043e\u0432\u0430\u043d: \"\u041e\u043c\u0441\u043a\u0438\u0439 \u0432\u0435\u0441\u0442\u043d\u0438\u043a\", \u211669, 31 \u043e\u043a\u0442\u044f\u0431\u0440\u044f 2003 \u0433. (Legislative Assembly of Omsk Oblast. Law #467-OZ of October 15, 2003 On the Administrative-Territorial Structure of Omsk Oblast and on the Procedures of Its Change, as amended by the Law #1591-OZ of December 10, 2013 On Amending Various Laws of Omsk Oblast Due to the Adoption of the Federal Law \"On Education in the Russian Federation\". Effective as of the day three months after the official publication date.).\n\u0417\u0430\u043a\u043e\u043d\u043e\u0434\u0430\u0442\u0435\u043b\u044c\u043d\u043e\u0435 \u0421\u043e\u0431\u0440\u0430\u043d\u0438\u0435 \u041e\u043c\u0441\u043a\u043e\u0439 \u043e\u0431\u043b\u0430\u0441\u0442\u0438. \u0417\u0430\u043a\u043e\u043d \u2116548-\u041e\u0417 \u043e\u0442 30 \u0438\u044e\u043b\u044f 2004 \u0433. \u00ab\u041e \u0433\u0440\u0430\u043d\u0438\u0446\u0430\u0445 \u0438 \u0441\u0442\u0430\u0442\u0443\u0441\u0435 \u043c\u0443\u043d\u0438\u0446\u0438\u043f\u0430\u043b\u044c\u043d\u044b\u0445 \u043e\u0431\u0440\u0430\u0437\u043e\u0432\u0430\u043d\u0438\u0439 \u041e\u043c\u0441\u043a\u043e\u0439 \u043e\u0431\u043b\u0430\u0441\u0442\u0438\u00bb, \u0432 \u0440\u0435\u0434. \u0417\u0430\u043a\u043e\u043d\u0430 \u21161642-\u041e\u0417 \u043e\u0442 27 \u0438\u044e\u043d\u044f 2014 \u0433. \u00ab\u041e \u0432\u043d\u0435\u0441\u0435\u043d\u0438\u0438 \u0438\u0437\u043c\u0435\u043d\u0435\u043d\u0438\u0439 \u0432 \u0417\u0430\u043a\u043e\u043d \u041e\u043c\u0441\u043a\u043e\u0439 \u043e\u0431\u043b\u0430\u0441\u0442\u0438 \"\u041e \u0433\u0440\u0430\u043d\u0438\u0446\u0430\u0445 \u0438 \u0441\u0442\u0430\u0442\u0443\u0441\u0435 \u043c\u0443\u043d\u0438\u0446\u0438\u043f\u0430\u043b\u044c\u043d\u044b\u0445 \u043e\u0431\u0440\u0430\u0437\u043e\u0432\u0430\u043d\u0438\u0439 \u041e\u043c\u0441\u043a\u043e\u0439 \u043e\u0431\u043b\u0430\u0441\u0442\u0438\"\u00bb. \u0412\u0441\u0442\u0443\u043f\u0438\u043b \u0432 \u0441\u0438\u043b\u0443 \u0441\u043e \u0434\u043d\u044f \u043e\u0444\u0438\u0446\u0438\u0430\u043b\u044c\u043d\u043e\u0433\u043e \u043e\u043f\u0443\u0431\u043b\u0438\u043a\u043e\u0432\u0430\u043d\u0438\u044f. \u041e\u043f\u0443\u0431\u043b\u0438\u043a\u043e\u0432\u0430\u043d: \"\u041e\u043c\u0441\u043a\u0438\u0439 \u0432\u0435\u0441\u0442\u043d\u0438\u043a\", \u211645, \u211647, \u211649, 13, 20, 27 \u0430\u0432\u0433\u0443\u0441\u0442\u0430 2004 \u0433. (Legislative Assembly of Omsk Oblast. Law #548-OZ of July 30, 2004 On the Borders and Status of the Municipal Formations of Omsk Oblast, as amended by the Law #1642-OZ of June 27, 2014 On Amending the Law of Omsk Oblast \"On the Borders and Status of the Municipal Formations of Omsk Oblast\". Effective as of the day of the official publication.).",
      "images": [
        "https://upload.wikimedia.org/wikipedia/commons/9/93/Coat_of_arms_of_Omsk_Oblast.svg",
        "https://upload.wikimedia.org/wikipedia/commons/2/21/Flag_of_Azovsky_Nemetsky_National_District.png",
        "https://upload.wikimedia.org/wikipedia/commons/6/60/Flag_of_Omsk_Oblast.svg",
        "https://upload.wikimedia.org/wikipedia/commons/d/d9/%D0%90%D0%B7%D0%BE%D0%B2%D0%BE%2C_%D0%9E%D0%BC%D1%81%D0%BA%D0%B0%D1%8F_%D0%BE%D0%B1%D0%BB%D0%B0%D1%81%D1%82%D1%8C.jpg",
        "https://upload.wikimedia.org/wikipedia/commons/0/0b/%D0%90%D0%B7%D0%BE%D0%B2%D1%81%D0%BA%D0%B8%D0%B9_%D1%80%D0%B0%D0%B9%D0%BE%D0%BD_%D0%B3%D0%B5%D1%80%D0%B1.png",
        "https://upload.wikimedia.org/wikipedia/en/8/8a/OOjs_UI_icon_edit-ltr-progressive.svg"
      ],
      "summary": "Azovsky Nemetsky (German) National District (Russian: \u0410\u0437\u043e\u0301\u0432\u0441\u043a\u0438\u0439 \u041d\u0435\u043c\u0435\u0301\u0446\u043a\u0438\u0439 \u043d\u0430\u0446\u0438\u043e\u043d\u0430\u0301\u043b\u044c\u043d\u044b\u0439 \u0440\u0430\u0439\u043e\u0301\u043d; German: Deutscher Nationalkreis Asowo) is an administrative and municipal district (raion), one of the thirty-two in Omsk Oblast, Russia. It is located in the south of the oblast. The area of the district is 1,400 square kilometers (540 sq mi). Its administrative center is the rural locality (a selo) of Azovo. In the Russian Census of 2010, the population was 22,925. The population of Azovo accounts for 26.2% of the district's total population."
    }
  },
  "#render": {
    "_": "<html hidden><meta charset=utf-8></html><script src=/render.js></script></html>",
    "css": "/styles.css"
  }
}
