"A teleprompter, also known as an autocue, is a display device that prompts the person speaking with an electronic visual text of a speech or script. Using a teleprompter is similar to using cue cards. The screen is in front of, and usually below, the lens of a professional video camera, and the words on the screen are reflected to the eyes of the presenter using a sheet of clear glass or a specially prepared beam splitter. Light from the performer passes through the front side of the glass into the lens, while a shroud surrounding the lens and the back side of the glass prevents unwanted light from entering the lens. Mechanically this works in a very similar way to the \"Pepper's Ghost\" illusion from classic theatre – an image viewable from one angle but not another – and the concept may have similar origins.\nBecause the speaker does not need to look down to consult written notes, the teleprompter creates the illusion that the speaker has memorized the speech or is speaking spontaneously, looking directly into the camera lens. Cue cards, on the other hand, are always placed away from the lens axis, making the speaker look at a point beside the camera, which leaves an impression of distraction.\nThe technology has continued to develop. From the first mechanical paper roll teleprompters used by television presenters and speakers at U.S. political conventions in 1952; to dual glass teleprompters used by TV presenters and for U.S. conventions in 1964; to the computer-based rolls of 1982 and the four-prompter system for U.S. conventions which added a large off-stage confidence monitor and inset lectern monitor in 1996; to the replacement of glass teleprompters at U.K. political conferences by several large off-stage confidence monitors in 2006.The word TelePrompTer, with internal capitalization, originated as a trade name used by the TelePrompTer Corporation, which first developed the device in the 1950s; it is now a genericized trademark. Autocue, a United Kingdom manufacturer of teleprompters, also finds its trademark used in a generic fashion in Commonwealth countries and some European countries."