"Samgyeopsal (삼겹살, 三--, lit. 'three-layer meat'), samgyeopsal-gui (삼겹살구이), or grilled pork belly is a type of gui (grilled dish) in Korean cuisine.\n\n\n== Etymology ==\n\nDirectly translated from Korean, samgyeop-sal (삼겹살) means \"three layer flesh,\" referring to striations of lean meat and fat in the pork belly that appear as three layers when cut.It is the part of the abdomen under the loin from the 5th rib or 6th rib to the hind limb. In Korea, the word samgyeop-sal, meaning \"pork belly\", often refers to samgyeop-sal-gui (grilled pork belly), in the same way that the word galbi, meaning \"ribs\", often refers to galbi-gui (grilled beef ribs). Gui refers to roasted, baked, or grilled dishes.\nOne can also find ogyeopsal (오겹살), with an o meaning \"five\". Ogyeop-sal includes the skin part of the pork belly, unlike samgyeop-sal where the skin is removed. This corresponds with the Chinese word for pork belly, wǔ huā ròu (五花肉) or \"five flower meat\", as the Chinese pork belly usually includes the rind.\n\n\n== Preparation ==\n\nThick, fatty slices of pork belly, sometimes with the skin left on and sometimes scored on the diagonal, are grilled on a slanted metal griddle or a gridiron at the diners' table, inset with charcoal grills or convex gas burners. Usually, diners grill the meat themselves, flipping and cutting them with tongs and scissors, and eat directly from the grill.The meat is usually neither marinated nor seasoned, although marinated samgyeopsal in flavors such as ginseng, wine, garlic, herbs, curry, doenjang, and gochujang has gained popularity since the late 2000s. Slices of garlic, onions, green chili peppers, mushrooms, and kimchi are often grilled alongside using the fat trickling from the pork belly.Common accompaniments for samgyeopsal include ssam vegetables such as lettuce, kkaennip (perilla leaves), ssammu (pickled radish paper) and dipping sauces such as ssamjang (made with seasoned mixture of chili paste and soy bean paste) and gireum-jang (made with sesame oil, salt, and black pepper), jangajji (soy sauce-pickled vegetables) such as myeongi-jangajji (pickled Siberian onion leaves) or yangpa-jangajji (pickled onions), kimchi, as well as sliced garlic, onions, and seasoned shredded scallions. Garlic, onions, and kimchi can be either grilled with the meat or consumed raw with the cooked meat. Mushrooms, such as button mushrooms or oyster mushrooms, are also grilled with the meat.\n\n\n== Consumption ==\nGrilled meat is placed on fresh and/or pickled leaves of vegetables, with some ssamjang, and rolled up to make ssam (wrap) which is eaten in one mouthful. Any combination of accompaniments mentioned above can be added to the roll according to preference, most popularly sliced garlic.Cooked rice, stews such as kimchi-jjigae and doenjang-jjigae, as well as naengmyeon (cold noodles), can be served as meals. Sometimes, leftover meat is mixed with rice, gim-garu (seaweed flakes), and seasonings to make bokkeum-bap (fried rice) at the end.\nSamgyeopsal is often accompanied by, or accompanying (as anju) shots of soju. Somaek, a simple cocktail made by dumping a shot of soju into a glass of beer, is also a popular beverage consumed with samgyeopasal.\n\n\n== Popularity ==\n\nIn South Korea, the third day of March is \"Samgyeopsal Day\", due to samgyeopsal's three-layered composition.\n\n\n== See also ==\n\nBacon – A type of salt-cured pork\nKorean barbecue – style of food preparation in Korean cuisine\nList of pork dishes – Wikipedia list article\n\n\n== References =="