"Keynesian economics ( KAYN-zee-ən; sometimes Keynesianism, named after British economist John Maynard Keynes) are the various macroeconomic theories and models of how aggregate demand (total spending in the economy) strongly influences economic output and inflation. In the Keynesian view, aggregate demand does not necessarily equal the productive capacity of the economy. Instead, it is influenced by a host of factors – sometimes behaving erratically – affecting production, employment, and inflation.Keynesian economists generally argue that aggregate demand is volatile and unstable and that, consequently, a market economy often experiences inefficient macroeconomic outcomes – a recession, when demand is low, and inflation, when demand is high. Further, they argue that these economic fluctuations can be mitigated by economic policy responses coordinated between government and central bank. In particular, fiscal policy actions (taken by the government) and  monetary policy actions (taken by the central bank), can help stabilize economic output, inflation, and unemployment over the business cycle. Keynesian economists generally advocate a market economy – predominantly private sector, but with an active role for government intervention during recessions and depressions.Keynesian economics developed during and after the Great Depression from the ideas presented by Keynes in his 1936 book, The General Theory of Employment, Interest and Money. Keynes' approach was a stark contrast to the aggregate supply-focused classical economics that preceded his book. Interpreting Keynes's work is a contentious topic, and several schools of economic thought claim his legacy.\nKeynesian economics, as part of the neoclassical synthesis, served as the standard macroeconomic model in the developed nations during the later part of the Great Depression, World War II, and the post-war economic expansion (1945–1973). It lost some influence following the oil shock and resulting stagflation of the 1970s. Keynesian economics was later redeveloped as New Keynesian economics, becoming part of the contemporary new neoclassical synthesis, that forms one current-day theory on  macroeconomics. The advent of the financial crisis of 2007–2008 sparked renewed interest in Keynesian thought."