"Dungeons & Dragons (commonly abbreviated as D&D or DnD) is a fantasy tabletop role-playing game (RPG) originally designed by Gary Gygax and Dave Arneson. It was first published in 1974 by Tactical Studies Rules, Inc. (TSR). It has been published by Wizards of the Coast (now a subsidiary of Hasbro) since 1997. The game was derived from miniature wargames, with a variation of the 1971 game Chainmail serving as the initial rule system. D&D's publication is commonly recognized as the beginning of modern role-playing games and the role-playing game industry.D&D departs from traditional wargaming by allowing each player to create their own character to play instead of a military formation. These characters embark upon imaginary adventures within a fantasy setting. A Dungeon Master (DM) serves as the game's referee and storyteller, while maintaining the setting in which the adventures occur, and playing the role of the inhabitants of the game world. The characters form a party and they interact with the setting's inhabitants and each other. Together they solve dilemmas, engage in battles, explore, and gather treasure and knowledge. In the process, the characters earn experience points (XP) in order to rise in levels, and become increasingly powerful over a series of separate gaming sessions.The early success of D&D led to a proliferation of similar game systems. Despite the competition, D&D has remained the market leader in the role-playing game industry. In 1977, the game was split into two branches: the relatively rules-light game system of basic Dungeons & Dragons, and the more structured, rules-heavy game system of Advanced Dungeons & Dragons (abbreviated as AD&D). AD&D 2nd Edition was published in 1989. In 2000, a new system was released as D&D 3rd edition, continuing the edition numbering from AD&D; a revised version 3.5 was released in June 2003. These 3rd edition rules formed the basis of the d20 System, which is available under the Open Game License (OGL) for use by other publishers. D&D 4th edition was released in June 2008. The 5th edition of D&D, the most recent, was released during the second half of 2014.In 2004, D&D remained the best-known, and best-selling, role-playing game in the US, with an estimated 20 million people having played the game, and more than US$1 billion in book and equipment sales worldwide. The year 2017 had \"the most number of players in its history—12 million to 15 million in North America alone\". D&D 5th edition sales \"were up 41 percent in 2017 from the year before, and soared another 52 percent in 2018, the game's biggest sales year yet\". The game has been supplemented by many pre-made adventures, as well as commercial campaign settings suitable for use by regular gaming groups. D&D is known beyond the game itself for other D&D-branded products, references in popular culture, and some of the controversies that have surrounded it, particularly a moral panic in the 1980s falsely linking it to Satanism and suicide. The game has won multiple awards and has been translated into many languages."