"Igneous rock (derived from the Latin word ignis meaning fire), or magmatic rock, is one of the three main rock types, the others being sedimentary and metamorphic. Igneous rock is formed through the cooling and solidification of magma or lava.\nThe magma can be derived from partial melts of existing rocks in either a planet's mantle or crust. Typically, the melting is caused by one or more of three processes: an increase in temperature, a decrease in pressure, or a change in composition. Solidification into rock occurs either below the surface as intrusive rocks or on the surface as extrusive rocks. Igneous rock may form with crystallization to form granular, crystalline rocks,  or without crystallization to form natural glasses. \nIgneous rocks occur in a wide range of geological settings: shields, platforms, orogens, basins, large igneous provinces, extended crust and oceanic crust.\n\n\n== Geological significance ==\nIgneous and metamorphic rocks make up 90–95% of the top 16 kilometres (9.9 mi) of the Earth's crust by volume. Igneous rocks form about 15% of the Earth's current land surface. Most of the Earth's oceanic crust is made of igneous rock.\nIgneous rocks are also geologically important because:\n\ntheir minerals and global chemistry give information about the composition of the lower crust or upper mantle from which their parent magma was extracted, and the temperature and pressure conditions that allowed this extraction;\ntheir absolute ages can be obtained from various forms of radiometric dating and can be compared to adjacent geological strata, thus permitting calibration of the geological time scale;\ntheir features are usually characteristic of a specific tectonic environment, allowing tectonic reconstructions (see plate tectonics);\nin some special circumstances they host important mineral deposits (ores): for example, tungsten, tin, and uranium are commonly associated with granites and diorites, whereas ores of chromium and platinum are commonly associated with gabbros.\n\n\n== Geological setting ==\n\nIgneous rocks can be either intrusive (plutonic and hypabyssal) or extrusive (volcanic).\n\n\n=== Intrusive ===\n\nIntrusive igneous rocks make up the majority of igneous rocks and are formed from magma that cools and solidifies within the crust of a planet. Bodies of intrusive rock are known as intrusions and are surrounded by pre-existing rock (called country rock). The country rock is an excellent thermal insulator, so the magma cools slowly, and intrusive rocks are coarse-grained (phaneritic). The mineral grains in such rocks can generally be identified with the naked eye. Intrusions can be classified according to the shape and size of the intrusive body and its relation to the bedding of the country rock into which it intrudes. Typical intrusive bodies are batholiths, stocks, laccoliths, sills and dikes. Common intrusive rocks are granite, gabbro, or diorite.\nThe central cores of major mountain ranges consist of intrusive igneous rocks. When exposed by erosion, these cores (called batholiths) may occupy huge areas of the Earth's surface.\nIntrusive igneous rocks that form at depth within the crust are termed plutonic (or abyssal) rocks and are usually coarse-grained. Intrusive igneous rocks that form near the surface are termed subvolcanic or hypabyssal rocks and they are usually much finer-grained, often resembling volcanic rock. Hypabyssal rocks are less common than plutonic or volcanic rocks and often form dikes, sills, laccoliths, lopoliths, or phacoliths.\n\n\n=== Extrusive ===\n\nExtrusive igneous rock, also known as volcanic rock, is formed by the cooling of molten magma on the earth's surface. The magma, which is brought to the surface through fissures or volcanic eruptions, rapidly solidifies. Hence such rocks are fine-grained (aphanitic) or even glassy. Basalt is the most common extrusive igneous rock and forms lava flows, lava sheets and lava plateaus. Some kinds of basalt solidify to form long polygonal columns. The Giant's Causeway in Antrim, Northern Ireland is an example.\nThe molten rock, which typically contains suspended crystals and dissolved gases, is called magma. It rises because it is less dense than the rock from which it was extracted. When magma reaches the surface, it is called lava. Eruptions of volcanoes into air are termed subaerial, whereas those occurring underneath the ocean are termed submarine. Black smokers and mid-ocean ridge basalt are examples of submarine volcanic activity.The volume of extrusive rock erupted annually by volcanoes varies with plate tectonic setting. Extrusive rock is produced in the following proportions:\ndivergent boundary: 73%\nconvergent boundary (subduction zone): 15%\nhotspot: 12%.The behaviour of lava depends upon its viscosity, which is determined by temperature, composition, and crystal content.  High-temperature magma, most of which is basaltic in composition, behaves in a manner similar to thick oil and, as it cools, treacle. Long, thin basalt flows with pahoehoe surfaces are common. Intermediate composition magma, such as andesite, tends to form cinder cones of intermingled ash, tuff and lava, and may have a viscosity similar to thick, cold molasses or even rubber when erupted. Felsic magma, such as rhyolite, is usually erupted at low temperature and is up to 10,000 times as viscous as basalt. Volcanoes with rhyolitic magma commonly erupt explosively, and rhyolitic lava flows are typically of limited extent and have steep margins because the magma is so viscous.Felsic and intermediate magmas that erupt often do so violently, with explosions driven by the release of dissolved gases—typically water vapour, but also carbon dioxide. Explosively erupted pyroclastic material is called tephra and includes tuff, agglomerate and ignimbrite. Fine volcanic ash is also erupted and forms ash tuff deposits, which can often cover vast areas.Because volcanic rocks are mostly fine-grained or glassy, it is much more difficult to distinguish between the different types of extrusive igneous rocks than between different types of intrusive igneous rocks. Generally, the mineral constituents of fine-grained extrusive igneous rocks can only be determined by examination of thin sections of the rock under a microscope, so only an approximate classification can usually be made in the field. Although classification by mineral makeup is preferred by the IUGS, this is often impractical, and chemical classification is done instead using the TAS classification.\n\n\n== Classification ==\n\nIgneous rocks are classified according to mode of occurrence, texture, mineralogy, chemical composition, and the geometry of the igneous body.\nThe classification of the many types of igneous rocks can provide important information about the conditions under which they formed. Two important variables used for the classification of igneous rocks are particle size, which largely depends on the cooling history, and the mineral composition of the rock. Feldspars, quartz or feldspathoids, olivines, pyroxenes, amphiboles, and micas are all important minerals in the formation of almost all igneous rocks, and they are basic to the classification of these rocks. All other minerals present are regarded as nonessential in almost all igneous rocks and are called accessory minerals. Types of igneous rocks with other essential minerals are very rare, but include carbonatites, which contain essential carbonates.In a simplified classification, igneous rock types are separated on the basis of the type of feldspar present, the presence or absence of quartz, and in rocks with no feldspar or quartz, the type of iron or magnesium minerals present. Rocks containing quartz (silica in composition) are silica-oversaturated. Rocks with feldspathoids are silica-undersaturated, because feldspathoids cannot coexist in a stable association with quartz.\nIgneous rocks that have crystals large enough to be seen by the naked eye are called phaneritic; those with crystals too small to be seen are called aphanitic. Generally speaking, phaneritic implies an intrusive origin; aphanitic an extrusive one.\nAn igneous rock with larger, clearly discernible crystals embedded in a finer-grained matrix is termed porphyry. Porphyritic texture develops when some of the crystals grow to considerable size before the main mass of the magma crystallizes as finer-grained, uniform material.\nIgneous rocks are classified on the basis of texture and composition. Texture refers to the size, shape, and arrangement of the mineral grains or crystals of which the rock is composed.\n\n\n=== Texture ===\n\nTexture is an important criterion for the naming of volcanic rocks. The texture of volcanic rocks, including the size, shape, orientation, and distribution of mineral grains and the intergrain relationships, will determine whether the rock is termed a tuff, a pyroclastic lava or a simple lava. However, the texture is only a subordinate part of classifying volcanic rocks, as most often there needs to be chemical information gleaned from rocks with extremely fine-grained groundmass or from airfall tuffs, which may be formed from volcanic ash.\nTextural criteria are less critical in classifying intrusive rocks where the majority of minerals will be visible to the naked eye or at least using a hand lens, magnifying glass or microscope. Plutonic rocks also tend to be less texturally varied and less prone to showing distinctive structural fabrics. Textural terms can be used to differentiate different intrusive phases of large plutons, for instance porphyritic margins to large intrusive bodies, porphyry stocks and subvolcanic dikes. Mineralogical classification is most often used to classify plutonic rocks. Chemical classifications are preferred to classify volcanic rocks, with phenocryst species used as a prefix, e.g. \"olivine-bearing picrite\" or \"orthoclase-phyric rhyolite\".\n\n\n=== Mineralogical classification ===\nThe IUGS recommends classifying igneous rocks by their mineral composition whenever possible. This is straightforward for coarse-grained intrusive igneous rock, but may require examination of thin sections under a microscope for fine-grained volcanic rock, and may be impossible for glassy volcanic rock. The rock must then be classified chemically.Mineralogical classification of an intrusive rock begins by determining if the rock is ultramafic, a carbonatite, or a lamprophyre. An ultramafic rock contains more than 90% of iron- and magnesium-rich minerals such as hornblende, pyroxene, or olivine, and such rocks have their own classification scheme. Likewise, rocks containing more than 50% carbonate minerals are classified as carbonatites, while lamprophyres are rare ultrapotassic rocks. Both are further classified based on detailed mineralogy.In the great majority of cases, the rock has a more typical mineral composition, with significant quartz, feldspars, or feldspathoids. Classification is based on the percentages of quartz, alkali feldspar, plagioclase, and feldspathoid out of the total fraction of the rock composed of these minerals, ignoring all other minerals present. These percentages place the rock somewhere on the QAPF diagram, which often immediately determines the rock type. In a few cases, such as the diorite-gabbro-anorthite field, additional mineralogical criteria must be applied to determine the final classification.Where the mineralogy of an volcanic rock can be determined, it is classified using the same procedure, but with a modified QAPF diagram whose fields correspond to volcanic rock types.\n\n\n=== Chemical classification and petrology ===\n\nWhen it is impractical to classify a volcanic rock by mineralogy, the rock must be classified chemically.\nThere are relatively few minerals that are important in the formation of common igneous rocks, because the magma from which the minerals crystallize is rich in only certain elements: silicon, oxygen, aluminium, sodium, potassium, calcium, iron, and magnesium. These are the elements that combine to form the silicate minerals, which account for over ninety percent of all igneous rocks. The chemistry of igneous rocks is expressed differently for major and minor elements and for trace elements. Contents of major and minor elements are conventionally expressed as weight percent oxides (e.g., 51% SiO2, and 1.50% TiO2). Abundances of trace elements are conventionally expressed as parts per million by weight (e.g., 420 ppm Ni, and 5.1 ppm Sm). The term \"trace element\" is typically used for elements present in most rocks at abundances less than 100 ppm or so, but some trace elements may be present in some rocks at abundances exceeding 1,000 ppm. The diversity of rock compositions has been defined by a huge mass of analytical data—over 230,000 rock analyses can be accessed on the web through a site sponsored by the U. S. National Science Foundation (see the External Link to EarthChem).\nThe single most important component is silica, SiO2, whether occurring as quartz or combined with other oxides as feldspars or other minerals. Both intrusive and volcanic rocks are grouped chemically by total silica content into broad categories.\n\nFelsic rocks have the highest content of silica, and are predominantly composed of the felsic minerals quartz and feldspar. These rocks (granite, rhyolite) are usually light coloured, and have a relatively low density.\nIntermediate rocks have a moderate content of silica, and are predominantly composed of feldspars. These rocks (diorite, andesite) are typically darker in colour than felsic rocks and somewhat more dense.\nMafic rocks have a relatively low silica content and are composed mostly of pyroxenes, olivines and calcic plagioclase. These rocks (basalt, gabbro) are usually dark coloured, and have a higher density than felsic rocks.\nUltramafic rock is very low in silica, with more than 90% of mafic minerals (komatiite, dunite).This classification is summarized in the following table:\n\nThe percentage of alkali metal oxides (Na2O plus K2O) is second only to silica in its importance for chemically classifying volcanic rock. The silica and alkali metal oxide percentages are used to place volcanic rock on the TAS diagram, which is sufficient to immediately classify most volcanic rocks. Rocks in some fields, such as the trachyandesite field, are further classified by the ratio of potassium to sodium (so that potassic trachyandesites are latites and sodic trachyandesites are benmoreites). Some of the more mafic fields are further subdivided or defined by normative mineralogy, in which an idealized mineral composition is calculated for the rock based on its chemical composition. For example, basanite is distinguished from tephrite by having a high normative olivine content.\nOther refinements to the basic TAS classification include:\n\nUltrapotassic – rocks containing molar K2O/Na2O >3.\nPeralkaline – rocks containing molar (K2O + Na2O)/Al2O3 >1.\nPeraluminous – rocks containing molar (K2O + Na2O + CaO)/Al2O3 <1.In older terminology, silica oversaturated rocks were called silicic or acidic where the SiO2 was greater than 66% and the family term quartzolite was applied to the most silicic. A normative feldspathoid classifies a rock as silica-undersaturated; an example is nephelinite.\n\nMagmas are further divided into three series:\n\nThe tholeiitic series – basaltic andesites and andesites.\nThe calc-alkaline series – andesites.\nThe alkaline series – subgroups of alkaline basalts and the rare, very high potassium-bearing (i.e. shoshonitic) lavas.The alkaline series is distinguishable from the other two on the TAS diagram, being higher in total alkali oxides for a given silica content, but the tholeiitic and calc-alkaline series occupy approximately the same part of the TAS diagram. They are distinguished by comparing total alkali with iron and magnesium content.These three magma series occur in a range of plate tectonic settings. Tholeiitic magma series rocks are found, for example, at mid-ocean ridges, back-arc basins, oceanic islands formed by hotspots, island arcs and continental large igneous provinces.All three series are found in relatively close proximity to each other at subduction zones where their distribution is related to depth and the age of the subduction zone. The tholeiitic magma series is well represented above young subduction zones formed by magma from relatively shallow depth. The calc-alkaline and alkaline series are seen in mature subduction zones, and are related to magma of greater depths. Andesite and basaltic andesite are the most abundant volcanic rock in island arc which is indicative of the calc-alkaline magmas. Some island arcs have distributed volcanic series as can be seen in the Japanese island arc system where the volcanic rocks change from tholeiite—calc-alkaline—alkaline with increasing distance from the trench.\n\n\n=== History of classification ===\nSome igneous rock names date to before the modern era of geology. For example, basalt as a description of a particular composition of lava-derived rock dates to Georgius Agricola in 1546 in his work De Natura Fossilium. The word granite goes back at least to the 1640s and is derived either from French granit or Italian granito, meaning simply \"granulate rock\". The term rhyolite was introduced in 1860 by the German traveler and geologist Ferdinand von Richthofen The naming of new rock types accelerated in the 19th century and peaked in the early 20th century.Much of the early classification of igneous rocks was based on the geological age and occurrence of the rocks. However, in 1902, the American petrologists Charles Whitman Cross, Joseph P. Iddings, Louis V. Pirsson, and Henry Stephens Washington proposed that all existing classifications of igneous rocks should be discarded and replaced by a \"quantitative\" classification based on chemical analysis. They showed how vague, and often unscientific, much of the existing terminology was and argued that as the chemical composition of an igneous rock was its most fundamental characteristic, it should be elevated to prime position.Geological occurrence, structure, mineralogical constitution—the hitherto accepted criteria for the discrimination of rock species—were relegated to the background. The completed rock analysis is first to be interpreted in terms of the rock-forming minerals which might be expected to be formed when the magma crystallizes, e.g., quartz feldspars, olivine, akermannite, Feldspathoids, magnetite, corundum, and so on, and the rocks are divided into groups strictly according to the relative proportion of these minerals to one another. This new classification scheme created a sensation, but was criticized for its lack of utility in fieldwork, and the classification scheme was abandoned by the 1960s. However, the concept of normative mineralogy has endured, and the work of Cross and his coinvestigators inspired a flurry of new classification schemes.Among these was the classification scheme of M.A. Peacock, which divided igneous rocks into four series: the alkalic, the alkali-calcic, the calc-alkali, and the calcic series. His definition of the alkali series, and the term calc-alkali, continue in use as part of the widely used Irvine-Barager classification, along with W.Q. Kennedy's tholeiitic series.By 1958, there were some 12 separate classification schemes and at least 1637 rock type names in use. In that year, Albert Streckeisen wrote a review article on igneous rock classification that ultimately led to the formation of the IUGG Subcommission of the Systematics of Igneous Rocks. By 1989 a single system of classification had been agreed upon, which was further revised in 2005. The number of recommended rock names was reduced to 316. These included a number of new names promulgated by the Subcommission.\n\n\n== Origin of magmas ==\nThe Earth's crust averages about 35 kilometres (22 mi) thick under the continents, but averages only some 7–10 kilometres (4.3–6.2 mi) beneath the oceans. The continental crust is composed primarily of sedimentary rocks resting on a crystalline basement formed of a great variety of metamorphic and igneous rocks, including granulite and granite. Oceanic crust is composed primarily of basalt and gabbro. Both continental and oceanic crust rest on peridotite of the mantle.\nRocks may melt in response to a decrease in pressure, to a change in composition (such as an addition of water), to an increase in temperature, or to a combination of these processes.\nOther mechanisms, such as melting from a meteorite impact, are less important today, but impacts during the accretion of the Earth led to extensive melting, and the outer several hundred kilometers of our early Earth was probably an ocean of magma. Impacts of large meteorites in the last few hundred million years have been proposed as one mechanism responsible for the extensive basalt magmatism of several large igneous provinces.\n\n\n=== Decompression ===\nDecompression melting occurs because of a decrease in pressure.The solidus temperatures of most rocks (the temperatures below which they are completely solid) increase with increasing pressure in the absence of water. Peridotite at depth in the Earth's mantle may be hotter than its solidus temperature at some shallower level. If such rock rises during the convection of solid mantle, it will cool slightly as it expands in an adiabatic process, but the cooling is only about 0.3 °C per kilometer. Experimental studies of appropriate peridotite samples document that the solidus temperatures increase by 3 °C to 4 °C per kilometer. If the rock rises far enough, it will begin to melt. Melt droplets can coalesce into larger volumes and be intruded upwards. This process of melting from the upward movement of solid mantle is critical in the evolution of the Earth.\nDecompression melting creates the ocean crust at mid-ocean ridges. It also causes volcanism in intraplate regions, such as Europe, Africa and the Pacific sea floor. There, it is variously attributed either to the rise of mantle plumes (the \"Plume hypothesis\") or to intraplate extension (the \"Plate hypothesis\").\n\n\n=== Effects of water and carbon dioxide ===\nThe change of rock composition most responsible for the creation of magma is the addition of water. Water lowers the solidus temperature of rocks at a given pressure. For example, at a depth of about 100 kilometers, peridotite begins to melt near 800 °C in the presence of excess water, but near or above about 1,500 °C in the absence of water. Water is driven out of the oceanic lithosphere in subduction zones, and it causes melting in the overlying mantle. Hydrous magmas composed of basalt and andesite are produced directly and indirectly as results of dehydration during the subduction process. Such magmas, and those derived from them, build up island arcs such as those in the Pacific Ring of Fire. These magmas form rocks of the calc-alkaline series, an important part of the continental crust.\nThe addition of carbon dioxide is relatively a much less important cause of magma formation than the addition of water, but genesis of some silica-undersaturated magmas has been attributed to the dominance of carbon dioxide over water in their mantle source regions. In the presence of carbon dioxide, experiments document that the peridotite solidus temperature decreases by about 200 °C in a narrow pressure interval at pressures corresponding to a depth of about 70 km. At greater depths, carbon dioxide can have more effect: at depths to about 200 km, the temperatures of initial melting of a carbonated peridotite composition were determined to be 450 °C to 600 °C lower than for the same composition with no carbon dioxide. Magmas of rock types such as nephelinite, carbonatite, and kimberlite are among those that may be generated following an influx of carbon dioxide into mantle at depths greater than about 70 km.\n\n\n=== Temperature increase ===\nIncrease in temperature is the most typical mechanism for formation of magma within continental crust. Such temperature increases can occur because of the upward intrusion of magma from the mantle. Temperatures can also exceed the solidus of a crustal rock in continental crust thickened by compression at a plate boundary. The plate boundary between the Indian and Asian continental masses provides a well-studied example, as the Tibetan Plateau just north of the boundary has crust about 80 kilometers thick, roughly twice the thickness of normal continental crust. Studies of electrical resistivity deduced from magnetotelluric data have detected a layer that appears to contain silicate melt and that stretches for at least 1,000 kilometers within the middle crust along the southern margin of the Tibetan Plateau. Granite and rhyolite are types of igneous rock commonly interpreted as products of the melting of continental crust because of increases in temperature. Temperature increases also may contribute to the melting of lithosphere dragged down in a subduction zone.\n\n\n=== Magma evolution ===\n\nMost magmas are fully melted only for small parts of their histories. More typically, they are mixes of melt and crystals, and sometimes also of gas bubbles. Melt, crystals, and bubbles usually have different densities, and so they can separate as magmas evolve.\nAs magma cools, minerals typically crystallize from the melt at different temperatures (fractional crystallization). As minerals crystallize, the composition of the residual melt typically changes. If crystals separate from the melt, then the residual melt will differ in composition from the parent magma. For instance, a magma of gabbroic composition can produce a residual melt of granitic composition if early formed crystals are separated from the magma. Gabbro may have a liquidus temperature near 1,200 °C, and the derivative granite-composition melt may have a liquidus temperature as low as about 700 °C. Incompatible elements are concentrated in the last residues of magma during fractional crystallization and in the first melts produced during partial melting: either process can form the magma that crystallizes to pegmatite, a rock type commonly enriched in incompatible elements. Bowen's reaction series is important for understanding the idealised sequence of fractional crystallisation of a magma.\nMagma composition can be determined by processes other than partial melting and fractional crystallization. For instance, magmas commonly interact with rocks they intrude, both by melting those rocks and by reacting with them. Magmas of different compositions can mix with one another. In rare cases, melts can separate into two immiscible melts of contrasting compositions.\n\n\n== Etymology ==\nThe word \"igneous\" is derived from the Latin ignis, meaning \"of fire\". Volcanic rocks are named after Vulcan, the Roman name for the god of fire. Intrusive rocks are also called \"plutonic\" rocks, named after Pluto, the Roman god of the underworld.\n\n\n== Gallery ==\n\n\t\t\n\t\t\n\t\t\n\t\t\n\t\t\n\t\t\n\n\n== See also ==\nList of rock types – A list of rock types recognized by geologists\nMetamorphic rock – Rock that was subjected to heat and pressure\nMigmatite – A mixture of metamorphic rock and igneous rock\nPetrology – The branch of geology that studies the origin, composition, distribution and structure of rocks\nSedimentary rock – Rock formed by the deposition and subsequent cementation of material\n\n\n== Notes ==\n\n\n== References ==\n\n\n== External links ==\nUSGS Igneous Rocks\nIgneous rock classification flowchart\nIgneous Rocks Tour, an introduction to Igneous Rocks\nThe IUGS systematics of igneous rocks"