"A shell corporation is a company or corporation that exists only on paper and has no office and no employees, but may have a bank account or may hold passive investments or be the registered owner of assets, such as intellectual property, or ships. Shell companies may be registered to the address of a company that provides a service setting up shell companies, and which may act as the agent for receipt of legal correspondence (such as an accountant or lawyer). The company may serve as a vehicle for business transactions without itself having any significant assets or operations. Sometimes shell companies are used for tax evasion, tax avoidance, and money laundering, or to achieve a specific goal such as anonymity. Anonymity may be sought to shield personal assets from others, such as a spouse when a marriage is breaking down, from creditors, from government authorities, besides others.\nShell companies can have legitimate business purposes. They may, for example, act as trustee for a trust, and not engage in any other activity on their own account. This structure creates limited liability for the trustee. A corporate shell can also be formed around a partnership to create limited liability for the partners, and other business ventures, or to immunize one part of a business from the risks of another part. Shell companies can be used to transfer assets from one company into a new one, while leaving the liabilities in the former company.\n\n\n== SEC definition ==\nThe U.S. Securities and Exchange Commission defines a \"shell\" company as follows:\n\nShell company: The term shell company means a registrant, other than an asset-backed issuer as defined in Item 1101(b) of Regulation AB (§ 229.1101(b) of this chapter), that has:\n(1) No or nominal operations; and\n(2) Either:\n(i) No or nominal assets;\n(ii) Assets consisting solely of cash and cash equivalents; or\n(iii) Assets consisting of any amount of cash and cash equivalents and nominal other assets.'\n\n\n== Background ==\nSome shell companies may have previously had operations that shrank due to unfavorable market conditions or company mismanagement. A shell corporation may also arise when a company's operations have been wound up, for example following a takeover, but the \"shell\" of the original company continues to exist. The term \"shell corporation\" does not describe the purpose of a corporate entity, but in general is more informative to classify an entity according to its role in a particular corporate structure; e.g. holding company, general partner, or a limited partner.\nShell companies are a main component of the underground economy, especially those based in tax havens. They may also be known as international business companies, personal investment companies, front companies, or \"mailbox\" companies. Shell companies can also be used for tax avoidance. A classic tax avoidance operation may utilize favorable transfer pricing among multiple corporate entities to lower tax liability in a certain country; e.g. Double Irish arrangement.\nA special purpose entity, used often in the context of a larger corporate structure, may be formed to achieve a specific goal, such as to create anonymity.\nAccording to a 2013 experimental study where the researchers requested anonymous incorporation in violation of international law, one in four corporate service providers offered to provide services in violation of international law.\n\n\n== Examples ==\nShell companies can be used to transfer assets of one company into a new company without having the liabilities of the former company. For example, when Sega Sammy Holdings purchased the bankrupt Index Corporation in June 2013, they formed a shell company in September 2013, called Sega Dream Corporation, into which were transferred valuable assets of the old company, including the Atlus brand and Index Corporation's intellectual properties. This meant that the liabilities of the old company were left in the old company, and Sega Dream had clean title to all the assets of the old company. The former Index Corporation was then dissolved. Sega Dream Corporation was renamed as Index Corporation in November 2013.\nWhen Hilco purchased HMV Canada, they used a shell company by the name of Huk 10 Ltd. in order to secure funds and minimize liability. HMV was then sued by Huk 10 Ltd., allowing Hilco to regain assets and dispose of HMV Canada.\nAs another example, the use of a shell company in a tax haven makes it possible to move profits to that shell company, in a strategy called tax evasion. A United States company buying products from overseas would have to pay US taxes on the profits, but to avoid this, it may buy the products through a non-resident shell company based in a tax haven, where it is described as an offshore company. The shell company would purchase the products in its name, mark up the products and sell them on to the US company, thereby transferring the profit to the tax haven. (The products may never actually physically pass through that tax haven, and be shipped directly to the US company.) As the shell company is not based in the United States, its profit is not subject to US income tax, and as it is an offshore company in the tax haven jurisdiction, it is not taxed there either. Under the tax haven law, the profits are deemed not to have been made in the jurisdiction, with the sale deemed to have taken place in the United States. As US personal income tax is significantly less important than corporate income tax, US company executives would claim a salary (or fees, consulting fees, etc.) from the company's profits.\nIn addition, there are several shell companies that are used by broadcasting groups to circumvent FCC limits on television station ownership. For example, Sinclair Broadcasting Group forms local marketing agreements with stations owned by Cunningham Broadcasting and Deerfield Media; nearly all of the stock of Cunningham Broadcasting is controlled by trusts in the name of the owner's children. Other examples include Nexstar Media Group controlling television stations owned by Mission Broadcasting and Vaughan Media.\n\n\n== Countries of domicile ==\nTypical countries of domicile of shell companies are offshore financial centers like Ireland, Liechtenstein, Luxembourg, Switzerland, Isle of Man, and the Channel Islands including Guernsey and Jersey in Europe, Bahamas, Barbados, Bermuda, Cayman Islands, and Virgin Islands in the Caribbean, Panama in Central America, and Hong Kong and Singapore in Asia. Shell companies are usually offered by law firms based in those countries. The process of establishing a shell company can sometimes be done very quickly online.In 2021 anonymous corporations were made illegal in the United States with the passage of the Corporate Transparency Act as part of the William M. (Mac) Thornberry National Defense Authorization Act for Fiscal Year 2021. But exemptions were included which are meant to limit its scope to the entities most likely to be used for illicit purposes. Companies which are exempt from the act include foreign companies that do not formally register to do business and companies that fall into one of 24 enumerated categories which include companies that employ more than 20 people, have revenues above $5 million, and a physical presence in the United States, as well Churches, charities, non-profits, trusts or partnerships. Companies that are Banks, broker-dealers, public issuers, insurance companies are also exempt.Due to Federalism in the United States, shell companies are often set-up in states such Delaware, Nevada, and Wyoming due to advantageous tax regimes.\n\n\n== Abuse ==\nShell companies have been used to commit fraud, by creating an empty shell company with a name similar to existing real companies, then running up the price of the empty shell and suddenly selling it (pump and dump).There are also shell companies that were created for the purpose of owning assets (including tangibles, such as a real estate for property development, and intangibles, such as royalties or copyrights) and receiving income. The reasons behind creating such a shell company may include protection against litigation and/or tax benefits (some expenses that would not be deductible for an individual may be deductible for a corporation). Sometimes, shell companies are used for tax evasion or tax avoidance.\n\n\n=== Offshore Leaks ===\n\nIn 2013 the International Consortium of Investigative Journalists published a report called \"Offshore Leaks\" with information about the use and owners of 130,000 shell companies. Many of the shell companies belonged to politicians and celebrities from around the world and were being used for tax evasion and hiding financial assets.\n\n\n=== Panama Papers ===\n\nIn 2016 a leak of 11.5 million documents to the German newspaper Süddeutsche Zeitung revealed information about owners of more than 214,000 shell companies administered by the law firm Mossack Fonseca in Panama. The shell companies were used by politicians, businessmen, autocrats, and terrorists from around the world for tax evasion and other illegal activities.\n\n\n=== India ===\nAfter India's decision to demonetise ₹500 and ₹1000 rupee notes on 8 November 2016, various authorities noticed a surge in shell companies depositing cash in banks, possibly in an attempt to hide the real owner of the wealth. In response, in July 2017, the authorities ordered nearly 2,000 shell companies to be shut down while Securities and Exchange Board of India (SEBI) imposed trading restrictions on 162 listed entities as shell companies. A high-level task force found that hundreds of shell companies were registered in a few buildings in Kolkata. Many of those were found to be locked, with their padlocks coated in dust and many others which had office space the size of cubicles.\n\n\n== Regulation ==\nSince shell companies are very often abused for various illegal purposes, regulation of shell companies is becoming more important to prevent such illegal activities.\n\n\n=== United Kingdom ===\nCurrently British overseas territories and crown dependencies are only required to tell the true name of owners of shell companies upon request from official law enforcement agencies. However, by 2020 they will be forced to publish these names in a public register in order to prevent anonymous use of shell companies.\n\n\n=== United States ===\nThe new customer due diligence (CDD) rule from 2016 forces banks to know the names of their customers in order to reveal them to law enforcement agencies upon request. Thereby, anonymous misuse of shell companies shall be prevented. The rule is administered by the Financial Crimes Enforcement Network (FinCEN). In January 2021 anonymous shell companies were effectively banned via a provision in the William M. (Mac) Thornberry National Defense Authorization Act for Fiscal Year 2021.\n\n\n=== India ===\nA \"Task Force On Shell Corporations\" was constituted in 2017 under the chairmanship of the Revenue Secretary to the Government Of India and Corporate Affairs Secretary to Govt. Of India, for effectively tackling malpractice by shell companies in a comprehensive manner.\n\n\n== See also ==\nAlternative public offering\nBrass plate company\nDummy corporation\nFront organization\nHolding company\nInternal competition\nLoophole\nMoney laundering\nNumbered company\nOffshore company\nOffshore financial center\nShadow banking system\nStructured investment vehicle\nTax inversion\nTransparency (market)\n\n\n== References =="