"Scorpions are predatory arachnids of the order Scorpiones. They have eight legs, and are easily recognized by a pair of grasping pincers and a narrow, segmented tail, often carried in a characteristic forward curve over the back and always ending with a stinger. The evolutionary history of scorpions goes back 435 million years. They mainly live in deserts but have adapted to a wide range of environmental conditions, and can be found on all continents except Antarctica. There are over 2,500 described species, with 22 extant (living) families recognized to date. Their taxonomy is being revised to account for 21st-century genomic studies.\nScorpions primarily prey on insects and other invertebrates, but some species take vertebrates. They use their pincers to restrain and kill prey. Scorpions themselves are preyed on by larger animals. The venomous sting can be used both for killing prey and for defense. During courtship, the male and female scorpion grasp each other's pincers and move around in a \"dance\" where the male tries to maneuver the female onto his deposited sperm packet. Most species give live birth and the female cares for the young as their exoskeletons harden, transporting them on her back. The exoskeleton contains fluorescent chemicals and glows under ultraviolet light.\nThe vast majority of species do not represent a serious threat to humans, and healthy adults usually do not need medical treatment after being stung. Only about 25 species have venom capable of killing a human. In some parts of the world with highly venomous species, human fatalities regularly occur, primarily in areas with limited access to medical treatment. Scorpions with their powerful stingers appear in art, folklore, mythology, and commercial brands. Scorpion motifs are woven into kilim carpets for protection from their sting. Scorpius is the name of a constellation, and the corresponding astrological sign is Scorpio; a classical myth tells how the giant scorpion and its enemy, Orion, became constellations on opposite sides of the sky."