"Circular reporting, or false confirmation, is a situation in source criticism where a piece of information appears to come from multiple independent sources, but in reality comes from only one source. In many cases, the problem happens mistakenly through sloppy intelligence-gathering practices. However, at other times the situation can be intentionally contrived by the original source as a way of reinforcing the widespread belief in its information.This problem occurs in a variety of fields, including intelligence gathering, journalism, and scholarly research. It is of particular concern in military intelligence because the original source has a higher likelihood of wanting to pass on misinformation, and because the chain of reporting is more prone to being obscured. It is also a problem in journalism and the development of conspiracy theories, in which the primary goal of a source spreading unlikely or hard-to-believe information is to make it appear to be widely known.\nThe case of the 2002 Niger uranium forgeries was a classic instance of circular reporting by intelligence agencies.\n\n\n== Circular reporting on Wikipedia ==\n\nWikipedia is sometimes criticized for being used as a source of circular reporting, particularly a variant where an unsourced claim in a Wikipedia article is repeated by a reliable source, citing the article; which is then added as a source to the initial claim.\n\n\n=== History of citogenesis ===\n\nIn November 2011, Randall Munroe coined the term citogenesis to describe this phenomenon in an xkcd comic strip, as wordplay on cytogenesis (the original process for the creation of cells) except for citations (often shortened to \"cites\"). The popularity of the comic brought the term into common use, and raised awareness about the risks of Wikipedia-mediated citogenesis for readers and journalists alike. \nThe four-step process illustrated by the comic has been referenced as the typical way that circular reporting develops via Wikipedia.  This has been described as particularly hard-to-catch because of the speed of revisions of modern webpages, and the lack of \"as of\" timestamps in citations and \"last updated\" timestamps on pages online.Inspired by the comic, Wikipedia editors have since maintained an internal list of citogenesis incidents, to monitor its prevalence.Wikipedia advises researchers and journalists to be wary of, and generally avoid, using Wikipedia as a direct source, and to focus instead on verifiable information found in an article's cited references. Researchers and Wikipedians alike are advised to note the retrieved-on date of any web citation, to support identification of the earliest source of a claim.\n\n\n=== Examples on Wikipedia ===\n\nProminent examples of false claims that were propagated on Wikipedia and in news sources because of circular reporting:\n\n2007: Wikipedia and The Independent propagated the false information that comedian Sacha Baron Cohen had worked at Goldman Sachs.\n2008: A student arbitrarily added \"also known as....Brazilian Aardvarks\" to the article on the coati, leading to subsequent commentary on the mammal that mentioned this nickname. Outlets repeating the nickname included The Independent, the Daily Express, the Metro, The Daily Telegraph, the Daily Mail, a book published by the University of Chicago, and a scholarly work published by the University of Cambridge.\n2009: The middle name \"Wilhelm\" was falsely added into Karl-Theodor zu Guttenberg's name. This was propagated by a raft of publications, including German and international press.\n2009: An incorrect release year of 1991 was added to the Wikipedia article of the Casio F-91W watch. The BBC repeated this in a 2011 article. Communication with primary sources repeatedly confirmed a 1989 release year, but as a reliable secondary source, the BBC's use of 1991 made the misinformation difficult to remove. In 2019, KSNV cited this incident as another example of citogenesis.  The correct year was only restored after that review, with the KSNV article becoming cited in the article to support restoring the 1989 release date.\n2014: A statement was anonymously added to the Wikipedia page on UK comedian Dave Gorman stating that he had \"taken a career break for a sponsored hitch-hike around the Pacific Rim countries\". When this was questioned, an article published at a later date (September 2014) in The Northern Echo, a daily regional newspaper in North East England was cited as evidence. Gorman repudiated the claim in an episode of his UK television show Modern Life Is Goodish (first broadcast 22 November 2016).\n\n\n== Examples outside Wikipedia ==\nIn 2001, the Niger uranium forgeries, documents initially released by SISMI (the former military intelligence agency of Italy), seemed to depict an attempt made by Saddam Hussein in Iraq to purchase yellowcake uranium powder from Niger during the Iraq disarmament crisis. They were referenced by other intelligence agencies to convince their governments or publics that such a purchase had taken place.\nIn 2018, Shehroze Chaudhry was identified as an active member of the Islamic State who participated in the killing of several individuals, through reporting involving a The New York Times podcast, among others. The podcast and other outlets referenced blog posts authored by Chaudhry starting in 2016. The podcast was taken by government officials and others as evidence of the crime; however, the original posts were unverified and later renounced by the author.\n\n\n== See also ==\nCircular reasoning\nCircular reference\nDon't repeat yourself (DRY)\nGhost word\nHoax\nMedia echo chamber\nReliability of Wikipedia\nRumor\nSelf-reference\nSelf-reference effect\nSingle source of truth\nSingle version of the truth\nSystem of record\nWikiality\nWoozle effect\n\n\n== References =="