"Tangerine Dream is a German electronic music band founded in 1967 by Edgar Froese. The group has seen many personnel changes over the years, with Froese having been the only continuous member until his death in January 2015. \nThe best-known lineup of the group was its mid-1970s trio of Froese, Christopher Franke, and Peter Baumann. In 1979, Johannes Schmoelling replaced Baumann. Since Froese's death in 2015, the group has been under the leadership of Thorsten Quaeschning (Froese's chosen successor and the current longest-serving band member, having joined in 2005). He is joined by violinist Hoshiko Yamane who joined in 2011, Ulrich Schnauss who joined in 2014 and Paul Frick who joined 9 June 2020.\nTangerine Dream are considered a pioneering act in electronica. Their work with the electronic music Ohr label produced albums that had a pivotal role in the development of the German musical scene known as kosmische (\"cosmic\"). Their \"Virgin Years\", so called because of their association with Virgin Records, produced albums that further explored synthesizers and sequencers, including the UK top 20 albums Phaedra (1974) and Rubycon (1975). The group also had a successful career composing film soundtracks, creating over 60 scores, which include those for the films Sorcerer, Thief, The Soldier, Risky Business, Flashpoint, The Keep, Firestarter, Legend, Three O'Clock High, Near Dark, Shy People, and Miracle Mile.\nFrom the late 1990s into the 2000s, Tangerine Dream continued to explore other styles of instrumental music as well as electronica. Their recorded output has been prolific, including over one hundred albums. Among other scoring projects, they helped create the soundtrack for the video game Grand Theft Auto V. Their mid-1970s work has been profoundly influential in the development of electronic music styles such as new-age (although the band themselves disliked the term) and electronic dance music.\nTheir most recent album of all-new music, Quantum Gate, was released on 29 September 2017. In December 2019, the band released Recurring Dreams, a compilation of new recordings of some of the band's classic compositions.\n\n\n== Lineup ==\nIn the late 1960s and early 1970s, Tangerine Dream existed as several short-lived incarnations, all of which included Froese, who teamed up with several musicians from West Berlin's underground music scene, including Steve Jolliffe, Klaus Schulze, and Conrad Schnitzler.Froese's most notable association was his partnership with Christopher Franke. Franke joined Tangerine Dream in 1970 after serving time in the group Agitation Free, originally to replace Schulze as the drummer. Franke is credited with starting to use electronic sequencers, which were introduced on Phaedra, a development that had not only a large impact on the group's music but to many electronic musicians to this day. Franke stayed with the group for 17 years, leaving in 1988 because of exhausting touring schedules, as well as creative differences with Froese.Other long-term members of the group include Peter Baumann (1971–1977), who later went on to found the new-age label Private Music, to which the band was signed from 1988 to 1991; Johannes Schmoelling (1979–1985); Paul Haslinger (1986–1990); Froese's son Jerome Froese (1990–2006); Linda Spa (1990–1996, 2005–2014), a saxophonist who appeared on numerous albums and concerts and contributed one track on Goblins' Club; and most recently Thorsten Quaeschning of Picture Palace Music (2005–present).\nA number of other members were also part of Tangerine Dream for shorter periods of time. Unlike session musicians, these players also contributed to compositions of the band during their tenures. Some of the more notable members are Steve Schroyder (organist, 1971–1972), Michael Hoenig (who replaced Baumann for a 1975 Australian tour and a London concert, included on Bootleg Box Set Vol. 1), Steve Jolliffe (wind instruments, keyboards and vocals on Cyclone and the following tour; he was also part of a short-lived 1969 line-up), Klaus Krüger (drummer on Cyclone and Force Majeure) and Ralf Wadephul (in collaboration with Edgar Froese recorded album Blue Dawn, but it was released only in 2006; also credited for one track on Optical Race (1988) and toured with the band in support of this album).\nThroughout the 1990s and into the 2000s, Tangerine Dream was often joined on stage by Zlatko Perica or Gerald Gradwohl on guitars, and Emil Hachfeld on electronic drums. Jerome Froese left in 2006 after a concert at the Tempodrom in Berlin. Until late 2014, Tangerine Dream comprised Edgar Froese, as well as Thorsten Quaeschning, who first collaborated in the composition of Jeanne d'Arc (2005). For concerts and recordings, they were usually joined by Linda Spa on saxophone and flute, Iris Camaa on drums and percussion, and Bernhard Beibl on guitar. In 2011, electric violinist Hoshiko Yamane was added to the lineup and is featured on some of the most recent albums.In late 2014, Bernhard Beibl announced on his Facebook page that he would stop collaborating with Tangerine Dream. Shortly thereafter, it was announced that Tangerine Dream would no longer be touring with Linda Spa or Iris Camaa, but that Ulrich Schnauss had been brought into the fold. Edgar Froese's death in January 2015, however, left this a short-lived line-up.\n\n\n== History ==\n\n\n=== Origins: psychedelia and krautrock ===\nEdgar Froese arrived in West Berlin in the mid-1960s to study art. His first band, the psychedelic rock-styled The Ones, disbanded after releasing only one single. After The Ones, Froese experimented with musical ideas, playing smaller gigs with a variety of musicians. Most of these performances were in the famous Zodiak Free Arts Lab, although one grouping also had the distinction of being invited to play for the surrealist painter Salvador Dalí. The music was partnered with literature, painting, early forms of multimedia, and more. It seemed as though only the most outlandish ideas attracted any attention, leading Froese to comment: \"In the absurd often lies what is artistically possible.\" As members of the group came and went, the direction of the music continued to be inspired by the Surrealists, and the group came to be called by the surreal-sounding name of Tangerine Dream, inspired by mishearing the line \"tangerine trees and marmalade skies\" from the Beatles' track \"Lucy in the Sky with Diamonds\".Froese was fascinated by technology and skilled in using it to create music. He built custom-made instruments and, wherever he went, collected sounds with tape recorders for use in constructing musical works later. His early work with tape loops and other repeating sounds was the obvious precursor to the emerging technology of the sequencer, which Tangerine Dream quickly adopted upon its arrival.\nThe first Tangerine Dream album, Electronic Meditation, was a tape-collage Krautrock piece, using the technology of the time rather than the synthesized music they later became famous for. The line-up for the album was Froese, Klaus Schulze, and Conrad Schnitzler. Electronic Meditation was published by Ohr in 1970 and began the period known as the Pink Years (the Ohr logo was a pink ear). Subsequent albums, beginning with Alpha Centauri, relied heavily on electronic instruments. The band's music during the early 1970s prominently featured organ from Steve Schroyder (on Alpha Centauri) or Peter Baumann (on subsequent releases), commonly augmented by guitar from Froese and drums from Christopher Franke. They also started their heavy usage of the Mellotron during this period.\n\n\n=== Rise to fame: the Virgin years ===\nThe band's 1973 album Atem was named as Album of the Year by British DJ John Peel, and this attention helped Tangerine Dream to sign to the fledgling Virgin Records in the same year. Soon afterward they released the album Phaedra, an eerie soundscape that unexpectedly reached No. 15 in the UK Albums Chart and became one of Virgin's first bona fide hits. Phaedra was one of the first commercial albums to feature sequencers and came to define much more than just the band's own sound. The creation of the album's title track was something of an accident: the band was experimenting in the studio with a recently acquired Moog synthesizer, and the tape happened to be rolling at the time. They kept the results and later added flute, bass guitar, and Mellotron performances. The Moog, like many other early synthesizers, was so sensitive to changes in temperature that its oscillators would drift badly in tuning as the equipment warmed up, and this drift can easily be heard on the final recording. This album marked the beginning of the period known as the 'Virgin Years'.\nTheir mid-1970s work has been profoundly influential in the development of electronic music styles such as new-age (although the band themselves disliked the term) and electronic dance music.In the 1980s, along with other electronic music pioneers such as Jean-Michel Jarre (with whom Edgar Froese collaborated on Jarre's 2015 album Electronica 1: The Time Machine) and Vangelis, the band were early adopters of the new digital technology, which revolutionized the sound of the synthesizer, although the group had been using digital equipment (in some shape or form) as early as the mid-1970s. Their technical competence and extensive experience in their early years with self-made instruments and unusual means of creating sounds meant that they were able to exploit this new technology to make music quite unlike anything heard before.\n\n\n=== Tangerine Dream live ===\nTangerine Dream's earliest concerts were visually simple by modern standards, with three men sitting motionless for hours alongside massive electronic boxes festooned with patch cords and a few flashing lights. Some concerts were even performed in complete darkness, as happened during the performance at York Minster on 20 October 1975. As time went on and technology advanced, the concerts became much more elaborate, with visual effects, lighting, lasers, pyrotechnics, and projected images. By 1977 their North American tour featured full-scale Laserium effects.\nThrough the 1970s and 1980s, the band toured extensively. The concerts generally included large amounts of unreleased and improvised material and were consequently widely bootlegged. They were notorious for playing extremely loudly (reaching 134 dB in 1976) and for a long time. The band released recordings of a fair number of their concerts, and on some of these the band worked out material that would later form the backbone of their studio recordings. (For example, Tangerine Dream, re-released as Pergamon, which documents a concert given in East Berlin shortly after Johannes Schmoelling joined the group, contains themes that would appear later on Tangram.) An early example of this was the Ricochet album, which was recorded during a tour that included European cathedrals, with some later overdubbing.\n\n\n=== Forays into vocals ===\n\nMost of Tangerine Dream's albums are entirely instrumental.  Three albums that prominently featured lyrics were Cyclone (1978), Tyger and Under Cover – Chapter One. While there have occasionally been a few vocals on the band's other releases, such as the track \"Kiew Mission\" from 1981's Exit and \"The Harbor\" from 1987's Shy People, the group only recently returned to featuring vocals in a musical trilogy based on Dante's Divine Comedy and their 2007 album Madcap's Flaming Duty.\nAfter their 1980 East Berlin gig, when they became one of the first major Western bands to perform in a communist country.  Tangerine Dream released a double live album of one of their performances there, called Poland, recorded during their tour in the winter at the end of 1983. With Poland, the band moved to the Jive Electro label, marking the beginning of the Blue Years.\n\n\n=== Soundtracks ===\nThroughout the 1980s, Tangerine Dream composed scores for more than 20 films. This had been an interest of Froese's since the late 1960s, when he scored an obscure Polish film, as well as appearing as an actor in several German underground films. He made the score for the experimental film \"Never shoot the bathroom man\", directed by Jürgen Polland. Many of the group's soundtracks were composed at least partially of reworked material from the band's studio albums or work that was in progress for upcoming albums; see, for example, the resemblance between the track \"Igneous\" on their soundtrack for Thief and the track \"Thru Metamorphic Rocks\" on their studio release Force Majeure. Their first exposure on U.S. television came when a track for the then in-progress album Le Parc was used as the theme for the television program Street Hawk. Some of the more famous soundtracks have been Sorcerer, Thief, Legend, Risky Business, The Keep, Firestarter, Flashpoint, Heartbreakers, Shy People and Near Dark.Tangerine Dream also composed the soundtrack score for the video game Grand Theft Auto V.In 2016, Tangerine Dream released their own version of the theme music for the television series Stranger Things.  Tangerine Dream had inspired music for the series.\n\n\n=== Going independent ===\nSeveral of the band's albums released during the 1990s were nominated for Grammy Awards. Since then, Tangerine Dream with Jerome Froese took a directional change away from the new-age leanings of those albums and toward an electronica style. After Jerome's departure, founder Edgar Froese steered the band in a direction somewhat reminiscent of material throughout their career.\nIn later years, Tangerine Dream released albums in series. The Dream Mixes series began in 1995 with the last being released in 2010. The Divine Comedy series, based on the writings of Dante Alighieri, spanned 2002–2006. From 2007 to 2010, the Five Atomic Seasons were released. Most recently, the Eastgate Sonic Poems series, based on the works of famous poetic authors such as Edgar Allan Poe and Franz Kafka, began in 2011, with the last appearing in 2013. Also, beginning in 2007, Tangerine Dream released a number of EPs, referred to as \"CupDiscs\" by the band.\nEdgar Froese also released a number of solo recordings, which are similar in style to Tangerine Dream's work. Jerome Froese released a number of singles as TDJ Rome, which are similar to his work within the Dream Mixes series. In 2005 he released his first solo album Neptunes under the name Jerome Froese.  In 2006 Jerome left Tangerine Dream to concentrate on his solo career. His second solo album Shiver Me Timbers was released on 29 October 2007, and his third, Far Side of the Face, was released in 2012. Beginning in 2011, Jerome Froese joined with former Tangerine Dream member Johannes Schmoelling and keyboardist Robert Waters to form the band Loom, which plays original material, as well as Tangerine Dream classics. Thorsten Quaeschning, leader of Picture Palace Music, was brought into Tangerine Dream in 2005 and contributed to most of the band's albums and CupDiscs since then.\nThe group had recording contracts with Ohr, Virgin, Jive Electro, Private Music, and Miramar, and many of the minor soundtracks were released on Varèse Sarabande. In 1996, the band founded their own record label, TDI, and more recently, Eastgate. Subsequent albums are today generally not available in normal retail channels but are sold by mail-order or through online channels. The same applies to their Miramar releases, the rights to which the band bought back. Meanwhile, their Ohr and Jive Electro catalogs (known as the \"Pink\" and \"Blue\" Years) are currently owned by Esoteric Recordings.\n\n\n=== Concert updates ===\n\nTo celebrate their 40th anniversary (1967–2007), Tangerine Dream announced their only UK concert: at London Astoria on 20 April 2007. The band also played a totally free open-air concert in Eberswalde on 1 July 2007 and at the Alte Oper in Frankfurt on Main on 7 October 2007. 2008 saw the band in Eindhoven Netherlands playing at E-Day (an electronic music festival); later in the year they also played the Night of the Prog Festival in Loreley, Germany, as well as concerts at the Kentish Town Forum, in London on 1 November, at the Picture House, Edinburgh on 2 November, and their first live concert in the US for over a decade, at the UCLA Royce Hall, Los Angeles on 7 November.\nIn 2009, the group announced that they would play a concert at the Royal Albert Hall in London, on 1 April 2010, titled the Zeitgeist concert, 35 years after their milestone concert there on 2 April 1975. The entire concert was released as a 3-CD live album on 7 July 2010.Tangerine Dream embarked in spring and summer 2012 on a tour of Europe, Canada and the USA called The Electric Mandarine Tour 2012: The 1st leg was a 5-date European tour, beginning on 10 April in Budapest (Hungary) via Padua (Italy), Milano (Italy), Zurich (Switzerland), and ending on 10 May in Berlin (Germany). The 2nd leg was a North-American tour which started with the Jazz Festival in Montréal (Canada) on 30 June, followed by a concert on 4 July at the Bluesfest in Ottawa (Canada) and continued as a 10-date US journey beginning in July in Boston, then New York, Philadelphia, Washington, and California. On 16 November 2014, Tangerine Dream performed in Melbourne, Australia, as part of Melbourne Music Week. They were the final shows with Froese.  Tangerine Dream played two consecutive nights at the Union Chapel, Islington London on April 23 & 24 2018, the second supported by ex-Japan and Porcupine Tree musician Richard Barbieri. In October and November 2019, Tangerine Dream went on its 16 step Random & Revision Tour.\n\n\n=== After Edgar Froese's death ===\nEdgar Froese died suddenly in Vienna on 20 January 2015 from a pulmonary embolism. On 6 April 2015, the group's remaining members (Quaeschning, Schnauss and Yamane) and Bianca Acquaye (Froese's widow), pledged to continue working together in an effort to fulfill Froese's vision for the group. However, ex-member Jerome Froese announced in his Facebook time line that in his opinion Tangerine Dream will not exist without his father.Tangerine Dream played their first show following Froese's death on 9 June 2016 in Szczecin, Poland.On 29 September 2017, Tangerine Dream released their new studio album entitled Quantum Gate, celebrating the 50th anniversary of the band's foundation. The album is based on ideas and musical sketches by founder Edgar Froese and was completed by the remaining members of the band.On 31 January 2020, Tangerine Dream re-released their December 2019 album Recurring Dreams, an 11-track collection of new recordings of some of the band's classic tracks, worldwide through Kscope. This was launched to coincide with the Tangerine Dream: Zeitraffer exhibition which opened on 17 January 2020 at London's Barbican and runs until 2 May 2020.On 9 June 2020 Paul Frick became the first member to join the group following Edgar's death after making guest appearances the prior two years. The group is currently working on a new album as a four-piece to be released in fall 2021 via Kscope. Frick has the unique distinction of being the first addition to the group who did not ever personally meet Froese. \n\n\n== Artistic connections ==\n\n\n=== Influences ===\nTangerine Dream began as a surreal rock band, with each of the members contributing different musical influences and styles. Edgar Froese's guitar style was inspired by Jimi Hendrix, while Christopher Franke contributed the more avant garde elements of Karlheinz Stockhausen and Terry Riley. Yes-like progressive rock influence was brought in by Steve Jolliffe on Cyclone. The sample-based sound collages of Johannes Schmoelling drew their inspiration from a number of sources; one instance is Steve Reich's Music for 18 Musicians on parts of Logos Live, and the track \"Love on a Real Train\" from the Risky Business soundtrack.Classical music has had an influence on the sound of Tangerine Dream over the years. György Ligeti, Johann Sebastian Bach, Pierre Boulez, Iannis Xenakis, Maurice Ravel, and Arcangelo Corelli are clearly visible as dominant influences in the early albums. A Baroque sensibility sometimes informs the more coordinated sequencer patterns, which has its most direct expression in the La Folia section that comes at the very end of the title track of Force Majeure. In live performances, the piano solos often directly quoted from Romantic classical works for piano, such as the Beethoven and Mozart snippets in much of the late 1970s – early 1980s stage shows. In the bootleg recording of the Mannheim Mozartsaal concert of 1976 (Tangerine Tree volume 13), the first part of the first piece also clearly quotes from Franz Liszt's Totentanz. The first phrase is played on a harpsichord synthesizer patch and is answered by the second half of the phrase in a flute voicing on a Mellotron. During the 1990s, many releases included recordings of classical compositions: Pictures at an Exhibition (on Turn of the Tides), Largo (from Xerxes) (on Tyranny of Beauty), Symphony in A Minor (by J. S. Bach), and Concerto in A Major / Adagio (by Wolfgang Amadeus Mozart) (both on Ambient Monkeys).\nSince the 1990s, Tangerine Dream have also recorded cover versions of Jimi Hendrix' \"Purple Haze\" (first on 220 Volt Live) and The Beatles' \"Eleanor Rigby\", \"Back in the U.S.S.R.\", \"Tomorrow Never Knows\", and \"Norwegian Wood\".\nAn infrequently recurring non-musical influence on Tangerine Dream, and Edgar Froese in particular, have been 12th–19th-century poets. This was first evident on the 1981 album Exit, the track title \"Pilots of the Purple Twilight\" being a quote from Alfred Lord Tennyson's poem Locksley Hall. Six years later, the album Tyger featured poems from William Blake set to music; and around the turn of the millennium, Edgar Froese started working on a musical trilogy based on Dante Alighieri's Divine Comedy, completed in 2006. Most recently, the 2007 album Madcap's Flaming Duty features more poems set to music, some again from Blake but also e.g. Walt Whitman.\nPink Floyd were also an influence on Edgar Froese and Tangerine Dream, the band in its very early psychedelic rock band phase playing improvisations based on Pink Floyd's \"Interstellar Overdrive\". Madcap's Flaming Duty is dedicated to the memory of the late Syd Barrett. The title refers to Barrett's solo release \"The Madcap Laughs\".\nThe band's influence can be felt in ambient artists such as Deepspace, The Future Sound of London, David Kristian, and Global Communication, as well as rock, pop, and dance artists such as Porcupine Tree, M83, DJ Shadow, Ulrich Schnauss, Cut Copy, and Kasabian. The band also clearly influenced 1990s and 2000s trance music, where lush soundscapes and synth pads are used along with repetitive synth sequences, much like in their 1975 releases Rubycon and Ricochet, as well as some of their music from the early 1980s. The group have also been sampled countless times, more recently by Recoil on the album SubHuman, by Sasha on Involver, and on several Houzan Suzuki albums. Michael Jackson also cited Tangerine Dream as one of his favourite bands, especially their 1977 soundtrack for Sorcerer.\n\n\n=== In popular culture ===\nSteven Wilson, of Porcupine Tree, stated that Tangerine Dream was one of his influences to make his music, and often cites Zeit as his all-time favorite album.\nJapanese electronic musician Susumu Hirasawa dedicated his song \"Island Door (Paranesian Circle)\" (トビラ島（パラネシアン・サークル）, Tobira Shima (Paraneshian Circle)) to Tangerine Dream.\nIn 2016, Netflix's original show Stranger Things used three Tangerine Dream tracks in its soundtrack: \"Green Desert\" from Green Desert (1986) in episode five, \"Exit\" from Exit (1981) in episode six and \"Tangent (Rare Bird)\" from Poland (1984) in episode eight. Composers of the soundtrack for the show, Kyle Dixon and Michael Stein of the electronic band Survive, also cited Tangerine Dream as the key influence behind the soundtrack, some of which were later covered by Tangerine Dream themselves.\n\n\n== Personnel ==\n\n\n=== Members ===\nCurrent membersThorsten Quaeschning – bandleader, music director, synthesizer, sequencer, drums, guitar (2005–present)\nHoshiko Yamane – acoustic violin, electric viola, electric violin, cello, Ableton Push controller, looper, synthesizer (2011–present)\nUlrich Schnauss – synthesizer, piano, sequencer, Ableton (2014–2019. 2020 to present studio only)\nPaul Frick – synthesizer, piano (2020–present, guest:2018-2020)Bianca Froese-Acquaye, Edgar Froese's widow, has taken up the mantle of continuing the legacy of the group and works closely in a non-musical capacity with the remaining members.\n\nFormer members\n\n\n=== Line-ups ===\n\n\n=== Timeline ===\n\n\n=== Guest musicians ===\n\n\n== Discography ==\nTangerine Dream has released over one hundred albums (not counting compilations and fan releases) over the last five decades. A project to collect and release fan concert recordings, known as the Tangerine Tree, was active from 2002 to 2006.\n\n\n== References ==\n\n\n== External links ==\nOfficial website\nTangerine Dream at IMDb\nTANGAUDIMAX – The Tangerine Dream Sound Museum"