"Tangerine Dream is a German electronic music band founded in 1967 by Edgar Froese. The group has seen many personnel changes over the years, with Froese having been the only continuous member until his death in January 2015. \nThe best-known lineup of the group was its mid-1970s trio of Froese, Christopher Franke, and Peter Baumann. In 1979, Johannes Schmoelling replaced Baumann. Since Froese's death in 2015, the group has been under the leadership of Thorsten Quaeschning (Froese's chosen successor and the current longest-serving band member, having joined in 2005). He is joined by violinist Hoshiko Yamane who joined in 2011, Ulrich Schnauss who joined in 2014 and Paul Frick who joined 9 June 2020.\nTangerine Dream are considered a pioneering act in electronica. Their work with the electronic music Ohr label produced albums that had a pivotal role in the development of the German musical scene known as kosmische (\"cosmic\"). Their \"Virgin Years\", so called because of their association with Virgin Records, produced albums that further explored synthesizers and sequencers, including the UK top 20 albums Phaedra (1974) and Rubycon (1975). The group also had a successful career composing film soundtracks, creating over 60 scores, which include those for the films Sorcerer, Thief, The Soldier, Risky Business, Flashpoint, The Keep, Firestarter, Legend, Three O'Clock High, Near Dark, Shy People, and Miracle Mile.\nFrom the late 1990s into the 2000s, Tangerine Dream continued to explore other styles of instrumental music as well as electronica. Their recorded output has been prolific, including over one hundred albums. Among other scoring projects, they helped create the soundtrack for the video game Grand Theft Auto V. Their mid-1970s work has been profoundly influential in the development of electronic music styles such as new-age (although the band themselves disliked the term) and electronic dance music.\nTheir most recent album of all-new music, Quantum Gate, was released on 29 September 2017. In December 2019, the band released Recurring Dreams, a compilation of new recordings of some of the band's classic compositions.\n\n"