"The Rape of Belgium was the brutal mistreatment of Belgian civilians by German troops during the invasion and occupation of Belgium in World War I.\nThe neutrality of Belgium had been guaranteed by the Treaty of London (1839), which had been signed by Prussia. However, the German Schlieffen Plan required that German armed forces pass through Belgium (thus violating Belgium's neutrality) in order to outflank the French Army, concentrated in eastern France. The German Chancellor Theobald von Bethmann Hollweg dismissed the treaty of 1839 as a \"scrap of paper\". Throughout the beginning of the war, the German army engaged in numerous atrocities against the civilian population of Belgium, including the destruction of civilian property; 6,000 Belgians were killed, and 17,700 died during expulsion, deportation, imprisonment, or death sentence by court. Another 3,000 Belgian civilians died due to electric fences the German Army put up to prevent civilians from fleeing the country and 120,000 became forced laborers, with half of that number deported to Germany. 25,000 homes and other buildings in 837 communities were destroyed in 1914 alone, and 1.5 million Belgians (20% of the entire population) fled from the invading German army.: 13 \n\n\n== War crimes ==\n\nIn some places, particularly Liège, Andenne and Leuven, but firstly Dinant, there is evidence that the violence against civilians was premeditated.: 573–4  However, in Dinant, the German army believed the inhabitants were as dangerous as the French soldiers themselves.\n\n\n=== Victimization of civilians ===\nGerman troops, afraid of Belgian guerrilla fighters, or francs-tireurs (\"free shooters\"), burned homes and executed civilians throughout eastern and central Belgium, including Aarschot (156 dead), Andenne (211 dead), Seilles, Tamines (383 dead), and Dinant (674 dead). The victims included men, women, and children. In the Province of Brabant, nuns were ordered to strip under the pretext that they were spies or men in disguise. However, there is no evidence that nuns were violated.: 164  In and around Aarschot, between August 19 and the recapture of the town by September 9, women were repeatedly victimized. Rape was nearly as ubiquitous as murder, arson and looting, if never as visible.: 164–165 \n\n\n=== Sack of Leuven ===\n\nOn August 25, 1914, the German army ravaged the city of Leuven, deliberately burning the university library, destroying approximately 230,000 books, 950 manuscripts, and 800 incunabula. Civilian homes were set on fire and citizens were often shot where they stood, with over 2,000 buildings destroyed and 10,000 inhabitants displaced. Large quantities of strategic materials, foodstuffs and modern industrial equipment were looted and transferred to Germany during 1914. These actions brought worldwide condemnation. (There were also several friendly fire incidents between groups of German soldiers during the confusion.)\n\n\n=== Death toll ===\nThe Germans were responsible for the deaths of 23,700 Belgian civilians, (6,000 Belgians killed, 17,700 died during expulsion, deportation, in prison or sentenced to death by court) and caused further non-fatalities of 10,400 permanent and 22,700 temporary invalids, with 18,296 children becoming war orphans. Military losses were 26,338 killed, died from injuries or accidents, 14,029 died from disease, or went missing.\n\n\n== Industrial dismantlement ==\n\nAs raw material usually imported from abroad dried up, more firms laid off workers. Unemployment became a major problem and increased reliance on charity distributed by civil institutions and organizations. As many as 650,000 people were unemployed between 1915 and 1918.The German authorities used the unemployment crisis to loot industrial machinery from Belgian factories, which was either sent to Germany intact or melted down.  The German policies enacted by the Imperial German General Government of Belgium would later create major problems for Belgian economic recovery after the end of the war.\n\n\n== Wartime propaganda ==\n\nAgreeing with the analysis of historian Susan Kingsley Kent, historian Nicoletta Gullace writes that \"the invasion of Belgium, with its very real suffering, was nevertheless represented in a highly stylized way that dwelt on perverse sexual acts, lurid mutilations, and graphic accounts of child abuse of often dubious veracity.\": 19  In Britain, many patriotic publicists propagated these stories on their own. For example, popular writer William Le Queux described the German army as \"one vast gang of Jack-the-Rippers\", and described in graphic detail events such as a governess hanged naked and mutilated, the bayoneting of a small baby, or the \"screams of dying women\", raped and \"horribly mutilated\" by German soldiers, accusing them of cutting off the hands, feet, or breasts of their victims.: 18–19 Gullace argues that \"British propagandists were eager to move as quickly as possible from an explanation of the war that focused on the murder of an Austrian archduke and his wife by Serbian nationalists to the morally unambiguous question of the invasion of neutral Belgium\". In support of her thesis, she quotes from two letters of Lord Bryce. In the first letter Bryce writes \"There must be something fatally wrong with our so-called civilization for this Ser[b]ian cause so frightful a calamity has descended on all Europe\". In a subsequent letter Bryce writes \"The one thing we have to comfort us in this war is that we are all absolutely convinced of the justice of the cause, and of our duty, once Belgium had been invaded, to take up the sword\".: 20 Although the infamous German phrase \"scrap of paper\" (referring to the 1839 Treaty of London) galvanized a large segment of British intellectuals in support of the war,: 21–22  in more proletarian circles this imagery had less impact. For example, Labour politician Ramsay MacDonald upon hearing about it, declared that \"Never did we arm our people and ask them to give up their lives for a less good cause than this\". British army recruiters reported problems in explaining the origins of the war in legalistic terms.: 23 As the German advance in Belgium progressed, British newspapers started to publish stories on German atrocities. The British press, \"quality\" and tabloid alike, showed less interest in the \"endless inventory of stolen property and requisitioned goods\" that constituted the bulk of the official Belgian Reports. Instead, accounts of rape and bizarre mutilations flooded the British press. The intellectual discourse on the \"scrap of paper\" was then mixed with the more graphic imagery depicting Belgium as a brutalized woman, exemplified by the cartoons of Louis Raemaekers,: 24  whose works were widely syndicated in the US.Part of the press, such as the editor of The Times and Edward Tyas Cook, expressed concerns that haphazard stories, a few of which were proven as outright fabrications, would weaken the powerful imagery, and asked for a more structured approach. The German and American press questioned the veracity of many stories, and the fact that the British Press Bureau did not censor the stories put the British government in a delicate position. The Bryce Committee was eventually appointed in December 1914 to investigate.: 26–28  Bryce was considered highly suitable to lead the effort because of his prewar pro-German attitudes and his good reputation in the United States, where he had served as Britain's ambassador, as well as his legal expertise.: 30 \n\nThe commission's investigative efforts were, however, limited to previously recorded testimonies. Gullace argues that \"the commission was in essence called upon to conduct a mock inquiry that would substitute the good name of Lord Bryce for the thousands of missing names of the anonymous victims whose stories appeared in the pages of the report\". The commission published its report in May 1915. Charles Masterman, the director of the British War Propaganda Bureau, wrote to Bryce: \"Your report has swept America. As you probably know even the most skeptical declare themselves converted, just because it is signed by you!\": 30  Translated in ten languages by June, the report was the basis for much subsequent wartime propaganda and was used as a sourcebook for many other publications, ensuring that the atrocities became a leitmotif of the war's propaganda up to the final \"Hang the Kaiser\" campaign.: 31–23 For example, in 1917 Arnold J. Toynbee published The German Terror in Belgium, which emphasized the most graphic accounts of \"authentic\" German sexual depravity, such as: \"In the market-place of Gembloux a Belgian despatch-rider saw the body of a woman pinned to the door of a house by a sword driven through her chest. The body was naked and the breasts had been cut off.\"Much of the wartime publishing in Britain was in fact aimed at attracting American support. A 1929 article in The Nation asserted: \"In 1916 the Allies were putting forth every possible atrocity story to win neutral sympathy and American support. We were fed every day [...] stories of Belgian children whose hands were cut off, the Canadian soldier who was crucified to a barn door, the nurses whose breasts were cut off, the German habit of distilling glycerine and fat from their dead in order to obtain lubricants; and all the rest.\"The fourth Liberty bond drive of 1918 employed a \"Remember Belgium\" poster depicting the silhouette of a young Belgian girl being dragged by a German soldier on the background of a burning village; historian Kimberly Jensen interprets this imagery as \"They are alone in the night, and rape seems imminent. The poster demonstrates that leaders drew on the American public's knowledge of and assumptions about the use of rape in the German invasion of Belgium.\"In his book Roosevelt and Hitler, Robert E. Herzstein stated that \"The Germans could not seem to find a way to counteract powerful British propaganda about the 'Rape of Belgium' and other alleged atrocities\". About the legacy of the propaganda, Gullace commented that \"one of the tragedies of the British effort to manufacture truth is the way authentic suffering was rendered suspect by fabricated tales\".: 32 \n\n\n== Aftermath ==\n\n\n=== Later analysis ===\n\nIn the 1920s, the war crimes of August 1914 were often dismissed as British propaganda. In recent years numerous scholars have examined the original documents and concluded that large-scale atrocities did occur, while acknowledging that other stories were fabrications.: 162  There is a debate between those who believe the German army acted primarily out of paranoia, in retaliation for real or believed incidents involving resistance actions by Belgian civilians, and those (including Lipkes) who emphasize additional causes, suggesting an association with German actions in the Nazi era.\nAccording to Larry Zuckerman, the German occupation far exceeded the constraints international law imposed on an occupying power. A heavy-handed German military administration sought to regulate every detail of daily life, both on a personal level with travel restraints and collective punishment, and on the economic level by harnessing the Belgian industry to German advantage and by levying repeated massive indemnities on the Belgian provinces. Before the war Belgium produced 4.4 percent of world commerce.: 44  More than 100,000 Belgian workers were forcibly deported to Germany to work in the war economy, and to Northern France to build roads and other military infrastructure for the German army.\n\n\n=== Historical studies ===\nRecent in-depth historical studies of German acts in Belgium include:\n\nThe Rape of Belgium: The Untold Story of World War I by Larry Zuckerman\nRehearsals: The German Army in Belgium, August 1914 by Jeff Lipkes\nGerman Atrocities 1914: A History of Denial by John Horne and Alan Kramer.\nSchuldfragen. Belgischer Untergrundkrieg und deutsche Vergeltung im August 1914 by Ulrich KellerHorne and Kramer describe some of the motivations for German tactics, chiefly (but not only), the collective fear of a \"People's War\":\n\nThe source of the collective fantasy of the People's War and of the harsh reprisals with which the German army (up to its highest level) responded are to be found in the memory of the Franco-Prussian War of 1870–1, when the German armies faced irregular Republican soldiers (or francs-tireurs), and in the way in which the spectre of civilian involvement in warfare conjured up the worst fears of democratic and revolutionary disorder for a conservative officer corps.\nThe same authors identify a number of contributory factors:\n\ninexperience leading to lack of discipline amongst German soldiers\ndrunkenness\n'friendly fire' incidents arising from panic\nfrequent collisions with Belgian and French rearguards leading to confusion\nrage at the stubborn and at first successful defense of Liège during the Battle of Liège\nrage at Belgian resistance at all, not seen as a people entitled to defend themselves\nprevailing near hatred towards the Roman Catholic clergy in Belgium and France\nambiguous or inadequate German field service regulations regarding civilians\nfailure of German logistics later leading to uncontrolled lootingRecent studies conducted by Ulrich Keller have put the reasoning of Horne and Kramer into question. Keller claims that the reason for the brutal German behavior in the first few months of the invasion was due to the existence of a substantial Belgian partisan movement. He claims the organized resistance was led by the Garde Civique. As evidence he provides German medical records which show a substantial number of German soldiers wounded by shotguns which were neither in use by the Germans nor by French nor Belgian rearguard units as well as records by the Belgian government.Keller's claims have led to an argument among historians which led to a conference being held in 2017. The conference was jointly organized by Sönke Neitzel, Oliver Janz, and Peter Hoeres and focused on the German behaviour in Belgium during the opening stages of the First World War. During the conference the following historians were able to present their arguments:\n\nUlrich Keller (Santa Barbara)\nJohn Horne (Dublin) and Alan Kramer (Dublin)\nAlexander Watson (London)\nOswald Überegger (Bozen)\nPeter Lieb (Potsdam)\nAxel Tixhon (Namur)\nLarissa Wegner (Freiburg)In sum, the conference demonstrated the need for additional research, particularly on the Belgian role in 1914 and the key question how widespread the irregular resistance had been. The evidence provided by Keller hints at a more than merely sporadic resistance by irregular Belgian fighters.\n\n\n=== Legacy ===\nAt a commemoration ceremony on May 6, 2001 in the Belgian town of Dinant, attended by Belgium's defense minister Andre Flahaut, World War II veterans, and the ambassadors of Germany, France and Britain, state secretary of the German Ministry of Defence, Walter Kolbow, officially apologized for a massacre of 674 civilians that took place on August 23, 1914 in the aftermath of the Battle of Dinant:\n\nWe have to recognize the injustices that were committed, and ask forgiveness. That is what I am doing with a deep conviction today. I apologise to you all for the injustice the Germans committed in this town.\nMr Kolbow placed a wreath and bowed before a monument to the victims bearing the inscription: To the 674 Dinantais martyrs, innocent victims of German barbarism.\n\n\n== See also ==\nDestruction of Kalisz (1914)\nHerero and Namaqua genocide (1904–1907)—an earlier atrocity in German South-West Africa\nLeipzig War Crimes Trials\n\n\n== References ==\n\n\n== Further reading ==\n\n\n=== Books ===\n\n\n=== Journals ===\nGreen, Leanne (2014). \"Advertising war: Picturing Belgium in First World War publicity\". Media, War & Conflict. 7#3 (3): 309–325. doi:10.1177/1750635214557534.\nGullace, Nicoletta F. \"Allied Propaganda and World War I: Interwar Legacies, Media Studies, and the Politics of War Guilt\" History Compass (Sept 2011) 9#9 pp 686–700\nHorne, J.; Kramer, A. (1994). \"German 'Atrocities' and Franco-German Opinion, 1914: The Evidence of German Soldiers' Diaries\". Journal of Modern History. 66 (1): 1–33. doi:10.1086/244776. ISSN 0022-2801. JSTOR 2124390.\nJones, Heather (2014). \"The Great War: How 1914–18 Changed the Relationship between War and Civilians\". The RUSI Journal. 159#4 (4): 84–91. doi:10.1080/03071847.2014.946698.\nNelson, Robert L. (2004). \"Ordinary Men in the First World War? German Soldiers as Victims and Participants\". Journal of Contemporary History. 39#3 (3): 425–435. doi:10.1177/0022009404044448. ISSN 0022-0094. JSTOR 3180736.\nWilson, Trevor (1979). \"Lord Bryce's Investigation into Alleged German Atrocities in Belgium, 1914–1915\". Journal of Contemporary History. 14#3 (3): 369–383. doi:10.1177/002200947901400301. ISSN 0022-0094. JSTOR 260012. sees the Bryce report as exaggerated propaganda\n\n\n== External links ==\n\nWegner, Larissa: Occupation during the War (Belgium and France) , in: 1914-1918-online. International Encyclopedia of the First World War.\nKramer, Alan: Atrocities, in: 1914-1918-online. International Encyclopedia of the First World War.\nDebruyne, Emmanuel: Intimate Relations between Occupiers and Occupied (Belgium and France) , in: 1914-1918-online. International Encyclopedia of the First World War.\nH-Net Review of Horne & Kramer, The German Atrocities of 1914: A History of Denial\nH-Net Review of L. Zuckerman, The Rape of Belgium: The Untold Story of World War I\nHistoryOfWar.org Review of J. Lipkes, Rehearsals: The German Army in Belgium, August 1914\nH-Net Review of J. Lipkes Rehearsals: The German Army in Belgium, August 1914 by Jeffrey Smith\nH-Net Review of J. Lipkes. Rehearsals: The German Army in Belgium, August 1914 by Robby Van Eetvelde\nProf. John Horne, German War Crimes\n[1]"