"A diaspora ( dye-AS-pər-ə) is a scattered population whose origin lies in a separate geographic locale. Historically, the word diaspora was used to refer to the mass dispersion of a population from its indigenous territories, specifically the dispersion of Jews. Whilst the word was originally used to describe the forced displacement of certain peoples, \"diasporas\" is now generally used to describe those who identify with a \"homeland\", but live outside of it.Some notable diasporas are the Assyrian Diaspora which originated during and after the Arab conquest of Iraq, Syria, Turkey and Iran, and continued in the aftermath of the Assyrian genocide; the southern Chinese and Indians who left their homelands during the 19th to 20th century; the Irish who left Ireland during and after the Great Famine; the Scottish who emigrated on a large scale after the Highland and Lowland Clearances; the Romani from India; the Italian diaspora and the Mexican diaspora; the exile and deportation of Circassians; the Palestinian diaspora following the flight or expulsion of Arabs from Palestine; the Armenian Diaspora following the Armenian genocide; the Lebanese Diaspora due to the Lebanese Civil War; the fleeing of Greeks from Turkey after the fall of Constantinople, the later Greek genocide, and the Istanbul pogroms, and the emigration of Anglo-Saxon warriors and their families after the Norman Conquest, primarily to the Byzantine Empire.Recently, scholars have distinguished between different kinds of diaspora, based on its causes such as colonialism, trade or labor migrations, or by the kind of social coherence within the diaspora community and its ties to the ancestral lands. Some diaspora communities maintain strong political ties with their homeland. Other qualities that may be typical of many diasporas are thoughts of return, keeping ties back home (country of origin) relationships with other communities in the diaspora, and lack of full integration into the host countries. Diasporas often maintain ties to the country of their historical affiliation and influence the policies of the country where they are located.\nAs of 2019, according to the United Nations, the Indian diaspora is the world's largest diaspora with a population of 17.5 million, followed by the Mexican diaspora with a population of 11.8 million and the Chinese diaspora with a population of 10.7 million."