"Zhelyu Mitev Zhelev (Bulgarian: Желю Митев Желев; 3 March 1935 – 30 January 2015) was a Bulgarian politician and former dissident who served as the first non-Communist President of Bulgaria from 1990 to 1997. Zhelev was one of the most prominent figures of the 1989 Bulgarian Revolution, which ended the 35 year rule of President Todor Zhivkov. A member of the Union of Democratic Forces, he was elected as President by the 7th Grand National Assembly. Two years later, he won Bulgaria's first direct presidential elections. He lost his party's nomination for his 1996 reelection campaign after losing a tough primary race to Petar Stoyanov.\n\n\n== Biography ==\n\n\n=== Early life ===\nZhelyu Zhelev was born on 3 March 1935 in Veselinovo village, Shumen. He graduated with a degree in philosophy from the Sofia University \"St. Kliment Ohridski\" in 1958, and later earned a Ph.D. in 1974.\n\n\n=== Dissident ===\nZhelev was a member of the Bulgarian Communist Party, but was expelled from it for political reasons in 1965. He was unemployed for six years since all employment in Bulgaria was state-regulated.In 1982, he published his controversial work, \"The Fascism\" (Фашизмът). Three weeks after the volume's publication in 1982, the book was removed from bookstores and libraries throughout the nation, as its description of the fascist states of Italy, Germany and Spain before, during, and after World War II made these regimes comparable to the Communist regimes in the Eastern block.\n\n\n=== SDS ===\nIn 1988, just before the Fall of Communism, Zhelev founded the Ruse Committee, and in 1989 he became a founding member and chairman of the Club for Support of Openness and the Reform (a time when many such democratic clubs were formed), which helped him to achieve the position of Chairman of the Coordinating Council of the Union of Democratic Forces (Bulgarian: СДС, SDS) party.\n\n\n=== MP and President ===\nZhelev was elected MP in June 1990 for the 7th Grand National Assembly; the Assembly's main goal was to create a new democratic Constitution of Bulgaria. After the resignation of President Petar Mladenov, the assembly elected Zhelev his successor on 1 August 1990. He thus became the first head of state in 44 years who was not either a Communist or fellow traveler.\n\n\n=== 1992 presidential election ===\nUnder the new constitution adopted in July 1991, the president was to be elected directly by voters, for a maximum of two terms. The first such election was held in January 1992. Zhelev led the field in the first round, held on 12 January. He then won in the runoff a week later against Velko Valkanov (who was endorsed by the Socialists) with 52.8% of the votes to become Bulgaria's first directly elected head of state. He immediately suspended his membership in the UDF; the new constitution did not allow the president to be a formal member of a political party during his term.\n\n\n=== 1996 presidential election ===\nZhelev sought a second term in 1996, but lost the UDF nomination to eventual winner Petar Stoyanov.\n\n\n=== Later political career ===\nAfter his defeat in the 1996 UDF primaries and after the end of his presidency in 1997, Zhelev remained in politics, but on a much smaller scale. He became Honorary Chair of the Liberal Democratic Union and Honorary Chair of the Liberal International and in 1997 went on to establish and preside over a foundation named after him. Zhelev was the initiator and president of the Balkan Political Club, a union of former political leaders from Southeast Europe. As part of the club he voiced his support for Turkey's accession to the European Union.In 2009, Zhelev also voiced his opinion that Bulgaria should adopt a presidential system based upon the French model: \"The country should have both prime minister and president, but the latter should be vested in far-reaching powers so that he may control the executive power\".Zhelev died in Sofia at the age of 79 on 30 January 2015.\n\n\n=== World Justice Project ===\nZhelyu Zhelev served as an Honorary Co-Chair for the World Justice Project (ABA).\n\n\n=== Awards and accolades ===\nOn 15 January 2010, Zhelev received the Macedonian state Order 8-September for his contribution to the recognition of the independence of the Republic of Macedonia from the former Yugoslavia.Zhelev Peak on Loubet Coast, Antarctica is named after Zhelyu Zhelev \"for his support for the Bulgarian Antarctic programme.\"\n\n\n== Family ==\nHe was married to Maria Zheleva (3 April 1942 – 8 December 2013) and has two daughters Yordanka (1963–1993) and Stanka (born 1966).\nZhelev has two grandchildren from his daughter Stanka.\n\n\n== References ==\n\n\n== External links ==\n\"Zhelyu Zhelev — The dissident president\" at the Sofia Echo, by Ivan Vatahov, April 17, 2003 (retrieved January 27, 2010).\nThomas, Richard (15 February 2015). \"Zhelyu Zhelev: Dissident who fought the dictatorship in Bulgaria before becoming its first democratically elected head of state\". The Independent. Retrieved November 14, 2018.\nThe Associated Press (February 2, 2015). \"Zhelyu Zhelev, communist-era dissident who became president of Bulgaria, dies\". The Washington Post. Retrieved November 14, 2018.\nThe Associated Press (January 30, 2015). \"Former Bulgarian president Zhelyu Zhelev, first democratically elected leader, dies at 79\". Times Colonist. Retrieved November 14, 2018.\n\"Zhelyu Zhelev, Bulgarian president - obituary; Bulgaria's first democratically elected president who laid the groundwork for his country's entry into the EU\". The Telegraph. 12 February 2015. Retrieved November 16, 2018."