"Another Round (Danish: Druk, \"binge drinking\") is a 2020 comedy-drama film directed by Thomas Vinterberg, from a screenplay by Vinterberg and Tobias Lindholm. An international co-production between Denmark, the Netherlands, and Sweden, the film stars Mads Mikkelsen, Thomas Bo Larsen, Magnus Millang, and Lars Ranthe.\nThe film had its world premiere at the Toronto International Film Festival on 12 September 2020, and was released in Denmark on 24 September 2020 by Nordisk Film. At the 93rd Academy Awards, the film won for Best International Feature Film and was also nominated for Best Director. It also won BAFTA Award for Best Film Not in the English Language and European Film Award for Best Film, and was nominated for the Golden Globe Award for Best Foreign Language Film.\n\n\n== Plot ==\nTeachers Martin, Tommy, Peter and Nikolaj are colleagues and friends at a gymnasium school in Copenhagen. All four struggle with unmotivated students and feel that their lives have become boring and stale. At a dinner celebrating Nikolaj's 40th birthday, the group begins to discuss psychiatrist Finn Skårderud, who has theorized that having a blood alcohol content (BAC) of 0.05 makes you more creative and relaxed. While the group dismisses the theory, Martin, who is depressed due to troubles in his marriage, is inspired and starts to drink at work. The rest of the group eventually decides to join him, considering the ordeal an experiment to test Skårderud's theory. They agree to a set of rules: their BAC should never be below 0.05 and that they should not drink after 8:00 pm.\nWithin a short period of time, all four members of the group find both their work and private lives more enjoyable. Martin, in particular, is delighted as he finally manages to reconnect with his wife and children. Agreeing that the experiment should be taken further, the group increases the daily BAC limit to 0.10. Still finding their lives improved, the group decides to attempt binge drinking to observe how their bodies and minds respond. The group has a fun night, but after coming home drunk, both Martin and Nikolaj are confronted by their families. Martin's family express their worries that he is descending into alcoholism, revealing that he has been visibly drunk for weeks. After a heated argument during which Martin's wife admits to infidelity, Martin leaves her. The group abandons the experiment.\nMonths later, all the members of the group have stopped drinking during the day with the exception of Tommy, who has become an alcoholic. A few days after arriving to work drunk, Tommy boards his boat with his old dog, sails out on the ocean and dies, presumably by falling in (possibly by suicide, but this is not explicitly stated).\nThe three remaining members of the group go out to dinner after Tommy's funeral and appear reluctant to drink the alcohol which is served. While dining, Martin receives a message from his wife who states that she is willing to give their marriage a new chance while the recently graduated students drive by. Martin, Peter and Nikolaj join them in celebrating and drinking at the harbour. Martin, a former jazz ballet dancer, dances with the rest of the partygoers, which he had refused up to this point in the film despite his colleagues' repeated urging. His dance becomes increasingly energetic and joyous, and the story ends as he leaps into the water, on a freeze frame of him in midair.\n\n\n== Cast ==\nMads Mikkelsen as Martin\nThomas Bo Larsen as Tommy\nLars Ranthe as Peter\nMagnus Millang as Nikolaj\nMaria Bonnevie as Anika\nSusse Wold as The Principal\n\n\n== Production ==\nThe film was based on a play Vinterberg had written while working at Burgtheater, Vienna. Additional inspiration came from Vinterberg's own daughter, Ida, who had told stories of the drinking culture within the Danish youth. Ida had originally pressed Vinterberg to adapt the play into a movie, and she was slated to play the daughter of Martin (Mads Mikkelsen). The story was originally \"A celebration of alcohol based on the thesis that world history would have been different without alcohol\". However, four days into filming, Ida was killed in a car accident. Following the tragedy, the script was reworked to become more life affirming. \"It should not just be about drinking. It was about being awakened to life\", stated Vinterberg. Tobias Lindholm served as director in the week following the accident. The film was dedicated to Ida, and was partially filmed in her classroom with her classmates.During production, the four main actors and Vinterberg would meet to drink just enough to let go of the embarrassment in front of each other. They would also watch drunk people on YouTube to better understand how completely inebriated people would act.\n\n\n== Release ==\nAnother Round was set to have its world premiere at the 2020 Cannes Film Festival, prior to the festival's cancellation due to government restrictions prompted by the COVID-19 pandemic. The film instead had its world premiere at the Toronto International Film Festival. It was screened at the San Sebastián International Film Festival, where it competed for the Golden Shell and opened Film Fest Gent 2020 in Belgium.It was released in Denmark on 24 September 2020, by Nordisk Film. In September 2020, Samuel Goldwyn Films acquired U.S. distribution rights to the film. It was also selected as opening film at the 51st International Film Festival of India.\n\n\n== Reception ==\n\n\n=== Critical response ===\nOn review aggregator website Rotten Tomatoes, Another Round holds an approval rating of 93% based on 205 reviews, with an average rating of 7.9/10. The site's critics consensus states: \"Take one part deftly directed tragicomedy, add a dash of Mads Mikkelsen in vintage form, and you've got Another Round – an intoxicating look at midlife crises.\" On Metacritic, the film has a weighted average score of 79 out of 100, based on 33 critics, indicating \"generally favorable reviews\".\n\n\n=== Accolades ===\n\n\n== Remake ==\nAn American English-language remake of the film is planned to star Leonardo DiCaprio and to be produced by Appian Way Productions, Endeavor Content, and Makeready.\n\n\n== See also ==\nList of submissions to the 93rd Academy Awards for Best International Feature Film\nList of Danish submissions for the Academy Award for Best International Feature Film\n\n\n== References ==\n\n\n== External links ==\nOfficial website \nAnother Round at IMDb\nAnother Round at Rotten Tomatoes"