"Damocles is a character who appears in an (likely apocryphal) anecdote commonly referred to as \"the Sword of Damocles\", an allusion to the imminent and ever-present peril faced by those in positions of power. Damocles was an obsequious courtier in the court of Dionysius II of Syracuse, a 4th-century BC ruler of Syracuse, Sicily.\nThe anecdote apparently figured in the lost history of Sicily by Timaeus of Tauromenium (c. 356–260 BC). The Roman orator Cicero may have read it in the texts of Greek historian Diodorus Siculus. Cicero used it in his Tusculanae Disputationes, 5. 61, by which means it passed into the European cultural mainstream.\n\n\n== Sword of Damocles ==\nAccording to the story, Damocles was pandering to his king, Dionysius, exclaiming that Dionysius was truly fortunate as a great man of power and authority, surrounded by magnificence. In response, Dionysius offered to switch places with Damocles for one day so that Damocles could taste that very fortune firsthand. Damocles quickly and eagerly accepted the king's proposal. Damocles sat on the king's throne, surrounded by every luxury, but Dionysius, who had made many enemies during his reign, arranged that a sword should hang above the throne, held at the pommel only by a single hair of a horse's tail to evoke the sense of what it is like to be king: though having much fortune, always having to watch in fear and anxiety against dangers that might try to overtake him. Damocles finally begged the king that he be allowed to depart because he no longer wanted to be so fortunate, realizing that with great fortune and power comes also great danger.King Dionysius effectively conveyed the sense of constant fear in which a person with great power may live. Dionysius committed many cruelties in his rise to power, such that he could never go on to rule justly because that would make him vulnerable to his enemies. Cicero used this story as the last in a series of contrasting examples for reaching the conclusion towards which he had been moving in his fifth Disputation, in which the theme is that having virtue is sufficient for living a happy life.\n\n\n=== Cultural depictions ===\nThe sword of Damocles is frequently used in allusion to this tale, epitomizing the imminent and ever-present peril faced by those in positions of power. More generally, it is used to denote the sense of foreboding engendered by a precarious situation, especially one in which the onset of tragedy is restrained only by a delicate trigger or chance. Shakespeare's Henry IV expands on this theme: \"Uneasy lies the head that wears a crown\"; compare the Hellenistic and Roman imagery connected with the insecurity offered by Tyche and Fortuna.\nIn The Canterbury Tales, Chaucer refers to the sword of Damocles, which the Knight describes to hang over Conquest. When the knight describes the three temples, he also pays special attention to the paintings, noticing one on the walls of the temple of Mars:\n\n— (lines 2026–2030.)The Roman 1st century BC poet Horace also alluded to the sword of Damocles in Ode 1 of the Third Book of Odes, in which he extolled the virtues of living a simple, rustic life, favouring such an existence over the myriad threats and anxieties that accompany holding a position of power. In this appeal to his friend and patron, the aristocratic Gaius Maecenas, Horace describes the Siculae dapes or \"Sicilian feasts\" as providing no savoury pleasure to the man, \"above whose impious head hangs a drawn sword (destrictus ensis).\"The phrase has also come to be used in describing any situation infused with a sense of impending doom, especially when the peril is visible and proximal—regardless of whether the victim is in a position of power. US President John F. Kennedy compared the omnipresent threat of nuclear annihilation to a sword of Damocles hanging over the people of the world. Soviet First Secretary Nikita Khrushchev wanted the Tsar Bomba to \"hang like the sword of Damocles over the imperialists' heads\".Woodcut images of the sword of Damocles as an emblem appear in 16th and 17th century European books of devices, with moralizing couplets or quatrains, with the import METUS EST PLENUS TYRANNIS. A small vignette shows Damocles under a canopy of state, at the festive table, with Dionysius seated nearby; the etching, with its clear political moral, was later used to illustrate the idea.The sword of Damocles appears frequently in popular culture, including novels, feature films, television series, video games, and music.\n\n\n== See also ==\nCroesus and Fate\n\"Sword of Damocles\" (Rufus Wainwright song)\n\n\n== Notes ==\n\n\n== External links ==\nCicero, Tusculan Disputations (translation), Livius.org, V. 61."