"Sean Taro Ono Lennon (Japanese: 小野 太郎, Hepburn: Ono Tarō, born October 9, 1975) is a British-American musician, songwriter, producer and multi-instrumentalist. He is the son of John Lennon and Yoko Ono, and half-brother to Julian Lennon. Over the course of his career, he has been a member of the bands Cibo Matto, the Ghost of a Saber Tooth Tiger, the Claypool Lennon Delirium and his parents' group the Plastic Ono Band. He has released two solo albums: Into the Sun (1998) and Friendly Fire (2006). He has produced numerous albums for various artists, including Black Lips, and the Plastic Ono Band.\n\n\n== Early life and education ==\nSean Lennon was born at New York–Presbyterian Hospital in New York City on October 9, 1975, his father's 35th birthday. He is of Japanese descent on his mother's side and English, Welsh and Irish descent on his father's side. Julian Lennon is his half-brother. Elton John is his godfather. After Sean's birth, John Lennon became a house husband, caring for his young son until his murder on December 8, 1980. Sean attended kindergarten in Tokyo and, at his request, was educated at the exclusive private boarding school Institut Le Rosey in Rolle, Switzerland, and earlier at New York's private Ethical Culture Fieldston School and Dalton School. He attended Columbia University for three semesters, majoring in anthropology before dropping out to focus on his music and tour with his mother.In January 1984, when Steve Jobs was visiting Manhattan, he attended a party that Sean's mother (Yoko Ono) was throwing for Lennon and Jobs gave him one of the first Macintosh computers. That same year, he sang \"It's Alright\" on the Ono tribute album Every Man Has a Woman for his mother.\nHis parents kick-started his musical career: his debut into the music world came at age five, when he recited a story on his mother's 1981 album, Season of Glass. From childhood into his teen years, Lennon continued to collaborate with his mother, contributing vocals and receiving production credit on her solo albums It's Alright, Starpeace and Onobox.  At 16 Lennon co-wrote the song \"All I Ever Wanted\" with Lenny Kravitz for his 1991 album Mama Said, and worked with Kravitz on a cover of his father's \"Give Peace a Chance\" in protest of the Gulf War. By 1995 Lennon had formed the band IMA (with Sam Koppelman and Timo Ellis) to play alongside his mother on her album Rising.  Lennon also made appearances in film, featured in the cast of Michael Jackson's 1988 Moonwalker and portraying a teenager experiencing visions of various M. C. Escher prints in Sony's 1990 promotional short-film Infinite Escher.\nLennon holds dual citizenship with the United States and United Kingdom.\n\n\n== Professional career ==\n\n\n=== Performance ===\n\nIn 1996, Miho Hatori and Yuka Honda of Cibo Matto were invited by Ono to remix the song \"Talking to the Universe\" for a Rising remix EP Rising Mixes. They met Lennon and invited him to join them on tour as a bass player. This eventually led to Lennon's contributing to their side-project Butter 08 and to his becoming a member of the group. He continued to play with them on tour, joining them on television and providing bass guitar and vocals on their EP Super Relax. Through his association with Cibo Matto, Lennon was approached by Adam Yauch (of Beastie Boys), who expressed an interest in his music and persuaded him to sign a record contract with Grand Royal Records. Regarding Grand Royal, Lennon has said:I think I found the only label on the planet who doesn't care who my parents are and what my name is. It's a good feeling to know that I wouldn't have gotten the offer if they wouldn't have liked my songs. That's pretty rare in the music business!\nLennon's solo debut Into the Sun, was released in 1998. A music video for \"Home\", a single from the album, was directed by Spike Jonze and enjoyed extended airplay on MTV. The album was produced by fellow Cibo Matto member Yuka Honda, who Lennon claimed was his inspiration for the album, who he had begun dating at the time.\nHe went on to tour (often backed by Cibo Matto) supporting Into the Sun. During this period he appeared on radio programs such as The Howard Stern Show and KCRW's Morning Becomes Eclectic. He later recalled promoting the album as a bitter experience due to the media focus on his family rather than his own music. In 1999, Lennon's EP Half Horse, Half Musician was released featuring new tracks such as \"Heart & Lung\" and \"Happiness\" as well as remixes of songs from Into the Sun. Along with Half Horse Half Musician, 1999 saw the release of Cibo Matto's second album Stereo ★ Type A. Lennon stepped out of his traditional role as the group's bass player, this time playing a much wider range of instruments (such as drums, guitars and synthesizers). Despite being well received, Stereo ★ Type A was followed by an extended Cibo Matto hiatus.\nIn 2000, Lennon contributed vocals to Del tha Funkee Homosapien (a single stanza on the Deltron 3030 track \"Memory Loss\"), Handsome Boy Modeling School and Jurassic 5. In 2001 on national television, Lennon performed several classics by the Beatles, \"This Boy\", \"Across the Universe\" and \"Julia\" alongside Robert Schwartzman, Rufus Wainwright and Moby for Come Together: A Night for John Lennon's Words and Music. In the following years Lennon faded out of the spotlight to focus more on his role as a producer.\n\n In 2000 Sean had a guest appearance on the Soulfly album Primitive on the song \"Son Song\"\nAfter the folding of Grand Royal Records in 2001, Lennon signed with Capitol Records, yet afterwards no solo material surfaced until February 2006, when \"Dead Meat\" was released as the first single from his new album, Friendly Fire. A promotional trailer for the CD/DVD package of Friendly Fire was leaked online in early 2006. The trailer featured scenes from the film version of the album, a DVD of music videos comprised into a film. The videos were actually screen tests for Coin Locker Babies, another project on which Lennon is working which became a cinematic counterpart to his new album.Friendly Fire was released in October 2006. The theme of the album is love and betrayal, and it is dedicated to the memory of a close friend who died. The night the album was released, Lennon made his first major television appearance in five years, performing \"Dead Meat\" live on the Late Show with David Letterman. Lennon has since appeared on Late Night with Conan O'Brien and The Sharon Osbourne Show. When questioned about the eight-year gap between solo albums in interviews, Lennon said that he did not feel like a solo artist during those years and that he wanted to experience music anonymously without the spotlight on him and his girlfriend.\nSince the release of Friendly Fire, Lennon has toured extensively around the world and while in France, he remixed his song \"Parachute\" in collaboration with French artist -M-. The remix is titled \"L'éclipse\" and was featured as a bonus track on the French release of Friendly Fire, while the single \"Dead Meat\" was featured in an episode of the TV drama True Blood.With the release of new material and subsequent touring Lennon launched a website featuring music, videos and a forum for his fans. Various members of the forum have created a fan-made cover album titled Truth Mask Replica.\nMuhl and Lennon premiered the band the Ghost of a Saber Tooth Tiger during a live performance at Radio City on Valentine's Day, 2008. The duo, commonly referred to as the GOASTT, released their debut single, \"Jardin Du Luxembourg\", on July 6, 2010, and their debut album, Ghost of a Saber Tooth Tiger (Acoustic Sessions), on October 26, 2010, both on Chimera, their own label. In conjunction with the debut, they performed six songs during an hour-long interview on WNYC and four songs for a Tiny Desk Concert on NPR. Lennon has also collaborated with Muhl with a group called \"Kemp and Eden\" who premiered at The Living Room in the spring of 2012.  On April 29, 2014, the Ghost of a Saber Tooth Tiger released their most successful album to date, titled Midnight Sun. The album was selected as one of the Top 50 best albums of 2014 by Rolling Stone. The album's release was followed by tours with the Flaming Lips, Tame Impala, Beck, Florence and the Machine, Dinosaur Jr., and Primus.\nAt the end of 2018, Lennon collaborated with Miley Cyrus and Mark Ronson for a cover of Yoko Ono and John Lennon's original Christmas song \"Happy Xmas (War is Over).\" The trio additionally performed the song at the Winter finale of Saturday Night Live.In 2015, Lennon formed the Claypool Lennon Delirium with Primus' lead vocalist and bassist Les Claypool. The following year, the new group released their debut album, Monolith of Phobos, which reached the Top 10 of three Billboard charts, followed by a covers EP titled Lime and Limpid Green in 2017. Their second album, South of Reality, was released on February 22, 2019.\n\n\n=== Production and other contributions ===\nWhile reestablishing himself as a solo artist, Lennon continued his work as a session musician and producer, lending his talent to the likes of Dopo Yume, Albert Hammond, Jr. (of the Strokes) and model/singer Irina Lăzăreanu. Lennon first appeared on the Soulfly album Primitive, released in 2000, while in October 2007, Lennon joined Mark Ronson in the BBC Electric Proms where he sang \"Sail on, Sailor\", as well as \"We Can Work It Out\" alongside Daniel Merriweather, and Tawiah. The year prior, he wrote and directed his first film, Friendly Fire, starring Carrie Fisher, Lindsay Lohan and others. His eponymous second studio LP served as the film's soundtrack as well.\nIn 2009 Lennon produced a second album for his mother on his record label Chimera Music, Between My Head and the Sky, by Yoko Ono and the Plastic Ono Band.  Lennon further worked with Ono as a producer for John Malkovich's 2016 remix EP Illuminated. Lennon co-produced Fat White Family's 2016 album Songs for Our Mothers, which was recorded in his New York City recording studio. Lennon also lent his production and songwriting talents to Lana Del Rey's fourth studio album Lust for Life, where he featured on the track \"Tomorrow Never Came\".\nLennon entered the field of film scores in 2009 with Rosencrantz and Guildenstern Are Undead, directed by long-time friend and school mate Jordan Galland. Lennon again collaborated with Galland as he contributed the score to the 2012 film Alter Egos, and appeared as the character \"Electric Death.\" The soundtrack premiered on Rolling Stone's website following the film's release. In 2014, Lennon contributed the song \"Animals\" for the Zombeavers soundtrack, while he additionally wrote and recorded \"Heart Grenade\" for the Japanese TV series Ghost in the Shell: Arise. Lennon also created the film score for the 2015 comedy horror film Ava's Possessions, a project which took over two years to create. The lead single from the soundtrack \"Demon Daughter\" premiered alongside the film's DVD release.Along with girlfriend Charlotte Kemp Muhl, Lennon started a record label, Chimera Music, which has signed a number of his collaborators including the Moonlandingz, Cibo Matto and Yoko Ono.\n\n\n== Activism and beliefs ==\nFrom 1996 to 1999, Lennon performed in and was involved in organizing the Tibetan Freedom Concerts with the Beastie Boys' Adam Yauch. The series advocated for the independence of Tibet from China.On October 19, 2011, Lennon was asked by Josh Sigurdson over Twitter what his opinion on the Occupy Wall Street protests was. He replied: \"I'm heading down there this weekend,\" as he did. On October 22, 2011, Lennon showed up on Wall Street with Rufus Wainwright and Josh Fox. The three played music throughout the day to protesters and others joined in. Lennon has not yet spoken to the media or press about the event.\nOn August 28, 2012, Lennon's opposition to hydraulic fracking was published as an editorial, \"Destroying Precious Land for Gas,\" by The New York Times. Of Artists Against Fracking, in 2014 he said,we can make more people aware of the damage fracking poses to our water supply, global warming, and climate change. Methane is 100 times more powerful of a greenhouse gas than carbon dioxide and most people don't realize how climate change will be triggered by a globalized fracking industry.\nTwo days later on August 30, 2012, Lennon unveiled \"Artists Against Fracking\", a campaign aimed at preventing the expansion of fracking in the United States. Over 200 artists have signed onto the initiative, including Mark Ruffalo and Anne Hathaway, as well as Beatles' members Paul McCartney and Ringo Starr.\nAsked by the Dallas Observer for his view of religion and spirituality, Lennon said,I'm not against religion, because I think it serves a purpose in our society and it can be helpful to certain groups of people. But, for me, religion is mythology. ... I do think we all have a spirit, and I think there's a lot more to life and human consciousness than science can explain. But I prefer looking to science for answers because it can be tested and vigorously logical.\nOn October 16, 2013, Lennon, along with Spacehog and Liv Tyler, played \"Live on Earth\" – an Internet-only performance – to benefit the David Lynch Foundation, which funds the teaching of Transcendental Meditation. Of his own practice of Transcendental Meditation, in 2014, Lennon said: \"for me, it's like a scientific method to calm my brain down and making my frontal lobe more active. It's an exercise, really. It helps me to have about 10 percent more conscious thinking.\"Lennon once described himself as a pacifist and \"anarchist\"; on February 6, 2016, he tweeted, \"AnCap is the only logical result of the non aggression [principle]. I am a pacifist so therefore an anarchist.\"\n\n\n== Personal life ==\nLennon is in a relationship with Charlotte Kemp Muhl, whom he met at the Coachella Valley Music and Arts Festival in 2005. Lennon, 29 at the time, thought she was too young at 17. They remained friends before falling in love. In an interview, Lennon states he stumbled upon Muhl's musical talents over a year after they had started dating, and formed The Ghost of a Saber Tooth Tiger around 2008. Muhl and Lennon are involved in a number of musical endeavors and much of their work is written at their home-based studio in Greenwich Village.\n\n\n== Discography ==\n\n\n=== Solo albums ===\nInto the Sun (1998)\nHalf Horse, Half Musician (EP 1999)\nFriendly Fire (2006)\n\n\n=== with Cibo Matto ===\nSuper Relax (1997)\nStereo ★ Type A (1999)\n\n\n=== with the Ghost of a Saber Tooth Tiger ===\nAcoustic Sessions (2010)\nLa Carotte Bleue (2011)\nMidnight Sun (2014)\n\n\n=== with Yoko Ono/Plastic Ono Band ===\nRising (1995)\nBlueprint for a Sunrise (2001)\nDon't Stop Me! EP (2009)\nBetween My Head and the Sky (2009)\nThe Flaming Lips 2011 EP: The Flaming Lips with Yoko Ono/Plastic Ono Band (2011)\nTake Me to the Land of Hell (2013)\n\n\n=== with Mystical Weapons ===\nMystical Weapons (2012)\nCrotesque (2013)\n\n\n=== with the Claypool Lennon Delirium ===\nMonolith of Phobos (2016)\nLime and Limpid Green (2017)\nSouth of Reality (2019)\n\n\n=== Film scores ===\nSmile for the Camera (2005)\nFriendly Fire (2006)\nThe Stranger (2008)\nRosencrantz and Guildenstern Are Undead (2008)\nTea Fight (2008)\nAlter Egos (2012)\nAva's Possessions (2015)\n\n\n=== Producer ===\nSoulfly – Primitive (2000)\nValentine Original Soundtrack (2001)\nFive Children and It Soundtrack (2004)\nEsthero – Wikked Lil' Grrrls (2005)\nIrina Lăzăreanu – Some Place Along the Way (2007)\nYoko Ono/Plastic Ono Band – Between My Head and the Sky (2009)\nThe Ghost of a Saber Tooth Tiger - Acoustic Sessions (2010)\nThe Ghost of a Saber Tooth Tiger - Midnight Sun (2010)\nThe Ghost of a Saber Tooth Tiger - La Carotte Bleue (2011)\nKemp & Eden – Blackhole Lace (2012)\nPlastic Ono Band - Take Me to the Land of Hell (2013)\nFat White Family - Songs for Our Mothers (2016)\nLana Del Rey – Lust for Life (2017)\nThe Moonlandingz - Interplanetary Class Classics (2017)\nBlack Lips - Satan's Graffiti or God's Art? (2017)\nInsecure Men - Insecure Men (2018)\nTemples - Paraphernalia (2020)\n\n\n=== Other contributions ===\nMarianne Faithfull's album Easy Come, Easy Go (2008) – \"Salvation\" (originally by Black Rebel Motorcycle Club)\nSalyu's compilation album Merkmal (2008) – \"Shady\"\nLennon contributed vocals and guitar to \"Son Song\", on the Soulfly album Primitive.  He can be heard in the final seconds of the song talking about how Soulfly guitarist/vocalist Max Cavalera's heavy-gauge strings hurt his fingertips.\nDeltron 3030's album Deltron 3030 (2000) – \"Memory Loss\"\nLennon sang backing vocals on the track \"Sandpaperback\" on Ben Lee's 1998 album Breathing Tornados.\nCollaborated in John Zorn's Great Jewish Music tributes to Marc Bolan, Burt Bacharach and Serge Gainsbourg, in 1997 and 1998.\nSean Lennon Vs. Kool Keith - \"Rockets in the Battlefield\" single (1999, Grand Royal)\nLennon remixed Tom Ze's single \"O Olho Do Lago\" in 1999.\nLennon made a spoken-word contribution to the Flaming Lips' \"Found This Star on the Ground\", a six-hour song. Lennon read the names of charity contributors who had donated in order to have their names featured in the song.\nLennon was a featured artist on the track \"Before the Skies\" for Haale's EP Paratrooper.\nLennon wrote music for the 2011 film A Monster in Paris.\nLennon co-wrote \"Perfect Crime\" with John Zorn (sung by Mike Patton and Sofia Rei Koutsovitis) for 2014's \"The Song Project\".\nLennon remixed the Moonlandingz' 2015 single \"Sweet Saturn Mine\" through Chimera Music.\nLennon covered \"Row Bulies Row\" with Charlotte Kemp Muhl and bassist Jack Shit for Son of Rogues Gallery: Pirate Ballads, Sea Songs & Chanteys (2013).\nLennon played slide guitar in Lady Gaga's \"Sinner's Prayer\", from her 2016 album Joanne.\nLennon appeared with the Sachal Ensemble on their album Song of Lahore (Universal, 2016)\nLennon remixed John Malkovich's 2016 single \"Cryolite\".\nLennon was a featured artist on the track \"Tomorrow Never Came\", included on Lana Del Rey's 2017 album Lust for Life.\nLennon co-wrote \"Theme for Valhalla Dale\", from the Moonlandingz 2017 album, Interplanetary Class Classics.\nLennon recorded a cover of \"(Happy Xmas) War Is Over\" with Miley Cyrus and Mark Ronson in 2018.\nLennon performed \"Mambo Sun\" with Charlotte Kemp Muhl on Angelheaded Hipster: The Songs of Marc Bolan & T. Rex, and the duo performed the song on Late Late Show with James Corden (2020)\nLennon performed with Lily Allen on her album No Shame (2018)\nLennon performed \"Come Together\" with Aerosmith at Madison Square Garden (2012)\n\n\n== Filmography ==\nMoonwalker (1988) – Sean\nImagine: John Lennon (1988) – Himself\nBuffy the Vampire Slayer – Season 2, Episode 1 – \"When She Was Bad\" (1997) – musician, Cibo Matto\nMelrose Place – Season 7, Episode 8 – \"The World According to Matt\" (1998) – Himself\nSmile for the Camera (2005) – Original score, writer\nFriendly Fire (2006) – Actor, original score, writer\nCoin Locker Babies (2008 in production) – Actor, writer\nRosencrantz And Guildenstern Are Undead (2010) - Score\nA Monster in Paris (2011, Francœur voice)\nAlter Egos (2012) – Original score, cameo appearance\nGhost in the Shell: Arise, Episode 3 (2014) – Singer, lyrics\nAva's Possessions (2015) - Original score\n\n\n== Bibliography ==\nPart Asian, 100% Hapa by Kip Fulbeck (2006) – Lennon is credited with writing the foreword.\nArcana III by John Zorn (2008) - Lennon wrote the essay \"Muse or Ick\"\n\n\n== References ==\n\n\n== External links ==\nOfficial website\nSean Lennon at IMDb\n\"Sean Lennon\", New York Magazine, May 18, 1998\nInterview on I Like Music, 2006\nInterview with director Michele Civetta about Friendly Fire\nInfinite Escher"