"Lipothrixviridae is a family of viruses in the order Ligamenvirales. Thermophilic archaea in the phylum Crenarchaeota serve as natural hosts. There are 11 species in this family, assigned to 4 genera.\n\n\n== Taxonomy ==\nThe following genera and species are assigned to the family:\nAlphalipothrixvirus\nAlphalipothrixvirus SBFV2\nAlphalipothrixvirus SFV1\nBetalipothrixvirus\nAcidianus filamentous virus 3\nAcidianus filamentous virus 6\nAcidianus filamentous virus 7\nAcidianus filamentous virus 8\nAcidianus filamentous virus 9\nSulfolobus islandicus filamentous virus\nDeltalipothrixvirus\nAcidianus filamentous virus 2\nDeltalipothrixvirus SBFV3\nGammalipothrixvirus\nAcidianus filamentous virus 1The family consists of four genera: Alphalipothrixvirus, Betalipothrixvirus, Gammalipothrixvirus and Deltalipothrixvirus. They are classified into genera based on their genomic properties and on the diversity of their terminal appendages, which are involved in host cell recognition. The originally proposed genus Alphalipothrixvirus was renamed Alphatristromavirus and moved to family Tristromaviridae. In 2020, the genus Alphalipothrixvirus was recreated for classification of Sulfolobus filamentous virus 1 and Sulfolobales Beppu filamentous virus 2.In the genus Gammalipothrixvirus claw-like structures are found at either end of the virion.\nMembers of the Lipothrixviridae share structural and genomic characteristics with viruses from the Rudiviridae family, which contains non-enveloped rod-shaped viruses. Viruses from the two families have linear dsDNA genomes and share up to nine genes. In addition, the filamentous particles of rudiviruses and lipothrixviruses are built from structurally similar, homologous major capsid proteins. Due to these shared properties viruses from the two families are classified into an order Ligamenvirales.Members of the Ligamenvirales are structurally related to viruses of the family Tristromaviridae which, similar to lipothrixviruses, are enveloped and encode two paralogous major capsid proteins with the same fold as those of ligamenviruses. Due to these structural similarities, order Ligamenvirales and family Tristromaviridae were proposed to be unified within a class 'Tokiviricetes' (toki means ‘thread’ in Georgian and viricetes is an official suffix for a virus class).\n\n\n== Virology ==\nThe viruses are enveloped and filamentous. The capsid varies considerably in length – 410–1950 nanometers (nm) – and is 24–38 nm in diameter. The envelope has a monolayer structure and includes di-phytanyl tetraethers lipids.\nFrom either end of the viron are protrusions extending from the core through the envelope. The capsid itself is elongated and exhibits helical symmetry. The core itself is helical.\nThere are two major capsid proteins (MCP1 and MCP2). MCP1 and MCP2 form a heterodimer, which wraps around the linear dsDNA genome transforming it into A-form. Interaction between the genome and the MCPs leads to condensation of the genome into the virion superhelix. Genomes are linear, up to 40 kb in length.\n\n\n== Life cycle ==\nViral replication is cytoplasmic. Entry into the host cell is achieved by adsorption to the host cell. Acidianus filamentous virus 1 was found to bind to cellular pili-like appendages. DNA templated transcription is the method of transcription. Archaea serve as the natural host. Transmission routes are passive diffusion.\n\n\n== References ==\n\n\n== External links ==\nViralzone: Lipothrixviridae"