"Psychological statistics is application of formulas, theorems, numbers and laws to psychology. \nStatistical Methods for psychology include development and application statistical theory and methods for modeling psychological data. \nThese methods include psychometrics, Factor analysis, Experimental Designs, and Multivariate Behavioral Research. The article also discusses journals in the same field.\n\n\n== Psychometrics ==\n\nPsychometrics deals with measurement of psychological attributes. It involves developing and applying statistical models for mental measurements. The measurement theories are divided into two major areas: (1) Classical test theory; (2) Item Response Theory.\n\n\n=== Classical Test Theory ===\n\nThe classical test theory or true score theory or reliability theory in statistics is a set of statistical procedures useful for development of psychological tests and scales. It is based on a fundamental equation, \nX = T + E\nwhere, X is total score, T is a true score and E is error of measurement. For each participant, it assumes that there exist a true score and it need to be obtained score (X) has to be as close to it as possible. The closeness of X has with T is expressed in terms of ratability of the obtained score. The reliability in terms of classical test procedure is correlation between true score and obtained score. The typical test construction procedures has following steps:\n(1)\tDetermine the construct \n(2)\tOutline the behavioral domain of the construct\n(3)\tWrite 3 to 5 times more items than desired test length\n(4)\tGet item content analyzed by experts and cull items\n(5)\tObtain data on initial version of the test \n(6)\tItem analysis (Statistical Procedure)\n(7)\tFactor analysis (Statistical Procedure)\n(8)\tAfter the second cull, make final version\n(9)\tUse it for research\n\n\n==== Reliability ====\n\nThe reliability is computed in specific ways.  \n(A)\tInter-Rater reliability: Inter-Rater reliability is estimate of agreement between independent raters. This is most useful for subjective responses. Cohen's Kappa, Krippendorff's Alpha, Intra-Class correlation coefficients, Correlation coefficients, Kendal's concordance coefficient, etc. are useful statistical tools. \n(B)\tTest-Retest Reliability: Test-Retest Procedure is estimation of temporal consistency of the test. A test is administered twice to the same sample with a time interval. Correlation between two sets of scores is used as an estimate of reliability. Testing conditions are assumed to be identical. \n(C)\t Internal Consistency Reliability: Internal consistency reliability estimates consistency of items with each other. Split-half reliability (Spearman- Brown Prophecy) and Cronbach Alpha are popular estimates of this reliability. \n(D)\tParallel Form Reliability: It is an estimate of consistency between two different instruments of measurement. The inter-correlation between two parallel forms of a test or scale is used as an estimate of parallel form reliability.\n\n\n==== Validity ====\n\nValidity of a scale or test is ability of the instrument to measure what it purports to measure. Construct validity, Content Validity, and Criterion Validity are types of validity. \nConstruct validity is estimated by convergent and discriminant validity and factor analysis. Convergent and discriminant validity are ascertained by correlation between similar of different constructs. \nContent Validity: Subject matter experts evaluate content validity. \nCriterion Validity is correlation between the test and a criterion variable (or variables) of the construct. Regression analysis, Multiple regression analysis, and Logistic regression are used as an estimate of criterion validity. \nSoftware applications: The R software has ‘psych’ package that is useful for classical test theory analysis.\n\n\n=== Modern test Theory ===\n\nThe modern test theory is based on latent trait model. Every item estimates the ability of the test taker. The ability parameter is called as theta (θ). The difficulty parameter is called b. the two important assumptions are local independence and unidimensionality.   \nThe Item Response Theory has three models. They are one parameter logistic model, two parameter logistic model and three parameter logistic model. In addition, Polychromous IRT Model are also useful.The R Software has ‘ltm’, packages useful for IRT analysis.\n\n\n== Factor Analysis ==\n\nFactor analysis is at the core of psychological statistics. It has two schools: (1) Exploratory Factor analysis (2) Confirmatory Factor analysis.\n\n\n=== Exploratory Factor Analysis (EFA) ===\n\nThe exploratory factor analysis begins without a theory or with a very tentative theory. It is a dimension reduction technique. It is useful in psychometrics, multivariate analysis of data and data analytics. \nTypically a k-dimensional correlation matrix or covariance matrix of variables is reduced to k X r factor pattern matrix where r < k. Principal Component analysis and common factor analysis are two ways of extracting data. Principal axis factoring, ML factor analysis, alpha factor analysis and image factor analysis is most useful ways of EFA. \nIt employs various factor rotation methods which can be classified into orthogonal (resulting in uncorrelated factors) and oblique (resulting correlated factors).\nThe ‘psych’ package in R is useful for EFA.\n\n\n=== Confirmatory Factor Analysis (CFA) ===\n\nConfirmatory Factor Analysis (CFA) is factor analytic technique that begins with theory and test the theory by carrying out factor analysis. \nThe CFA is also called as latent structure analysis, which considers factor as latent variables causing actual observable variables. The basic equation of the CFA is\nX = Λξ + δ\nwhere, X is observed variables, Λ are structural coefficients, ξ are latent variables (factors) and δ are errors. \nThe parameters are estimated using ML methods however; other methods of estimation are also available. The chi-square test is very sensitive and hence various fit measures are used.\nR package ‘sem’, ‘lavaan’ are useful for the same.\n\n\n== Experimental Design ==\n\nExperimental Methods are very popular in psychology. It has more than 100 years tradition. Experimental psychology has a status of sub-discipline in psychology .\nThe statistical methods are applied for designing and analyzing experimental data. They involve, t-test, ANOVA, ANCOVA,  MANOVA, MANCOVA, binomial test, chi-square etc. are used for the analysis of the experimental data.\n\n\n== Multivariate Behavioral Research ==\nMultivariate behavioral research is becoming very popular in psychology. These methods include Multiple Regression and Prediction; Moderated and Mediated Regression Analysis; Logistics Regression; Canonical Correlations; Cluster analysis; Multi-level modeling; Survival-Failure analysis; Structural Equations Modeling; hierarchical linear modelling, etc. are very useful for psychological statistics.\n\n\n== Journals for statistical application for psychology ==\nThere are many specialized journals that publish advances in statistical analysis for psychology:\n\nPsychometrika\nEducational and Psychological Measurement\nAssessment\nAmerican Journal of Evaluation\nApplied Psychological Measurement\nBehavior Research Methods\nBritish Journal of Mathematical and Statistical Psychology\nJournal of Educational and Behavioral Statistics\nJournal of Mathematical Psychology\nMultivariate Behavioral Research\nPsychological Assessment\nStructural Equation Modeling\n\n\n== Software Packages for Psychological Research ==\nVarious software packages are available for statistical methods for psychological research. They can be classified as commercial software (e.g., JMP and SPSS) and open-source (e.g., R). Among the open-source offerings, the R software is the most popular. There are many online references for R and specialized books on R for Psychologists are also being written. The \"psych\" package of R is very useful for psychologists. Among others, \"lavaan\", \"sem\", \"ltm\", \"ggplot2\" are some of the popular packages. PSPP and KNIME are other free packages. Among the commercial packages include JMP, SPSS and SAS. JMP and SPSS are commonly reported in books.\n\n\n== See also ==\nQuantitative psychology\n\n\n== References ==\nAgresti, A. (1990). Categorical data analysis. Wiley: NJ.\nBollen, KA. (1989). Structural Equations with Latent Variables. New York: John Wiley & Sons.\nBelhekar, V. M. (2016). Statistics for Psychology Using R, New Delhi: SAGE. ISBN 9789385985003\nDancey, Christine P.; Reidy, John (2011). Statistics Without Maths for Psychology. Prentice Hall. ISBN 978-0-273-72602-9.\nCohen, B.H. (2007) Explaining Psychological Statistics, 3rd Edition, Wiley. ISBN 978-0-470-00718-1\nCronbach LJ (1951). Coefficient alpha and the internal structure of tests. Psychometrika 16, 297–334. doi:10.1007/bf02310555\nHambleton, R. K., & Swaminathan H. (1985). Item Response theory: Principles and Applications. Boston: Kluwer.\nHarman, H. H. (1976). Modern Factor Analysis(3rd ed.). Chicago: University of Chicago Press.\nHayes, A. F. (2013). Introduction to mediation, moderation, and conditional process analysis. The Guilford Press: NY.\nHowell, D. (2009) Statistical Methods for Psychology, International Edition, Wadsworth. ISBN 0-495-59785-6\nKline, T. J. B. (2005)Psychological Testing: A Practical Approach to Design and Evaluation. Sage Publications: Thousand Oaks.\nLoehlin, J. E. (1992). Latent Variable Models: An Introduction to Factor, Path, and Structural Analysis (2nd ed.). Hillsdale, NJ: Lawrence Erlbaum.\nLord, F. M. , and Novick, M. R. ( 1 968). Statistical theories of mental test scores. Reading, Mass. : Addison-Wesley, 1968.\nMenard, S. (2001). Applied logistic regression analysis. (2nd ed.). Thousand Oaks. CA: Sage Publications.\nNunnally, J. & Bernstein, I. (1994). Psychometric Theory.  McGraw-Hill.\nRaykov, T.  & Marcoulides, G.A. (2010) Introduction to Psychometric Theory. New York: Routledge.\nTabachnick, B. G., & Fidell, L. S. (2007). Using Multivariate Statistics, 6th ed. Boston: Pearson. ISBN 9780205849574\nWilcox, R. (2012). Modern Statistics for the Social and Behavioral Sciences: A Practical Introduction. FL: CRC Press. ISBN 9781439834565Specific\n\n\n== External links ==\nCRAN Webpage for R\nPage for R functions for psychological statistics\n\nMatthew Rockloff's tutorials on t-tests, correlation and ANOVA\nYouTube videos on statistics for psychology by Vivek Belhekar"