"Kangchenjunga, also spelled Kanchenjunga, is the third highest mountain in the world. It rises with an elevation of 8,586 m (28,169 ft) in a section of the Himalayas called Kangchenjunga Himal delimited in the west by the Tamur River, in the north by the Lhonak Chu and Jongsang La, and in the east by the Teesta River. It lies between India and Nepal, with three of the five peaks, namely Main, Central and South, directly on the border, and the peaks West and Kangbachen in Nepal's Taplejung District.Until 1852, Kangchenjunga was assumed to be the highest mountain in the world, but calculations based on various readings and measurements made by the Great Trigonometrical Survey of India in 1849 came to the conclusion that Mount Everest, known as Peak XV at the time, was the highest. Allowing for further verification of all calculations, it was officially announced in 1856 that Kangchenjunga is the third highest mountain in the world.Kangchenjunga was first climbed on 25 May 1955 by Joe Brown and George Band, who were part of the 1955 British Kangchenjunga expedition. They stopped short of the summit in accordance with the promise given to the Chogyal that the top of the mountain would remain intact.\n\n\n== Names ==\nKangchenjunga is the official spelling adopted by Douglas Freshfield, Alexander Mitchell Kellas and the Royal Geographical Society that gives the best indication of the Tibetan pronunciation. Freshfield referred to the spelling used by the Indian Government since the late 19th century. Alternative spellings include Kanchenjunga, Khangchendzonga and Kangchendzönga.The brothers Hermann, Adolf and Robert Schlagintweit explained the local name 'Kanchinjínga' meaning “The five treasures of the high snow” as originating from the Tibetan word \"gangs\" pronounced [kaŋ] meaning snow, ice; \"chen\" pronounced [tɕen] meaning great; \"mzod\" meaning treasure; \"lnga\" meaning five.Local Lhopo people believe that the treasures are hidden but reveal themselves to the devout when the world is in peril; the treasures comprise salt, gold, turquoise and precious stones, sacred scriptures, invincible armor or ammunition, grain and medicine.\nKangchenjunga's name in the Limbu language is Senjelungma or Seseylungma, and is believed to be an abode of the omnipotent goddess Yuma Sammang.\n\n\n== Protected areas ==\nThe Kangchenjunga landscape is a complex of three distinct ecoregions: the eastern Himalayan broad-leaved and coniferous forests, the Eastern Himalayan alpine shrub and meadows and the Terai-Duar savanna and grasslands.\nThe Kangchenjunga transboundary landscape is shared by Nepal, India, Bhutan and China, and comprises 14 protected areas with a total of 6,032 km2 (2,329 sq mi):\nNepal: Kanchenjunga Conservation Area\nSikkim, India: Khangchendzonga National Park, Varsey Rhododendron Sanctuary, Fambong Lho Wildlife Sanctuary, Kyongnosla Alpine Sanctuary, Maenam Wildlife Sanctuary, Shingba Rhododendron Sanctuary and Pangolakha Wildlife Sanctuary\nDarjeeling, India: Jore Pokhri Wildlife Sanctuary, Singalila National Park, Senchal Wildlife Sanctuary, Mahananda Wildlife Sanctuary and Neora Valley National Park\nBhutan: Torsa Strict Nature ReserveThese protected areas are habitats for many globally significant plant species such as rhododendrons and orchids and many endangered flagship species such as snow leopard (Panthera uncia), Asian black bear (Ursus thibetanus), red panda (Ailurus fulgens), white-bellied musk deer (Moschus leucogaster), blood pheasant (Ithaginis cruentus) and chestnut-breasted partridge (Arborophila mandellii).\n\n\n== Geography ==\n\nThe Kangchenjunga Himal section of the Himalayas lies both in Nepal and India and encompasses 16 peaks over 7,000 m (23,000 ft). In the north, it is limited by the Lhonak Chu, Goma Chu, and Jongsang La, and in the east by the Teesta River. The western limit runs from the Jongsang La down the Gingsang and Kangchenjunga glaciers and the rivers of Ghunsa and Tamur. Kanchenjunga rises about 20 km (12 mi) south of the general alignment of the Great Himalayan range about 125 km (78 mi) east-southeast of Mount Everest as the crow flies. South of the southern face of Kanchenjunga runs the 3,000–3,500 m (9,800–11,500 ft) high Singalila Ridge that separates Sikkim from Nepal and northern West Bengal.Kangchenjunga and its satellite peaks form a huge mountain massif. The massif's five highest peaks are listed in the following table.\n\nThe main ridge of the massif runs from north-northeast to south-southwest and forms a watershed to several rivers. Together with ridges running roughly from east to west they form a giant cross. These ridges contain a host of peaks between 6,000 and 8,586 m (19,685 and 28,169 ft). The northern section includes Yalung Kang, Kangchenjunga Central and South, Kangbachen, Kirat Chuli, and Gimmigela Chuli, and runs up to the Jongsang La. The eastern ridge in Sikkim includes Siniolchu. The southern section runs along the Nepal-Sikkim border and includes Kabru I to III. This ridge extends southwards to the Singalila Ridge. The western ridge culminates in the Kumbhakarna, also known as Jannu.Four main glaciers radiate from the peak, pointing roughly to the northeast, southeast, northwest, and southwest. The Zemu glacier in the northeast and the Talung glacier in the southeast drain to the Teesta River; the Yalung glacier in the southwest and the Kangchen glacier in the northwest drain to the Arun and Kosi rivers.\nThe glaciers spread over the area above approximately 5,000 m (16,000 ft), and the glacialized area covers about 314 km2 (121 sq mi) in total. There are 120 glaciers in the Kanchenjunga Himal, of which 17 are debris-covered. Between 1958 and 1992, more than half of 57 examined glaciers had retreated, possibly due to rising of air temperature.Kangchenjunga Main is the highest elevation of the Brahmaputra River basin, which forms part of the southeast Asian monsoon regime and is among the globally largest river basins.\nKangchenjunga is one of six peaks above 8,000 m (26,000 ft) located in the basin of the Koshi river, which is among the largest tributaries of the Ganges.\nThe Kangchenjunga massif forms also part of the Ganges Basin.Although it is the third highest peak in the world, Kangchenjunga is only ranked 29th by topographic prominence, a measure of a mountain's independent stature. The key col for Kangchenjunga lies at a height of 4,664 metres (15,302 ft), along the watershed boundary between Arun and Brahmaputra rivers in Tibet. It is however, the 4th most prominent peak in the Himalaya, after Everest, and the western and eastern anchors of the Himalaya, Nanga Parbat, and Namcha Barwa, respectively.\n\n\n== Climbing routes ==\n\nThere are four climbing routes to reach the summit of Kangchenjunga, three of which are in Nepal from the southwest, northwest, and northeast, and one from northeastern Sikkim in India. To date, the northeastern route from Sikkim has been successfully used only three times. The Indian government has banned expeditions to Kanchenjunga; therefore, this route has been closed since 2000.\n\n\n== Climbing history ==\n\n\n=== Early reconnaissances and attempts ===\nBetween April 1848 and February 1849, Joseph Dalton Hooker explored parts of northern Sikkim and eastern Nepal, mainly to collect plants and study the distribution of Himalayan flora. He was based in Darjeeling, and made repeated excursions in the river valleys and into the foothills of Kangchenjunga up to an altitude of 15,620 ft (4,760 m).\nIn spring 1855, the German explorer Hermann Schlagintweit travelled to Darjeeling but was not allowed to proceed further north due to the Nepalese-Tibetan War. In May, he explored the Singalila Ridge up to the peak of Tonglo for a meteorological survey.\nIn 1879, Sarat Chandra Das and Lama Ugyen-gyatso crossed into Tibet west of \"Kanchanjinga\" via eastern Nepal and the Tashilhunpo Monastery en route to Lhasa. They returned along the same route in 1881.\nIn 1883, a party of William Woodman Graham together with two Swiss mountaineers climbed in the area of Kangchenjunga. They were the first who ascended Kabru within 30–40 ft (9.1–12.2 m) below the summit. They crossed the Kang La pass and climbed a peak of nearly 19,000 ft (5,800 m) from which they examined Jannu. They concluded it was too late in the year for an attempt and returned once again to Darjeeling.\nBetween October 1885 and January 1886, Rinzin Namgyal surveyed the unexplored north and west sides of Kangchenjunga. He was the first native surveyor to map the circuit of Kangchenjunga and provided sketches of each side of the peak and the adjoining valleys. He also defined the frontiers of Nepal, Tibet, and Sikkim in this area.\nIn 1899, British mountaineer Douglas Freshfield set out with his party comprising the Italian photographer Vittorio Sella. They were the first mountaineers to examine the lower and upper ramparts, and the great western face of Kangchenjunga, rising from the Kangchenjunga Glacier.\nIn 1905, a party headed by Aleister Crowley made the first attempt at climbing the mountain. Aleister Crowley had been part of the team attempting the 1902 ascent of K2. The team reached an estimated altitude of 6,500 m (21,300 ft) on the southwest side of the mountain before turning back. The exact height reached is somewhat unclear; Crowley stated that on 31 August, \"We were certainly over 21,000 ft (6,400 m) and possibly over 22,000 ft (6,700 m)\", when the team was forced to retreat to Camp 5 by the risk of avalanche. On 1 September, they evidently went further; some members of the team, Reymond, Pache, and Salama, \"got over the bad patch\" that had forced them to return to Camp 5 the day before, and progressed \"out of sight and hearing\" before returning to Crowley and the men with packs, who could not cross the dangerous section unassisted with their burdens. It is not clear how far Reymond, Pache, and Salama had ascended – but in summarizing, Crowley ventured \"We had reached a height of approximately 25,000 ft (7,600 m).\" Attempting a \"mutinous\" late-in-the-day descent from Camp 5 to Camp 4, climber Alexis Pache (who earlier that day had been one of three to ascend possibly higher than any before), and three local porters, were killed in an avalanche. Despite the insistence of one of the men that \"the demon of Kangchenjunga was propitiated with the sacrifice\", Crowley decided the accident and its ramifications made it impossible to continue the expedition.\nIn 1907, two Norwegians set about climbing Jongri via the Kabru glacier to the south, an approach apparently rejected by Graham's party. Progress was very slow, partly because of problems with supplies and porters, and presumably also lack of fitness and acclimatisation. However, from a high camp at about 22,600 ft (6,900 m) they were eventually able to reach a point 50 or 60 ft (15 or 18 m) below the summit before they were turned back by strong winds.\nIn 1929, the German Paul Bauer led an expedition team that reached 7,400 m (24,300 ft) on the northeast spur before being turned back by a five-day storm.\nIn May 1929, the American E. F. Farmer left Darjeeling with native porters, crossed the Kang La into Nepal and climbed up towards the Talung Saddle. When his porters refused to go any further, he climbed alone further upwards through drifting mists but did not return.\nIn 1930, Günter Dyhrenfurth led an international expedition comprising the German Uli Wieland, Austrian Erwin Schneider, and Englishman Frank Smythe who attempted to climb Kangchenjunga. They failed because of poor weather and snow conditions.\nIn 1931, Paul Bauer led a second German expedition team who attempted the northeast spur before being turned back by bad weather, illnesses, and deaths. The team, including Peter Aufschnaiter, retreated after climbing 300 m higher than the 1929 attempt.\nIn 1954, John Kempe led a party comprising J. W. Tucker, S. R. Jackson, G. C. Lewis, T. H. Braham and medical officer D. S. Mathews. They explored the upper Yalung glacier with the intention to discover a practicable route to the great ice-shelf that runs across the southwest face of Kangchenjunga. This reconnaissance led to the route used by the successful 1955 expedition.\n\n\n=== First ascent ===\n\nIn 1955, Joe Brown and George Band made the first ascent on 25 May, followed by Norman Hardie and Tony Streather on 26 May. The full team also included John Clegg (team doctor), Charles Evans (team leader), John Angelo Jackson, Neil Mather, and Tom Mackinnon.\nThe ascent proved that Aleister Crowley's 1905 route (also investigated by the 1954 reconnaissance) was viable. The route starts on the Yalung Glacier to the southwest of the peak, and climbs the Yalung Face, which is 3,000 metres (10,000 ft) high. The main feature of this face is the \"Great Shelf\", a large sloping plateau at around 7,500 metres (24,600 ft), covered by a hanging glacier. The route is almost entirely on snow, glacier, and one icefall; the summit ridge itself can involve a small amount of travel on rock. The first ascent expedition made six camps above their base camp, two below the Shelf, two on it, and two above it. They started on 18 April, and everyone was back to base camp by 28 May. Other members of this expedition included John Angelo Jackson and Tom Mackinnon.\n\n\n=== Other notable ascents ===\n\n1973 Yutaka Ageta and Takeo Matsuda of the Japanese expedition summitted Kangchenjunga West, also called Yalung Kang, by climbing the southwestern ridge. Matsuda never returned to camp and his body was never found. The expedition concluded that he had fallen during descent when he was separated from Ageta.\n1977 The second ascent of Kangchenjunga, by an Indian Army team led by Colonel Narendra Kumar. They completed the northeast spur, the difficult ridge that defeated German expeditions in 1929 and 1931.\n1978 Polish teams made the first successful ascents of the summits Kangchenjunga South (Wojciech Wróż and Eugeniusz Chrobak, 19 May) and Kangchenjunga Central (Wojciech Brański, Zygmunt Andrzej Heinrich, Kazimierz Olech, 22 May).\n1979 The third ascent, on 16 May, and the first without oxygen, by Doug Scott, Peter Boardman and Joe Tasker establishing a new route on the North Ridge.\n1982 6 May sees Ang Dorje, Friedel Mutschlechner, and Reinhold Messner (suffering from amoebic liver abscess) reach the top by a variation on the North Face route without supplemental oxygen.\n1983 Pierre Beghin made the first solo ascent. It was accomplished without the use of supplemental oxygen.\n1986 On 11 January, Krzysztof Wielicki and Jerzy Kukuczka, Polish climbers, made the first winter ascent. That year Otto Guilherme Gerstenberger Junior (Brazilian) and Johann Krigeer (South African) reach the peak without using supplemental oxygen.\n1988 First successful American Expedition; led by Carlos Buhler, from the North Face. Summiting were Buhler, Peter Habeler (Austrian), and Martin Zabaleta (Spanish)\n1989 A Soviet expedition successfully traversed all four summits of Kangchenjunga that are higher than 8,000m. Two separate teams traversed the summits in opposite directions.\n1989 American Expedition led by Lou Whittaker, with six people summiting on the Northwall: George Dunn, Craig van Hoy, Ed Viesturs, Phil Ershler, Larry Nielson, Greg Wilson.\n1991 Slovenian Marija Frantar and Joze Rozman attempted the first ascent by a woman. Their bodies were later found below the summit headwall.\n1991 Slovenian Andrej Štremfelj and Marko Prezelj completed an alpine-style climb up the south ridge of Kangchenjunga to the south summit (8,494 m).\n1992 Carlos Carsolio made the only summit that year. It was in a solo climb without supplementary oxygen.\n1992 Wanda Rutkiewicz, the first woman in the world to ascend and descend K2 and a world-renowned Polish climber, died after she insisted on waiting for an incoming storm to pass, which she did not survive.\n1995 Benoît Chamoux, Pierre Royer and their Sherpa guide disappeared on 6 October near the summit.\n1998 Ginette Harrison was the first woman who climbed Kangchenjunga North face.\n2005 Alan Hinkes, a British climber, was the only person to summit in the 50th anniversary of the first ascent year, and it marked his 14th eight-thousander.\n2006 Gerlinde Kaltenbrunner, an Austrian mountaineer, was the second woman to reach the summit.\n2009 Jon Gangdal and Mattias Karlsson reached the summit, becoming, respectively, the first Norwegian and the first Swedish mountaineer to summit this mountain.\n2009 Edurne Pasaban, a Spanish mountaineer, reached the summit becoming the first woman to summit twelve eight-thousanders.\nIn May 2009, Kinga Baranowska was the first Polish woman to reach the summit of Kangchenjunga.\n2011 Tunç Fındık became the first Turkish man to reach the peak of Kangchenjunga, his seventh eight thousander, with Swiss partner Guntis Brandts via the British 1955 SW Face route.\n2011 Indian mountaineers Basanta Singha Roy and Debasish Biswas of Mountaineers' Association of Krishnanagar (MAK), West Bengal, India, successfully scaled Kangchenjunga Main on 20 May 2011.\nIn May 2013, five climbers including Hungarian Zsolt Erőss and Péter Kiss reached the summit, but disappeared during the descent.\nIn May 2014, Bulgarian Boyan Petrov reached the peak without the use of supplemental oxygen. Petrov is a diabetic.\nIn May 2014, Chhanda Gayen became the first Indian woman to summit. She was killed by an avalanche on the descent.Despite improved climbing gear the fatality rate of climbers attempting to summit Kanchenjunga is high. Since the 1990s, more than 20% of people died while climbing Kanchenjunga's main peak.\n\n\n== Tourism ==\n\nBecause of its remote location in Nepal and the difficulty involved in accessing it from India, the Kangchenjunga region is not much explored by trekkers. It has, therefore, retained much of its pristine beauty. In Sikkim too, trekking into the Kangchenjunga region has just recently been permitted. The Goecha La trek is gaining popularity amongst tourists. It goes to the Goecha La Pass, located right in front of the huge southeast face of Kangchenjunga. Another trek to Green Lake Basin has recently been opened for trekking. This trek goes to the Northeast side of Kangchenjunga along the famous Zemu Glacier. The film Singalila in the Himalaya is journey around Kangchenjunga.\n\n\n== In myth ==\n\nThe area around Kangchenjunga is said to be home to a mountain deity, called Dzö-nga or \"Kangchenjunga Demon\", a type of yeti or rakshasa. A British geological expedition in 1925 spotted a bipedal creature which they asked the locals about, who referred to it as the \"Kangchenjunga Demon\".For generations, there have been legends recounted by the inhabitants of the areas surrounding Kanchenjunga, both in Sikkim and in Nepal, that there is a valley of immortality hidden on its slopes. These stories are well known to both the original inhabitants of the area, the Lepcha people, and Limbu people and those of the Tibetan Buddhist cultural tradition. In Tibetan, this valley is known as Beyul Demoshong. In 1962 a Tibetan Lama by the name of Tulshuk Lingpa led over 300 followers into the high snow slopes of Kanchenjunga to ‘open the way’ to Beyul Demoshong. The story of this expedition is recounted in the 2011 book A Step Away from Paradise.\n\n\n== In literature ==\n\nIn the Swallows and Amazons series of books by Arthur Ransome, a high mountain (unnamed in the books) is given the name \"Kanchenjunga\" by the children when they climb it in 1931.\nIn The Epic of Mount Everest, first published in 1926, Sir Francis Younghusband: \" For natural beauty Darjiling (Darjeeling) is surely unsurpassed in the world. From all countries travellers come there to see the famous view of Kangchenjunga, 28,150 feet (8,580 m) in height, and only 40 miles (64 km) distant. Darjiling (Darjeeling) itself is 7,000 feet (2,100 m) above sea-level and is set in a forest of oaks, magnolia, rhododendrons, laurels and sycamores. And through these forests, the observer looks down the steep mountain-sides to the Rangeet River only 1,000 feet (300 m) above sea-level, and then up and up through tier after tier of forest-clad ranges, each bathed in a haze of deeper and deeper purple, till the line of snow is reached; and then still up to the summit of Kangchenjunga, now so pure and ethereal we can scarcely believe it is part of the solid earth on which we stand; and so high it seems part of the very sky itself.\"\nIn 1999, official James Bond author Raymond Benson published High Time to Kill. In this story, a microdot containing a secret formula for aviation technology is stolen by a society called the Union. During their escape, their plane crashes on the slopes of Kangchenjunga. James Bond becomes part of a climbing expedition in order to retrieve the formula.\nThe Inheritance of Loss by Kiran Desai, which won the 2006 Man Booker Prize, is set partly in Kalimpong, a hill station situated near Kangchenjunga.\nIn Legend of the Galactic Heroes by Yoshiki Tanaka, which won the Seiun Award for \"Best Novel of the Year\" in 1988 and was adapted into an anime series by Kitty Films, the capital and holiest temple of the Terraist Cult is on Earth beneath the rubble of Kangchenjunga.\nMichelle Paver's 2016 ghost story Thin Air concerns a fictional expedition to climb Kangchenjunga in 1935, and an earlier (also fictional) expedition in 1906.\nThe book Round Kangchenjunga – A Narrative of Mountain Travel and Exploration by Douglas Freshfield gives a complete account of his travel around Kangchenjunga.\n\n\n== Further reading ==\n\nJoseph Dalton Hooker 1855. Himalayan Journals. Assistant-director of the Royal Botanic Gardens, Kew.\nLaurence Waddell 1899. Among The Himalayas. Travels in Sikkim. Book includes the exploration of the south of Kangchenjunga.\nAleister Crowley 1905. The Confessions of Aleister Crowley, Chapters 51, 52, and 53, tells of the Kangchenjunga Expedition by him and Dr. Jacot-Guillarmod.\nDouglas Freshfield 1903. Round Kangchenjunga – A Narrative of Mountain Travel and Exploration. Edward Arnold, London\nPaul Bauer 1937. Himalayan Campaign. Blackwell is the story of Bauer's two attempts in 1929 and 1931, republished as Kangchenjunga Challenge (William Kimber, 1955).\nPaul Bauer \"The German Attack on Kangchenjunga\", The Himalayan Journal, 1930 Vol. II.\nLieut. Col. H.W. Tobin \"Exploration and Climbing in The Sikkim Himalaya\", The Himalayan Journal, April 1930 Vol. II. Provides the early exploration and climbing attempts on Kangchenjunga.\nProf. G. O. Dyhrenfurth \"The International Himalayan Expedition, 1930\", The Himalayan Journal, April 1931, Vol. III. Details their attempt on Kangchenjunga.\nH.W. Tilman The ascent of Nanda Devi, 7 June 1937, Cambridge University Press. Relates the story of their intention to climb Kangchenjunga.\nIrving, R. L. G. 1940. Ten Great Mountains. London, J. M. Dent & Sons\nJohn Angelo Jackson 1955. More than Mountains Book containing data on the 1954 Kangchenjunga reconnaissance. Jackson was also a team member of the first ascent of Kangchenjunga in 1955, also relates the Daily Mail \"Abominable Snowman\" or Yeti Expedition, when the first trek from Everest to Kangchenjunga was accomplished * [1]. Relevant pages 97 onwards with two detailed maps.\nCharles Evans Kangchenjunga The Untrodden Peak, Hodder & Stoughton, Leader of the 1955 expedition. Principal of the University College of North Wales, Bangor. Foreword by His Royal Highness the Duke of Edinburgh, K.G.\nJoe Brown, The Hard Years, tells his version of the first ascent of Kangchenjunga in 1955.\nColonel Narinder Kumar 1978. Kangchenjunga: First ascent from the north-east spur. Vision books. Includes the second ever ascent of Kangchenjunga and the first from the northeast spur on the Indian side of the mountain. See also Himalayan Journal Vol. 36 and 50th Anniversary Edition\nPeter Boardman 1982. Sacred Summits: A Climber's Year. Includes the 1979 ascent of Kangchenjunga with Joe Tasker and Doug Scott. Also in The Himalayan Journal Vol 36.\nJohn Angelo Jackson 2005. Adventure Travels in the Himalaya. Indus Publishing. Recounts in more detail the first ascent of Kangchenjunga.\nSimon Pierse 2005. Kangchenjunga: Imaging a Himalayan Mountain. University of Wales, School of Art Press, ISBN 978-1-899095-22-3. An anthology of word and image published to coincide with the 50th anniversary of the first ascents of Kangchenjunga. Well illustrated with reproductions of paintings, prints, and photographs describing the climbing history and cultural significance of the mountain. Preface by George Band.The above Himalayan Journal references were all also reproduced in the \"50th Anniversary of the First Ascent of Kangchenjunga\" The Himalayan Club, Kolkata Section 2005.\n\nPema Wangchuk and Mita Zulca Khangchendzonga: Sacred Summit. The book details the stories and legends celebrated by the communities living in the Kangchenjunga's shadow, goes over the exploits of the early explorers and mountaineers. Chapters cover what Khangchendzonga means to Buddhism, mapping, early explorers, Alexander Kellas, early expeditions, the first ascent in 1955, the Indian Army ascent (1977), the second British ascent (1979), women climbers, the Tiger climbers, the yeti, and more. Profusely illustrated with many period photos.\nThe Geographer at High Altitudes, Climbing on the Himalaya and other Mountain Ranges, By J. Norman Collie, F.R.S. Edinburgh: David Douglas. 1902.\nThe Glaciers of Kangchenjunga Douglas Freshfield The Geographical Journal, Vol. 19, No. 4 Apr 1902, pp. 453–472\nRound Kangchenjunga. A Narrative of Mountain Travel and Exploration, Douglas W. Freshfield Bulletin of the American Geographical Society, Vol. 36, No. 2 1904\nC. K. Howard-Bury. 1922. \"The Mount Everest Expedition\". The Geographical Journal 59 (2): 81–99.\n\"General Bruce's Illness a Serious handicap\" The Times, (British) World Copyright, Lt. R.F.Norton, 19 April 1924. Expedition in the Kangchenjunga area.\nAccount of a Photographic Expedition to the Southern Glaciers of Kangchenjunga in the Sikkim Himalaya, N. A. Tombazi, The Geographical Journal, Vol. 67, No. 1 Jan 1926, pp. 74–76\nAn Adventure to Kangchenjunga, Hugh Boustead, The Geographical Journal, Vol. 69, No. 4 (Apr. 1927), pp. 344–350\nThe Times Literary Supplement, Thursday, 11 December 1930. \"The Kangchenjunga Adventure\", F.S. Smythe.\nIm Kampf um den Himalaja, Paul Bauer. The Kangchenjunga Adventure, F. S. Smythe, Himalaya: Unsere Expedition, G. O. Dyhrenfurth. 1930\nThe Times Literary Supplement, Thursday, 9 April 1931. \"Kangchenjunga\", Paul Bauer.\nThe Imperial Gazetteer of India. Vol. XXVI, The Geographical Journal, Vol. 79, No. 1 Jan 1932, pp. 53–56\nRecent Heroes of Modern Adventure, T. C. Bridges; H. Hessell Tiltman, The Geographical Journal, Vol. 81, No. 6 Jun 1933, p. 568\nPaul Bauer 1931. Um Den Kantsch: der zweite deutsche Angriff auf den Kangchendzönga, The Geographical Journal, Vol. 81, No. 4 Apr 1933, pp. 362–363\nPaul Bauer; Sumner Austin 1938. Himalayan Campaign: The German Attack on Kangchenjunga, The Geographical Journal, Vol. 91, No. 5: 478\nCharles Evans; George Band 1956. Kangchenjunga Climbed. The Geographical Journal 122 (1): 1–12.\nCharles Evans 1956. \"Kangchenjunga: The Untrodden Peak\". The Times Literary Supplement.\nLou Whittaker, Memoirs of a Mountain guide, 1994\n\n\n== See also ==\nList of elevation extremes by country\n\n\n== References ==\n\n\n== External links ==\nKangchenjunga page on Himalaya-Info.org (German)\nKangchenjunga page on Summitpost.org\nAleister Crowley's detailed account of the 1905 attempt on Kangchenjunga\nKangchenjunga History for a more detailed up to date account of the mountain's history and ascents.\n\"Kāngchenjunga, India/Nepal\" on Peakbagger\n\"Kangchenjunga\". Peakware.com. Archived from the original on 4 March 2016. – photos\nGlacier Research Image Project presents photos tracking 24 years of changes in glaciers at Kangchenjunga.\nMtxplore Mountain Statistics Statistics of Kangchenjunga."