"The Hershey Company, commonly known as Hershey's, is an American multinational company and one of the largest chocolate manufacturers in the world. It also manufactures baked products, such as cookies and cakes, and sells beverages like milkshakes, and many more that are produced globally. Its headquarters are in Hershey, Pennsylvania, which is also home to Hersheypark and Hershey's Chocolate World. It was founded by Milton S. Hershey in 1894 as the Hershey Chocolate Company, a subsidiary of his Lancaster Caramel Company. The Hershey Trust Company owns a minority stake but retains a majority of the voting power within the company.Hershey's chocolate is available across the United States, and in over 60 countries worldwide. They have three large distribution centers, with modern technology and labor management systems. In addition, Hershey is a member of the World Cocoa Foundation. It is also associated with the Hersheypark Stadium and the Giant Center.\n\n\n== History ==\n\n\n=== Early years ===\n\nAfter an apprenticeship to a confectioner in 1873, Milton S. Hershey opened a candy shop in Philadelphia. This shop was open for six years, after which Hershey apprenticed with another confectioner in Denver, where he learned to make caramel. After another failed business attempt in New York, Hershey returned to Pennsylvania, where he founded the Lancaster Caramel Company in 1886.\nThe use of fresh milk in caramels proved successful, and in 1900, after seeing chocolate-making machines for the first time at the 1893 World's Columbian Exposition in Chicago, Hershey sold his caramel company for $1,000,000 (equal to $31,108,000 today), and concentrated on chocolate. To people who questioned him, he said, \"Caramels are just a fad, but chocolate is a permanent thing.\"\nIn 1896, Hershey built a milk-processing plant so he could create and refine a recipe for his milk chocolate candies.  In 1899, he developed the Hershey process, which is less sensitive to milk quality than traditional methods. In 1900, he began manufacturing Hershey's Milk Chocolate Bars, also known as Hershey's Bars or Hershey Bars.\n\n\n=== Expansion ===\n\nIn 1903, Hershey began construction of a chocolate plant in his hometown of Derry Church, Pennsylvania, later known as Hershey, Pennsylvania. The town was an inexpensive place for the workers and their families to live, though the factory was built without windows, so that employees would not be distracted.  To increase employee morale, Hershey provided leisure activities and created what would later become Hersheypark.  The milk chocolate bars from this plant proved popular, and the company grew rapidly.\nIn 1907, he introduced a new candy: bite-sized, flat-bottomed, conical pieces of chocolate that he named \"Hershey's Kiss\".  At first, each was wrapped by hand in a square of aluminum foil. The introduction of machine wrapping in 1921 sped up the process and added a small paper ribbon to the top of the package, indicating that it was a genuine Hershey product. Today, 70 candies are produced daily.Other products introduced included Mr. Goodbar (1925) (peanuts in milk chocolate), Hershey's Syrup (1926), semisweet chocolate chips (1928), and the Krackel bar with crisped rice (1938).\n\n\n=== Reese's Peanut Butter Cups ===\nHarry Burnett Reese invented Reese's Peanut Butter Cups after founding the H.B. Reese Candy Company in 1923. Reese died on May 16, 1956, in West Palm Beach, Florida, leaving the company to his six sons. On July 2, 1963, the H.B. Reese Candy Company merged with the Hershey Chocolate Corporation in a tax-free stock-for-stock merger. In 2020, after 57 years of stock splits, the original 666,316 shares of Hershey common stock received by the Reese family represented 16 million Hershey shares valued at $2.5 billion, paying annual dividends of $51.4 million. In 1969, only 6 years after the Reese/Hershey merger, Reese's Peanut Butter Cups became The Hershey Company's top seller. As of September 20, 2012, Reese's was the best-selling candy brand in the United States, with sales of $2.603 billion, and the fourth-best-selling brand globally, with sales of $2.679 billion. \nOnly $76 million (2.8%) of its sales are outside the United States.\n\n\n=== Unionization ===\nLabor unrest came to Hershey in the late 1930s, as a Congress of Industrial Organizations-backed union attempted to organize the factory workers.  A failed sit-down strike in 1937 ended in violence; loyalist workers and local dairy farmers beat many of the strikers as they attempted to leave the plant.  By 1940, an affiliate of the American Federation of Labor had successfully organized Hershey's workers under the leadership of John Shearer, who became the first president of Local Chapter Number 464 of the Bakery, Confectionery, Tobacco Workers and Grain Millers' International Union.  Local 464 still represents the Hershey workforce.\n\n\n=== M&M's ===\n\nShortly before World War II, Bruce Murrie, son of long-time Hershey's president William F.R. Murrie, struck a deal with Forrest Mars to create hard sugar-coated chocolate that would be called M&M's (for Mars and Murrie). Murrie had a 20% interest in the product, which used Hershey chocolate during World War II rationing. In 1948, Mars bought out Murrie and became one of Hershey's main competitors.\n\n\n=== Kit Kat and Rolo ===\nIn 1969, Hershey received a license from Rowntree's to manufacture and market Kit Kat and Rolo in the United States. After Hershey's competitor Nestlé acquired Rowntree's in 1988, it was still required to honor the agreement, and so Hershey continues to make and market the products in the U.S. The license would revert to Nestlé if Hershey were sold. This became a sticking point in Hershey's failed attempt to attract a serious buyer in 2002, and even Nestlé rejected Hershey's asking price, feeling that the economics would not work.\n\n\n=== Cadbury's ===\nIn 1988, Hershey's acquired the rights to manufacture and distribute many Cadbury-branded products in the United States (except gum and mints, which are part of Mondelēz International).  In 2015, they sued a British importer to halt imports of British Cadbury chocolate, which reportedly angered consumers. A merger between Mondelēz and Hershey's was considered but abandoned in 2016 after Hershey's turned down a $23 billion cash-and-stock bid.\n\n\n=== Other 20th-century sales and acquisitions ===\nIn 1977, Hershey acquired Y&S Candies, founded in 1845, and became the makers of Twizzlers licorice candies.\nIn 1986, Hershey's made a brief foray into cough drops when it acquired the Luden's cough drops brand. By 2001, though, the brand had been sold to Pharmacia (now part of Pfizer), and Luden's eventually became a product of Prestige Brands. Hershey's kept Luden's 5th Avenue bar.\nIn 1996, Hershey purchased the American operations of the Leaf Candy Company from Huhtamäki. In 1999, the Hershey Pasta Group was divested to several equity partners to form the New World Pasta company (now part of Ebro Foods).\n\n\n=== 21st century ===\nOn July 25, 2002, it became known that the Hershey Trust Company was seeking to sell its controlling interest in the Hershey Foods Corporation. The value of Hershey stock rose 25% in a single day, with over 19 million shares traded. Over the following 55 days, widespread press coverage, as well as pressure from Pennsylvania Attorney General Mike Fisher, the community of Hershey, and Dauphin County Orphans' Court Senior Judge Warren G. Morgan, led to the sale being abandoned. The seven Hershey trustees who voted to sell Hershey Foods on September 17, 2002, for US$12.5 billion to the William Wrigley Jr. Company (now part of Mars Incorporated) were removed by Attorney General Fisher and Judge Morgan. Ten of the 17 trustees were forced to resign and four new members who lived locally were appointed. The former Pennsylvania Attorney General, LeRoy S. Zimmerman, became the new chairman of the reconstituted Milton Hershey School Trustees. Mr. Zimmerman has publicly committed to having the Milton Hershey School Trust always retain its interest in The Hershey Company.\nIn December 2004, Hershey acquired the Mauna Loa Macadamia Nut Corp. from The Shansby Group.\n\nIn 2005, Krave Jerky was founded by Jon Sebastiani after he trained for a marathon and looked for a healthy source of energy.  Alliance Consumer Growth, a private equity group, invested in Krave Jerky in 2012. Hershey's purchased the company in 2015 for $240 million.  Hershey would later in 2020 sell Krave Jerky to Sonoma Brands, the food industry incubator founded by Sebastiani in 2016.In July 2005, Hershey acquired the Berkeley, California-based boutique chocolate-maker Scharffen Berger. In November 2005, Hershey acquired Joseph Schmidt Confections, the San Francisco-based chocolatier, and in November 2006, Hershey acquired Dagoba Organic Chocolate, a boutique chocolate maker based in Ashland, Oregon.\nIn June 2006, Philadelphia city councilman Juan Ramos called for Hershey's to stop marketing \"Ice Breakers Pacs\", a kind of mint, due to the resemblance of its packaging to a kind that was used for illegal street drugs.In September 2006, ABC News reported that several Hershey chocolate products were reformulated to replace cocoa butter with vegetable oil as an emulsifier. According to the company, this change was made to reduce the costs of producing the products instead of raising their prices or decreasing the sizes. Some consumers complained that the taste was different, but the company stated that in the company-sponsored blind taste tests, about half of consumers preferred the new versions. As the new versions no longer met the Food and Drug Administration's official definition of \"milk chocolate\", the changed items were relabeled from stating they were \"milk chocolate\" and \"made with chocolate\" to \"chocolate candy\" and \"chocolatey.\"In December 2011, Hershey reached an agreement to acquire Brookside Foods Ltd., a privately held confectionery company based in Abbotsford, British Columbia.In April 2015, the Hershey chocolate plant on East Chocolate Avenue in Hershey Pennsylvania was demolished to make way for mixed-use development.In 2016, Hershey acquired barkTHINS, a New York-based chocolate snack foods company that expected to generate between $65 million and $75 million in revenue for that year, for $290 million.An August 2016 attempt to sell Hershey to Mondelez International was abandoned because of objections by the Hershey Trust.In 2017, Hershey acquired Amplify Snack Brands, Austin, Texas-based maker of SkinnyPop, in an all-cash transaction valued at approximately $1.6 billion.In September 2018, Hershey announced to buy Pirate Brands from B&G Foods for $420 million in an all-cash deal.In August 2019, Hershey announced it would purchase protein bar maker One Brands LLC for $397 million.In October 2019, Hershey announced a collaboration with Yuengling to produce a limited release collaboration beer titled Yuengling Hershey's Chocolate Porter, becoming Hershey's first licensed beer partnership.In June 2021, Hershey acquired Lily's for $425 million.\n\n\n== Milton Hershey School (MHS) ==\n\nUnable to have children of his own, Milton S. Hershey founded the Hershey Industrial School in 1909 for white orphaned boys. In 1918, three years after the death of his wife, Milton Hershey donated around $90 million to the boarding school in trust, as well as 40% of the Hershey Company's common stock. The school's initial purpose was to train young men in trades but eventually shifted to focus on preparation for college. The Hershey Trust Company has exercised voting rights for the school and has been a trustee since its founding.Many of its designs resemble Hershey chocolate products, such as the Hershey Kisses street lights. Milton Hershey was involved in the school's operations until his death in 1945. The Hershey Industrial School was renamed the Milton Hershey School in 1951.\n\n\n== Manufacturing plants ==\nThe first plant outside Hershey opened on June 15, 1963, in Smiths Falls, Ontario, and the third opened on May 22, 1965, in Oakdale, California. In February and April 2007, Hershey's announced that the Smiths Falls and Oakdale plants would close in 2008, being replaced in part by a new facility in Monterrey, Mexico. The Oakdale factory closed on February 1, 2008. Hershey chocolate factory in São Roque, Brazil, was opened in August 2002. Hershey's Asia operations are largely supplied by their plant in Mandideep, India.Hershey also has plants in Stuarts Draft, Virginia; Lancaster, Pennsylvania; Hazleton, Pennsylvania; Memphis, Tennessee; Robinson, Illinois, and Guadalajara, Mexico.\nVisitors to Hershey can experience Hershey's Chocolate World visitors center and its simulated tour ride. Public tours were once operated in the Pennsylvania and California factories, which ended in Pennsylvania in 1973 as soon as Hershey's Chocolate World opened, and later in California following the September 11, 2001, attacks, due to security concerns.On September 18, 2012, Hershey opened a new and expanded West Hershey plant. The plant was completed at a budget of $300 million.On March 9, 2018, Hershey broke ground to expand its Kit Kat manufacturing facility in Hazle Township, Pennsylvania. The expansion project has a $60 million budget and is expected to create an additional 111 jobs at the facility.\n\n\n== Product recalls ==\nIn July 1998, a number of 100 g (3.5 oz) milk chocolate bars being sold for fundraising events were recalled because they may have contained traces of almonds not listed in the ingredients.\nIn November 2006, the Smiths Falls production plant in Ontario temporarily shut down and several products were voluntarily recalled after concerns over Salmonella contamination possibly found in soy lecithin within their production line. It was believed that most of the products involved in the recall never made it to the retail level.\n\n\n== Philanthropy ==\nHershey has made large contributions to education. One of their most notable contributions was the Elizabethtown College Honors Program. The program was established in 1999 and is funded partially through the endowment.\nIn 2015, Hershey announced a commitment to the Clinton Global Initiative to help build a sustainable supply chain to support basic nutrition for children in Ghana.Hershey's long-term focus on children and families has yielded long-standing partnerships with organizations such as Children's Miracle Network, Ronald McDonald House, and United Way (UW). In 2016, the company donated more than $486,200 to those organizations.\n\n\n== Criticism ==\nHershey has been criticized for not having programs to ensure sustainable and ethical cocoa purchases, lagging behind its competitors in fair trade measures.The \"Raise the Bar, Hershey!\" campaign was launched in September 2010 by Global Exchange, Green America, the Oasis Trust, and the International Labor Rights Forum. The purpose of the Raise the Bar Campaign was to pressure Hershey to commit \"to take immediate action to eliminate forced and child labor [...] from Hershey's cocoa supply\"; \"to sourcing 100% Fair Trade Certified cocoa beans by 2012 for at least one of its top five selling chocolate bars [...] making at least one additional top five selling bar 100% Fair Trade Certified every two years thereafter\"; and that \"the majority of Hershey's cocoa across all products will be Fair Trade Certified by 2022\". The pressure was particularly directed at Whole Foods Market, which announced on October 3, 2012, that it would cease carrying Hershey's Scharffen Berger line. The Campaign stated, \"Whole Foods' decision follows more than 40 natural food retailers and coops publicly expressing concern about carrying Scharffen Berger and Dagoba products as a consequence of the giant chocolate maker's refusal to address child labor in its supply chain\". The same day, Hershey's announced it would \"source 100 percent certified cocoa for its global chocolate product lines by 2020 and accelerate its programs to help eliminate child labor in the cocoa regions of West Africa\".In 2019, Hershey announced that they could not guarantee that their chocolate products were free from child slave labor, as they could trace only about 50% of their purchasing back to the farm level. The Washington Post noted that the commitment taken in 2001 to eradicate such practices within 4 years had not been kept, neither at the due deadline of 2005, nor within the revised deadlines of 2008 and  2010, and that the result was not likely to be achieved for 2020 either.In 2021, Hershey was named in a class action lawsuit filed by eight former child slaves from Mali who alleged that the company aided and abetted their enslavement on cocoa plantations in Ivory Coast. The suit accused Hershey (along with Nestlé, Cargill, Mars, Incorporated, Olam International, Barry Callebaut, and Mondelez International) of knowingly engaging in forced labor, and the plaintiffs sought damages for unjust enrichment, negligent supervision, and intentional infliction of emotional distress.\n\n\n== Products ==\n\n\n=== Gallery ===\n\n\t\t\n\t\t\n\t\t\n\t\t\n\t\t\n\t\t\n\t\t\n\t\t\n\t\t\n\t\t\n\t\t\n\n\n== Additional sources ==\nBrenner, Joël Glenn (2000). The Emperors of Chocolate: Inside the Secret World of Hershey & Mars. Broadway Books. ISBN 0-7679-0457-5.*Our History | HERSHEY'S\nHistory | The Hotel Hershey Official Hershey's chocolate and candy site\n\n\n== See also ==\n\nList of products manufactured by The Hershey Company\nList of food companies\nPennsylvania chocolate workers' strike, 1937\n\n\n== References ==\n\n\n== External links ==\nOfficial website Business data for The Hershey Company:"