"Overfishing is the removal of a species of fish from a body of water at a rate that the species cannot replenish, resulting in those species becoming underpopulated in that area. In a Food and Agriculture Organization of the United Nations 2018 report, the FAO estimates that one-third of world fish stocks were overfished by 2015. Over 30 billion euros in public subsidies are directed to fisheries annually.Overfishing can occur in water bodies of any sizes, such as ponds, rivers, lakes or oceans, and can result in resource depletion, reduced biological growth rates and low biomass levels. Sustained overfishing can lead to critical depensation, where the fish population is no longer able to sustain itself. Some forms of overfishing, such as the overfishing of sharks, has led to the upset of entire marine ecosystems.The ability of a fishery to recover from overfishing depends on whether the ecosystem's conditions are suitable for the recovery. Dramatic changes in species composition can result in an ecosystem shift, where other equilibrium energy flows involve species compositions different from those that had been present before the depletion of the original fish stock. For example, once trout have been overfished, carp might take over in a way that makes it impossible for the trout to re-establish a breeding population.\n\n\n== Global scale ==\n\nOverfishing has stripped many fisheries around the world of their stocks. The United Nations Food and Agriculture Organization estimated in a 2018 report that 33.1% of world fish stocks are subject to overfishing. Significant overfishing has been observed in pre-industrial times. In particular, the overfishing of the western Atlantic Ocean from the earliest days of European colonisation of the Americas has been well documented.The fraction of fish stocks that are within biologically sustainable levels has exhibited a decreasing trend, from 90% in 1974 to 66.9% in 2015. In contrast, the percentage of stocks fished at biologically unsustainable levels increased from 10% in 1974 to 33.1% in 2015, with the largest increases in the late-1970s and 1980s.\n\nIn 2015, maximally sustainably fished stocks (formerly termed fully fished stocks) accounted for 59.9% and underfished stocks for 7% of the total assessed stocks. While the proportion of underfished stocks decreased continuously from 1974 to 2015, the maximally sustainably fished stocks decreased from 1974 to 1989, and then increased to 59.9% in 2015.In 2015, among the 16 major statistical areas, the Mediterranean and Black Sea had the highest percentage (62.2%) of unsustainable stocks, closely followed by the Southeast Pacific 61.5% and Southwest Atlantic 58.8%. In contrast, the Eastern Central Pacific, Northeast Pacific (Area 67), Northwest Pacific (Area 61), Western Central Pacific and Southwest Pacific had the lowest proportion (13 to 17%) of fish stocks at biologically unsustainable levels.Daniel Pauly, a fisheries scientist known for pioneering work on the human impacts on global fisheries, has commented:\nIt is almost as though we use our military to fight the animals in the ocean. We are gradually winning this war to exterminate them. And to see this destruction happen, for nothing really – for no reason – that is a bit frustrating. Strangely enough, these effects are all reversible, all the animals that have disappeared would reappear, all the animals that were small would grow, all the relationships that you can't see any more would re-establish themselves, and the system would re-emerge.\n\n\n== Examples and evidence for overfishing ==\nExamples of overfishing exist in areas such as the North Sea, the Grand Banks of Newfoundland and the East China Sea. In these locations, overfishing has not only proved disastrous to fish stocks, but also to the fishing communities relying on the harvest. Like other extractive industries such as forestry and hunting, fisheries are susceptible to economic interaction between ownership or stewardship and sustainability, otherwise known as the tragedy of the commons.\n\nTuna has been caught by the locals in the upper Adriatic for centuries. Increasing fishing prevented the large schools of little tunny from migrating into the Gulf of Trieste. The last major tuna catch was made in 1954 by the fishermen of Santa Croce, Contovello and Barcola.\nThe Peruvian coastal anchovy fisheries crashed in the 1970s after overfishing and an El Niño season largely depleted anchovies from its waters. Anchovies were a major natural resource in Peru; indeed, 1971 alone yielded 10.2 million metric tons of anchovies. However, the following five years saw the Peruvian fleet's catch amount to only about four million tons. This was a major loss to Peru's economy.The collapse of the cod fishery off Newfoundland, and the 1992 decision by Canada to impose an indefinite moratorium on the Grand Banks, is a dramatic example of the consequences of overfishing.\nThe sole fisheries in the Irish Sea, the west English Channel, and other locations have become overfished to the point of virtual collapse, according to the UK government's official Biodiversity Action Plan. The United Kingdom has created elements in this plan to attempt to restore the fishery, but the expanding global human population and the expanding demand for fish has reached a point where demand for food threatens the stability of these fisheries, if not the species' survival.\nMany deep sea fish are at risk, such as orange roughy and sablefish. The deep sea is almost completely dark, near freezing, and has little food. Deep sea fish grow slowly because of limited food, have slow metabolisms, low reproductive rates, and many do not reach breeding maturity for 30 to 40 years. A fillet of orange roughy at the store is probably at least 50 years old. Most deep sea fish are in international waters, where there are no legal protections. Most of these fish are caught by deep trawlers near seamounts, where they congregate for food. Flash freezing allows the trawlers to work for days at a time, and modern fishfinders target the fish with ease.\nBlue walleye became extinct in the Great Lakes in the 1980s. Until the middle of the 20th century, the walleye was a commercially valuable fish, with about a half million tonnes being landed in the period from about 1880 to the late-1950s, when the populations collapsed, apparently through a combination of overfishing, anthropogenic eutrophication, and competition with introduced rainbow smelt.\nThe World Wide Fund for Nature and the Zoological Society of London jointly issued their \"Living Blue Planet Report\" on 16 September 2015 which states that there was a dramatic fall of 74% in worldwide stocks of the important scombridae fish such as mackerel, tuna and bonitos between 1970 and 2010, and the global overall \"population sizes of mammals, birds, reptiles, amphibians and fish fell by half on average in just 40 years.\"\nOverfishing of the critically endangered Pacific bluefin tuna has resulted in the few still caught selling for astronomical prices. In January 2019, a 278 kilogram (612 pound) tuna sold for 333.6 million yen, or over US$3 million, US$4,900 per pound. Fishers, driven by the fish's high value, use extraordinary techniques to catch them, leaving the population on the verge of collapse.\nSharks and rays: The global abundance of oceanic sharks and rays has declined by 71% since 1970, owing to an 18-fold increase in relative fishing pressure. As a consequence, three-quarters of the species comprising this group are now threatened with extinction.\n\n\n=== In management ===\nSeveral countries are now effectively managing their fisheries. Examples include Iceland and New Zealand. The United States has turned many of its fisheries around from being in a highly depleted state.\n\n\n== Consequences ==\n\nAccording to a 2008 UN report, the world's fishing fleets are losing US$50 billion each year due to depleted stocks and poor fisheries management. The report, produced jointly by the World Bank and the UN Food and Agriculture Organization (FAO), asserts that half the world's fishing fleet could be scrapped with no change in catch. In addition, the biomass of global fish stocks have been allowed to run down to the point where it is no longer possible to catch the amount of fish that could be caught. Increased incidence of schistosomiasis in Africa has been linked to declines of fish species that eat the snails carrying the disease-causing parasites. Massive growth of jellyfish populations threaten fish stocks, as they compete with fish for food, eat fish eggs, and poison or swarm fish, and can survive in oxygen depleted environments where fish cannot; they wreak massive havoc on commercial fisheries. Overfishing eliminates a major jellyfish competitor and predator, exacerbating the jellyfish population explosion. Both climate change and a restructuring of the ecosystem have been found to be major roles in an increase in jellyfish population in the Irish Sea in the 1990s.According to the 2019 Global Assessment Report on Biodiversity and Ecosystem Services published by the Intergovernmental Science-Policy Platform on Biodiversity and Ecosystem Services, overfishing is a primary driver of mass extinction in the world's oceans. A 2021 study published in the journal Nature asserted that the \"primary cause\" of ocean defaunation is overfishing.\n\n\n== Types ==\nThere are three recognized types of biological overfishing: growth overfishing, recruit overfishing, and ecosystem overfishing.\n\n\n=== Growth overfishing ===\n\nGrowth overfishing occurs when fish are harvested at an average size that is smaller than the size that would produce the maximum yield per recruit. A recruit is an individual that makes it to maturity, or into the limits specified by a fishery, which are usually size or age. This makes the total yield less than it would be if the fish were allowed to grow to an appropriate size. It can be countered by reducing fishing mortality to lower levels and increasing the average size of harvested fish to a size that will allow maximum yield per recruit.\n\n\n=== Recruitment overfishing ===\nRecruitment overfishing happens when the mature adult population (spawning biomass) is depleted to a level where it no longer has the reproductive capacity to replenish itself—there are not enough adults to produce offspring. Increasing the spawning stock biomass to a target level is the approach taken by managers to restore an overfished population to sustainable levels. This is generally accomplished by placing moratoriums, quotas, and minimum size limits on a fish population.\n\n\n=== Ecosystem overfishing ===\nEcosystem overfishing occurs when the balance of the ecosystem is altered by overfishing. With declines in the abundance of large predatory species, the abundance of small forage type increases causing a shift in the balance of the ecosystem towards smaller fish species.\n\n\n== Acceptable levels ==\nThe notion of overfishing hinges on what is meant by an \"acceptable level\" of fishing. More precise biological and bioeconomic terms define acceptable level as follows:\n\nBiological overfishing occurs when fishing mortality has reached a level where the stock biomass has negative marginal growth (reduced rate of biomass growth), as indicated by the red area in the figure. (Fish are being taken out of the water so quickly that the replenishment of stock by breeding slows down. If the replenishment continues to diminish for long enough, replenishment will go into reverse and the population will decrease.)\nEconomic or bioeconomic overfishing additionally considers the cost of fishing when determining acceptable catches. Under this framework, a fishery is considered to be overfished when catches exceed maximum economic yield where resource rent is at its maximum. Fish are being removed from the fishery so quickly that the profitability of the fishery is sub-optimal. A more dynamic definition of economic overfishing also considers the present value of the fishery using a relevant discount rate to maximise the flow of resource rent over all future catches.\n\n\n=== Harvest control rule ===\nA model proposed in 2010 for predicting acceptable levels of fishing is the Harvest Control Rule (HCR), which is a set of tools and protocols with which management has some direct control of harvest rates and strategies in relation to predicting stock status, and long-term maximum sustainable yields. Constant catch and constant fishing mortality are two types of simple harvest control rules.\n\n\n=== Input and output orientations ===\nFishing capacity can also be defined using an input or output orientation.\n\nAn input-oriented fishing capacity is defined as the maximum available capital stock in a fishery that is fully utilized at the maximum technical efficiency in a given time period, given resource and market conditions.An output-oriented fishing capacity is defined as the maximum catch a vessel (fleet) can produce if inputs are fully utilized given the biomass, the fixed inputs, the age structure of the fish stock, and the present stage of technology.Technical efficiency of each vessel of the fleet is assumed necessary to attain this maximum catch. The degree of capacity utilization results from the comparison of the actual level of output (input) and the capacity output (input) of a vessel or a fleet.\n\n\n== Mitigation ==\nIn order to meet the problems of overfishing, a precautionary approach and Harvest Control Rule (HCR) management principles have been introduced in the main fisheries around the world. The Traffic Light color convention introduces sets of rules based on predefined critical values, which can be adjusted as more information is gained.\nThe United Nations Convention on the Law of the Sea treaty deals with aspects of overfishing in articles 61, 62, and 65.\nArticle 61 requires all coastal states to ensure that the maintenance of living resources in their exclusive economic zones is not endangered by over-exploitation. The same article addresses the maintenance or restoration of populations of species above levels at which their reproduction may become seriously threatened.\nArticle 62 provides that coastal states: \"shall promote the objective of optimum utilization of the living resources in the exclusive economic zone without prejudice to Article 61\"\nArticle 65 provides generally for the rights of, inter alia, coastal states to prohibit, limit, or regulate the exploitation of marine mammals.According to some observers, overfishing can be viewed as an example of the tragedy of the commons; appropriate solutions would therefore promote property rights through, for instance, privatization and fish farming. Daniel K. Benjamin, in Fisheries are Classic Example of the 'Tragedy of the Commons', cites research by Grafton, Squires and Fox to support the idea that privatization can solve the overfishing problem: According to recent research on the British Columbia halibut fishery, where the commons has been at least partly privatized, substantial ecological and economic benefits have resulted. There is less damage to fish stocks, the fishing is safer, and fewer resources are needed to achieve a given harvest.\"Another possible solution, at least for some areas, is quotas, restricting fishers to a specific quantity of fish. A more radical possibility is declaring certain areas of the sea \"no-go zones\" and make fishing there strictly illegal, so the fish have time to recover and repopulate.\nIn order to maximise resources some countries, e.g., Bangladesh and Thailand, have improved the availability of family planning services. The resulting smaller populations have a decreased environmental footprint and reduced food needs.Controlling consumer behavior and demand is critical in mitigating action. Worldwide, a number of initiatives emerged to provide consumers with information regarding the conservation status of the seafood available to them. The \"Guide to Good Fish Guides\" lists a number of these.\n\n\n=== Government regulation ===\n\nMany regulatory measures are available for controlling overfishing. These measures include fishing quotas, bag limits, licensing, closed seasons, size limits and the creation of marine reserves and other marine protected areas.\nA model of the interaction between fish and fishers showed that when an area is closed to fishers, but there are no catch regulations such as individual transferable quotas, fish catches are temporarily increased but overall fish biomass is reduced, resulting in the opposite outcome from the one desired for fisheries. Thus, a displacement of the fleet from one locality to another will generally have little effect if the same quota is taken. As a result, management measures such as temporary closures or establishing a marine protected area of fishing areas are ineffective when not combined with individual fishing quotas. An inherent problem with quotas is that fish populations vary from year to year. A study has found that fish populations rise dramatically after stormy years due to more nutrients reaching the surface and therefore greater primary production. To fish sustainably, quotas need to be changed each year to account for fish population.\nIndividual transferable quotas (ITQs) are fishery rationalization instruments defined under the Magnuson-Stevens Fishery Conservation and Management Act as limited access permits to harvest quantities of fish. Fisheries scientists decide the optimal amount of fish (total allowable catch) to be harvested in a certain fishery. The decision considers carrying capacity, regeneration rates and future values. Under ITQs, members of a fishery are granted rights to a percentage of the total allowable catch that can be harvested each year. These quotas can be fished, bought, sold, or leased allowing for the least-cost vessels to be used. ITQs are used in New Zealand, Australia, Iceland, Canada, and the United States.\nIn 2008, a large-scale study of fisheries that used ITQs compared to ones that didn't provided strong evidence that ITQs can help to prevent collapses and restore fisheries that appear to be in decline.China bans fishing in the South China Sea for a period each year.The United Nations has included sustainable fishing and ending subsidies that contribute to overfishing as key targets for 2030 as part of their Sustainable Development Goal 14:  Life Below Water.\n\n\n=== Removal of subsidies ===\nBecause government provided financial subsidies can make it economically viable to fish beyond biologically sustainable levels, several scientists have called for an end to subsidies paid to deep-sea fisheries. In international waters beyond the 200 nautical mile exclusive economic zones of coastal countries, many fisheries are unregulated, and fishing fleets plunder the depths with state-of-the-art technology. In a few hours, massive nets weighing up to 15 tons, dragged along the bottom by deep-water trawlers, can destroy deep-sea corals and sponge beds that have taken centuries or millennia to grow. The trawlers can target orange roughy, grenadiers, or sharks. These fish are usually long-lived and late maturing, and their populations take decades, even centuries to recover.Fisheries scientist Daniel Pauly and economist Ussif Rashid Sumaila have examined subsidies paid to bottom trawl fleets around the world. They found that US$152 million per year are paid to deep-sea fisheries. Without these subsidies, global deep-sea fisheries would operate at a loss of US$50 million a year. A great deal of the subsidies paid to deep-sea trawlers is to subsidize the large amount of fuel required to travel beyond the 200 mile limit and drag weighted nets.\n\n\"There is surely a better way for governments to spend money than by paying subsidies to a fleet that burns 1.1 billion litres of fuel annually to maintain paltry catches of old growth fish from highly vulnerable stocks, while destroying their habitat in the process\" – Pauly.\"Eliminating global subsidies would render these fleets economically unviable and would relieve tremendous pressure on over-fishing and vulnerable deep-sea ecosystems\" – Sumaila.\n\n\n=== Minimizing fishing impact ===\nFishing techniques may be altered to minimize bycatch and reduce impacts on marine habitats. These techniques include using varied gear types depending on target species and habitat type. For example, a net with larger holes will allow undersized fish to avoid capture. A turtle excluder device (TED) allows sea turtles and other megafauna to escape from shrimp trawls. Avoiding fishing in spawning grounds may allow fish stocks to rebuild by giving adults a chance to reproduce.\n\n\n=== Aquaculture ===\nAquaculture involves the farming of fish in captivity. This approach effectively privatizes fish stocks and creates incentives for farmers to conserve their stocks. It also reduces environmental impact. However, farming carnivorous fish, such as salmon, does not always reduce pressure on wild fisheries, since carnivorous farmed fish are usually fed fishmeal and fish oil extracted from wild forage fish.  The various species of Pacific salmon and Atlantic salmon are relatively easy to raise in captivity and such aquacultural operations have existed for more than 150 years.  Largescale releases of salmon raised in captivity to supplement wild salmon runs will usually increase fishing pressure on the much less abundant wild salmon runs.\nAquaculture played a minor role in the harvesting of marine organisms until the 1970s. Growth in aquaculture increased rapidly in the 1990s when the rate of wild capture plateaued. Aquaculture now provides approximately half of all harvested aquatic organisms. Aquaculture production rates continue to grow while wild harvest remains steady.\nFish farming can enclose the entire breeding cycle of the fish, with fish being bred in captivity. Some fish prove difficult to breed in captivity and can be caught in the wild as juveniles and brought into captivity to increase their weight. With scientific progress, more species are being made to breed in captivity. This was the case with southern bluefin tuna, which were first bred in captivity in 2009.\n\n\n=== Consumer awareness ===\n\nAs global citizens become more aware of overfishing and the ecological destruction of the oceans, movements have sprung up to encourage abstinence—not eating any seafood—or eating only \"sustainable seafood\".\nSustainable seafood is a movement that has gained momentum as more people become aware of overfishing and environmentally destructive fishing methods. Sustainable seafood is seafood from either fished or farmed sources that can maintain or increase production in the future without jeopardizing the ecosystems from which it was acquired. In general, slow-growing fish that reproduce late in life, such as orange roughy, are vulnerable to overfishing. Seafood species that grow quickly and breed young, such as anchovies and sardines, are much more resistant to overfishing. Several organizations, including the Marine Stewardship Council (MSC), and Friend of the Sea, certify seafood fisheries as sustainable.The Marine Stewardship Council has developed an environmental standard for sustainable and well-managed fisheries. Environmentally responsible fisheries management and practices are rewarded with the use of its blue product ecolabel. Consumers concerned about overfishing and its consequences are increasingly able to choose seafood products that have been independently assessed against the MSC's environmental standard. This enables consumers to play a part in reversing the decline of fish stocks. As of February 2012, over 100 fisheries around the world have been independently assessed and certified as meeting the MSC standard. Their where-to-buy page lists the currently available certified seafood. As of February 2012, over 13,000 MSC-labelled products are available in 74 countries around the world. Fish & Kids is an MSC project to teach schoolchildren about marine environmental issues, including overfishing.\nThe Monterey Bay Aquarium's Seafood Watch Program, although not an official certifying body like the MSC, also provides guidance on the sustainability of certain fish species. Some seafood restaurants have begun to offer more sustainable seafood options. The Seafood Choices Alliance is an organization whose members include chefs that serve sustainable seafood at their establishments. In the US, the Sustainable Fisheries Act defines sustainable practices through national standards. Although there is no official certifying body like the MSC, the National Oceanic and Atmospheric Administration has created FishWatch to help guide concerned consumers to sustainable seafood choices.\nIn September 2016, a partnership of Google and Oceana and Skytruth introduced Global Fishing Watch, a website designed to assist citizens of the globe in monitoring fishing activities.\n\n\n== Barriers to effective management ==\nThe fishing industry has a strong financial incentive to oppose some measures aimed at improving the sustainability of fish stocks. Recreational fisherman also has an interest in maintaining access to fish stocks. This leads to extensive lobbying that can block or weaken government policies intended to prevent overfishing.\nOutside of countries' exclusive economic zones, fishing is difficult to control. Large oceangoing fishing boats are free to exploit fish stocks at will.In waters that are the subject of territorial disputes, countries may actively encourage overfishing. A notable example is the cod wars where Britain used its navy to protect its trawlers fishing in Iceland's exclusive economic zone. Fish are highly transitory. Many species will freely move through different jurisdictions. The conservation efforts of one country can then be exploited by another.\nWhile governments can create regulations to control people's behaviors this can be undermined by illegal fishing activity. Estimates of the size of the illegal catch range from 11 to 26 million tonnes, which represents 14-33% of the world's reported catch. Illegal fishing can take many forms. In some developing countries, large numbers of poor people are dependent on fishing. It can prove difficult to regulate this kind of overfishing, especially for weak governments. Even in regulated environments, illegal fishing may occur. While industrial fishing is often effectively controlled, smaller scale and recreational fishermen can often break regulations such as bag limits and seasonal closures. Fisherman can also easily fish illegally by doing things such as underreporting the amount of fish they caught or reporting that they caught one type of fish while actually catching another. There is also a large problem with the surveillance of illegal fishing activity. In 2001, the UN Food and Agriculture Organization (FAO), passed the International Plan of Action to Prevent, Deter and Eliminate Illegal, Unreported and Unregulated Fishing (IPOA-IUU). This is an agreement with the intention to stop port states from allowing boats to dock that participated in illegal, unreported or unregulated fishing. It also gives details for port states on effective measures of inspecting and reporting illegal fishing. Some illegal fishing takes place on an industrial scale with financed commercial operations.The fishing capacity problem is not only related to the conservation of fish stocks but also to the sustainability of fishing activity. Causes of the fishing problem can be found in the property rights regime of fishing resources. Overexploitation and rent dissipation of fishermen arise in open-access fisheries as was shown in Gordon.In open-access resources like fish stocks, in the absence of a system like individual transferable quotas, the impossibility of excluding others provokes the fishermen who want to increase catch to do so effectively by taking someone else' share, intensifying competition. This tragedy of the commons provokes a capitalization process that leads them to increase their costs until they are equal to their revenue, dissipating their rent completely.\n\n\n=== Resistance from fishermen ===\n\nThere is always disagreement between fishermen and government scientists... Imagine an overfished area of the sea in the shape of a hockey field with nets at either end. The few fish left therein would gather around the goals because fish like structured habitats. Scientists would survey the entire field, make lots of unsuccessful hauls, and conclude that it contains few fish. The fishermen would make a beeline to the goals, catch the fish around them, and say the scientists do not know what they are talking about. The subjective impression the fishermen get is always that there's lots of fish - because they only go to places that still have them... fisheries scientists survey and compare entire areas, not only the productive fishing spots. – Fisheries scientist Daniel Pauly \n\n\n== See also ==\n\n\n== References ==\n\n\n=== Citations ===\n\n\n=== Sources ===\n This article incorporates text from a free content work.  Licensed under CC BY-SA 3.0 IGO License statement/permission on Wikimedia Commons. Text taken from In brief, The State of World Fisheries and Aquaculture, 2018,  FAO, FAO. To learn how to add open license text to Wikipedia articles, please see this how-to page. For information on reusing text from Wikipedia, please see the terms of use.\n\n\n== Bibliography ==\n\n\n== External links ==\nThe World Is Running Out of Fish Faster Than We Thought (15 December 2016), Vice\n\"Overfishing Factsheet\". Waitt Institute. Retrieved 8 April 2016.\nJackson, J. \"Ocean Appocolypse Now\". UCSB. Retrieved 8 June 2015.\nMicrodocs: City vs. village fishing\nBye bye bluefin: Managed to death, The Economist. 30 October 2008. Retrieved 6 February 2009.\nWe’ve removed 90% of all large fish from the oceans. Just 10% to go. Australian Broadcasting Corporation. 13 February 2021."