"Edmund \"Ed\" Pevensie is a fictional character in C. S. Lewis's The Chronicles of Narnia series. He is a principal character in three of the seven books (The Lion, the Witch and the Wardrobe, Prince Caspian, and The Voyage of the Dawn Treader), and a lesser character in two others (The Horse and His Boy and The Last Battle).\nIn the live-action films, The Lion, The Witch and The Wardrobe, Prince Caspian and  The Voyage of the Dawn Treader, Edmund is portrayed by actor Skandar Keynes. Actor Mark Wells portrays an older Edmund at the end of the first film.\nIn The Lion, the Witch and the Wardrobe, Edmund betrays his siblings to the White Witch while under her influence, but as the story goes on, he accepts the error of his ways. He is redeemed with the intervention of Aslan and joins the fight against the witch. Fulfilling an ancient prophecy, he becomes King Edmund the Just, King of Narnia, and with sisters Susan and Lucy, co-ruler under High King Peter. Edmund is described in one book in a scene in Tashbaan as being part of a group of men 'as fair-skinned as [Shasta], and most of them had fair hair', although whether Edmund is one of the fair-haired ones is not clear. In the illustrations of him in the final book he is drawn as having fair hair.\n\n\n== Biography ==\n\n\n=== Prior story ===\nEdmund was born in 1930 and (according to the film series) lived in Finchley, England,  and he is 10 years old when he appears in The Lion, the Witch and the Wardrobe. By The Last Battle he is 19 years old.\n\n\n=== Characteristics ===\nThough Lucy is specifically described as being \"golden haired\", she, Susan, and Peter are depicted in the illustrations with dark hair, while Edmund is usually blond.  By contrast, in the most recent film adaptions Edmund is played by British actor Skandar Keynes, who is of both Lebanese and Turkish ancestry and therefore has darker hair and eyes than his siblings.\nEdmund is the most developed character in the series, beginning as a spiteful and mean-spirited boy in The Lion, the Witch, and the Wardrobe. By the end of the book, and throughout the rest of the series, Edmund is seen to be loyal, courageous, logical, and mature. In his adult life, as a king of Narnia, it is revealed that he handles many of Narnia's negotiations and transactions, as seen in The Horse and His Boy when Shasta runs into Edmund in Tashbaan the capital city of Calormen, where he has accompanied Susan to discuss a marriage proposal from Prince Rabadash. Edmund becomes protective particularly of Lucy, and acts as a voice of reason to Peter, who is more apt to become carried away.\nOn his return to Narnia in Prince Caspian, he makes friendships with both Prince Caspian and Reepicheep, which develop further in the Voyage of the Dawn Treader.\nEdmund is one of the most well developed characters in the books by virtue of his moral and spiritual journey from traitor to King, to serious and trustworthy young man. He is haunted throughout the rest of the series by his betrayal in The Lion, the Witch, and the Wardrobe. This is more evident in the films, in which Edmund personally foils the White Witch's return and he is tempted by her on the Dark Island upon which a person's worst fears are revealed. As the series progresses, his role in the books varies, but overall his character is serious. He acts as confidante and confessor to his cousin Eustace in the novel The Voyage of the Dawn Treader, as negotiator and counsellor for his sister Susan, and warleader for Narnia in the novel The Horse and His Boy. In the movie series, he provides comic relief, along with characters such as Reepicheep and the Beavers.\nAslan proclaims him King Edmund the Just, but in the letter sent to Miraz in the novel Prince Caspian he styles himself \"Duke of Lantern Waste and Count of the Western March, Knight of the Noble Order of the Table\".\n\n\n=== The Lion, the Witch and the Wardrobe ===\nIn The Lion, the Witch and the Wardrobe, Edmund is one of the main characters, at the age of 10 years, and the character who develops the most over the course of story.\nIt is implied in the book that Edmund started life as a likeable person, but then changed for the worse and became spiteful after starting at a new school. However, in the 2005 film adaptation of the book, it is implied that he is upset that their father was forced to serve in the war and that they are sent away from home as a result. In the 1988 BBC version, the reason for his change in behaviour is not mentioned.\nEdmund makes unjust and hurtful comments to Lucy when she first finds the entrance to Narnia through the wardrobe, and is the second of the Pevensie children to go to Narnia, after following Lucy to mock her during a game of hide and seek.\nHe walks some distance into the forest, convinced that he will find Lucy, but instead he meets the White Witch (who introduces herself as the Queen of Narnia) and eats some enchanted Turkish delight, which causes an addiction in the person who eats it. As a result, he promises the Witch that he will bring his siblings to her castle, not knowing that she intends to kill them all to prevent the fulfillment of a Narnian prophecy - she had promised to make him a Prince and heir to her throne if he brought his siblings into Narnia. Lucy did mention the White Witch in a subsequent conversation and Edmund realised that the witch was none other than the \"Queen of Narnia\", but the magic of the Turkish Delight was so strong that he was still determined to go back to her for more.\nUpon returning, he denies having been in Narnia, not wishing to admit that Lucy's story had been true. When Lucy tells the older siblings that they went to Narnia and told Edmund to tell them too, Edmund betrays Lucy and tells them that Lucy was making Narnia up.\nIt is when all four of the Pevensie children later go through the wardrobe that he lets slip that he has been in Narnia before. He and the other three children are taken under protection of Mr and Mrs Beaver, but while the others are having an in-depth conversation about the arrival of Aslan, Edmund sneaks away to the White Witch's castle, where he expects to be made a prince and later a king.\nHowever, his opinion of the Witch changes when she reveals her true character in her castle. She harshly berates him for coming alone, only offers him hard bread and cold water for his efforts, and does not shelter him from the cold on her sledge. She is even more horrified to hear from Edmund that Aslan has arrived in Narnia, and heads straight in the direction of the Stone Table, having first ordered Maugrim to find and kill his siblings and the Beavers. Edmund realises the full extent of her evil on their journey to the Stone Table, when they encounter a group of creatures enjoying a feast provided by Father Christmas. When the creatures continue to affirm that Father Christmas is their benefactor and has entered the land - a clear sign of her waning power - she turns them to stone over the protests of Edmund. (In the 2005 film, after Maugrim catches the fox which helped the beavers and the other three Pevensies elude him, the witch turns the fox to stone and hits Edmund for withholding information about Aslan and his army. In the 1988 BBC version, the scenario shown is the original that is portrayed in the book.)\nHe has now realized to his horror the full extent of the evil with which he has allied himself. In another sign of the witch's crumbling power the sledge eventually stalls as the snow melts, so they have to continue their journey on foot. They eventually stop in a wooded valley, where the Witch prepares to put him to death as a traitor. She ties Edmund to a tree and draws her knife, but a rescue party sent by Aslan arrives, frees him, and brings him to his siblings and the rest of Aslan's army. Edmund becomes fully reformed after a long conversation with Aslan, who afterward commands the Pevensies to consider the matter of their brother's misdeeds resolved.\nThe next day, the Witch arrives and reiterates her claim to Edmund's life. She and Aslan work out an agreement that Aslan will die in Edmund's place (though the other Narnians do not know this); but unknown to her, the magical nature of this contract allows Aslan to be brought back to life. Susan and Lucy witnessed Aslan's sacrifice and resurrection.\nWhile Aslan and Edmund's sisters race to free the cursed prisoners in the Witch's castle, Edmund consolidates his reformation by aligning himself with Peter's army in battle, where he plays a critical role in neutralizing the White Witch's most dangerous advantage, her wand, and is gravely wounded in the attempt.\nHowever, he is saved from death by the timely arrival of reinforcements led by Aslan, who leaps upon the Witch and kills her and by Lucy, who gives Edmund a dose of a magic cordial which can quickly heal any injury. The remnants of the enemy then either give themselves up or take to flight.\nEventually, a completely reformed Edmund Pevensie is crowned by Aslan as King Edmund, co-ruler of Narnia with Queen Lucy, Queen Susan and High King Peter, and is knighted as Duke of Lantern Waste, Count of the Western March, and Knight of the Noble Order of the Table.\nAfter fifteen years in Narnia, he and his siblings return to England, where they all magically appear as children again.\n\n\n=== The Horse and His Boy ===\nKing Edmund, Queen Susan, Tumnus the Faun and a raven named Sallowpad are visitors in the country of Calormen, where Crown Prince Rabadash wants to force Susan to marry him. Mistaking Shasta for the missing prince Corin Thunderfist of Narnia's ally Archenland, Edmund scolds the young boy for running off and making everyone worry. The Narnians manage to escape, which leads Rabadash to convince his father the Tisroc that they should take Narnia by invading Archenland.\nShasta brings warning of Rabadash's invasion to Narnia, and meets Edmund once again. Edmund gently reminds Shasta that he should not eavesdrop, but is clear that all is well before they march to Anvard to stop Rabadash.  Edmund, Shasta, and Corin's father, King Lune of Archenland, lead the fight against the Calormene army and defeat them.  Shasta is then recognized as Prince Cor, the long-lost heir of Archenland.\nEdmund's own redemption lends him perspective during the judgment of Rabadash; despite the fact that Rabadash has acted treacherously, Edmund argues against killing him, saying (in reference to himself) \"Even a traitor may mend.  I have known one who did.\"\n\n\n=== Prince Caspian ===\nEdmund and his siblings return to Narnia to aid Caspian, rightful King of Narnia, against King Miraz the Usurper. He convinces Trumpkin the dwarf that they are the Kings and Queens from the legend by defeating him in a sparring practice. He later helps Peter and Trumpkin defend Caspian against Nikabrik, a hag, and a werewolf, which Edmund kills. Edmund is also there to witness Peter's duel against Miraz. In the book Edmund is around 11 years old at the time of their return, but in the movie he is probably between 13 and 15 years of age.\nHe has since become more caring and protective of Lucy, and is the first person to believe her when she sees Aslan, supporting her against the disbelief of Trumpkin and her other siblings. Edmund is shown in a more positive light in this book than in The Lion, The Witch and The Wardrobe. His demeanor is more cooperative and loyal, even under the guidance of Peter, who is unprepared for the new Narnia and its current status. He rarely stands up to Peter openly but often subtly takes charge.\nIn the movie, Edmund proves to be much more mature than Peter and Caspian both, but he stays out of their arguments. Edmund is indispensable in all the battles, to Peter especially; sneaking into Miraz's castle ahead of the army to signal that it was safe to enter, and presenting Peter's proposition for a duel to Miraz and goading him into accepting, thereby buying them time. Also in the movie, he is able to stop the White Witch from being brought back from the dead by forcing his sword into the ice wall through which she is trying to re-enter Narnia and he smashes it. Peter continually robs Edmund of the credit he deserves by insisting, \"I had it sorted.\" This does not appear to bother Edmund until halfway through the movie when, after preventing the White Witch's return, he says to Peter, \"I know. You had it sorted,\" before walking away.\nEdmund, along with Trumpkin, Reepicheep, and others, provides some comedic relief throughout the story.\nIn destroying the White Witch once again, it can be thought that Edmund has at last overcome his dark past with her, which seemingly everyone but him has long since forgotten. It can also be thought that Edmund's repeated heroism and nobility is an attempt at compensating for betraying his siblings, regardless of whether or not they still hold it against him.\n\n\n=== The Voyage of the Dawn Treader ===\nEdmund, Lucy and their cousin Eustace enter the world of Narnia through a magic painting, and end up in the ocean. They are rescued and brought on board the Dawn Treader, where they are reunited with King Caspian, who is on a quest to search for the missing Lords that his uncle had sent to explore other lands some years before. This is Edmund and Lucy's last adventure in the world of Narnia since Aslan told them they were getting too old to come back. By this point Edmund's character has matured a great deal which can be seen in the way he deals with his cousin Eustace and in the power struggle with Caspian. Edmund and Lucy are noticeably close in this installment, as can be seen in the way they defend each other against Eustace. When Eustace changes his behavior after being changed back from a dragon, Edmund mentions his own betrayal and says that Eustace was not worse than he was. While on Ramandu's Island, Edmund says to Ramandu's daughter that when he looks at her, he cannot help believing what she says, but the same might happen with a witch: clearly him remembering what had happened with the White Witch when he first came into Narnia, and wishing to avoid a repeat.\nIn the book Edmund is around 12 or 13 at the time of their return, but in the movie he appears to be between 15–17 years of age.\nIn the 2010 film, Edmund is haunted by a green mist in the form of the White Witch and becomes jealous of Caspian's status as the current Narnian king (being overruled by him). He and Caspian become violent at one point, over the enchanted pool that turns everything submerged in it to gold, which Lucy quickly breaks up and reprimands them both for. After this, Edmund no longer appears to be bothered by Caspian's status as king. He is also greatly distressed when the Dufflepuds appear to have taken Lucy, and when he believes Eustace to have been eaten by a dragon, which shows the deep affection and sense of protection he has for his family. He is also the person who imagines and defeats the sea serpent, and helps Caspian to rescue the slaves from Narrowhaven slave market on the island of Doorn.\nAt the end of the film Edmund is more composed than Lucy when it is revealed they will not be returning, and consoles her, saying that it may be time anyway; while he is obviously deeply moved and distressed, it is clear that he suspected this would be the case. In the very last scene, back in England, he looks back and grins knowingly at Eustace, which suggests a camaraderie between the two that had not been there before.\n\n\n=== The Last Battle ===\nAfter seeing a vision of King Tirian of Narnia pleading for their help in England, Peter and Edmund go to the Ketterleys' old home in London to dig up the magic rings that Professor Kirke buried in the yard as a boy in The Magician's Nephew to be used by Eustace and Jill to reach Narnia. They are waiting for the others at the train platform when the accident happens.\nWhen King Tirian sees the Seven Friends of Narnia in his dream/vision, he thinks that, as with Peter, that Edmund 'had already the face of a King and a warrior'.\nEdmund accompanies everyone, except Susan, into Aslan's country. Like his brother and younger sister, he is killed in the train crash and is transferred to Aslan's country, where they all live forever.\n\n\n== Portrayals ==\nIn the 1967 TV serial, he was played by Edward McMurry.\nJonathan R. Scott played Edmund in the 1988 BBC production.  As an adult he is played by Charles Ponting.\nIn the 2005 film The Chronicles of Narnia: The Lion, the Witch and the Wardrobe, young Edmund is portrayed by Skandar Keynes while Mark Wells plays Edmund as an adult. Keynes returned for the sequel, The Chronicles of Narnia: Prince Caspian, released in 2008. He again portrayed Edmund in The Chronicles of Narnia: The Voyage of the Dawn Treader.\nIn the spoof Epic Movie, Edmund is played by Kal Penn, renamed Edward.\n\n\n== References ==\n\nFord, Paul (2005), Edmund Pevensie (in The Companion to Narnia: A Complete Guide to the Magical World of C.S. Lewis' The Chronicles of Narnia), HarperSanFrancisco, ISBN 0-06-079127-6\n\n\n== External links ==\nNarniaWeb"