"Camp Pine Knot, also known as Huntington Memorial Camp, on Raquette Lake in the Adirondack Mountains of New York State, was built by William West Durant. Begun in 1877, it was the first of the \"Adirondack Great Camps\" and epitomizes the \"Great Camp\" architectural style.  Elements of that style include log and native stonework construction, decorative rustic items of branches and twigs, and layout as a compound of separated structures.   It is located on the southwest tip of Long Point, a two-mile long point extending into Raquette Lake, in the Town of Long Lake in Hamilton County, New York.\nThe camp consists of some two dozen buildings, including a seven-room  \"Swiss Cottage,\" four \"Log Cottages\" of one to three rooms, two frame cottages of three and five rooms, a \"Glass Dining Room,\" and a five-stall horse barn and wagon shed.  Covered walkways connect many of the buildings.  There was also the \"Barque,\" a 20 by 60 foot four-room bark cabin built on a log raft, used to escape from the dreaded black fly in the spring; it was fully equipped, with a kitchen, bath, and running water.\n\n\n== History ==\nPine Knot was started by Durant's father, railroad developer Thomas C. Durant, as a showplace to draw investors to Durant's holdings, but it was William West Durant that would develop it into the remarkable model for Adirondack Great Camps to follow. In 1895 West sold the camp to wealthy industrialist Collis P. Huntington.\nThe camp went unused from the start of the 20th century until 1947, when it was sold to the State University of New York at Cortland for 1 dollar, for use as their Outdoor Education center.  Due to the soundness of its construction, despite its long disuse, the buildings required little repair.  The Barque is being rebuilt.\nThe camp was included in a multiple property submission for listing on the National Register of Historic Places in 1986, was in fact listed in 1986, and was declared a National Historic Landmark in 2004.\n\n\t\t\n\t\t\n\n\n== See also ==\n\nList of National Historic Landmarks in New York\nNational Register of Historic Places listings in Hamilton County, New York\n\n\n== References ==\n\n\n== Sources ==\nGilborn, Craig. Durant: Fortunes and Woodland Camps of a Family in the Adirondacks.  Utica, NY: North Country Books, 1981.\nKaiser, Harvey.  Great Camps of the Adirondacks. Boston:  David R. Godine, 1982.\n\n\n== External links ==\nSUNY Cortland Outdoor Education, \"Cortland's Raquette Lake Camp Becomes First National Historic Landmark in SUNY\", by Peter D. Koryzno, Winter 2004\nSUNY Cortland Outdoor Education - History of Camp Huntington (Pine Knot)\nCamp Pine Knot - The Origin of the Adirondack Great Camp\nSt. Hubert's Isle - Adirondack Great Camps - Pine Knot, Uncas & Sagamore - Photos\nSUNY Cortland - Huntington Camp"