"A New Earth: Awakening to Your Life’s Purpose is a self-help book by Eckhart Tolle. First published in 2005, it sold 5 million copies in North America by 2009. In 2008 it was selected for Oprah's Book Club and featured in a series of 10 weekly webinars with Tolle and Oprah Winfrey.\n\n\n== Overview ==\nAn article in Success magazine describes A New Earth as a \"self-improvement book\" that encourages its readers to live their lives in each present moment and to create happiness for themselves without emphasizing material possessions.  Tolle's intent is to change the way human beings think, and he envisions a world population that is increasingly humble, enlightened and pure. According to Tolle, the book's purpose \"is not to add new information or beliefs to your mind or to try to convince you of anything, but to bring about a shift in consciousness\".In the book,  Tolle asserts that everyone can find \"the freedom and joy of life\" if they live in the present moment. The book describes human dysfunction, selfishness, anxiety and the inhumanity we inflict on each other, as well as mankind's failed attempts to find life meaning and purpose through material possessions and unhealthy relationships.  It asserts that thoughts can have a powerful and beneficial \"effect on the healing process\", and puts forth a concept of \"evolutionary transformation of human consciousness\" which prompts the reader to participate in \"honest self-evaluation [that] can lead to positive change.\"\n\n\n== Synopsis ==\nEarly chapters of the book give simple explanations and provide a foundation for further concepts and ideas. In \"Chapter One: The Flowering of Human Consciousness\", Tolle discusses the \"inherent dysfunction in humanity\" and proposes ways that readers may rise above it.  He then develops these concepts in chapters two, three and four by offering his descriptions of the ego and its \"vices.\" In the book, Tolle defines the term ego as an \"illusory sense of self\" based on one's memories and thoughts.  In chapters five and six Tolle uses the phrase pain body to describe the human tendency to carry \"an accumulation of old emotional pain\". In chapters seven, eight and nine: \"Inner Space, Inner Purpose and Who You Truly Are\", Tolle makes many distinctions: between \"knowing yourself and knowing about yourself\"; between the \"Dreamer\" and the \"dream\"; between the objects of consciousness and the space of consciousness; between outer space and inner space; and between outer purpose and inner purpose. In chapter ten, \"A New Earth\", Tolle gives his readers suggestions for implementation of his ideas in their personal life but cautions them by saying:  \"You are still an ordinary human. What is extraordinary is what comes through you into this world\".\n\n\n== Reception ==\nOprah Winfrey selected A New Earth for her book club in January 2008, and in March it was featured in a series of ten weekly webinars broadcast on Winfrey's website. By March 23, 2008 the book had reached number one on the New York Times Best Seller list for \"Paperback Advice\". According to Barnes & Noble, the book became the fastest-selling title in the history of Oprah's Book Club, out of the 61 selections since the book club's inception in 1996. Within four weeks of the book-club announcement 3.5 million copies had been shipped.   By 2009, an estimated 5 million copies had been sold in North America. Some Christian readers have criticized the book, saying that it states that a person can control their own destiny rather than God necessarily doing so. In addition, a journalist for SUCCESS magazine wrote in August 2008 that some readers reported having a difficult time understanding and incorporating Tolle's message into their lives.The book was originally published in 2005 by the Dutton/Penguin Group. Its second printing was published in 2006 by Plume publishing. A third printing was published 2008 by the Penguin Group. A New Earth is also available as an unabridged audiobook, read by the author.\n\n\n== See also ==\nPosi music\n\n\n== References ==\n\n\n== External links ==\nA New Earth at Official Website of Eckhart Tolle\nStudy materials (webcasts, transcripts, workbook, meditations) at Oprah.com"