"Corduroy is a textile with a distinct pattern, a \"cord\" or wale.  Modern corduroy is most commonly composed of tufted cords, sometimes exhibiting a channel (bare to the base fabric) between the tufts. Both velvet and corduroy derive from fustian fabric.\nThe fabric looks as if it is made from multiple cords laid parallel to each other and then stitched together. The word corduroy is from cord and duroy, a coarse woollen cloth made in England in the 18th century. The interpretation of the word as corde du roi (from French, the cord of the King) is a false etymology.Corduroy is considered a durable cloth.  Corduroy is found in the construction of trousers, jackets and shirts.  The width of the cord is commonly referred to as the size of the \"wale\" (i.e. the number of ridges per inch). The lower the \"wale\" number, the thicker the width of the wale (e.g., 4-wale is much thicker than 11-wale). Corduroy’s wale count per inch can vary from 1.5 to 21, although the traditional standard falls somewhere between 10 and 12. Wide wale is more commonly used in trousers and furniture upholstery (primarily couches); medium, narrow, and fine wale fabrics are usually found in garments worn above the waist.\nCorduroy is made by weaving extra sets of fibre into the base fabric to form vertical ridges called wales. The wales are built so that clear lines can be seen when they are cut into pile. \nThe primary types of corduroy are:\n\nStandard wale: 11 wales/inch, and available in many colours\nPincord/pinwale/needlecord: Pincord is the finest cord around with a count at the upper end of the spectrum (above 16)\nPigment dyed/printed corduroy: The process of colouring or printing corduroy with pigment dyes. The dye is applied to the surface of the fabric, then the garment is cut and sewn. When washed during the final phase of the manufacturing process, the pigment dye washes out in an irregular way, creating a vintage look. The colour of each garment becomes softer with each washing, and there is a subtle colour variation from one to the next. No two are alike.\nCorduroy is a material traditionally used in making British country clothing, even though its origin lies in items worn by townspeople in industrial areas. Although corduroy has existed for a long time and was used in Europe since the 18th century, only in the 20th century did it become global – notably expanding in popularity during the 1970s.\n\n\n== Other names ==\nOther names are often used for corduroy. Alternative names include: corded velveteen, elephant cord (the thick-stripes version), pin cord, Manchester cloth and cords.In continental Europe, corduroy is known as \"Cord\", \"rib cord\" or \"rib velvet\" - in parts of Europe such as Germany, Czechia, Holland and Belgium it used to be simply known as \"Manchester\" - that still remains the current name for corduroy in Swedish. In Portugal, corduroy is associated with a completely different type of fabric, \"bombazine\", and is referred to as such. In Greece and Cyprus they are known as kotlé pants. In Iran they are referred to as “Makhmal Kebrity” (velvet matchstick) or just “kebrity” (matchstick) pants as the width of a cord resembles that of a matchstick. \n\n\n== See also ==\nCorduroy road\nBedford cord\n\n\n== References =="